{
  "alexanderLines": "เกิดอะไรกับความฝันที่ถูกทำลาย\n\nจวนจะจมหาย\nดั่งเรืออับปางในทะเล\n\nหรือโต้คลื่น\nดั่งเด็กชายลงเล่นน้ำ\n\nหรือแค่ลอยล่อง\nวนไปวนมา...\n\nหรืออาจจมหายมลายไป",
  "alexanderTitle": "ความฝันที่ถูกทำลาย",
  "author": "ผู้แต่ง",
  "authorWarning": "อย่าป้อนชื่อเต็มของคุณ ให้ใช้ชื่อเล่นหรือชื่อย่อแทน",
  "backgroundOrTextEffect": "คุณต้องเพิ่มพื้นหลังหรือเอฟเฟกต์ข้อความ",
  "carroll2Lines": "เจ้าจระเข้น้อย\nทำหางให้ส่องแสงทอประกาย\nหมั่นรดตัวด้วยน้ำในแม่น้ำไนล์\nจนทุกอณูสุกใสดั่งทองคำ\n\nมันยิ้มอย่างเริงร่า\nกางกรงเล็บหนาอย่างแนบเนียน\nพร้อมต้อนรับเหล่าปลาน้อยเข้ามาใน\nขากรรไกรที่แสยะยิ้มเปรมปรีดิ์",
  "carroll2Title": "จระเข้",
  "carroll3Lines": "'ช่างยอดเยี่ยมและเจ้าเล่ห์ที่ลื่นไหล หมุนวน\nและสั่นไหวในคลื่น;\nมิมซี่ทั้งหมดเป็นโบโรโกฟส์\nและโมเมแรทตกต่ำ\n\n“ระวังจับบ้ำวัก ลูกชายของฉัน!\nกรามที่กัดกรงเล็บที่จับ!\nระวังนกจุ๊บจุ๊บ และหลีกเลี่ยง\nบันดาสแนตช์ที่ดื้อรั้น!”",
  "carroll3Title": "แจ็บเบอร์ว็อกกี",
  "chooseAPoem": "เลือกบทกวี",
  "chooseSound": "บทกวีนี้ยังไม่มีเสียงใดๆ โปรดเลือกเพลงหรือเสียงเพื่อเพิ่มลงในโค้ดของคุณ\n<xml><block type=\"Poetry_playSound\"><title name=\"SOUND\">\"sound://category_background/typewriter.mp3\"</title></block></xml>  \n<xml><block type=\"Poetry_playMusic\"><title name=\"SOUND\">\"sound://category_background/fire_burning.mp3\"</title></block></xml>",
  "editCustomPoem": "แก้ไขบทกวีที่กำหนดค่าเอง",
  "effectWithEvent": "ลองใช้เอฟเฟกต์ด้านหน้าหรือพื้นหลังใหม่ใต้บล็อกอีเว้นท์ \"เมื่อบรรทัดแสดง\"",
  "enterMyOwn": "ใส่ของฉัน",
  "ewingLines": "ที่ไหนสักแห่งที่มีฝนตก\nที่นั่นจะเติบโตเป็นสีเขียวและสวยงาม\nที่ไหนสักแห่งในตัวฉัน ก็มีฝนก็ตกเช่นเดียวกัน\nที่นั่นจะเติบโตเป็นสีเขียวและสวยงาม\nบางครั้งฝนก็ตกจากภายในตัวฉันออกสู่ภายนอก\nแล้วฉันก็รู้ว่า\nฉันยังมีชีวิตอยู่\nฉันยังมีชีวิตอยู่\nฉันยังมีชีวิตอยู่",
  "ewingTitle": "คำยืนยัน",
  "fieldLines": "คืนหนึ่ง วินเคน บลินเคน และ น็อด\nออกเดินทางด้วยรองเท้าไม้\nล่องเรือในแม่น้ำที่มีแสงคริสตัล\nสู่ทะเลน้ำค้าง\n“จะไปไหน ต้องการอะไร”\nพระจันทร์เฒ่าถามทั้งสาม\n\"เรามาจับปลาเฮอริ่ง\nที่อาศัยอยู่ในทะเลที่สวยงามแห่งนี้",
  "fieldTitle": " วินเคน บลินเคน และ น็อด",
  "foregroundEffectWithEvent": "เลือกบรรทัดในบทกวีที่มีสิ่งใหม่เกิดขึ้น เพิ่มเอฟเฟกต์ใต้บล็อกกิจกรรมของคุณ\n<xml><block type=\"Poetry_whenLineShows\"><title name=\"N\">1</title><next><block type=\"Poetry_setForegroundEffect\"><title name=\"EFFECT\">\"rain\"</title></block></next></block></xml>",
  "frostLines": "ธรรมชาติแรกขจีเปล่งสีทอง\nยากยิ่ง ปกป้อง รักษา\nก่อนผันเปลี่ยนสู่ใบไม้คือมาลา\nหากผลิโฉมเพียงชั่วคราหานานครัน\nใบไม้ ร่วงหล่น ผลัดใบ\nสวนสวรรค์ล่มสลายให้โศกศัลย์\nอรุณรุ่งจากจรก่อนเริ่มวัน\nขจีใดล้วนไม่คงมั่น นิรันดร",
  "frostTitle": "ไม่มีทองคำอยู่ได้",
  "genericBonusSuccess": "เก่งมาก! คุณผ่านด่านแล้ว รวมถึงชาเลนจ์พิเศษด้วย!",
  "hafezLines": "ฉันหวังว่าฉันจะแสดงให้คุณเห็นได้\nในขณะที่คุณเหงาหรืออยู่ในความมืด\nแสงที่น่าอัศจรรย์\nของตัวคุณเอง!",
  "hafezTitle": "ภาพที่ยอดเยี่ยมของฉัน",
  "harjoLines": "จดจำท้องฟ้าที่คุณเกิดภายใต้\nรับรู้เรื่องราวของแต่ละดวงดาว\nจดจำดวงจันทร์ รับรู้ว่าเธอเป็นใคร\nจงจำการกำเนิดของดวงอาทิตย์ในยามรุ่งอรุณ นั่นคือช่วง\nเวลาที่แข็งแกร่งที่สุดของวัน จดจำช่วงเวลาพระอาทิตย์ตกดิน\nและนำมาซึ่งเวลากลางคืน",
  "harjoTitle": "จดจำ",
  "hoplerLines": "และท้องฟ้า!\nตอนกลางวันกับสีน้ำเงินอันมั่นคงแน่วแน่\nของเรือนเพาะชำที่ว่างเปล่า\nทุ่งหญ้าเลื้อยพริ้วไหวในโทนสีเหลือง\nทุ่งหญ้าพริ้วไหว\nเขียวขจีและวุ่นวาย\nร่มเงาภายใต้ลำต้นที่โค้งงอ\nกลางวัน กลางวันนี้—\nท้องฟ้าสีครามเต็มไปด้วยเสียงครวญครางบานสะพรั่ง\nทุ่งหญ้าพริ้วไหว",
  "hoplerTitle": "ในสวน",
  "hughes1Lines": "โบกแขนให้กว้าง\nท่ามกลางแสงแดดที่แผดเผา\nเต้นรำ! วนไป! วนไป!\nจนกว่าวันที่แสนรวดเร็วจะผ่านพ้น\nพักผ่อนยามเย็น...\nต้นไม้น้อยใหญ่...\nช่วงกลางคืนคืบคลานมาอย่างอ่อนโยน\n  มืดมิดเหมือนกับฉัน",
  "hughes1Title": "ความฝันที่หลากหลาย",
  "hughesLines": "แม้นฝันลอยเลื่อนเป็นรสชาติใด? \nมันเหือดฉ่ำหวาน\nเหมือนองุ่นแห้งตากกลางแดด? \nหรือคั่งกลัดหนอง -- \nก่อนปริไหล? \nมันคลุ้งเหม็นเหมือนเนื้อเน่า? \nหรือตกสะเก็ดเกาะกรัง -- \nเหมือนน้ำเชื่อมค้างเติ่ง? \nบางทีฝันอาจถ่วงถม \nเหมือนประทุกท้นเหลือแสน \nหรือมันปะทุเปรี้ยง ",
  "hughesTitle": "ฮาเร็ม",
  "lomeli1Lines": "จินตนาการ:\nท้องฟ้าที่มีแสงแดดส่องถึง\nสดใสไปกับสายตา\nเครื่องตัดหญ้าที่ห่างไกลได้หยุดลง\nสายลมที่พัดผ่านผิวไป\nเสียงร้องที่อบอุ่นรอบข้าง\n— ฉันคิดถึงสุนัขของฉันจริงๆ",
  "lomeli1Title": "งีบพักยามบ่าย",
  "lomeli2Lines": "เมื่อวังวนสับสนวุ่นวาย\nฉุดรั้งแรงโน้มถ่วงใหม่รอบตัวคุณ\nหรือเมื่อคุณฝันถึงสวน\nที่เต็มไปด้วยความปรารถนาและก้อนหินมากมาย\nเมื่อนั้นคุณจะได้เรียนรู้\nว่าโลกแห่งคำพูดนั้นไร้ขอบเขต",
  "lomeli2Title": "บทกวีเพื่อจินตภาพ",
  "makeBackground": "คุณต้องเพิ่มแบ็กกราวนด์เอฟเฟกต์",
  "makeForeground": "คุณต้องเพิ่มเอฟเฟกต์ด้านหน้า",
  "noBackground": "เพิ่มบล็อกนี้ในโค้ดของคุณเพื่อเปลี่ยนแอนิเมชั่นพื้นหลัง:\n<xml><block type=\"Poetry_setBackgroundEffect\"><title name=\"EFFECT\">\"fadeColors\"</title><title name=\"PALETTE\">\"rainbow\"</title></block></xml>",
  "noBehavior": "คุณยังไม่ได้ใส่พฤติกรรมลงไป ค้นหาบล็อกนี้ในกล่องเครื่องมือของคุณ:\n<xml><block type=\"Poetry_startBehavior\"><title name=\"ANIMATION_NAME\">\"smiling_sun\"</title><title name=\"BEHAVIOR\">spinning_right</title></block></xml>",
  "noEffects": "คุณยังไม่ได้ใส่โค้ดบางตัว เพิ่มพื้นหลังหรือบล็อกเอฟเฟกต์ข้อความใต้ \"เมื่อเรียกใช้\"",
  "noSprites": "คุณยังไม่ได้ใส่สไปรท์ ค้นหาบล็อกนี้และเพิ่มลงในโค้ดของคุณ: \n<xml><block type=\"Poetry_makeNewSpriteAnon\"><title name=\"ANIMATION_NAME\">\"twinkling_star\"</title><title name=\"LOCATION\">'{\"x\":200,\"y\":243}'</title></block></xml>",
  "noTextEffect": "ลองเพิ่มบล็อกสีข้อความใต้ \"เมื่อเรียกใช้\"",
  "oneTextEffect": "เก่งมาก! คุณเพิ่มเอฟเฟกต์ข้อความแล้วหนึ่งรายการ ลองเพิ่มอีกอัน",
  "poLines": "นกทั้งหลายได้หายไปในท้องฟ้า\nและตอนนี้เมฆก้อนสุดท้ายก็ลอยไป\nเรานั่งด้วยกัน ทั้งภูเขาและตัวฉัน\nจนกระทั่งหลงเหลือแต่ภูเขา",
  "poTitle": "ภูเขา",
  "poem": "บทกวี:",
  "profanityFoundError": "บทกวีของคุณมีภาษาที่ไม่เหมาะสม ดังนั้นจะไม่ทำการบันทึกไว้ โปรดอัปเดตบทกวีของคุณเพื่อลบ {wordCount, plural, one {word} other {words}} \"{words}\"",
  "reinfFeedbackMsg": "เสร็จเรียบร้อย! คลิก \"ไปต่อ\" เพื่อไปยังด่านต่อไป",
  "removedSprite": "คุณยังไม่ได้ใส่สไปรท์ ค้นหาบล็อกนี้และเพิ่มลงในโค้ดของคุณ: \n<xml><block type=\"Poetry_makeNewSpriteAnon\"><title name=\"ANIMATION_NAME\">\"ocean_wave\"</title><title name=\"LOCATION\">'{\"x\":200,\"y\":243}'</title></block></xml>",
  "riosLines": "ห้องสมุดคือเจ้าแห่งหนังสือ\nมีปกเป็นคอนกรีต ไม้ และกระจก\n\nมีเรื่องราวที่ยิ่งใหญ่และยาวนาน\nของทุกสิ่งอยู่ในนั้น\n\nห้องสมุดนั้นแสนอันตราย\nเต็มไปด้วยคำตอบ หากได้เข้าไปข้างใน\n\nเมื่อออกมา\nจะไม่เหมือนกับคนเดิมที่เคยเข้าไปอีกเลย",
  "riosTitle": "อย่าเข้าไปในห้องสมุด",
  "rumi1Lines": "อยากร้องเพลง\nให้เหมือนอย่างนกร้องเพลง\nไม่ต้องห่วงว่า\nใครจะได้ยินหรือ\nห่วงว่าคนอื่นจะคิดอย่างไร",
  "rumi1Title": "ร้อง",
  "rumi2Lines": "คุณไม่ใช่หยดหนึ่งของมหาสมุทร\nคุณคือมหาสมุทรทั้งมวลในหนึ่งหยด",
  "rumi2Title": "มหาสมุทร",
  "save": "บันทึก",
  "selectPoem": "เลือกบทกวี",
  "setSize": "ขนาดสไปร์ทของคุณยังไม่เปลี่ยนแปลง เพิ่มบล็อกนี้ในโค้ดของคุณ\n<xml><block type=\"Poetry_setSize\"><title name=\"SPRITE\">\"ocean_wave\"</title><title name=\"VAL\">150</title></block></xml>",
  "shareGame": "แบ่งปันเกมส์ของคุณ:",
  "singerLines": "เจ้าหนึ่งนิ้วนี้ขึ้นกับเวลา\nเงาพาดมานานไป เส้นผมอยู่ใกล้เกินไป\nจนได้สีน้ำตาลกรอบที่สมบูรณ์แบบ\nแล้วก็ไหม้เป็นสีถ่าน\nค่อยๆเหลวละลาย\nกลายเป็นเมือก\nและเธอก็แพ้เกมไป\nเพราะมาร์ชเมลโล่\nหล่นไปที่กองไฟ",
  "singerTitle": "ปิ้งมาร์ชเมลโลว์",
  "spriteEvent": "ลองเพิ่มหรือลบสไปร์ทใต้บล็อกอีเวนท์ \"เมื่อบรรทัดแสดง\"",
  "successAddedSprite": "เก่งมากที่ใส่สไปร์ทใหม่ไปในอีเวนท์! คลิก \"เล่นต่อ\" เพื่อลองเพิ่มสไปร์ทลงในอีเวนท์",
  "successBackgroundEvent": "เก่งมากที่เปลี่ยนพื้นหลังของคุณด้วยอีเวนท์! คลิก 'เล่นต่อ' เพื่อลองเปลี่ยนเอฟเฟกต์ด้านหน้า",
  "successEffectWithEvent": "ยินดีด้วย คุณได้เพิ่มเอฟเฟกต์ให้กับโค้ดของคุณแล้ว! คุณสามารถคลิก 'เล่นต่อ' เพื่อเพิ่มเอฟเฟกต์เพิ่มเติมได้",
  "successForegroundEvent": "เก่งมากที่เปลี่ยนภาพด้านหน้าของคุณด้วยอีเวนท์! คลิก 'เล่นต่อ' เพื่อลองเปลี่ยนเอฟเฟกต์พื้นหลัง",
  "successLevel1": "ยินดีด้วย! คุณผ่านด่านที่ 1 แล้ว",
  "successLevel10": "ยินดีด้วย! คุณผ่านด่านที่ 10 แล้ว",
  "successLevel2": "ยินดีด้วย! คุณผ่านด่านที่ 2 แล้ว",
  "successLevel3": "ยินดีด้วย! คุณผ่านด่านที่ 3 แล้ว",
  "successLevel4": "ยินดีด้วย! คุณผ่านด่านที่ 4 แล้ว",
  "successLevel5": "ยินดีด้วย! คุณผ่านด่านที่ 5 แล้ว",
  "successLevel6": "ยินดีด้วย! คุณผ่านด่านที่ 6 แล้ว",
  "successLevel7": "ยินดีด้วย! คุณผ่านด่านที่ 7 แล้ว",
  "successLevel8": "ยินดีด้วย! คุณผ่านด่านที่ 8 แล้ว",
  "successLevel9": "ยินดีด้วย! คุณผ่านด่านที่ 9 แล้ว",
  "successRemovedSprite": "เก่งมากลบสไปร์ทใหม่ออกในอีเวนท์! คลิก \"เล่นต่อ\" เพื่อลองเพิ่มสไปร์ทลงในอีเวนท์",
  "successTextEvent": "เก่งมากที่เปลี่ยนเอฟเฟกต์ข้อความของคุณด้วยอีเวนท์! คลิก 'เล่นต่อ' เพื่อลองเปลี่ยนเอฟเฟกต์ด้านหน้าหรือพื้นหลัง",
  "taylorLines": "ดาวดวงน้อยกระพริบวิบวาว\nอยากรู้จังเจ้าคือสิ่งใด\nเหนือพื้นโลกที่สูงขึ้นไป\nดังเพชรพราวบนฟากฟ้าไกล\n\nเมื่อสิ้นแสงอาทิตย์ลาไป\nฟ้าสดใสกลับมืดมิดพลัน\nเมื่อนั้นเจ้านั้นจะคอยส่องแสง\nเป็นแสงกระพริบวิบวาวยามค่ำคืน",
  "taylorTitle": "ดาว",
  "textEffectWithEvent": "ตั้งค่าเอฟเฟกต์ข้อความใหม่ใต้บล็อกเหตุการณ์ \"เมื่อบรรทัดแสดง\"",
  "title": "ชื่อเรื่อง:",
  "twainLines": "ดวงอาทิตย์ฤดูร้อนอันอบอุ่น\nส่องแสงทอประกายที่นี่\nลมใต้อันอบอุ่น\nพัดผ่านเบาๆที่นี่\nหญ้าเขียวสดปกคลุมด้านบน\nนอนให้สบาย นอนให้สบาย\nราตรีสวัสดิ์หัวใจที่รัก\nหลับฝันดี หลับฝันดี",
  "twainTitle": "ดวงอาทิตย์ฤดูร้อนอันอบอุ่น",
  "tzuLines": "พอใจในสิ่งที่มี\nชื่นชมยินดีในสิ่งที่เป็น\nเมื่อคุณรู้ว่าไม่มีอะไรขาดหายไป\nโลกทั้งใบจะเป็นของคุณ",
  "tzuTitle": "ชื่นชมยินดี",
  "wordsworthLines": "ฉันพเนจรอย่างโดดเดี่ยวดั่งก้อนเมฆ\nที่ลอยอยู่บนหุบเขาและเนินเขาสูง\nทันใดนั้นฉันเห็นผืนท้องทุ่ง\nหนาแน่นด้วยดอกแดฟโฟดิลสีทอง\nข้างทะเลสาบใต้ต้นไม้\nพริ้วไหวและเต้นระบำท่ามกลางสายลม",
  "wordsworthTitle": "ฉันพเนจรอย่างโดดเดี่ยวดั่งก้อนเมฆ"
}