{
  "fishvtrash-training-init1": "Ins Wasser gekippter Müll beeinträchtigt das Meeresleben.  In dieser Aktivität programmierst oder trainierst du KI (künstliche Intelligenz), um Fische oder Müll zu identifizieren.  Lasst uns den Ozean säubern!  Klicke irgendwo auf den Bildschirm, um fortzufahren.",
  "fishvtrash-training-init2": "Lernen wir die KI kennen.",
  "fishvtrash-training-init3": "Die KI weiß nicht, ob ein Objekt ein Fisch oder Müll ist, aber sie kann Bilder verarbeiten und Muster erkennen.",
  "fishvtrash-training-init4": "Um die KI zu programmieren, verwende die Tasten, um ein Bild als \"Fisch\" oder \"Nicht Fisch\" zu kennzeichnen.  Das Training, das du anbietest, lehrt die KI, Muster selbstständig zu erkennen.  Fangen wir an!",
  "fishvtrash-training-pause1": "Neun Millionen Tonnen Plastik gelangen jedes Jahr in den Ozean.",
  "fishvtrash-training-pause2": "Du programmierst oder trainierst die KI mit jedem Klick.  Mache weiter.",
  "fishvtrash-training-pause3": "80 % der Meeresverschmutzung kommt von Landmaterial und kostet schätzungsweise 12 Milliarden Euro pro Jahr.",
  "fishvtrash-training-pause4": "Die KI lernt aus deinen Entscheidungen.  Wenn du \"falsche\" Entscheidungen triffst, wird die KI deine Fehler wiederholen. Trainiere weiter.",
  "fishvtrash-training-pause5": "Tolle Arbeit!  Je mehr Daten du der Ki liefert, desto mehr lernt sie.  Füttere die KI mit weiteren Daten oder fahre fort, wenn du bereit bist.",
  "fishvtrash-predicting-init1": "Mal sehen, ob die KI weiß, wie ein \"Fisch\" aussieht.",
  "fishvtrash-predicting-init2": "Die KI wird eine zufällige Menge von Objekten analysieren und sie auf der Grundlage deines Trainings beschriften.",
  "fishvtrash-predicting-init3": "Auf geht's!",
  "fishvtrash-pond-init1": "Hier sind einige Objekte, die die KI aufgrund deines Trainings als \"Fisch\" identifiziert hat.  Wie hat die KI abgeschnitten?",
  "fishvtrash-pond-recall": "Klicke hier, um zwischen den als \"Fisch\" und \"kein Fisch\" gekennzeichneten Objekten zu wechseln.",
  "fishvtrash-pond-init2": "Du kannst die KI mehr trainieren...",
  "fishvtrash-pond-init3": "...oder fahre fort.",
  "creaturesvtrashdemo-predicting-init1": "Bisher haben wir die KI darauf trainiert, Objekte entweder als “Fisch” oder “nicht Fisch” zu identifizieren.",
  "creaturesvtrashdemo-predicting-init2": "Was wäre, wenn diese Trainingsdaten genutzt würden, um zu entscheiden, was ins Wasser gehört?",
  "creaturesvtrashdemo-predicting-init3": "Was würde mit anderen Meeresbewohnern geschehen?  Verursacht unser Trainingsansatz unbeabsichtigte Folgen?",
  "creaturesvtrashdemo-predicting-init4": "Lass mal sehen.",
  "creaturesvtrashdemo-predicting-pause1": "Ist dir aufgefallen, dass die KI einige Meeresbewohner als \"keine Fische\" identifiziert hat?",
  "creaturesvtrashdemo-predicting-pause2": "Diese Meeresbewohner sind zwar keine Fische, aber sie gehören ins Wasser.",
  "creaturesvtrashdemo-predicting-pause3": "Die KI lernt nur, was wir ihr beibringen.",
  "creaturesvtrashdemo-predicting-pause4": "Lass uns die KI erneut trainieren.",
  "creaturesvtrash-training-init1": "Bringen wir der KI bei, zu lernen, welche Objekte ins Wasser gehören.",
  "creaturesvtrash-training-init2": "Im Ozean können Plastikmüllreste Fische, Seevögel und Meeressäuger schädigen. Der Schutz von Seevögeln und Meereslebewesen ist einer von vielen Gründen, die Ozeane sauber zu halten.",
  "creaturesvtrash-training-init3": "Je mehr Trainingsdaten du zur Verfügung stellst, desto mehr lernt die KI.  Trainiere weiter.",
  "creaturesvtrash-training-init4": "Die Meeresverschmutzung durch Plastik hat weltweit mindestens 267 Arten beeinträchtigt, darunter 86% aller Meeresschildkrötenarten.",
  "creaturesvtrash-training-init5": "Trainiere weiter, um der KI beizubringen, was ins Wasser gehört.",
  "creaturesvtrash-training-init6": "Tolle Arbeit!  Je mehr Daten du zur Verfügung stellst, desto besser wird es funktionieren.  Trainiere die KI weiter oder fahre fort wenn du bereit bist.",
  "creaturesvtrash-predicting-init1": "Glaubst du, dass die KI jetzt besser identifizieren kann, was im Wasser sein sollte?  Lass uns zusehen.",
  "creaturesvtrash-pond-init1": "Basierend auf deinem Training, hier sind einige Objekte, die die KI als \"gehört ins Wasser\" identifiziert hat.  Wie hat die KI das gemacht?",
  "fishshort-words-init1": "Künstliche Intelligenz und maschinelles Lernen können genutzt werden, um einem Computer neue Muster beizubringen.",
  "fishshort-words-init2": "Bringen wir der KI ein neues Wort bei, indem wir ihr Beispiele für diese Art von Fischen zeigen.",
  "fishshort-words-training-pause1": "Denkst du, dass die KI genug Trainingsdaten hat? Du kannst auf \"Weiter\" klicken, um dies herauszufinden.",
  "fishshort-words-training-pause2": "Tolle Arbeit!  Trainiere weiter die KI oder fahre fort, wenn du bereit bist.",
  "fishshort-predicting-init1": "Mit deinen Trainingsdaten hast du die KI so programmiert, dass sie \"{word}\"-Fische erkennt.",
  "fishshort-predicting-init2": "Mal sehen, wie die KI \"{word}\" Fische identifiziert.",
  "fishshort-pond-init1": "Basierend auf deinem Training, hat die KI {n, plural,one {diesen} other {diese}} Fische als \"{Wort}\" identifiziert. Wie hat die KI dabei abgeschnitten? Du kannst weiter trainieren, wenn du die Ergebnisse verbessern willst.",
  "fishshort-pond-init2": "Klicke auf den Info-Button, um zu sehen, was die KI gelernt hat.",
  "fishlong-words-init1": "Jetzt lass uns sehen, ob die KI ein weniger offensichtliches Wort lernen kann.",
  "fishlong-words-init2": "Bringen wir der KI ein Wort bei, das von deiner Meinung abhängt. Es liegt an dir, Fische auszuwählen, die zu deinem Wort passen.",
  "fishlong-training-pause1": "Ist es fair, künstliche Intelligenz einzusetzen, um einen Fisch nach seinem Aussehen zu beurteilen?  Während KI fair und neutral erscheinen mag, kommt ihre Analyse aus dem Training, das wir anbieten.  Welche unbeabsichtigte Verzerrung könnte das verursachen?",
  "fishlong-training-pause2": "Mehr Trainingsdaten werden der KI helfen, dein Wort zu lernen.  Trainiere weiter.",
  "fishlong-training-pause3": "Jede Wahl, die du triffst, kann der KI helfen zu lernen.  Trainiere weiter.",
  "fishlong-training-pause4": "Denkst du, dass die KI genug Trainingsdaten hat? Je mehr Trainingsdaten die KI hat, desto besser wird sie. Fahre fort, wenn du denkst, dass deine KI bereit ist.",
  "fishlong-training-many": "Wow.  Das sind eine Menge Fische!",
  "fishlong-predicting-init1": "Mit deinen Trainingsdaten hast du die KI so programmiert, dass sie \"{word}\"-Fische erkennt.",
  "fishlong-predicting-init2": "Mal sehen, wie die KI \"{Wort}\" Fische identifiziert.",
  "fishlong-pond-init1": "Basierend auf deinem Training, hat die KI {n, plural,one {diesen} other {diese}} Fische als \"{Wort}\" identifiziert.  Wie hat die KI dabei abgeschnitten?",
  "fishlong-pond-init2": "Du kannst mehr trainieren, wenn du die Ergebnisse verbessern willst.",
  "fishlong-pond-init3": "Oder du kannst der KI ein neues Wort beibringen, indem du Neues Wort auswählst.",
  "didYouKnow": "Wusstest du schon?",
  "continue": "Weiter",
  "areYouSure": "Bist du sicher?",
  "eraseWarning": "Das Löschen der Daten der KI löscht das gesamte Training dauerhaft. Möchtest du das wirklich machen?",
  "erase": "Löschen",
  "cancel": "Abbrechen",
  "yes": "Ja",
  "no": "Nein",
  "notWord": "Kein {word}",
  "run": "Ausführen",
  "mostImportantParts": "Dies waren die wichtigsten Fischteile:",
  "clickIndividualFish": "Klicke auf einzelne Fische, um ihre Informationen zu sehen.",
  "mostImportantPartsDescription": "Dies waren die wichtigsten Fischteile bei der Bestimmung, ob dieser Fisch \"*{word}*\" oder \"**{notWord}**\" war.",
  "newWord": "Neues Wort",
  "finish": "Abschließen",
  "trainMore": "Weiter trainieren",
  "wordQuestionShort": "Auf welche Art von Fischen willst du die KI trainieren, um diese zu erkennen?",
  "wordQuestionLong": "Wähle ein neues Wort, um die KI zu unterrichten.",
  "isThisFish": "Ist das ein Fisch {word}?",
  "isThisAFish": "Ist das ein Fisch?",
  "doesThisBelongInWater": "Gehört das ins Wasser?",
  "fish": "Fisch",
  "waterCreature": "Wasserkreatur",
  "blue": "Blau",
  "green": "Grün",
  "red": "Rot",
  "circular": "Rund",
  "rectangular": "Rechteckig",
  "triangular": "Dreieckig",
  "angry": "Wütend",
  "awesome": "Fantastisch",
  "delicious": "Köstlich",
  "endangered": "Gefährdet",
  "fast": "Schnell",
  "fierce": "Grimmig",
  "fun": "Lustig",
  "glitchy": "Glibschig",
  "happy": "Glücklich",
  "hungry": "Hungrig",
  "playful": "Verspielt",
  "scary": "Beängstigend",
  "silly": "Albern",
  "spooky": "Gespenstisch",
  "wild": "Wild",
  "dorsalFins": "Rückenfinne",
  "pectoralFinsFront": "Brustflossen",
  "tails": "Schwanz",
  "bodies": "Körper",
  "scales": "skaliert",
  "eyes": "Augen",
  "mouths": "Mund",
  "colors": "Farben"
}