{
  "angry": "Wütend",
  "areYouSure": "Bist du sicher?",
  "awesome": "Fantastisch",
  "blue": "Blau",
  "bodies": "Körper",
  "cancel": "Abbrechen",
  "circular": "Rund",
  "clickIndividualFish": "Klicke auf einzelne Fische, um mehr zu erfahren.",
  "colors": "Farben",
  "continue": "Weiter",
  "creaturesvtrash-pond-init1": "Hier sind einige Objekte, die KI basierend auf deinem Training als \"gehört ins Wasser\" identifiziert hat. Wie gut hat die KI funktioniert?",
  "creaturesvtrash-predicting-init1": "Glaubst du, dass die KI jetzt besser identifizieren kann, was im Wasser sein sollte?  Lass uns zusehen.",
  "creaturesvtrash-training-init1": "Bringen wir der KI bei, zu lernen, welche Objekte ins Wasser gehören.",
  "creaturesvtrash-training-init2": "Im Ozean können Plastikmüllreste Fische, Seevögel und Meeressäuger schädigen. Der Schutz von Seevögeln und Meereslebewesen ist einer von vielen Gründen, die Ozeane sauber zu halten.",
  "creaturesvtrash-training-init3": "Je mehr Trainingsdaten du bereitstellst, desto mehr lernt die KI. Trainiere sie weiter.",
  "creaturesvtrash-training-init4": "Die Meeresverschmutzung durch Plastik hat weltweit mindestens 267 Arten beeinträchtigt, darunter 86% aller Meeresschildkrötenarten.",
  "creaturesvtrash-training-init5": "Trainiere weiter, um der KI beizubringen, was ins Wasser gehört.",
  "creaturesvtrash-training-init6": "Tolle Arbeit! Je mehr Daten du der KI bereitstellst, desto besser wird sie funktionieren. Trainiere die KI weiter oder fahre fort, wenn du bereit bist.",
  "creaturesvtrashdemo-predicting-init1": "Bisher haben wir die KI darauf trainiert, Objekte entweder als “Fisch” oder “kein Fisch” zu identifizieren.",
  "creaturesvtrashdemo-predicting-init2": "Was wäre, wenn diese Trainingsdaten genutzt würden, um zu entscheiden, was ins Wasser gehört?",
  "creaturesvtrashdemo-predicting-init3": "Was würde mit anderen Meeresbewohnern passieren? Ruft unsere Trainingsmethode unbeabsichtigte Folgen hervor?",
  "creaturesvtrashdemo-predicting-init4": "Lass mal sehen.",
  "creaturesvtrashdemo-predicting-pause1": "Ist dir aufgefallen, dass die KI einige Meeresbewohner als \"keine Fische\" identifiziert hat?",
  "creaturesvtrashdemo-predicting-pause2": "Diese Meeresbewohner sind zwar keine Fische, aber sie gehören ins Wasser.",
  "creaturesvtrashdemo-predicting-pause3": "Die KI lernt nur, was wir ihr beibringen.",
  "creaturesvtrashdemo-predicting-pause4": "Lass uns die KI erneut trainieren.",
  "delicious": "Köstlich",
  "didYouKnow": "Wusstest du schon?",
  "doesThisBelongInWater": "Gehört das ins Wasser?",
  "dorsalFins": "Rückenflosse",
  "endangered": "Gefährdet",
  "erase": "Löschen",
  "eraseWarning": "Das Löschen der Daten der KI löscht das gesamte Training dauerhaft. Möchtest du das wirklich machen?",
  "eyes": "Augen",
  "fast": "Schnell",
  "fierce": "Grimmig",
  "finish": "Abschließen",
  "fish": "Fisch",
  "fishlong-pond-init1": "Aufgrund deines Trainings hat die KI {n, plural,one {diesen Fisch} other {diese Fische}} als \"{word}\" identifiziert. Wie gut hat die KI funktioniert? ",
  "fishlong-pond-init2": "Du kannst sie weiter trainieren, wenn du die Ergebnisse verbessern willst.",
  "fishlong-pond-init3": "Oder du kannst der KI ein neues Wort beibringen, indem du Neues Wort auswählst.",
  "fishlong-predicting-init1": "Mit deinen Trainingsdaten hast du die KI so programmiert, dass sie \"{word}\"-Fische erkennt.",
  "fishlong-predicting-init2": "Mal sehen, wie die KI \"{word}\" Fische identifiziert.",
  "fishlong-training-many": "Wow! Das sind ganz schön viele Fische!",
  "fishlong-training-pause1": "Ist es fair, künstliche Intelligenz einzusetzen, um einen Fisch nach seinem Aussehen zu beurteilen? Die künstliche Intelligenz mag zwar fair und neutral erscheinen, aber ihre Analyse beruht auf dem Training, das wir ihr geben. Welche unbeabsichtigten Vorannahmen könnte das verursachen?",
  "fishlong-training-pause2": "Mehr Trainingsdaten werden der KI helfen, dein Wort zu lernen. Trainiere weiter.",
  "fishlong-training-pause3": "Jede Entscheidung, die du triffst, kann der KI beim Lernen helfen. Trainiere weiter.",
  "fishlong-training-pause4": "Glaubst du, dass die KI genug Trainingsdaten hat? Sie wird mit mehr Daten besser funktionieren. Fahre fort, wenn du denkst, dass die KI bereit ist.",
  "fishlong-words-init1": "Jetzt lass uns sehen, ob die KI ein weniger offensichtliches Wort lernen kann.",
  "fishlong-words-init2": "Jetzt wollen wir der KI ein Wort beibringen, das von deiner Meinung abhängt. Es ist deine Aufgabe, Fische auszuwählen, die zu deinem Wort passen.",
  "fishshort-pond-init1": "Basierend auf deinem Training hat die KI {n, plural,one {diesen} other {diese}} Fisch als \"{word}\" identifiziert. Wie gut hat die KI funktioniert? Du kannst sie weiter trainieren, wenn du die Ergebnisse verbessern willst.",
  "fishshort-pond-init2": "Klicke auf die Info-Schaltfläche, um zu sehen, was die KI gelernt hat.",
  "fishshort-predicting-init1": "Mit deinen Trainingsdaten hast du die KI so programmiert, dass sie \"{word}\"-Fische erkennt.",
  "fishshort-predicting-init2": "Mal sehen, wie die KI \"{word}\" Fische identifiziert.",
  "fishshort-words-init1": "Künstliche Intelligenz und maschinelles Lernen können genutzt werden, um einem Computer neue Muster beizubringen.",
  "fishshort-words-init2": "Bringen wir der KI ein neues Wort bei, indem wir ihr Beispiele für diese Art von Fischen zeigen.",
  "fishshort-words-training-pause1": "Denkst du, dass die KI genug Trainingsdaten hat? Du kannst auf \"Weiter\" klicken, um dies herauszufinden.",
  "fishshort-words-training-pause2": "Gute Arbeit! Trainiere die KI weiter oder fahre fort, wenn du bereit bist.",
  "fishvtrash-pond-init1": "Hier sind einige Objekte, die die KI basierend auf deinen Trainings als \"Fisch\" identifiziert hat. Wie gut hat die KI funktioniert?",
  "fishvtrash-pond-init2": "Du kannst die KI weiter trainieren...",
  "fishvtrash-pond-init3": "...oder fahre fort.",
  "fishvtrash-pond-recall": "Klicke hier, um zwischen den als \"Fisch\" und \"kein Fisch\" gekennzeichneten Objekten zu wechseln.",
  "fishvtrash-predicting-init1": "Mal sehen, ob die KI weiß, wie ein \"Fisch\" aussieht.",
  "fishvtrash-predicting-init2": "Die KI wird eine zufällige Menge von Objekten analysieren und sie auf der Grundlage deines Trainings markieren.",
  "fishvtrash-predicting-init3": "Los geht's!",
  "fishvtrash-training-init1": "Im Wasser entsorgter Müll beeinträchtigt das Leben im Meer. Bei dieser Aktivität programmierst oder trainierst du eine KI (künstliche Intelligenz), Fische oder Müll zu identifizieren. Säubern wir den Ozean! Klicke auf eine beliebige Stelle des Bildschirms, um fortzufahren.",
  "fishvtrash-training-init2": "Lernen wir die KI kennen.",
  "fishvtrash-training-init3": "Die KI weiß nicht, ob ein Objekt ein Fisch oder Müll ist, aber sie kann Bilder verarbeiten und Muster erkennen.",
  "fishvtrash-training-init4": "Um die KI zu programmieren, verwende die Schaltflächen, um ein Bild als \"Fisch\" oder \"kein Fisch\" zu kennzeichnen. Durch das Training wird die KI lernen, selbständig Muster zu erkennen. Los geht's!",
  "fishvtrash-training-pause1": "Neun Millionen Tonnen Plastik gelangen jedes Jahr in den Ozean.",
  "fishvtrash-training-pause2": "Mit jedem Klick programmierst oder trainierst du eine KI. Weiter geht's.",
  "fishvtrash-training-pause3": "80 % der Meeresverschmutzung kommt von Landschutt und kostet schätzungsweise 12 Milliarden Euro pro Jahr.",
  "fishvtrash-training-pause4": "Die KI lernt aus deinen Entscheidungen. Wenn du \"falsche\" Entscheidungen triffst, wird die KI deine Fehler wiederholen. Trainiere weiter.",
  "fishvtrash-training-pause5": "Gute Arbeit! Je mehr Daten du der KI zur Verfügung stellst, desto mehr lernt sie. Trainiere die KI weiter oder mach weiter, wenn du soweit bist.",
  "fun": "Lustig",
  "glitchy": "Glitschig",
  "green": "Grün",
  "happy": "Glücklich",
  "hungry": "Hungrig",
  "isThisAFish": "Ist das ein Fisch?",
  "isThisFish": "Ist der Fisch {word}?",
  "mostImportantParts": "Dies waren die wichtigsten Fischteile:",
  "mostImportantPartsDescription": "Dies waren die wichtigsten Fischteile bei der Bestimmung, ob dieser Fisch \"*{word}*\" oder \"**{notWord}**\" war.",
  "mouths": "Mund",
  "newWord": "Neues Wort",
  "no": "Nein",
  "notWord": "Kein {word}",
  "pectoralFinsFront": "Brustflossen",
  "playful": "Verspielt",
  "rectangular": "Rechteckig",
  "red": "Rot",
  "run": "Ausführen",
  "scales": "Schuppen",
  "scary": "Beängstigend",
  "silly": "Albern",
  "spooky": "Gespenstisch",
  "tails": "Schwanz",
  "trainMore": "Weiter trainieren",
  "triangular": "Dreieckig",
  "waterCreature": "Wasserkreatur",
  "wild": "Wild",
  "wordQuestionLong": "Wähle ein neues Wort, um die KI zu trainieren.",
  "wordQuestionShort": "Auf welche Art von Fischen willst du die KI trainieren, um diese zu erkennen?",
  "yes": "Ja"
}