{
  "fishvtrash-training-init1": "Τα απορρίμματα που ρίχνονται στο νερό επηρεάζουν την θαλάσσια ζωή. Σε αυτή τη δραστηριότητα θα προγραμματίσετε ή θα εκπαιδεύσετε έναν αλγόριθμο τεχνητής νοημοσύνης που θα ταυτοποιεί τα ψάρια ή τα σκουπίδια. Ας καθαρίσουμε τον ωκεανό! Κάντε κλικ οπουδήποτε στην οθόνη για να συνεχίσετε.",
  "fishvtrash-training-init2": "Ας γνωρίσουμε την Τεχνητή Νοημοσύνη.",
  "fishvtrash-training-init3": "Η Τεχνητή Νοημοσύνη δεν ξέρει αν ένα αντικείμενο είναι ψάρι ή σκουπίδι, αλλά μπορεί να επεξεργαστεί εικόνες και να εντοπίσει μοτίβα.",
  "fishvtrash-training-init4": "Για να προγραμματίσετε την Τεχνητή Νοημοσύνη χρησιμοποιήστε τα κουμπιά για να κατηγοριοποιήσετε μια εικόνα ως \"Ψάρι\" ή \"Όχι Ψάρι\". Η εκπαίδευση που θα παρέχετε θα μάθει στην Τεχνητή Νοημοσύνη πώς να αναγνωρίζει μοτίβα μόνη της. Ας ξεκινήσουμε!",
  "fishvtrash-training-pause1": "7 δισεκατομμύρια κιλά πλαστικού πέφτουν στον ωκεανό κάθε χρόνο.",
  "fishvtrash-training-pause2": "Προγραμματίζεις ή εκπαιδεύεις την Τεχνητή Νοημοσύνη με κάθε κλικ. Συνέχισε.",
  "fishvtrash-training-pause3": "Το 80% της ρύπανσης του ωκεανού προέρχεται από χερσαία απόβλητα και κοστίζει περίπου 12 δισεκατομμύρια Ευρώ το χρόνο.",
  "fishvtrash-training-pause4": "Η Τεχνητή Νοημοσύνη μαθαίνει από τις επιλογές σου. Αν κάνεις \"λάθος\" επιλογές, η Τεχνητή Νοημοσύνη θα επαναλάβει τα λάθη σου. Συνέχισε την εκπαίδευση.",
  "fishvtrash-training-pause5": "Εξαιρετική δουλειά! Όσο πιο πολλά δεδομένα παρέχεις στην Τεχνητή Νοημοσύνη, τόσο πιο πολλά μαθαίνει. Συνέχισε να εκπαιδεύεις την Τεχνητή Νοημοσύνη ή συνέχισε όταν είσαι έτοιμος.",
  "fishvtrash-predicting-init1": "Ας δούμε τώρα αν η Τεχνητή Νοημοσύνη ξέρει πώς μοιάζει ένα ψάρι.",
  "fishvtrash-predicting-init2": "Η Τεχνητή Νοημοσύνη θα αναλύσει ένα τυχαίο σύνολο αντικειμένων και θα τα κατηγοριοποιήσει με βάση την εκπαίδευση σου.",
  "fishvtrash-predicting-init3": "Πάμε!",
  "fishvtrash-pond-init1": "Με βάση την εκπαίδευσή σου, ορίστε μερικά αντικείμενα που ταυτοποιήθηκαν ως \"ψάρι\". Πώς τα πήγε η Τεχνητή Νοημοσύνη;",
  "fishvtrash-pond-recall": "Πάτησε εδώ για να εναλλάξεις ανάμεσα σε αντικείμενα που ταυτοποιήθηκαν ως \"ψάρια\" ή \"όχι ψάρια\".",
  "fishvtrash-pond-init2": "Μπορείς να εκπαιδεύσεις την Τεχνητή Νοημοσύνη περισσότερο...",
  "fishvtrash-pond-init3": "...ή να Συνεχίσεις.",
  "creaturesvtrashdemo-predicting-init1": "Μέχρι στιγμής εκπαιδεύσαμε την Τεχνητή Νοημοσύνη στο να ταυτοποιεί αντικείμενα ως \"ψάρια\" ή \"όχι ψάρια\".",
  "creaturesvtrashdemo-predicting-init2": "Τι θα γινόταν αν τα δεδομένα χρησιμοποιούνταν για να αποφασίσουμε τι ανήκει στο νερό;",
  "creaturesvtrashdemo-predicting-init3": "Τι θα γινόταν στα πλάσματα της θάλασσας; Μήπως η εκπαιδευτική μας προσέγγιση προκαλεί ακούσιες συνέπειες;",
  "creaturesvtrashdemo-predicting-init4": "Ας δούμε.",
  "creaturesvtrashdemo-predicting-pause1": "Παρατήρησες ότι η Τεχνητή Νοημοσύνη ταυτοποίησε μερικά πλάσματα της θάλασσας ως \"όχι ψάρια\";",
  "creaturesvtrashdemo-predicting-pause2": "Παρόλο που αυτά τα πλάσματα της θάλασσας δεν είναι ψάρια, ανήκουν στο νερό.",
  "creaturesvtrashdemo-predicting-pause3": "Η Τεχνητή Νοημοσύνη μαθαίνει μόνο ότι της διδάξουμε.",
  "creaturesvtrashdemo-predicting-pause4": "Ας ξαναεκπαιδεύσουμε την Τεχνητή Νοημοσύνη.",
  "creaturesvtrash-training-init1": "Ας διδάξουμε στην Τεχνητή Νοημοσύνη ποια αντικείμενα θα έπρεπε να είναι στο νερό.",
  "creaturesvtrash-training-init2": "Στον ωκεανό, τα πλαστικά απόβλητα μπορεί να βλάψουν ψάρια, γλάρους και θαλάσσια θηλαστικά. Η προστασία των γλάρων και της θαλάσσιας ζωής είναι ένας από τους πολλούς λόγους για να διατηρούμε τους ωκεανούς καθαρούς.",
  "creaturesvtrash-training-init3": "Όσο πιο πολύ εκπαιδεύεις την Τεχνητή Νοημοσύνη, τόσο πιο πολλά μαθαίνει. Συνέχισε την εκπαίδευση.",
  "creaturesvtrash-training-init4": "Η θαλάσσια ρύπανση από το πλαστικό έχει επηρεάσει τουλάχιστον 267 είδη παγκοσμίως, συμπεριλαμβανομένου του 86% των ειδών των θαλάσσιων χελωνών.",
  "creaturesvtrash-training-init5": "Συνέχισε να εκπαιδεύεις την Τεχνητή Νοημοσύνη σχετικά με το τι ανήκει στο νερό.",
  "creaturesvtrash-training-init6": "Εξαιρετική δουλειά! Όσο πιο πολλά δεδομένα παρέχεις στην Τεχνητή Νοημοσύνη, τόσο πιο καλά θα τα πάει. Συνέχισε να εκπαιδεύεις την Τεχνητή Νοημοσύνη ή συνέχισε όταν είσαι έτοιμος.",
  "creaturesvtrash-predicting-init1": "Πιστεύεις ότι η Τεχνητή Νοημοσύνη θα τα πάει καλύτερα στο να ταυτοποιήσει τι θα έπρεπε να είναι στο νερό; Ας δούμε.",
  "creaturesvtrash-pond-init1": "Με βάση την εκπαίδευσή σου, ορίστε μερικά αντικείμενα που ταυτοποιήθηκαν ως \"ανήκει στο νερό\". Πώς τα πήγε η Τεχνητή Νοημοσύνη;",
  "fishshort-words-init1": "Η Τεχνητή Νοημοσύνη και η μηχανική μάθηση μπορούν να χρησιμοποιηθούν για να διδάξουν στον υπολογιστή νέα μοτίβα.",
  "fishshort-words-init2": "Ας μάθουμε στην Τεχνητή Νοημοσύνη μια νέα λέξη δείχνοντας της παραδείγματα αυτού του τύπου ψαριών.",
  "fishshort-words-training-pause1": "Πιστεύεις πως η Τεχνητή Νοημοσύνη έχει αρκετά δεδομένα; Μπορείς να κάνεις κλικ στο \"Συνέχεια\" για να μάθεις.",
  "fishshort-words-training-pause2": "Εξαιρετική δουλειά! Συνέχισε να εκπαιδεύεις την Τεχνητή Νοημοσύνη ή συνέχισε όταν είσαι έτοιμος.",
  "fishshort-predicting-init1": "Με τα δεδομένα σου, έχεις προγραμματίσει την Τεχνητή Νοημοσύνη να αναγνωρίζει {word} ψάρια.",
  "fishshort-predicting-init2": "Ας δούμε την Τεχνητή Νοημοσύνη να ταυτοποιεί \"{word}\" ψάρια.",
  "fishshort-pond-init1": "Με βάση την εκπαίδευσή σου, η Τεχνητή Νοημοσύνη ταυτοποίησε {n, plural,one {αυτό το ψάρι}other {αυτά τα ψάρια}} ως \"{word}\". Πώς τα πήγε η Τεχνητή Νοημοσύνη; Μπορείς να την εκπαιδεύσεις περισσότερο αν θες να βελτιώσεις τα αποτελέσματα.",
  "fishshort-pond-init2": "Πάτησε το κουμπί \"Πληροφορίες\" για να δεις τι έμαθε η Τεχνητή Νοημοσύνη.",
  "fishlong-words-init1": "Τώρα ας δούμε αν η Τεχνητή Νοημοσύνη μπορεί να μάθει μια λιγότερο προφανή λέξη.",
  "fishlong-words-init2": "Ας διδάξουμε στην Τεχνητή Νοημοσύνη μια λέξη που βασίζεται σε εσένα. Πρέπει εσύ να διαλέξεις ψάρια που ταιριάζουν στη λέξη σου.",
  "fishlong-training-pause1": "Είναι δίκαιο να χρησιμοποιούμε την Τεχνητή Νοημοσύνη για να κρίνουμε ένα ψάρι από την εμφάνισή του; Ενώ η Τεχνητή Νοημοσύνη μπορεί να φαίνεται δίκαιη και ουδέτερη, η ανάλυσή της προέρχεται από την εκπαίδευση που παρέχουμε. Τι ακούσιες προκαταλήψεις θα μπορούσε να προκαλέσει;",
  "fishlong-training-pause2": "Πιο πολλά δεδομένα θα βοηθήσουν την Τεχνητή Νοημοσύνη να μάθει την λέξη σου. Συνέχισε την εκπαίδευση.",
  "fishlong-training-pause3": "Κάθε επιλογή που κάνεις θα βοηθήσει την Τεχνητή Νοημοσύνη να μάθει. Συνέχισε την εκπαίδευση.",
  "fishlong-training-pause4": "Πιστεύεις ότι η Τεχνητή Νοημοσύνη έχει αρκετά δεδομένα; Η Τεχνητή Νοημοσύνη θα τα πάει καλύτερα με πολλά δεδομένα.  Πάτησε Συνέχεια όταν πιστεύεις ότι η Τεχνητή Νοημοσύνη είναι έτοιμη.",
  "fishlong-training-many": "Ουάου! Πολλά ψάρια!",
  "fishlong-predicting-init1": "Με τα δεδομένα σου, έχεις προγραμματίσει την Τεχνητή Νοημοσύνη να αναγνωρίζει {word} ψάρια.",
  "fishlong-predicting-init2": "Ας δούμε την Τεχνητή Νοημοσύνη να ταυτοποιεί \"{word}\".",
  "fishlong-pond-init1": "Με βάση την εκπαίδευσή σου, η Τεχνητή Νοημοσύνη ταυτοποίησε {n, plural,one {αυτό το ψάρι}other {αυτά τα ψάρια}} ως \"{word}\". Πώς τα πήγε η Τεχνητή Νοημοσύνη;",
  "fishlong-pond-init2": "Μπορείς να εκπαιδεύσεις την Τεχνητή Νοημοσύνη περισσότερο αν θέλεις να βελτιώσεις τα αποτελέσματα.",
  "fishlong-pond-init3": "Ή μπορείς να μάθεις στην Τεχνητή Νοημοσύνη μια νέα λέξη επιλέγοντας \"Νέα Λέξη\".",
  "didYouKnow": "Το ήξερες;",
  "continue": "Συνέχεια",
  "areYouSure": "Είσαι σίγουρος;",
  "eraseWarning": "Η διαγραφή όλων των δεδομένων της Τεχνητής Νοημοσύνης θα διαγράψει μόνιμα όλη την εκπαίδευση. Αυτό θέλεις να κάνεις;",
  "erase": "Διαγραφή",
  "cancel": "Άκυρο",
  "yes": "Ναι",
  "no": "Όχι",
  "notWord": "Όχι {word}",
  "run": "Εκτέλεση",
  "mostImportantParts": "Αυτά ήταν τα πιο σημαντικά μέρη του ψαριού:",
  "clickIndividualFish": "Πάτησε πάνω σε κάθε ψάρι για να δεις τις πληροφορίες του.",
  "mostImportantPartsDescription": "Αυτά ήταν τα πιο σημαντικά μέρη που οδήγησαν στην απόφαση εάν αυτό το ψάρι είναι \"*{word}*\" ή \"**{notWord}**\".",
  "newWord": "Νέα Λέξη",
  "finish": "Τερματισμός",
  "trainMore": "Εκπαίδευσε Περισσότερο",
  "wordQuestionShort": "Τι τύπο ψαριών θες να μάθει να ανιχνεύει η Τεχνητή Νοημοσύνη;",
  "wordQuestionLong": "Διάλεξε μια νέα λέξη για να μάθεις στην Τεχνητή Νοημοσύνη.",
  "isThisFish": "Είναι αυτό το ψάρι {word};",
  "isThisAFish": "Είναι αυτό ψάρι;",
  "doesThisBelongInWater": "Ανήκει αυτό στο νερό;",
  "fish": "Ψάρι",
  "waterCreature": "Θαλάσσιο πλάσμα",
  "blue": "Μπλε",
  "green": "Πράσινο",
  "red": "Κόκκινο",
  "circular": "Κυκλικό",
  "rectangular": "Ορθογώνιο",
  "triangular": "Τριγωνικό",
  "angry": "Θυμωμένος",
  "awesome": "Υπέροχα",
  "delicious": "Πεντανόστιμος",
  "endangered": "Υπό εξαφάνιση",
  "fast": "Γρήγορος",
  "fierce": "Άγριος",
  "fun": "Διασκεδαστικός",
  "glitchy": "Κολλώδης",
  "happy": "Χαρούμενος",
  "hungry": "Πεινασμένος",
  "playful": "Παιχνιδιάρης",
  "scary": "Τρομακτικός",
  "silly": "Χαζός",
  "spooky": "Τρομακτικός",
  "wild": "Άγριος",
  "dorsalFins": "ραχιαίο πτερύγιο",
  "pectoralFinsFront": "θωρακικό πτερύγιο",
  "tails": "ουρά",
  "bodies": "σώμα",
  "scales": "κλίμακες",
  "eyes": "μάτια",
  "mouths": "στόμα",
  "colors": "χρώματα"
}