{
  "fishvtrash-training-init1": "La basura arrojada al agua afecta la vida marina. En esta actividad, programarás o entrenarás a IA (inteligencia artificial) para identificar peces o basura. ¡Limpiemos el océano! Haz clic en cualquier lugar de la pantalla para continuar.",
  "fishvtrash-training-init2": "Conozcamos la Inteligencia Artificial",
  "fishvtrash-training-init3": "La Inteligencia Artificial no sabe si un objeto es un pez o una basura, pero puede procesar imágenes e identificar patrones.",
  "fishvtrash-training-init4": "Para programar la Inteligencia Artificial, utilice los botones para etiquetar una imagen como \"Pez\" o \"No pez\".  El entrenamiento que proporcione enseñará a la Inteligencia Artificial a reconocer patrones por sí misma.  ¡Vamos a empezar!",
  "fishvtrash-training-pause1": "Cada año llegan al océano unos 8.000 millones de kilos de plástico.",
  "fishvtrash-training-pause2": "Estás programando o entrenando a la Inteligencia Artificial con cada clic.  Continúa.",
  "fishvtrash-training-pause3": "El 80% de la contaminación de los océanos procede de los desechos terrestres y se calcula que cuesta unos 11.000 millones de euros al año.",
  "fishvtrash-training-pause4": "La Inteligencia Artificial aprende de tus elecciones.  Si tomas decisiones \"equivocadas\", la Inteligencia Artificial repetirá tus errores.  Sigue entrenando.",
  "fishvtrash-training-pause5": "¡Buen trabajo!  Cuantos más datos proporciones a la Inteligencia Artificial, más aprenderá.  Sigue entrenando a la Inteligencia Artificial o continúa cuando estés preparado.",
  "fishvtrash-predicting-init1": "Ahora, veamos si la inteligencia artificial sabe cómo es un \"pez\".",
  "fishvtrash-predicting-init2": "La Inteligencia Artificial analizará un conjunto aleatorio de objetos y los etiquetará basándose en su entrenamiento.",
  "fishvtrash-predicting-init3": "¡Vamos!",
  "fishvtrash-pond-init1": "Basándose en su formación, estos son algunos objetos que la Inteligencia Artificial identificó como \"peces\".  ¿Cómo lo hizo la Inteligencia Artificial?",
  "fishvtrash-pond-recall": "Haz clic aquí para cambiar entre los objetos identificados como \" peces \" y \" no peces \".",
  "fishvtrash-pond-init2": "Puedes seguir entrenando a la Inteligencia Artificial...",
  "fishvtrash-pond-init3": "...o Continuar.",
  "creaturesvtrashdemo-predicting-init1": "Hasta ahora, hemos entrenado a la Inteligencia Artificial para que identifique los objetos como \" peces \" o \" no peces \".",
  "creaturesvtrashdemo-predicting-init2": "¿Y si estos datos de entrenamiento se utilizaran para decidir lo que debe estar en el agua?",
  "creaturesvtrashdemo-predicting-init3": "¿Qué pasaría con otras criaturas marinas?  ¿Nuestro enfoque de formación tiene consecuencias no deseadas?",
  "creaturesvtrashdemo-predicting-init4": "Veamos.",
  "creaturesvtrashdemo-predicting-pause1": "¿Te has dado cuenta de que la Inteligencia Artificial ha identificado algunas criaturas marinas como \"no peces\"?",
  "creaturesvtrashdemo-predicting-pause2": "Aunque estas criaturas marinas no son peces, sí pertenecen al agua.",
  "creaturesvtrashdemo-predicting-pause3": "La Inteligencia Artificial sólo aprende lo que le enseñamos.",
  "creaturesvtrashdemo-predicting-pause4": "Volvamos a entrenar a la Inteligencia Artificial.",
  "creaturesvtrash-training-init1": "Enseñemos a Inteligencia Artificial para que aprenda qué objetos deberían estar en el agua.",
  "creaturesvtrash-training-init2": "En el océano, los desechos plásticos pueden dañar peces, aves marinas y mamíferos marinos. La protección de las aves marinas y la vida marina es una de las muchas razones para mantener limpios los océanos.",
  "creaturesvtrash-training-init3": "Cuantos más datos de entrenamiento proporciones, más aprende la Inteligencia Artificial. Sigue entrenando.",
  "creaturesvtrash-training-init4": "La contaminación del mar con plásticos ha afectado al menos a 267 especies en todo el mundo, incluido el 86% de las especies de tortugas marinas.",
  "creaturesvtrash-training-init5": "Sigue entrenando para enseñar a la Inteligencia Artificial lo que debe estar en el agua.",
  "creaturesvtrash-training-init6": "¡Buen trabajo!  Cuantos más datos proporciones a la Inteligencia Artificial, mejor lo hará.  Sigue entrenando a la Inteligencia Artificial o continúa cuando estés preparado.",
  "creaturesvtrash-predicting-init1": "¿Crees que la Inteligencia Artificial hará ahora un mejor trabajo identificando lo que debería estar en el agua?  Veamos.",
  "creaturesvtrash-pond-init1": "Basándote en tu formación, aquí tienes algunos objetos que la Inteligencia Artificial identificó como \"pertenecen al agua\".  ¿Cómo lo hizo la Inteligencia Artificial?",
  "fishshort-words-init1": "La inteligencia artificial y el aprendizaje automático se pueden utilizar para enseñar nuevos patrones a un ordenador.",
  "fishshort-words-init2": "Enseñemos a la Inteligencia Artificial una nueva palabra mostrándole ejemplos de ese tipo de peces.",
  "fishshort-words-training-pause1": "¿Crees que la Inteligencia Artificial tiene suficientes datos de entrenamiento?  Puedes hacer clic en Continuar para averiguarlo.",
  "fishshort-words-training-pause2": "¡Grandioso trabajo!  Sigue entrenando a la Inteligencia Artificial o continúa cuando estés preparado.",
  "fishshort-predicting-init1": "Con tus datos de entrenamiento, has programado a la Inteligencia Artificial para que reconozca el pez “{word}”.",
  "fishshort-predicting-init2": "Veamos si la Inteligencia Artificial identifica un pez “{word}”.",
  "fishshort-pond-init1": "Basándose en tu entrenamiento, la Inteligencia Artificial identificó {n, plural,one {este} other {estos}} peces como “{word}”.  ¿Cómo lo hizo la Inteligencia Artificial?  Puedes entrenar más si quieres mejorar los resultados.",
  "fishshort-pond-init2": "Haz clic en el botón de información para ver lo que la Inteligencia Artificial ha aprendido.",
  "fishlong-words-init1": "Ahora veamos si la Inteligencia Artificial puede aprender una palabra menos obvia.",
  "fishlong-words-init2": "Vamos a enseñar a la Inteligencia Artificial una palabra que dependa de tu opinión.  Te toca elegir peces que coincidan con tu palabra.",
  "fishlong-training-pause1": "¿Es justo utilizar la inteligencia artificial para juzgar a un pez por su aspecto?  Aunque la Inteligencia Artificial pueda parecer justa y neutral, su análisis proviene del entrenamiento que le proporcionamos.  ¿Qué sesgo involuntario podría causar esto?",
  "fishlong-training-pause2": "Más datos de entrenamiento ayudarán a la Inteligencia Artificial a aprender tu palabra.  Sigue entrenando.",
  "fishlong-training-pause3": "Cada elección que hagas puede ayudar a la Inteligencia Artificial a aprender.  Sigue entrenando.",
  "fishlong-training-pause4": "¿Crees que la Inteligencia Artificial tiene suficientes datos de entrenamiento?  La inteligencia artificial lo hará mejor con muchos datos.  Continúa cuando creas que la Inteligencia Artificial está preparada.",
  "fishlong-training-many": "Vaya.  ¡Eso es un montón de peces!",
  "fishlong-predicting-init1": "Con tus datos de entrenamiento, has programado a la Inteligencia Artificial para que reconozca el pez “{word}”.",
  "fishlong-predicting-init2": "Veamos si la Inteligencia Artificial identifica un pez “{word}”.",
  "fishlong-pond-init1": "Basándose en tu entrenamiento, la Inteligencia Artificial identificó {n, plural,one {este} other {estos}} peces como “{word}”.  ¿Cómo lo hizo?",
  "fishlong-pond-init2": "Puedes entrenar más si quieres mejorar los resultados.",
  "fishlong-pond-init3": "O puedes enseñar a la Inteligencia Artificial una nueva palabra eligiendo Nueva Palabra.",
  "didYouKnow": "¿Lo sabías?",
  "continue": "Continuar",
  "areYouSure": "¿Estás seguro?",
  "eraseWarning": "Borrar los datos de la Inteligencia Artificial borrará permanentemente todo el entrenamiento. ¿Es eso lo que quieres hacer?",
  "erase": "Borrar",
  "cancel": "Cancelar",
  "yes": "Sí",
  "no": "No",
  "notWord": "No {word}",
  "run": "Ejecutar",
  "mostImportantParts": "Estas han sido las partes más importantes del pez:",
  "clickIndividualFish": "Haz clic en cada pez para ver su información.",
  "mostImportantPartsDescription": "Estas fueron las partes más importantes para determinar si este pez era “*{word}*” o “**{notWord}**”.",
  "newWord": "Nueva Palabra",
  "finish": "Terminar",
  "trainMore": "Entrenar Más",
  "wordQuestionShort": "¿Qué tipo de peces quieres que detecte la Inteligencia Artificial?",
  "wordQuestionLong": "Elige una nueva palabra para enseñar a la Inteligencia Artificial.",
  "isThisFish": "¿Este pez es {word}?",
  "isThisAFish": "¿Este es un pez?",
  "doesThisBelongInWater": "¿Esto debe estar en el agua?",
  "fish": "Pez",
  "waterCreature": "Criatura acuática",
  "blue": "Azul",
  "green": "Verde",
  "red": "Rojo",
  "circular": "Circular",
  "rectangular": "Rectangular",
  "triangular": "Triangular",
  "angry": "Enfadado",
  "awesome": "Fantástico",
  "delicious": "Delicioso",
  "endangered": "En peligro de extinción",
  "fast": "Rápido",
  "fierce": "Feroz",
  "fun": "Divertido",
  "glitchy": "Defectuoso",
  "happy": "Alegre",
  "hungry": "Hambriento",
  "playful": "Juguetón",
  "scary": "Miedoso",
  "silly": "Tonto",
  "spooky": "Escalofriante",
  "wild": "Salvaje",
  "dorsalFins": "aleta dorsal",
  "pectoralFinsFront": "aletas pectorales",
  "tails": "cola",
  "bodies": "cuerpo",
  "scales": "escamas",
  "eyes": "ojos",
  "mouths": "boca",
  "colors": "colores"
}