{
  "angry": "Galit",
  "areYouSure": "Sigurado ka?",
  "awesome": "Kahanga-hanga",
  "blue": "Asul",
  "bodies": "katawan",
  "cancel": "Kanselahin",
  "circular": "Pabilog",
  "clickIndividualFish": "I-click ang indibidwal na isda upang makita ang kanilang impormasyon.",
  "colors": "mga kulay",
  "continue": "Magpatuloy",
  "creaturesvtrash-pond-init1": "Batay sa pagsasanay mo, narito ang ilang bagay na tinukoy ng A.I. bilang \"nasa tubig\". Kamusta ang A.I?",
  "creaturesvtrash-predicting-init1": "Sa palagay mo, gagawin na ba ngayon ng A.I. ang isang mas mahusay na trabaho sa pagtukoy kung ano ang dapat na nasa tubig? Tingnan natin.",
  "creaturesvtrash-training-init1": "Turuan natin ang A.I. na matutunan kung aling mga bagay ang dapat nasa tubig.",
  "creaturesvtrash-training-init2": "Sa karagatan, maaaring makapinsala ang mga plastik sa mga isda, seabird, at marine mammal. Isa sa maraming dahilan upang panatilihing malinis ang karagatan ang pagprotekta sa mga seabird at marine life.",
  "creaturesvtrash-training-init3": "Kung mas maraming data ng pagsasanay ang ibibigay mo, mas maraming natututunan ang A.I. Patuloy na Sanayin.",
  "creaturesvtrash-training-init4": "Nakaapekto ang marine plastic pollution sa hindi bababa sa 267 species sa buong mundo, kabilang ang 86% ng lahat ng sea turtle species.",
  "creaturesvtrash-training-init5": "Panatilihin ang pagsasanay upang turuan ang A.I. kung ano ang nasa tubig.",
  "creaturesvtrash-training-init6": "Magaling! Mas maraming datos ang iyong ibibigay sa A.I., mas mabuti ang magagawa nito. Patuloy na sanayin ang A.I. o magpatuloy kapag handa na.",
  "creaturesvtrashdemo-predicting-init1": "Sa ngayon, sinanay natin ang A.I. na tukuyin ang mga bagay bilang \"isda\" man o \"hindi isda\".",
  "creaturesvtrashdemo-predicting-init2": "Paano kung ang data ng pagsasanay na ito ay ginamit upang magpasya kung ano ang nasa sa tubig?",
  "creaturesvtrashdemo-predicting-init3": "Ano ang mangyayari sa ibang nilalang sa dagat? Nagdudulot ba ng hindi sinasadyang mga kahihinatnan ang diskarte sa pagsasanay?",
  "creaturesvtrashdemo-predicting-init4": "Tingnan natin.",
  "creaturesvtrashdemo-predicting-pause1": "Napansin mo ba na tinukoy ng A.I. ang ilang nilalang sa dagat bilang \"hindi isda\"?",
  "creaturesvtrashdemo-predicting-pause2": "Bagama't hindi isda ang mga nilalang na ito sa dagat, kabilang sila sa tubig.",
  "creaturesvtrashdemo-predicting-pause3": "Natututo lang ang A.I. kung ano ang itinuturo natin dito.",
  "creaturesvtrashdemo-predicting-pause4": "Sanayin nating muli ang A.I.",
  "delicious": "Masarap",
  "didYouKnow": "Alam mo ba?",
  "doesThisBelongInWater": "Nabibilang ba ito sa tubig?",
  "dorsalFins": "dorsal na palikpik",
  "endangered": "Nanganganib",
  "erase": "Burahin",
  "eraseWarning": "Permanenteng bubura sa lahat ng pagsasanay ang pagbura sa datos ng A.I.. Iyan ba ang gusto mong mangyari?",
  "eyes": "mga mata",
  "fast": "Mabilis",
  "fierce": "Mabagsik",
  "finish": "Tapusin",
  "fish": "Isda",
  "fishlong-pond-init1": "Batay sa pagsasanay mo, tinukoy ng A.I. ang {n, plural,one {this} other {these}} fish bilang “{word}”. Kamusta ang A.I?",
  "fishlong-pond-init2": "Maaari kang Magsanay Pa kung gusto mong mas pagandahin ang mga resulta.",
  "fishlong-pond-init3": "O maaari mong turuan ang A.I. ng isang bagong salita sa pamamagitan ng pagpili ng Bagong Salita.",
  "fishlong-predicting-init1": "Sa data ng pagsasanay mo, na-program mo ang A.I. upang makilala ang \"{word}\" na isda.",
  "fishlong-predicting-init2": "Tingnan natin kung matutukoy ng A.I. ang isdang “{word}”.",
  "fishlong-training-many": "Wow. Ang daming isda niyan!",
  "fishlong-training-pause1": "Makatarungan bang gumamit ng artificial intelligence upang hatulan ang isang isda sa pamamagitan ng hitsura nito? Bagama't mukhang patas at neutral ang A.I., nagmumula ang pagsusuri nito sa pagsasanay na ibinibigay natin. Anong hindi sinasadyang bias ang maaaring idulot nito?",
  "fishlong-training-pause2": "Higit pang data ng pagsasanay ang makakatulong sa A.I. na matutunan ang salita mo. Magpatuloy sa pagsasanay.",
  "fishlong-training-pause3": "Makakatulong ang bawat pagpipiliang gagawin mo sa A.I. na matuto. Magpatuloy sa pagsasanay",
  "fishlong-training-pause4": "Sa tingin mo may sapat na data ba ng pagsasanay ang A.I.? Mas magiging mahusay ang A.I. sa maraming data. Magpatuloy kapag sa tingin mo ay handa na ang A.I.",
  "fishlong-words-init1": "Ngayon tingnan natin kung matututo ang A.I. ng hindi gaanong halatang salita.",
  "fishlong-words-init2": "Turuan natin ang A.I. ng isang salita na depende sa opinyon mo. Nasa sa iyo na pumili ng isda na tumutugma sa salita mo.",
  "fishshort-pond-init1": "Batay sa pagsasanay mo, tinukoy ng A.I. ang {n, plural,one {this} other {these}} isda bilang “{word}”. Kamusta ang A.I? Maaari kang Magsanay ng Higit Pa kung gusto mong pagbutihin ang mga resulta.",
  "fishshort-pond-init2": "Mag-click sa buton ng impormasyon upang makita kung ano ang natutunan ng A.I.",
  "fishshort-predicting-init1": "Sa data ng pagsasanay mo, na-program mo ang A.I. upang makilala ang \"{word}\" na isda.",
  "fishshort-predicting-init2": "Tingnan natin ang A.I. na kilalanin ang \"{word}\" na isda.",
  "fishshort-words-init1": "Maaaring gamitin ang artificial intelligence at machine learning upang magturo ng mga bagong pattern sa computer.",
  "fishshort-words-init2": "Magturo tayo ng bagong salita sa A.I. sa pamamagitan ng pagpapakita dito ng mga halimbawa ng ganoong uri ng isda.",
  "fishshort-words-training-pause1": "Sa tingin mo ba ay may sapat na data ng pagsasanay ang A.I.? Maaari mong i-click ang Magpatuloy upang malaman.",
  "fishshort-words-training-pause2": "Magaling! Patuloy na sanayin ang A.I. o magpatuloy kapag handa na.",
  "fishvtrash-pond-init1": "Batay sa pagsasanay mo, narito ang ilang bagay na tinukoy ng AI bilang \"isda\". Kamusta ang A.I?",
  "fishvtrash-pond-init2": "Maaari mong sanayin ang A.I. nang higit pa...",
  "fishvtrash-pond-init3": "...o Magpatuloy.",
  "fishvtrash-pond-recall": "Mag-click dito upang lumipat sa pagitan ng mga bagay na tinukoy bilang \"isda\" at \"hindi isda\".",
  "fishvtrash-predicting-init1": "Ngayon tingnan natin kung alam ng AI kung ano ang hitsura ng isang \"isda\".",
  "fishvtrash-predicting-init2": "Susuriin ng AI ang isang random na hanay ng mga bagay at lagyan ng label ang mga ito batay sa pagsasanay mo.",
  "fishvtrash-predicting-init3": "Tayo na!",
  "fishvtrash-training-init1": "Nakakaapekto sa buhay dagat ang mga basurang itinapon sa tubig. Sa aktibidad na ito, magpo-program o magsasanay ka ng AI (artificial intelligence) upang matukoy ang mga isda o basura. Linisin natin ang karagatan! Mag-click saanman sa screen upang magpatuloy.",
  "fishvtrash-training-init2": "Kilalanin natin ang A.I.",
  "fishvtrash-training-init3": "Hindi alam ng AI kung isda o basura ang isang bagay, ngunit maaari itong magproseso ng mga larawan at tumukoy ng mga pattern.",
  "fishvtrash-training-init4": "Upang i-program ang AI, gamitin ang mga pindutan upang lagyan ng label ang isang imahe bilang \"Isda\" o \"Hindi Isda\". Ang pagsasanay na iyong ibibigay ay magtuturo sa AI na makilala sa sarili nito ang mga pattern. Magsimula na tayo!",
  "fishvtrash-training-pause1": "Labing pitong bilyong libra ng plastik ang pumapasok sa karagatan bawat taon.",
  "fishvtrash-training-pause2": "Nagpo-programa o nagsasanay ka ng A.I. sa bawat pag-click. Magpatuloy.",
  "fishvtrash-training-pause3": "80% ng polusyon sa karagatan ay nagmumula sa mga basura ng lupa at tinatayang nagkakahalaga ng $13 bilyon bawat taon.",
  "fishvtrash-training-pause4": "Natututo ang A.I. mula sa mga pagpipilian mo. Kung gumawa ka ng \"maling\" mga pagpipilian, uulitin ng A.I. ang mga pagkakamali mo. Patuloy na magsanay.",
  "fishvtrash-training-pause5": "Mahusay! Kung mas maraming data ang ibibigay mo sa A.I., mas natututo ito. Patuloy na sanayin ang A.I. o magpatuloy kapag handa na.",
  "fun": "Nakakatuwa",
  "glitchy": "Malamang na sira",
  "green": "Luntian",
  "happy": "Masaya",
  "hungry": "Gutom",
  "isThisAFish": "Isda ba ito?",
  "isThisFish": "Isda ba ito {word}?",
  "mostImportantParts": "Ito ang mga pinakamahalagang bahagi ng isda:",
  "mostImportantPartsDescription": "Ito ang pinakamahalagang bahagi ng isda sa pagtukoy kung ang isdang ito ay “*{word}*” o “**{notWord}**”.",
  "mouths": "bibig",
  "newWord": "Bagong Salita",
  "no": "Hindi",
  "notWord": "Hindi ang {word}",
  "pectoralFinsFront": "mga pectoral na palikpik",
  "playful": "Mapaglaro",
  "rectangular": "Parihaba",
  "red": "Pula",
  "run": "Patakbuhin",
  "scales": "mga kaliskis",
  "scary": "Nakakatakot",
  "silly": "Tanga",
  "spooky": "Nakakatakot",
  "tails": "buntot",
  "trainMore": "Magsanay Pa",
  "triangular": "Tatsulok",
  "waterCreature": "Nilalang sa tubig",
  "wild": "Mabangis",
  "wordQuestionLong": "Pumili ng bagong salita upang ituro sa A.I.",
  "wordQuestionShort": "Anong uri ng isda ang gusto mong isanay na matukoy ng A.I.?",
  "yes": "Oo"
}