{
  "fishvtrash-training-init1": "Ang basurang itinapon sa tubig ay nakakaapekto sa buhay sa dagat. Sa aktibidad na ito, ipo-program o sasanayin mo ang A.I. (artificial intelligence) para matukoy ang isda o basura. Linisin natin ang karagatan! Mag-click saanman sa screen para magpatuloy.",
  "fishvtrash-training-init2": "Kilalanin natin ang A.I.",
  "fishvtrash-training-init3": "Hindi alam ng A.I. kung ang isang bagay ay isang isda o basura, ngunit mapoproseso nito ang mga imahe at matutukoy ang mga pattern.",
  "fishvtrash-training-init4": "Para i-program ang A.I., gamitin ang mga button para pangalanan ang imahe na Isda” o “Hindi Isda”. Ang pagsasanay na iyong ibibigay ay magtuturo sa A.I. na tukuyin ang mga pattern nang sarili. Mag-umpisa tayo!",
  "fishvtrash-training-pause1": "Labimpitong bilyong pound ng plastic ang pumapasok sa karagatan bawat taon.",
  "fishvtrash-training-pause2": "Pino-program mo o sinasanay ang A.I. sa bawat klik. Magpatuloy.",
  "fishvtrash-training-pause3": "80% ng polusyon sa karagatan ay nagmula sa mga debris ng lupa at tinatayang nagkakahalaga ng $13 bilyon kada taon.",
  "fishvtrash-training-pause4": "Natuto ang A.I. mula sa iyong mga pagpili. Kung gagawa ka ng mga “maling” pagpili, uulitin ng A.I. ang iyong mga mali. Magpatuloy sa pagsasanay.",
  "fishvtrash-training-pause5": "Mahusay! Mas maraming datos ang iyong ibibigay sa A.I., mas lalo itong matututo. Patuloy na sanayin ang A.I. o magpatuloy kapag handa.",
  "fishvtrash-predicting-init1": "Ngayon tingnan natin kung alam ng A.I. ang hitsura ng isang “isda”.",
  "fishvtrash-predicting-init2": "Aanalisahin ng A.I. ang random na set ng mga bagay at papangalanan ito batay sa iyong pagsasanay.",
  "fishvtrash-predicting-init3": "Tayo na!",
  "fishvtrash-pond-init1": "Batay sa iyong pagsasanay, narito ang ilang bagay na tinutukoy ng A.I. bilang “isda”. Kumusta ang A.I?",
  "fishvtrash-pond-recall": "Mag-click dito para lumipat-lipat sa pagitan ng mga bagay na tinukoy na “isda” at “hindi isda”.",
  "fishvtrash-pond-init2": "Mas higit mo pang masasanay ang A.I...",
  "fishvtrash-pond-init3": "...o Magpatuloy.",
  "creaturesvtrashdemo-predicting-init1": "Sa ngayon, nasanay na natin ang A.I. para matukoy ang mga bagay na alinman sa “fish” o “hindi isda”.",
  "creaturesvtrashdemo-predicting-init2": "Paano kung ang datos ng pagsasanay na ito ay ginamit para pasyahan kung ano ang nabibilang sa tubig?",
  "creaturesvtrashdemo-predicting-init3": "Ano ang mangyayari sa ibang mga nilalang sa dapat? Ang ating paraan ba ng pagsasanay ay nagdudulot ng hindi nilalayong mga resulta?",
  "creaturesvtrashdemo-predicting-init4": "Tingnan natin.",
  "creaturesvtrashdemo-predicting-pause1": "Napansin niyo ba na tinukoy ng A.I ang ibang mga nilalang sa dagat na “hindi isda”?",
  "creaturesvtrashdemo-predicting-pause2": "Kahit na ang mga nilalang sa dagat na ito ay hindi isda, nabibilang sila sa tubig.",
  "creaturesvtrashdemo-predicting-pause3": "Natuto lamang ang A.I. sa kung ano ang itinuturo natin.",
  "creaturesvtrashdemo-predicting-pause4": "Sanayin natin muli ang A.I.",
  "creaturesvtrash-training-init1": "Turuan natin ang A.I. na malaman kung aling mga bagay ang dapat nasa tubig.",
  "creaturesvtrash-training-init2": "Sa karagatan, ang mga plastic ay makakasira sa isda, seabirds, at mga mammal sa tubig. Ang pagprotekta sa mga seabird at buhay-dagat ay isa sa maraming dahilan na panatilihing malinis ang karagatan.",
  "creaturesvtrash-training-init3": "Mas maraming datos sa pagsasanay ang iyong ibibigay, mas matututo ang A.I.  Magpatuloy sa pagsasanay.",
  "creaturesvtrash-training-init4": "Ang polusyon ng plastc sa dagat ay nakaapekto sa pinakamababa 267 species sa buong mundo, kabilang ang 86% ng lahat ng sea turtle species.",
  "creaturesvtrash-training-init5": "Magpatuloy sa pagtuturo sa A.I. kung ano ang nabibilang sa tubig.",
  "creaturesvtrash-training-init6": "Magaling! Mas maraming datos ang iyong ibibigay sa A.I., mas mabuti ang magagawa nito. Patuloy na sanayin ang A.I. o magpatuloy kapag handa na.",
  "creaturesvtrash-predicting-init1": "Sa palagay mo ba mas gagawa na ngayon ang A.I. ng mas mahusay na trabaho sa pagtukoy kung ano ang dapat nasa tubig? Panoorin natin.",
  "creaturesvtrash-pond-init1": "Batay sa iyong pagsasanay, narito ang ilang mga bagay na tinukoy ng A.I. na “nabibilang sa tubig”. Kumusta ang A.I?",
  "fishshort-words-init1": "Ang artificial intelligence at machine learning ay maaaring gamitin para turuan ang isang computer ng mga bagong pattern.",
  "fishshort-words-init2": "Turuan natin ang A.I. ng bagong salita sa pamamagitan ng pagpapakita nito ng mga halimbawa kung anong uri ng isda iyan.",
  "fishshort-words-training-pause1": "Sa palagay mo ba ang A.I. ay may sapat na datos sa pagsasanay? Maaari mong i-click ang Magpatuloy para malaman.",
  "fishshort-words-training-pause2": "Magaling! Patuloy na sanayin ang A.I. o magpatuloy kapag handa na.",
  "fishshort-predicting-init1": "Sa iyong datos sa pagsasanay, pinrogram mo ang A.I. para makilala ang isda na “{word}”.",
  "fishshort-predicting-init2": "Tingnan natin kung matutukoy ng A.I. ang isdang “{word}”.",
  "fishshort-pond-init1": "Batay sa iyong pagsasanay, natukoy ng A.I. ang {n, plural,one {ito} other {ito}} isda bilang “{word}”. Kumusta ang A.I.? Maaari kang Magsanay Pa kung gusto mong mapahusay ang mga resulta.\n",
  "fishshort-pond-init2": "Mag-click sa button ng impormasyon para makita kung ano ang natutunan ng A.I.",
  "fishlong-words-init1": "Ngayon tingnan natin kung matutunan ng A.I. ang hindi gaanong malinaw na salita.",
  "fishlong-words-init2": "Turuan natin ang A.I. ng isang salita na nakadepende sa iyong opinyon. Nasa sa iyo na kung pipili ng isda na katugma sa iyong salita.",
  "fishlong-training-pause1": "Patas ba na gamitin ang artificial intelligence para hatulan ang isda batay sa hitsura nito? Kahit na ang AI ay mukhang patas at neutral, ang pag-aanalisa nito ay nagmumula sa pagsasanay na ibinibigay natin. Ano kaya ang hindi nilalayong pagkiling na maidudulot nito?",
  "fishlong-training-pause2": "Ang mas maraming datos ay makakatulong sa A.I. na matutunan ang iyong salita. Magpatuloy sa pagsasanay.",
  "fishlong-training-pause3": "Ang bawat desisyon na gagawin mo ay makakatulong sa A.I. na matuto. Magpatuloy sa pagsasanay.",
  "fishlong-training-pause4": "Sa palagay mo ba ang A.I. ay may sapat na datos sa pagsasanay? Maaaring gaganap nang mas mabuti ang A.I. sa maraming datos. Magpatuloy kapag sa palagay mo handa na ang A.I.",
  "fishlong-training-many": "Wow. Ang daming isda niyan!",
  "fishlong-predicting-init1": "Sa iyong datos sa pagsasanay, pinrogram mo ang A.I. para makilala ang isda na “{word}”.",
  "fishlong-predicting-init2": "Tingnan natin kung matutukoy ng A.I. ang isdang “{word}”.",
  "fishlong-pond-init1": "Batay sa iyong pagsasanay, tinukoy ng A.I. ang isdang {n, plural,one {ito} other {ito}} bilang “{word}”. Kumusta ang A.I.?",
  "fishlong-pond-init2": "Maaari kang Magsanay Pa kung gusto mong mas pagandahin ang mga resulta.",
  "fishlong-pond-init3": "O maaari mong turuan ang A.I. ng isang bagong salita sa pamamagitan ng pagpili ng Bagong Salita.",
  "didYouKnow": "Alam mo ba?",
  "continue": "Magpatuloy",
  "areYouSure": "Sigurado ka?",
  "eraseWarning": "Ang pagbura sa datos ng A.I. ay permanenteng bubura sa lahat ng pagsasanay. Iyan ba ang gusto mong mangyari?",
  "erase": "Burahin",
  "cancel": "Kanselahin",
  "yes": "Oo",
  "no": "Hindi",
  "notWord": "Huwag {word}",
  "run": "Patakbuhin",
  "mostImportantParts": "Ito ang pinakamahalagang mga parte ng isda:",
  "clickIndividualFish": "I-click ang indibidwal na isda para makita ang kanilang impormasyon.",
  "mostImportantPartsDescription": "Ito ang pinakamahalagang mga parte ng isda sa pagtukoy kung ang isda na ito ay “*{word}*” o“**{notWord}**”.",
  "newWord": "Bagong Salita",
  "finish": "Tapusin",
  "trainMore": "Magsanay Pa",
  "wordQuestionShort": "Anong uri ng isda ang gusto mong sanayin ang A.I. na madetek?",
  "wordQuestionLong": "Pumili ng bagong salita para ituro sa A.I.",
  "isThisFish": "Ang isda bang ito ay {word}?",
  "isThisAFish": "Ito ba ay isda?",
  "doesThisBelongInWater": "Nabibilang ba ito sa tubig?",
  "fish": "Isda",
  "waterCreature": "Nilalang sa tubig",
  "blue": "Asul",
  "green": "Luntian",
  "red": "Pula",
  "circular": "Bilugan",
  "rectangular": "Rektanggular",
  "triangular": "Trianggular",
  "angry": "Galit",
  "awesome": "Kamangha-mangha",
  "delicious": "Masarap",
  "endangered": "Nanganganib",
  "fast": "Mabilis",
  "fierce": "Mabangis",
  "fun": "Nakakatuwa",
  "glitchy": "Malamang na masira",
  "happy": "Masaya",
  "hungry": "Nagugutom",
  "playful": "Mapaglaro",
  "scary": "Nakakatakot",
  "silly": "Tanga",
  "spooky": "Nakakatakot",
  "wild": "Wild",
  "dorsalFins": "dorsal na palikpik",
  "pectoralFinsFront": "mga pectoral na palikpik",
  "tails": "buntot",
  "bodies": "katawan",
  "scales": "mga kaliskis",
  "eyes": "mga mata",
  "mouths": "bibig",
  "colors": "mga kulay"
}