{
  "fishvtrash-training-init1": "Les déchets accumulés dans l'eau affectent la vie marine. Dans cette activité, vous allez programmer ou entraîner une I.A. (Intelligence Artificielle) à identifier des poissons ou des déchets. Allons nettoyer l'océan! Cliquez n'importe où sur l'écran pour continuer.",
  "fishvtrash-training-init2": "Allons rencontrer l'I.A.",
  "fishvtrash-training-init3": "L’ I.A. ne sait pas si un objet est un poisson ou un déchet, mais elle peut analyser des images et identifier des motifs.",
  "fishvtrash-training-init4": "Pour programmer l' I.A., utilisez les boutons pour désigner une image comme \"Poisson\" ou \"Pas un poisson\". L'entraînement que vous donnez à l' I.A. lui permettra de reconnaître des motifs par elle-même. Commençons!",
  "fishvtrash-training-pause1": "Près de 8,5 millions de tonnes de plastique entrent dans l'océan chaque année.",
  "fishvtrash-training-pause2": "Vous programmez ou entraînez l'I.A. à chaque clic. Continuez.",
  "fishvtrash-training-pause3": "80% de la pollution des océans vient de débris terrestres, et il est estimé qu'elle coûte près de 13 milliards d'euros par an.",
  "fishvtrash-training-pause4": "L'I.A. apprends de vos choix. Si vous faites de \"mauvais\" choix, l'I.A. va répéter vos erreurs.  Continuez de vous entraîner.",
  "fishvtrash-training-pause5": "Beau travail!  Plus vous donnez de données à l'I.A., plus elle apprends.  Continuez à entraîner l'I.A. ou continuez lorsque vous serez prêts.",
  "fishvtrash-predicting-init1": "Maintenant voyons voir si l'I.A. sait à quoi un \"poisson\" ressemble.",
  "fishvtrash-predicting-init2": "L'I.A. va analyser un lot d'objets aléatoires et les étiqueter à partir de l'entraînement que vous lui avez donné.",
  "fishvtrash-predicting-init3": "C'est parti !",
  "fishvtrash-pond-init1": "À partir de son entraînement, voici quelques objets que l'I.A. a identifié comme \"poissons\". Comment c'est elle débrouillée?",
  "fishvtrash-pond-recall": "Cliquez ici pour basculer entre objets identifiés comme \"poisson\" ou \"pas poisson\".",
  "fishvtrash-pond-init2": "Vous pouvez entraîner l'I.A plus...",
  "fishvtrash-pond-init3": "...ou Continuer.",
  "creaturesvtrashdemo-predicting-init1": "Pour l'instant, on a entraîné l'I.A. à identifier des objets comme \"poisson\" ou \"pas poisson\".",
  "creaturesvtrashdemo-predicting-init2": "Et si ces données d'entraînement étaient utilisées pour décider ce qui devrait être dans l'eau ?",
  "creaturesvtrashdemo-predicting-init3": "Qu'arriverait-il aux autres créatures marines?  Est-ce que notre approche d'entraînement a des  conséquences inattendues?",
  "creaturesvtrashdemo-predicting-init4": "Voyons voir.",
  "creaturesvtrashdemo-predicting-pause1": "Avez-vous remarqué que l'I.A. identifiait des créatures marines comme \"pas poisson\" ?",
  "creaturesvtrashdemo-predicting-pause2": "Même si ces créatures marines ne sont pas des poissons, elle appartiennent à l'océan.",
  "creaturesvtrashdemo-predicting-pause3": "L'I.A. n'apprends que ce qu'on lui enseigne.",
  "creaturesvtrashdemo-predicting-pause4": "Entraînons l'I.A. de nouveau.",
  "creaturesvtrash-training-init1": "Apprenons à l'I.A. quels objets devraient être dans l'eau.",
  "creaturesvtrash-training-init2": "Dans l'océan, les débris plastiques peuvent blesser les poissons, oiseaux et mammifères marins. Protéger les oiseaux et la vie marine est l'une des nombreuses raisons à garder l'océan propre.",
  "creaturesvtrash-training-init3": "Plus vous l'entraînez, plus l'I.A apprends. Continuez à l'entraîner.",
  "creaturesvtrash-training-init4": "La pollution du plastique à impacté au moins 267 espèces dans le monde entier, dont 86% de toutes les espèces de tortues marines.",
  "continue": "Continuer",
  "areYouSure": "Es-tu certain ?",
  "cancel": "Annuler",
  "yes": "Oui",
  "no": "Non",
  "run": "Démarrer",
  "finish": "Terminer"
}