{
  "fishvtrash-training-init1": "I rifiuti scaricati in acqua danneggiano la vita sottomarina. In questa esercitazione, programmerai o, meglio, addestrerai A.I. (un’Intelligenza Artificiale) a distinguere i pesci dai rifiuti. Puliamo il mare! Clicca in qualsiasi punto dello schermo per proseguire.",
  "fishvtrash-training-init2": "Andiamo a conoscere A.I. (l’Intelligenza Artificiale)",
  "fishvtrash-training-init3": "A.I. non sa se un oggetto è un pesce o un rifiuto, ma è in grado di elaborare le immagini per riconoscerne le caratteristiche.",
  "fishvtrash-training-init4": "Per programmare A.I., usa i pulsanti per classificare un'immagine come \"Pesce\" o \"Non pesce\". Questo addestramento permetterà all'Intelligenza Artificiale di riconoscere autonomamente la presenza delle caratteristiche. Iniziamo!",
  "fishvtrash-training-pause1": "Otto milioni di tonnellate di plastica finiscono in mare ogni anno.",
  "fishvtrash-training-pause2": "Ad ogni clic stai programmando o, meglio, addestrando l'Intelligenza Artificiale. Prosegui.",
  "fishvtrash-training-pause3": "L'80% dell'inquinamento marino proviene da rifiuti terrestri e si stima che questo costi 13 miliardi di dollari all'anno.",
  "fishvtrash-training-pause4": "A.I. impara dalle tue scelte. Se fai delle scelte \"sbagliate\", A.I. ripeterà i tuoi errori. Continua l’addestramento.",
  "fishvtrash-training-pause5": "Ottimo lavoro! Più dati fornisci ad A.I., più impara. Continua ad addestrare l'Intelligenza Artificiale o clicca su “Prosegui” quando pensi sia sufficiente.",
  "fishvtrash-predicting-init1": "Ora vediamo se A.I. sa che aspetto ha un \"Pesce\".",
  "fishvtrash-predicting-init2": "L’Intelligenza Artificiale analizzerà un insieme casuale di oggetti e li classificherà in base al tuo addestramento.",
  "fishvtrash-predicting-init3": "Pronti, via!",
  "fishvtrash-pond-init1": "In base al tuo addestramento, ecco alcuni oggetti che A.I. ha classificato come \"Pesce\". Ha funzionato bene?",
  "fishvtrash-pond-recall": "Clicca qui per passare da oggetti classificati  come \"Pesce\" a quelli classificati  come \"Non pesce\".",
  "fishvtrash-pond-init2": "È possibile addestrare A.I. ancora un po’...",
  "fishvtrash-pond-init3": "oppure cliccare su “Prosegui”.",
  "creaturesvtrashdemo-predicting-init1": "Finora, abbiamo addestrato l'Intelligenza Artificiale a classificare gli oggetti come \"Pesce\" o \"Non pesce\".",
  "creaturesvtrashdemo-predicting-init2": "Cosa succederebbe se usassimo questi dati per decidere più in generale cosa è corretto aspettarsi di trovare in acqua?",
  "creaturesvtrashdemo-predicting-init3": "Cosa succederebbe ad altri esseri viventi che si trovano in mare? Il nostro tipo di addestramento potrebbe causare delle conseguenze indesiderate?",
  "creaturesvtrashdemo-predicting-init4": "Vediamo.",
  "creaturesvtrashdemo-predicting-pause1": "Hai notato che A.I. ha identificato alcuni animali marini come \"Non pesci\"?",
  "creaturesvtrashdemo-predicting-pause2": "In effetti questi animali non sono pesci, ma vivono comunque in mare.",
  "creaturesvtrashdemo-predicting-pause3": "L’Intelligenza Artificiale impara solo quello che gli insegniamo.",
  "creaturesvtrashdemo-predicting-pause4": "Proviamo di nuovo.",
  "creaturesvtrash-training-init1": "Insegniamo all'Intelligenza Artificiale ad imparare quali oggetti è corretto aspettarsi di trovare in acqua.",
  "creaturesvtrash-training-init2": "In mare, i rifiuti di plastica possono danneggiare pesci, uccelli e mammiferi marini. La protezione degli uccelli e della vita sottomarina è una delle tante ragioni per mantenere il mare pulito.",
  "creaturesvtrash-training-init3": "Più dati di apprendimento fornisci, più A.I. impara. Continua l’addestramento.",
  "creaturesvtrash-training-init4": "La presenza di plastica in mare ha danneggiato almeno 267 specie in tutto il mondo, tra cui l'86% di tutte le specie di tartarughe marine.",
  "creaturesvtrash-training-init5": "Continua l'addestramento per insegnare all'Intelligenza Artificiale cosa è corretto aspettarsi di trovare in acqua.",
  "creaturesvtrash-training-init6": "Ottimo lavoro! Più dati si forniscono all'Intelligenza Artificiale, meglio sarà. Continua l’addestramento o clicca su \"Prosegui\" quando pensi che sia sufficiente.",
  "creaturesvtrash-predicting-init1": "Pensi che A.I. ora farà un lavoro migliore per classificare cosa è corretto aspettarsi di trovare in acqua? Controlliamo.",
  "creaturesvtrash-pond-init1": "In base al tuo addestramento, ecco alcuni oggetti che A.I. ha identificato come \"è giusto trovarlo in acqua\".  Ha funzionato bene?",
  "fishshort-words-init1": "L'Intelligenza Artificiale e l'Apprendimento Automatico possono essere utilizzati per insegnare a un computer nuove caratteristiche.",
  "fishshort-words-init2": "Insegniamo ad A.I. una nuova proprietà mostrandogli degli esempi di pesci dotati di questa PROPRIETÀ.",
  "fishshort-words-training-pause1": "Pensi che l'Intelligenza Artificiale abbia ricevuto abbastanza dati di apprendimento? Per scoprirlo puoi cliccare su \"Prosegui\".",
  "fishshort-words-training-pause2": "Ottimo lavoro! Continua l’addestramento o clicca su \"Prosegui\" quando pensi che sia sufficiente.",
  "fishshort-predicting-init1": "Con i tuoi dati di apprendimento, hai programmato A.I. per riconoscere i pesci “{word}”.",
  "fishshort-predicting-init2": "Vediamo come A.I. ha identificato i pesci “{word}”.",
  "fishshort-pond-init1": "In base al tuo addestramento, A.I. ha identificato {n, plural,one {questo pesce} other {questi pesci}} come “{word}”. Ha funzionato bene? Puoi cliccare “Addestra ancora un po’” se vuoi migliorare i risultati.",
  "fishshort-pond-init2": "Clicca sul pulsante “i” delle informazioni per vedere cosa ha imparato l'Intelligenza Artificiale.",
  "fishlong-words-init1": "Ora verifichiamo se l'Intelligenza Artificiale è in grado di imparare a riconoscere una PROPRIETÀ meno evidente.",
  "fishlong-words-init2": "Insegna ad A.I. una PROPRIETÀ che dipende dalla tua opinione. Sta a te decidere quali pesci siano dotati di quella PROPRIETÀ.",
  "fishlong-training-pause1": "Ti sembra giusto usare l'intelligenza artificiale per giudicare un pesce dal suo aspetto? Anche se A.I. può sembrare corretta ed imparziale, i risultati della sua analisi derivano dai dati di apprendimento. Quali pregiudizi potrebbero essere introdotti involontariamente?",
  "fishlong-training-pause2": "Ulteriori dati di apprendimento aiuteranno A.I. ad imparare la nuova PROPRIETÀ. Continua l’addestramento.",
  "fishlong-training-pause3": "Ogni scelta che fai, migliora l’apprendimento dell'intelligenza artificiale. Continua l’addestramento.",
  "fishlong-training-pause4": "Pensi che l'Intelligenza Artificiale abbia ricevuto abbastanza dati di apprendimento? A.I. farà del suo meglio meglio se prima acquisisce molti dati. Continua quando pensi che l'Intelligenza Artificiale sia pronta.",
  "fishlong-training-many": "Wow.  Questi sono proprio tantissimi pesci!",
  "fishlong-predicting-init1": "Con i tuoi dati di apprendimento, hai programmato A.I. per riconoscere i pesci “{word}”.",
  "fishlong-predicting-init2": "Vediamo come A.I. ha identificato i pesci “{word}”.",
  "fishlong-pond-init1": "In base al tuo addestramento, A.I. ha identificato  {n, plural,one {questo pesce} other {questi pesci}} come “{word}”. Ha funzionato bene?",
  "fishlong-pond-init2": "Puoi cliccare “Addestra ancora un po’” se vuoi migliorare i risultati.",
  "fishlong-pond-init3": "Oppure puoi insegnare ad A.I. una nuova PROPRIETÀ scegliendo \"Nuova proprietà\".",
  "didYouKnow": "Lo sapevi?",
  "continue": "Prosegui",
  "areYouSure": "Sei sicuro?",
  "eraseWarning": "Cancellando i dati dell'Intelligenza Artificiale, si annulla definitivamente l'effetto di tutti i precedenti addestramenti. È proprio ciò che vuoi fare?",
  "erase": "Cancella",
  "cancel": "Annulla",
  "yes": "Sì",
  "no": "No",
  "notWord": "Non {word}",
  "run": "Esegui",
  "mostImportantParts": "Queste sono le parti più importanti dei pesci:",
  "clickIndividualFish": "Clicca sui singoli pesci per vedere le loro caratteristiche.",
  "mostImportantPartsDescription": "Queste sono le parti più importanti per determinare se questo pesce è “**{word}**” o “**{notWord}**”.",
  "newWord": "Nuova proprietà",
  "finish": "Termina",
  "trainMore": "Addestra ancora un po’",
  "wordQuestionShort": "Che tipo di pesci vuoi che A.I. impari ad individuare?",
  "wordQuestionLong": "Scegli una nuova PROPRIETÀ da insegnare ad A.I.",
  "isThisFish": "Questo pesce è {word}?",
  "isThisAFish": "È un pesce?",
  "doesThisBelongInWater": "Questo è giusto trovarlo in acqua?",
  "fish": "Pesce",
  "waterCreature": "Essere vivente che si trova in mare",
  "blue": "Blu",
  "green": "Verdi",
  "red": "Rossi",
  "circular": "Circolari",
  "rectangular": "Rettangolari",
  "triangular": "Triangolari",
  "angry": "Arrabbiati",
  "awesome": "Meravigliosi",
  "delicious": "Deliziosi",
  "endangered": "In pericolo",
  "fast": "Veloci",
  "fierce": "Feroci",
  "fun": "Divertenti",
  "glitchy": "Problematici",
  "happy": "Felici",
  "hungry": "Affamati",
  "playful": "Giocosi",
  "scary": "Spaventosi",
  "silly": "Sciocchi",
  "spooky": "Inquietanti",
  "wild": "Selvaggi",
  "dorsalFins": "pinna dorsale",
  "pectoralFinsFront": "pinne pettorali",
  "tails": "coda",
  "bodies": "corpo",
  "scales": "squame",
  "eyes": "occhi",
  "mouths": "bocca",
  "colors": "colori"
}