{
  "angry": "Arrabbiato",
  "areYouSure": "Sei sicuro?",
  "awesome": "Fantastico",
  "blue": "Blu",
  "bodies": "corpo",
  "cancel": "Annulla",
  "circular": "Circolare",
  "clickIndividualFish": "Clicca il singolo pesce per vederne le informazioni.",
  "colors": "colori",
  "continue": "Prosegui",
  "creaturesvtrash-pond-init1": "In base al tuo addestramento, ecco alcuni oggetti che l'IA ha identificato come \"appartenente all'acqua\". Come è andata all'IA?",
  "creaturesvtrash-predicting-init1": "Pensi che l'IA farà ora un lavoro migliore nell'identificare cosa dovrebbe essere in acqua? Guardiamo.",
  "creaturesvtrash-training-init1": "Insegniamo all'intelligenza artificiale a imparare quali oggetti devono stare nell'acqua.",
  "creaturesvtrash-training-init2": "Nell'oceano, i detriti di plastica possono far male ai pesci, uccelli e mammiferi marini. Proteggere gli uccelli marini e la vita marina è uno dei tanti motivi per mantenere puliti gli oceani.",
  "creaturesvtrash-training-init3": "Più dati d'addestramento fornisci, più l'IA impara. Continua l'addestramento.",
  "creaturesvtrash-training-init4": "L'inquinamento plastico marino ha influenzato almeno 267 specie in tutto il mondo, incluso l'86% di tutte le specie di tartarughe marine.",
  "creaturesvtrash-training-init5": "Continua l'addestramento per insegnare all'IA cosa appartiene all'acqua.",
  "creaturesvtrash-training-init6": "Ottimo lavoro! Più dati fornisci all'IA, meglio funzionerà. Continua ad addestrare l'IA o continua quando pronto.",
  "creaturesvtrashdemo-predicting-init1": "Finora, abbiamo addestrato l'intelligenza artificiale a identificare gli oggetti come «pesce» o «non pesce».",
  "creaturesvtrashdemo-predicting-init2": "E se questi dati d'addestramento fossero stati usati per decidere cosa appartenga all'acqua?",
  "creaturesvtrashdemo-predicting-init3": "Cosa succederebbe alle altre creature marine? Il tuo approccio di addestramento causa conseguenze indesiderate?",
  "creaturesvtrashdemo-predicting-init4": "Vediamo.",
  "creaturesvtrashdemo-predicting-pause1": "Hai notato che l'IA ha identificato alcune creature marine come \"non pesce\"?",
  "creaturesvtrashdemo-predicting-pause2": "Mentre queste creature marine non sono pesci, appartengono all'acqua.",
  "creaturesvtrashdemo-predicting-pause3": "L'IA impara solo ciò che gli insegniamo.",
  "creaturesvtrashdemo-predicting-pause4": "Addestriamo di nuovo l'IA.",
  "delicious": "Delizioso",
  "didYouKnow": "Lo sapevi?",
  "doesThisBelongInWater": "Questo deve stare nell'acqua?",
  "dorsalFins": "pinna dorsale",
  "endangered": "In pericolo",
  "erase": "Cancella",
  "eraseWarning": "Cancellare i dati dell'IA eliminerà permanentemente tutto l'addestramento. Questo è quello che vuoi fare?",
  "eyes": "occhi",
  "fast": "Veloce",
  "fierce": "Feroce",
  "finish": "Termina",
  "fish": "Pesce",
  "fishlong-pond-init1": "In base al tuo addestramento, l'IA ha identificato {n, plural,one {questo pesce} other {questi pesci}} come \"{word}\". Com'è andata all'IA?",
  "fishlong-pond-init2": "Puoi Addestrare di Più se vuoi migliorare i risultati.",
  "fishlong-pond-init3": "O puoi insegnare all'IA una nuova parola scegliendo Nuova Parola.",
  "fishlong-predicting-init1": "Con i tuoi dati d'apprendimento, hai programmato l'IA per riconoscere il pesce \"{word}\".",
  "fishlong-predicting-init2": "Vediamo l'IA identificare il pesce \"{word}\".",
  "fishlong-training-many": "Wow. Questi sono tanti pesci!",
  "fishlong-training-pause1": "Ti sembra giusto usare l'intelligenza artificiale per giudicare un pesce dal suo aspetto? Mentre l'IA potrebbe sembrare giusta e neutrale, le sue analisi provengono dall'addestramento che forniamo. Che pregiudizi imprevisti potrebbe causare questo?",
  "fishlong-training-pause2": "Più dati d'addestramento aiuteranno l'IA a imparare la tua parola. Continua ad addestrare.",
  "fishlong-training-pause3": "Ogni scelta che effettui può aiutare l'IA a imparare. Continua ad addestrare.",
  "fishlong-training-pause4": "Pensi che l'IA abbia abbastanza dati d'addestramento? L'IA farà di meglio con molti dati. Continua quando pensi che l'IA sia pronta.",
  "fishlong-words-init1": "Ora vediamo se l'IA può imparare una parola meno ovvia.",
  "fishlong-words-init2": "Insegniamo all'IA una parola che dipende dalla tua opinione. Sta a te scegliere il pesce corrispondente alla tua parola.",
  "fishshort-pond-init1": "In base al tuo addestramento, l'IA ha identificato {n, plural, one {questo pesce} other {questi pesci}} come \"{word}\". Come è andata all'IA? Puoi Addestrare di Più se vuoi migliorare i risultati.",
  "fishshort-pond-init2": "Clicca sul pulsante delle informazioni per vedere cosa l'IA ha imparato.",
  "fishshort-predicting-init1": "Con i tuoi dati d'apprendimento, hai programmato l'IA per riconoscere il pesce \"{word}\".",
  "fishshort-predicting-init2": "Vediamo l'IA identificare il pesce \"{word}\".",
  "fishshort-words-init1": "L'intelligenza artificiale e l'apprendimento automatico sono utilizzabili per insegnare nuovi schemi a un computer.",
  "fishshort-words-init2": "Insegniamo all'IA una nuova parola mostrandogli esempi di quel tipo di pesce.",
  "fishshort-words-training-pause1": "Pensi che l'IA abbia abbastanza dati d'apprendimento? Puoi cliccare Continua per scoprirlo.",
  "fishshort-words-training-pause2": "Ottimo lavoro! Continua ad addestrare l'IA o continua quando pronto.",
  "fishvtrash-pond-init1": "In base al tuo addestramento, ecco qualche oggetto che l'IA ha identificato come \"pesce\". Com'è andata all'IA?",
  "fishvtrash-pond-init2": "Puoi addestrare l'IA di più...",
  "fishvtrash-pond-init3": "...o Continuare.",
  "fishvtrash-pond-recall": "Clicca qui per passare tra gli oggetti identificati come \"pesce\" e \"non pesce\".",
  "fishvtrash-predicting-init1": "Ora vediamo se l'IA sa che aspetto ha un \"pesce\".",
  "fishvtrash-predicting-init2": "L'IA analizzerà una serie casuale di oggetti e li etichetterà in base al tuo addestramento.",
  "fishvtrash-predicting-init3": "Andiamo!",
  "fishvtrash-training-init1": "I rifiuti scaricati nell'acqua influiscono sulla vita marina. In questa attività, programmerai o addestrerai l'IA (intelligenza artificiale) per identificare pesci o rifiuti. Puliamo l'oceano! Fai clic in un punto qualsiasi dello schermo per continuare.",
  "fishvtrash-training-init2": "Incontriamo l'IA",
  "fishvtrash-training-init3": "L'IA non sa se un oggetto è un pesce o un rifiuto, ma può elaborare immagini e identificare schemi.",
  "fishvtrash-training-init4": "Per programmare l'IA, usa i pulsanti per etichettare un'immagine come \"Pesce\" o \"Non Pesce\". L'addestramento che fornisci insegnerà all'IA per riconoscere gli schemi per conto proprio. Iniziamo!",
  "fishvtrash-training-pause1": "Diciassette milioni di tonnellate di plastica entrano nell'oceano ogni anno.",
  "fishvtrash-training-pause2": "Stai programmando o addestrando l'IA a ogni click. Continua così.",
  "fishvtrash-training-pause3": "L'80% dell'inquinamento dell'oceano proviene dai detriti terrestri e si stima costi $13 miliardi l'anno.",
  "fishvtrash-training-pause4": "L'IA impara dalle tue scelte. Se fai le scelte \"errate\", l'IA ripeterà i tuoi errori. Continua ad addestrarla.",
  "fishvtrash-training-pause5": "Ottimo lavoro! Più dati fornisci all'IA, più impara. Continua ad addestrare l'IA o continua quando pronto.",
  "fun": "Divertente",
  "glitchy": "Problematico",
  "green": "Verdi",
  "happy": "Felice",
  "hungry": "Affamato",
  "isThisAFish": "Questo è un pesce?",
  "isThisFish": "Questo pesce è {word}?",
  "mostImportantParts": "Queste erano le parti del pesce più importanti:",
  "mostImportantPartsDescription": "Queste erano le parti di pesce più importanti nel determinare se questo pesce fosse \"*{word}*\" o \"**{notWord}**\".",
  "mouths": "bocca",
  "newWord": "Nuova Parola",
  "no": "No",
  "notWord": "No {word}",
  "pectoralFinsFront": "pinne pettorali",
  "playful": "Giocoso",
  "rectangular": "Rettangolare",
  "red": "Rossi",
  "run": "Esegui",
  "scales": "squame",
  "scary": "Spaventoso",
  "silly": "Sciocco",
  "spooky": "Spaventoso",
  "tails": "coda",
  "trainMore": "Addestra di Più",
  "triangular": "Triangolare",
  "waterCreature": "Creatura d'acqua",
  "wild": "Selvaggio",
  "wordQuestionLong": "Scegli una nuova parola da insegnare all'IA",
  "wordQuestionShort": "Per rilevare quale pesce desideri addestrare l'IA?",
  "yes": "Sì"
}