{
  "angry": "ಸಿಟ್ಟು",
  "areYouSure": "ನಿಮಗೆ ಖಚಿತವೆ?",
  "awesome": "ಅದ್ಭುತ",
  "bodies": "ದೇಹ",
  "cancel": "ರದ್ದುಮಾಡಿ",
  "circular": "ವೃತ್ತಾಕಾರ",
  "clickIndividualFish": "ತಮ್ಮ ಮಾಹಿತಿಯನ್ನು ನೋಡಲು ಪ್ರತ್ಯೇಕ ಮೀನಿನ ಮೇಲೆ ಕ್ಲಿಕ್ ಮಾಡಿ.",
  "colors": "ಬಣ್ಣಗಳು",
  "continue": "ಮುಂದುವರೆಯಿರಿ",
  "creaturesvtrash-pond-init1": "ನಿಮ್ಮ ತರಬೇತಿಯನ್ನು ಆಧರಿಸಿ, \"ನೀರಿಗೆ ಸಂಬಂಧಿಸಿದ್ದು\" ಎಂದು ಎಐ ಗುರುತಿಸುವ ಕೆಲವು ವಸ್ತುಗಳು ಇಲ್ಲಿವೆ. ಎಐ ಇದನ್ನು ಹೇಗೆ ಮಾಡಿತು?",
  "creaturesvtrash-predicting-init1": "ನೀರಿನಲ್ಲಿ ಯಾವುದು ಇರಬೇಕು ಎಂಬುದನ್ನು ಗುರುತಿಸುವಲ್ಲಿ ಎಐ ಈಗ ಉತ್ತಮ ಕೆಲಸ ಮಾಡುತ್ತದೆ ಎಂದು ನೀವು ಭಾವಿಸುತ್ತೀರಾ? ನೋಡೋಣ.",
  "creaturesvtrash-training-init1": "ಯಾವ ವಸ್ತು ನೀರಿನಲ್ಲಿ ಇರಬೇಕು ಎಂಬುದನ್ನು ಎಐ ಕಲಿಯಲು ಎಐಗೆ ಬೋಧಿಸೋಣ.",
  "creaturesvtrash-training-init2": "ಸಮುದ್ರದಲ್ಲಿ, ಪ್ಲಾಸ್ಟಿಕ್ ಕಸವು ಮೀನು, ಸೀಬರ್ಡ್‌ಗಳು ಮತ್ತು ಜಲಚರ ಸಸ್ತನಿಗಳಿಗೆ ಹಾನಿ ಮಾಡಬಹುದು. ಸೀಬರ್ಡ್‌ಗಳು ಮತ್ತು ಜಲಚರಗಳ ಜೀವನವನ್ನು ರಕ್ಷಿಸುವುದು, ಸಮುದ್ರವನ್ನು ಸ್ವಚ್ಛವಾಗಿಡುವುದರ ಹಲವು ಕಾರಣಗಳಲ್ಲಿ ಒಂದಾಗಿದೆ.",
  "creaturesvtrash-training-init3": "ನೀವು ಒದಗಿಸುವ ತರಬೇತಿ ಡೇಟಾ ಹೆಚ್ಚಿದ್ದಷ್ಟೂ, ಎಐ ಹೆಚ್ಚು ಹೆಚ್ಚು ಕಲಿಯುತ್ತದೆ. ತರಬೇತಿ ಪಡೆಯುತ್ತಿರಿ.",
  "creaturesvtrash-training-init4": "ಸಮುದ್ರದಲ್ಲಿ ಪ್ಲಾಸ್ಟಿಕ್ ಮಾಲಿನ್ಯವು ಕನಿಷ್ಠ 267 ಜೀವಿಗಳ ಮೇಲೆ ವಿಶ್ವಾದ್ಯಂತ ಬಾಧಿಸಿದೆ. ಇದರಲ್ಲಿ 86% ರಷ್ಟು ಸಮುದ್ರ ಆಮೆಗಳೂ ಸೇರಿವೆ.",
  "creaturesvtrash-training-init5": "ನೀರಿನಲ್ಲಿ ಯಾವುದು ಇರಬೇಕು ಎಂಬುದನ್ನು ಎಐ ಗೆ ಬೋಧಿಸಲು ತರಬೇತಿ ನೀಡುತ್ತಲೇ ಇರಿ.",
  "creaturesvtrash-training-init6": "ಉತ್ತಮ ಕೆಲಸ! ಎಐ ಗೆ ನೀವು ಹೆಚ್ಚು ಡೇಟಾ ನೀಡಿದಷ್ಟೂ, ಅದು ಉತ್ತಮ ಕೆಲಸ ಮಾಡುತ್ತದೆ. ಎಐ ಗೆ ತರಬೇತಿ ನೀಡುತ್ತಿರಿ ಅಥವಾ ಸಿದ್ಧವಾದಾಗ ಮುಂದುವರಿಸಿ.",
  "creaturesvtrashdemo-predicting-init1": "ಈವರೆಗೆ ವಸ್ತುವನ್ನು \"ಮೀನು\" ಅಥವಾ \"ಮೀನು ಅಲ್ಲ\" ಎಂದು ಗುರುತಿಸುವಂತೆ ನಾವು ಎಐ ಗೆ ತರಬೇತಿ ನೀಡಿದ್ದೇವೆ.",
  "creaturesvtrashdemo-predicting-init2": "ನೀರಿನಲ್ಲಿ ಇರುವುದು ಏನು ಎಂದು ನಿರ್ಧರಿಸಲು ಈ ತರಬೇತಿ ಡೇಟಾವನ್ನು ಬಳಸಿದರೆ ಹೇಗೆ?",
  "creaturesvtrashdemo-predicting-init3": "ಇತರ ಸಮುದ್ರ ಜೀವಿಗಳಿಗೆ ಏನಾಗುತ್ತದೆ? ನಮ್ಮ ತರಬೇತಿ ವಿಧಾನವು ಅನುದ್ದೇಶಿತ ಪರಿಣಾಮಗಳನ್ನು ಉಂಟು ಮಾಡಬಹುದೇ?",
  "creaturesvtrashdemo-predicting-init4": "ನೋಡೋಣ.",
  "creaturesvtrashdemo-predicting-pause1": "ಕೆಲವು ಸಮುದ್ರ ಜೀವಿಗಳನ್ನು \"ಮೀನು ಅಲ್ಲ\" ಎಂದು ಎಐ ಗುರುತಿಸಿದೆ ಎಂದು ನೀವು ಗಮನಿಸಿದ್ದೀರಾ?",
  "creaturesvtrashdemo-predicting-pause2": "ಈ ಸಮುದ್ರ ಜೀವಿಗಳು ಮೀನು ಅಲ್ಲದಿದ್ದರೂ, ಅವು ನೀರಿಗೆ ಸಂಬಂಧಿಸಿವೆ.",
  "creaturesvtrashdemo-predicting-pause3": "ನಾವು ಏನನ್ನು ಬೋಧಿಸುತ್ತೇವೆ ಎಂಬುದನ್ನು ಮಾತ್ರ ಎಐ ಕಲಿಯುತ್ತದೆ.",
  "creaturesvtrashdemo-predicting-pause4": "ಎಐ ಗೆ ಪುನಃ ತರಬೇತಿ ನೀಡೋಣ.",
  "delicious": "ರುಚಿಕರ",
  "didYouKnow": "ನಿಮಗೆ ಗೊತ್ತೇ?",
  "doesThisBelongInWater": "ಇದು ನೀರಿಗೆ ಸಂಬಂಧಿಸಿದ್ದೇ?",
  "dorsalFins": "ಡೋರ್ಸಲ್ ಫಿನ್",
  "endangered": "ಅಳಿವಿನಂಚಿನಲ್ಲಿರುವ",
  "erase": "ಅಳಿಸಿ",
  "eraseWarning": "ಎಐ ಡೇಟಾ ಅಳಿಸುವುದರಿಂದ ಎಲ್ಲ ತರಬೇತಿ ಡೇಟಾ ಶಾಶ್ವತವಾಗಿ ಅಳಿಸುತ್ತದೆ. ನೀವು ಇದನ್ನು ಮಾಡಲು ಬಯಸಿದ್ದೀರಾ?",
  "eyes": "ಕಣ್ಣುಗಳು",
  "fast": "ತ್ವರಿತ",
  "fierce": "ವ್ಯಗ್ರ",
  "finish": "ಪೂರ್ಣಗೊಳಿಸು",
  "fish": "ಮೀನು",
  "fishlong-pond-init1": "ನಿಮ್ಮ ತರಬೇತಿಯನ್ನು ಆಧರಿಸಿ, {n, plural,one {this} other {these}} ಮೀನನ್ನು “{word}” ಎಂದು ಎಐ ಗುರುತಿಸಿದೆ. ಹೇಗೆ ಮಾಡಿದ ಪ್ರಯತ್ನ ಹೇಗಿದೆ?",
  "fishlong-pond-init2": "ಫಲಿತಾಂಶಗಳನ್ನು ಸುಧಾರಿಸಲು ನೀವು ಬಯಸಿದರೆ ನೀವು ಹೆಚ್ಚು ತರಬೇತಿ ನೀಡಬಹುದು.",
  "fishlong-pond-init3": "ಅಥವಾ ಹೊಸ ಶಬ್ದವನ್ನು ಆಯ್ಕೆ ಮಾಡುವ ಮೂಲಕ ಎಐ ಗೆ ನೀವು ಹೊಸ ಶಬ್ದವನ್ನು ಬೋಧಿಸಬಹುದು.",
  "fishlong-predicting-init1": "ನಿಮ್ಮ ತರಬೇತಿ ಡೇಟಾದ ಮೂಲಕ, \"{word}\" ಮೀನನ್ನು ಗುರುತಿಸಲು ನೀವು ಎಐ ಪ್ರೋಗ್ರಾಮ್ ಮಾಡಿದ್ದೀರಿ.",
  "fishlong-predicting-init2": "ಎಐ \"{word}\" ಮೀನನ್ನು ಗುರುತಿಸುವುದನ್ನು ನೋಡೋಣ.",
  "fishlong-training-many": "ವಾವ್. ಅಲ್ಲಿ ತುಂಬಾ ಮೀನು ಇದೆ!",
  "fishlong-training-pause1": "ಮೀನನ್ನು ಅದರ ನೋಟದಿಂದ ನಿರ್ಧರಿಸಲು ಆರ್ಟಿಫಿಶಿಯಲ್ ಇಂಟಲಿಜೆನ್ಸ್ ಅನ್ನು ಬಳಸುವುದು ಸೂಕ್ತವೇ? ಎಐ ನ್ಯಾಯೋಚಿತ ಮತ್ತು ನಿರ್ಲಿಪ್ತ ಎಂದು ಕಂಡುಬಂದರೂ, ಇದರ ವಿಶ್ಲೇಷಣೆಯು ನಾವು ನೀಡುವ ತರಬೇತಿಯನ್ನು ಆಧರಿಸಿರುತ್ತದೆ. ಯಾವ ಅನುದ್ದೇಶಿತ ತಾರತಮ್ಯವನ್ನು ಇದು ಉಂಟು ಮಾಡಬಹುದು?",
  "fishlong-training-pause2": "ಹೆಚ್ಚು ತರಬೇತಿ ಡೇಟಾ ಎಐ ಗೆ ನಿಮ್ಮ ಶಬ್ದವನ್ನು ಕಲಿಯಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ. ತರಬೇತಿ ನೀಡುತ್ತಿರಿ.",
  "fishlong-training-pause3": "ನೀವು ಮಾಡುವ ಪ್ರತಿ ಆಯ್ಕೆಯೂ, ಎಐ ಗೆ ಕಲಿಯಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ. ತರಬೇತಿ ನೀಡುತ್ತಿರಿ.",
  "fishlong-training-pause4": "ಎಐ ಸಾಕಷ್ಟು ಡೇಟಾ ಹೊಂದಿದೆ ಎಂದು ನೀವು ಭಾವಿಸುತ್ತೀರಾ? ತುಂಬಾ ಡೇಟಾ ಇದ್ದಾಗ ಎಐ ಉತ್ತಮವಾಗಿ ಕೆಲಸ ಮಾಡುತ್ತದೆ. ಎಐ ಸಿದ್ಧವಾಗಿದೆ ಎಂದು ನೀವು ಭಾವಿಸಿದಾಗ ಮುಂದುವರಿಯಿರಿ.",
  "fishlong-words-init1": "ಕಡಿಮೆ ನಿಖರತೆಯ ಶಬ್ದವನ್ನು ಎಐ ಕಲಿಯಬಹುದೇ ಎಂಬುದನ್ನು ನೋಡೋಣ.",
  "fishlong-words-init2": "ನಿಮ್ಮ ಅಭಿಪ್ರಾಯವನ್ನು ಅವಲಂಬಿಸಿದ ಒಂದು ಶಬ್ದವನ್ನು ಎಐ ಗೆ ಬೋಧಿಸೋಣ. ನಿಮ್ಮ ಶಬ್ದಕ್ಕೆ ಹೊಂದುವ ಮೀನನ್ನು ಆಯ್ಕೆ ಮಾಡುವುದು ನಿಮಗೆ ಬಿಟ್ಟದ್ದು.",
  "fishshort-pond-init1": "ನಿಮ್ಮ ತರಬೇತಿಯನ್ನು ಆಧರಿಸಿ, {n, plural,one {this} other {these}} ಮೀನನ್ನು “{word}” ಎಂದು ಎಐ ಗುರುತಿಸಿದೆ. ಎಐ ಸಾಧನೆ ಹೇಗಿತ್ತು? ಫಲಿತಾಂಶಗಳನ್ನು ನೀವು ಸುಧಾರಿಸಲು ಬಯಸಿದರೆ ಇನ್ನಷ್ಟು ತರಬೇತಿಯನ್ನು ನೀವು ಮಾಡಬಹುದು.",
  "fishshort-pond-init2": "ಎಐ ಏನನ್ನು ಕಲಿತಿದೆ ಎಂಬುದನ್ನು ನೋಡಲು ಮಾಹಿತಿ ಬಟನ್ ಮೇಲೆ ನೀವು ಕ್ಲಿಕ್ ಮಾಡಬಹುದು.",
  "fishshort-predicting-init1": "ನಿಮ್ಮ ತರಬೇತಿ ಡೇಟಾದ ಮೂಲಕ, \"{word}\" ಮೀನನ್ನು ಗುರುತಿಸಲು ನೀವು ಎಐ ಪ್ರೋಗ್ರಾಮ್ ಮಾಡಿದ್ದೀರಿ.",
  "fishshort-predicting-init2": "ಎಐ “{word}” ಮೀನನ್ನು ಗುರುತಿಸುವುದನ್ನು ನೋಡೋಣ.",
  "fishshort-words-init1": "ಕಂಪ್ಯೂಟರ್‌ಗೆ ಹೊಸ ಪ್ಯಾಟರ್ನ್‌ಗಳನ್ನು ಬೋಧಿಸಲು ಆರ್ಟಿಫಿಶಿಯಲ್ ಇಂಟಲಿಜೆನ್ಸ್ ಮತ್ತು ಮಶಿನ್ ಲರ್ನಿಂಗ್ ಅನ್ನು ಬಳಸಬಹುದು.",
  "fishshort-words-init2": "ಆ ರೀತಿಯ ಮೀನಿನ ಉದಾಹರಣೆಗಳನ್ನು ತೋರಿಸುವ ಮೂಲಕ ಎಐ ಗೆ ಹೊಸ ಶಬ್ದವನ್ನು ಬೋಧಿಸೋಣ.",
  "fishshort-words-training-pause1": "ಎಐ ಸಾಕಷ್ಟು ತರಬೇತಿ ಡೇಟಾ ಹೊಂದಿದೆ ಎಂದು ನೀವು ಭಾವಿಸುತ್ತೀರಾ? ಕಂಡುಕೊಳ್ಳಲು ನೀವು ಮುಂದುವರಿಯಿರಿ ಎಂದು ಕ್ಲಿಕ್ ಮಾಡಬಹುದು.",
  "fishshort-words-training-pause2": "ಉತ್ತಮ ಕೆಲಸ! ಎಐ ಗೆ ತರಬೇತಿ ನೀಡುತ್ತಿರಿ ಅಥವಾ ಸಿದ್ಧವಾದಾಗ ಮುಂದುವರಿಯಿರಿ.",
  "fishvtrash-pond-init1": "ನಿಮ್ಮ ತರಬೇತಿಯನ್ನು ಆಧರಿಸಿ, \"ಮೀನು\" ಎಂದು ಎಐ ಗುರುತು ಮಾಡುವ ಕೆಲವು ವಸ್ತುಗಳು ಇಲ್ಲಿವೆ. ಎಐ ಹೇಗೆ ಮಾಡಿತು?",
  "fishvtrash-pond-init2": "ನೀವು ಎಐ ಗೆ ಇನ್ನಷ್ಟು ತರಬೇತಿ ನೀಡಬಹುದು...",
  "fishvtrash-pond-init3": "... ಅಥವಾ ಮುಂದುವರಿಯಬಹುದು.",
  "fishvtrash-pond-recall": "\"ಮೀನು\" ಮತ್ತು \"ಮೀನು ಅಲ್ಲ\" ಎಂದು ಗುರುತಿಸಿದ ಸವಸ್ತುಗಳನ್ನು ಬದಲಿಸಲು ಇಲ್ಲಿ ಕ್ಲಿಕ್ ಮಾಡಿ.",
  "fishvtrash-predicting-init1": "\"ಮೀನು\" ಹೇಗೆ ಕಾಣಿಸುತ್ತದೆ ಎಂಬುದನ್ನು ಎಐ ತಿಳಿಯಬಹುದೇ ಎಂದು ನೋಡೋಣ.",
  "fishvtrash-predicting-init2": "ಎಐ ಯಾದೃಚ್ಛಿಕ ವಸ್ತುಗಳ ಗುಚ್ಛವನ್ನು ವಿಶ್ಲೇಷಿಸುತ್ತದೆ ಮತ್ತು ನಿಮ್ಮ ತರಬೇತಿಯನ್ನು ಆಧರಿಸಿ ಅವುಗಳನ್ನು ಲೇಬಲ್ ಮಾಡುತ್ತದೆ.",
  "fishvtrash-predicting-init3": "ಮುಂದೆ ಸಾಗೋಣ!",
  "fishvtrash-training-init1": "ಸಮುದ್ರದಲ್ಲಿ ಸುರಿದ ಕಸವು ಜಲಚರಗಳ ಜೀವನದ ಮೇಲೆ ಬಾಧಿಸುತ್ತದೆ. ಈ ಚಟುವಟಿಕೆಯಲ್ಲಿ, ಮೀನು ಅಥವಾ ಕಸವನ್ನು ಗುರುತಿಸಲು ನೀವು ಪ್ರೋಗ್ರಾಮ್ ಮಾಡುತ್ತೀರಿ ಅಥವಾ ಎಐ (ಆರ್ಟಿಫಿಶಿಯಲ್ ಇಂಟಲಿಜೆನ್ಸ್‌) ಗೆ ತರಬೇತಿ ನೀಡುತ್ತೀರಿ. ಸಮುದ್ರವನ್ನು ಸ್ವಚ್ಛಗೊಳಿಸೋಣ! ಮುಂದುವರಿಸಲು ಸ್ಕ್ರೀನ್‌ ಮೇಲೆ ಎಲ್ಲಾದರೂ ಕ್ಲಿಕ್ ಮಾಡಿ.",
  "fishvtrash-training-init2": "ಎಐ ಭೇಟಿ ಮಾಡೋಣ",
  "fishvtrash-training-init3": "ಒಂದು ವಸ್ತು ಮೀನೋ ಅಥವಾ ಕಸವೋ ಎಂದು ಎಐಗೆ ತಿಳಿದಿಲ್ಲ. ಆದರೆ, ಇದು ಚಿತ್ರಗಳನ್ನು ಪ್ರೋಸೆಸ್ ಮಾಡಿ, ಪ್ಯಾಟರ್ನ್‌ಗಳನ್ನು ಗುರುತಿಸಬಹುದು.",
  "fishvtrash-training-init4": "ಎಐ ಪ್ರೋಗ್ರಾಮ್ ಮಾಡಲು, ಚಿತ್ರವನ್ನು \"ಮೀನು\" ಅಥವಾ \"ಮೀನು ಅಲ್ಲ\" ಎಂದು ಗುರುತಿಸುವುದಕ್ಕಾಗಿ ಬಟನ್‌ಗಳನ್ನು ಬಳಸಿ. ನೀವು ಒದಗಿಸುವ ತರಬೇತಿಯು ಸ್ವತಂತ್ರವಾಗಿ ಪ್ಯಾಟರ್ನ್‌ಗಳನ್ನು ಗುರುತಿಸಲು ಎಐಗೆ ಬೋಧಿಸುತ್ತದೆ. ಆರಂಭ ಮಾಡೋಣ!",
  "fishvtrash-training-pause1": "ಹದಿನೇಳು ಬಿಲಿಯನ್ ಪೌಂಡ್ ಪ್ಲಾಸ್ಟಿಕ್‌ ಪ್ರತಿ ವರ್ಷ ಸಮುದ್ರಕ್ಕೆ ಪ್ರವೇಶಿಸುತ್ತದೆ.",
  "fishvtrash-training-pause2": "ಪ್ರತಿ ಕ್ಲಿಕ್‌ನಲ್ಲೂ ನೀವು ಪ್ರೋಗ್ರಾಮ್ ಮಾಡುತ್ತೀರಿ ಅಥವಾ ಎಐ ಗೆ ತರಬೇತಿ ನೀಡುತ್ತಿರುತ್ತೀರಿ. ಮುಂದುವರಿಯುತ್ತಿರಿ.",
  "fishvtrash-training-pause3": "80% ಸಮುದ್ರದ ಮಾಲಿನ್ಯವು ಭೂಮಿಯ ಕಸದಿಂದ ಬರುತ್ತದೆ ಮತ್ತು ಇದು ಪ್ರತಿ ವರ್ಷ 13 ಬಿಲಿಯನ್ ಡಾಲರ್ ವೆಚ್ಚ ಎಂದು ಅಂದಾಜು ಮಾಡಲಾಗಿದೆ.",
  "fishvtrash-training-pause4": "ನಿಮ್ಮ ಆಯ್ಕೆಗಳಿಗೆ ಎಐ ಕಲಿಯುತ್ತದೆ. ನೀವು \"ತಪ್ಪು\" ಆಯ್ಕೆಗಳನ್ನು ಮಾಡಿದರೆ, ನಿಮ್ಮ ತಪ್ಪುಗಳನ್ನೇ ಎಐ ಪುನರಾವರ್ತಿಸುತ್ತದೆ. ತರಬೇತಿ ನೀಡುತ್ತಿರಿ.",
  "fishvtrash-training-pause5": "ಉತ್ತಮ ಕೆಲಸ! ಎಐ ಗೆ ನೀವು ಹೆಚ್ಚು ಡೇಟಾ ನೀಡಿದಷ್ಟೂ, ಇದು ಹೆಚ್ಚು ಕಲಿಯುತ್ತದೆ. ಎಐ ಗೆ ತರಬೇತಿ ನೀಡುತ್ತಿರಿ ಅಥವಾ ಸಿದ್ಧವಾದಾಗ ಮುಂದುವರಿಸಿ.",
  "fun": "ಮೋಜಿನ",
  "glitchy": "ಗ್ಲಿಚ್ಚಿ",
  "happy": "ಖುಷಿ",
  "hungry": "ಹಸಿವು",
  "isThisAFish": "ಇದು ಮೀನು?",
  "isThisFish": "ಇದು {word} ಮೀನು?",
  "mostImportantParts": "ಇವು ಅತ್ಯಂತ ಪ್ರಮುಖ ಮೀನಿನ ಭಾಗಗಳು:",
  "mostImportantPartsDescription": "ಈ ಮೀನು “*{word}*” ಅಥವಾ “**{notWord}**” ಆಗಿದೆಯೇ ಎಂದು ಗುರುತಿಸುವಲ್ಲಿ ಇವು ಪ್ರಮುಖ ಮೀನಿನ ಭಾಗಗಳಾಗಿರುತ್ತವೆ.",
  "mouths": "ಬಾಯಿ",
  "newWord": "ಹೊಸ ಶಬ್ದ",
  "no": "ಇಲ್ಲ",
  "notWord": "{word} ಅಲ್ಲ",
  "pectoralFinsFront": "ಪೆಟ್ರೋರಲ್ ಫಿನ್ಸ್",
  "playful": "ಖುಷಿಯ",
  "rectangular": "ಆಯತಾಕಾರ",
  "run": "ರನ್",
  "scales": "ಸ್ಕೇಲ್‌ಗಳು",
  "scary": "ಭಯಾನಕ",
  "silly": "ಕ್ಷುಲ್ಲಕ",
  "spooky": "ಪುಕ್ಕಲು",
  "tails": "ಬಾಲ",
  "trainMore": "ಇನ್ನಷ್ಟು ತರಬೇತಿ ನೀಡಿ",
  "triangular": "ತ್ರಿಕೋನ",
  "waterCreature": "ನೀರಿನ ಜೀವಿ",
  "wild": "ಕಾಡಿನ",
  "wordQuestionLong": "ಎಐ ಗೆ ಬೋಧಿಸಲು ಹೊಸ ಶಬ್ದವನ್ನು ಆಯ್ಕೆ ಮಾಡಿ.",
  "wordQuestionShort": "ಎಐ ಗುರುತಿಸಲು ಯಾವ ರೀತಿಯ ಮೀನನ್ನು ನೀವು ತರಬೇತಿ ಮಾಡಲು ಬಯಸಿದ್ದೀರಿ?",
  "yes": "ಹೌದು"
}