{
  "angry": "စိတ်ဆိုးသော",
  "awesome": "အံဩဖို့ကောင်းသော",
  "bodies": "ကိုယ်ထည်",
  "cancel": "ပယ်ဖျတ်သည်",
  "circular": "လုံးဝိုင်းသော",
  "clickIndividualFish": "သူတို့၏ အချက်အလက်များကိုကြည့်ရန် ငါးတစ်ကောင်ခြင်းစီကို ခလုတ်နှိပ်ပါ",
  "colors": "အရောင်များ",
  "continue": "ဆက်လုပ်ပါ",
  "creaturesvtrash-pond-init1": "ဒီမှာပြထားတာတွေကတော့ သင်လေ့ကျင့်ပေးတဲ့အပေါ်မူတည်ပြီး A.I.က \"‌ရေထဲမှာသက်ဆိုင်နေသမျှ\"ကို ခွဲခြားထားတာတွေပါ။ A.I.က ဘယ်လိုလုပ်ခဲ့သလဲ?",
  "creaturesvtrash-predicting-init1": "ရေထဲမှာဘာရှိသလဲဆိုတာကို ခွဲခြားဖို့ကို A.I.ကပိုကောင်းအောင်လုပ်နိုင်မယ်လို့ သင်ထင်ပါသလား? ကြည့်လိုက်ကြရအောင်။",
  "creaturesvtrash-training-init1": "ဘယ်လိုအရာတွေက ရေထဲမှာပဲ ရှိသင့်တယ်ဆိုတာကို  A.I.သိမ‌အောင် သင်ကြားပေးလိုက်ကြရအောင်။",
  "creaturesvtrash-training-init2": "သမုဒ္ဒရာထဲမှာဆိုလျှင် ပလပ်စတစ် စွန့်ပစ်ပစ္စည်းတွေက ငါးတွေ ပင်လယ်နေငှက်တွေနဲ့ ပင်လယ်နေ နို့တိုက်သတ္တ၀ါတွေကို အန္တရာယ်ဖြစ်စေတယ်။ ပင်လယ်နေငှက်တွေနဲ့ ပင်လယ်နေနို့တိုက်သတ္တ၀ါတွေကို ကာကွယ်ပေးခြင်းက သမုဒ္ဒရာကြီးကို သန့်စင်အောင်ထိန်းသိမ်းပေးမယ့် နည်းတွေထဲက တစ်နည်းပဲ။",
  "creaturesvtrash-training-init3": "သင်ဟာ လေ့ကျင့်သင်ကြားပေးတဲ့ ‌ဒေတာတွေ ပို‌ထောက်ပံ့နိုင်လေလေ  A.I.က ပိုသိလေလေပဲ။ ဆက်ပြီးလေ့ကျင့်လိုက်ပါ။",
  "creaturesvtrash-training-init4": "  ပင်လယ်နေ ပလပ်စတစ်ညစ်ညမ်းမှုသည် ပင်လယ်လိပ်မျိုးစိတ်အားလုံး၏ ၈၆ရာခိုင်နှုန်း အပါအ၀င် ကမ္ဘာအနှံ့ရှိ မျိုးစိတ်ပေါင်း  အနည်းဆုံး ၂၆၇မျိုးအပေါ် အကျိုးသက်ရောက်မှုရှိခဲ့သည်။\n",
  "creaturesvtrash-training-init5": "ရေနဲ့သက်ဆိုင်တဲ့ A.I.ကို ဆက်လက်ပြီးလေ့ကျင့်သင်ကြားပေးပါ။",
  "creaturesvtrash-training-init6": "ကောင်းလိုက်တဲ့အလုပ်ပဲ! A.I.ကို သင်ပိုပြီးအချက်အလက်ထောက်ပံ့နိုင်လေလေ ၄င်းက ‌ပိုကောင်းကောင်းလုပ်နိုင်လေလေပဲ။ A.I.ဆက်လုပ်နိုင်ဖို့ အဆင်သင့်မဖြစ်သရွေ့ ဆက်လက်လေ့ကျင့်ပေးပါ။",
  "creaturesvtrashdemo-predicting-init1": "ယခုအထိကတော့ ကျွန်တော်တို့ဟာ A.I.ကို \"ငါး\" လား \"ငါးမဟုတ်ပါ\" ဆိုတာ‌ခွဲခြားနိုင်ဖို့ လေ့ကျင့်ပေးခဲ့ပါပြီ။\n",
  "creaturesvtrashdemo-predicting-init2": "ဘာတွေက ရေထဲမှာရောက်ရှိနေပြီး သက်ဆိုင်သလဲဆိုတာကို လေ့ကျင့်ပေးထားတဲ့ ဒေတာအချက်အလက်တွေသာ ဆုံးဖြတ်ဖို့ အသုံးပြုခဲ့ရင်?",
  "creaturesvtrashdemo-predicting-init3": "ရေသတ္တ၀ါတွေအတွက် ဘာတွေဖြစ်လာမလဲ? ကျွန်တော်တို့သင်ကြားလေ့ကျင့်ပေးလိုက်တဲ့နည်းတွေက မရည်ရွယ်ထားတဲ့ အကျိုးဆက်တွေကို ဖြစ်စေသလား?",
  "creaturesvtrashdemo-predicting-init4": "ကြည့်ကြစို့",
  "creaturesvtrashdemo-predicting-pause1": " A.I. က \"ငါးမဟုတ်ပါ\"ဆိုတဲ့ အချို့ရေနေသတ္တ၀ါတွေကို ခွဲခြားနိုင်တာ သင်သတိထားမိသလား?",
  "creaturesvtrashdemo-predicting-pause2": "အဲ့ဒီသတ္တ၀ါတွေက ‌ငါးလည်းမဟုတ်သော်လည်း ရေထဲမှာပဲ နေထိုင်ကြတာပဲ။",
  "creaturesvtrashdemo-predicting-pause3": " A.I.ဆိုတာ ငါတို့သင်ပေးတာလောက်ပဲ သူသင်ယူတာ။",
  "creaturesvtrashdemo-predicting-pause4": " A.I.ကို ထပ်ပြီးလေ့ကျင့်ပေးကြစို့။",
  "delicious": "အရသာရှိသော",
  "didYouKnow": "သင်သိပြီးပြီလား",
  "doesThisBelongInWater": "ဒီအရာသည် ရေထဲနှင့် သက်ဆိုင်ပါသလား",
  "dorsalFins": "ကျောဖက် ရေယက်",
  "endangered": "အန္တရာယ်များသည်",
  "erase": "ဖျက်သည်",
  "eraseWarning": "ဖန်တီးထားသောအသိဉာဏ် အချက်အလက်များကို ဖျက်ပစ်ခြင်းသည် လေ့ကျင့်ထားပေးမှုများကို အပြီးတိုင် ပျောက်ပျက်စေလိမ့်မည်။ သင်ပြုလုပ်လိုသည့် အရာ ဟုတ်ပါသလား။",
  "eyes": "မျက်လုံးများ",
  "fast": "လျင်မြန်သော",
  "fierce": "ပြင်းထန်သော",
  "finish": "ပြီးဆုံးပြီ",
  "fish": "ငါး",
  "fishlong-pond-init2": "သင်ရလာဒ် များကို ပိုမိုကောင်းမွန်စေလိုလျှင် သင် ပို၍ လေ့ကျင့်ပေးနိုင်ပါတယ်",
  "fishlong-pond-init3": "သို့မဟုတ် သင် ဖန်တီးထားသော အသိဉာဏ်ကို သင်ကြားနိုင်ပါတယ်။ စကားလုံးသစ်တစ်လုံးကို စကားလုံးသစ် ရွေးချယ်ခြင်းဖြင့်",
  "fishlong-predicting-init1": "သင်လေ့ကျင့်ပေးတာနဲ့အမျှ သင်ဟာ A.I.ကို ငါးဆိုတဲ့စကားလုံး‌ကို မှတ်မိနေဖို့ အစီစဉ်ဆွဲပြီးပါပြီ။",
  "fishlong-predicting-init2": "ဖန်တီးထားသောအသိဉာဏ် က (စကားလုံး) ငါး ကို ခွဲခြား ထားတာ ကြည့်ရအောင်",
  "fishlong-training-many": "ဝိုး။ ငါးတွေ အများကြီးဘဲ။",
  "fishlong-training-pause1": "ငါးရဲ့ပုံပန်းထင်နေရုံနဲ့ ငါးလို့သတ်မှတ်ဖို့  A.I.ကိုသုံးဖို့တရားပါသလား? A.Iဆိုတာကတရားမျှတတယ်ထင်ရသော်လည်း သူရဲ့ခွဲခြမ်းစိတ်ဖြာမှုက ကျွန်တော်တို့လေ့ကျင့်ပေးတာတွေကလာတာပါ။ ဒါက မမျှော်လင့်တဲ့ ဘယ်ဘက်လိုက်မှုက ဖြစ်စေလဲ?",
  "fishlong-training-pause2": "ပိုများသော လေ့ကျင့်မှုအချက်အလက် များက သင့် စကားလုံးကို ဖန်တီးထားသော အသိဉာဏ် လေ့လာရာတွင် ကူညီပေးပါလိမ့်မယ်",
  "fishlong-training-pause3": "သင်ပြုလုပ်လိုက်သော ရွေးချယ်မှု့ တစ်ခုချင်းစီ က ဖန်တီးထားသော အသိဉာဏ် လေ့လာသင်ရာယူတွင် ကူညီနိုင်ပါတယ်။ ဆက်ပြီး လေ့ကျင့်ပါ။",
  "fishlong-training-pause4": "ဖန်တီးထားသော အသိဉာဏ် မှာလုံလောက်သော လေ့ကျင့်မှု အချက်အလက် ရှိသည်ဟု သင်ထင်ပါသလား။ အချက်အလက် များစွာ နဲ့ဆိုရင် ဖန်တီးထားသော အသိဉာဏ် က ပိုပြီး ကောင်းမွန်အောင် ပြုလုပ်နိုင်လိမ့်မည်။ ဖန်တီးထားသော အသိဉာဏ် အဆင်သင့် ဖြစ်ပြီဟု သင်ထင်သောအခါ ဆက်သွားပါ။",
  "fishlong-words-init1": "A.I.က သိသာထင်ရှားမှုနည်းတဲ့စကားလုံးတစ်လုံးကို လေ့လာနိုင်တယ်ဆိုတာ ယခုကြည့်လိုက်ကြရ‌အောင်။",
  "fishlong-words-init2": "သင်၏ထင်မြင်ချက်အ‌ပေါ်မူတည်နေတဲ့ စကားလုံးတစ်လုံးကို A.I.အားသင်ပေးကြည့်ကြရအောင်။ သင်၏စကားလုံးနဲ့ ကိုက်ညီတဲ့ငါးကို‌ရွေးချယ်ဖို့ သင့်အပေါ်မူတည်နေပါတယ်။",
  "fishshort-pond-init2": "A.I.ဘာလေ့လာခဲ့သလဲဆိုတာကို သိဖို့ infoဆိုသည့် ခလုတ်ကိုနှိပ်ပါ။",
  "fishshort-predicting-init1": "သင်လေ့ကျင့်ပေးတာနဲ့အမျှ သင်ဟာ A.I.ကို ငါးဆိုတဲ့စကားလုံး‌ကို မှတ်မိနေဖို့ အစီစဉ်ဆွဲပြီးပါပြီ။",
  "fishshort-predicting-init2": "A.I.က \"ငါး\"ဆိုတဲ့စကားလုံးကို ဘယ်လိုခွဲခြားသတ်မှတ်သလဲ ကြည့်ရအောင်။",
  "fishshort-words-init1": "လူလုပ်မှတ်ဉာဏ်တုနဲ့ စက်ပညာလေ့လာခြင်းတွေဟာ ကွန်ပျူတာတွေကို ပုံစံအသစ်တွေကို သင်ပေးတဲ့နေရာမှာအသုံးပြုနိုင်ပါတယ်။",
  "fishshort-words-init2": "အဲ့ဒါဘာငါးလဲဆိုတာကို ဉပမာ‌အနေနဲ့ပြပြီးတော့  A.I.ကို စကားလုံးအသစ်တစ်လုံး သင်ကြားပေးကြစို့။",
  "fishshort-words-training-pause1": "A.I.ကို သင်ကြားပေးမယ့် ဒေတာတွေလုံလောက်တယ်လို့သင်ထင်ပါသလား? ဆက်လက်ပြီးအဖြေရှာဖို့ ဆက်နှိပ်နိုင်ပါတယ်။",
  "fishshort-words-training-pause2": "ကောင်းပါတယ်! A.I.အဆင်သင့်ဖြစ်ရင်ပဲဖြစ်ဖြစ် ဆက်ပြီး‌လေ့ကျင့်ပေးပါ။",
  "fishvtrash-pond-init1": "သင်လေ့ကျင့်ထားတဲ့အပေါ်မူတည်ပြီး A.I. ဒီနေရာမှာပါ သတ်မှတ်ပေးထားတဲ့ \"ငါး\"ဆိုတဲ့ တချို့ ပစ္စည်းတွေပါ။ A.I.ဘယ်လိုများလုပ်ပါလိမ့်?",
  "fishvtrash-pond-init2": "သင်ဟာ A.I.ကို နောက်ထပ်ထပ်မံ လေ့ကျင့်သင်ကြားပေးနိုင်ပါတယ်။",
  "fishvtrash-pond-init3": ".... ဒီလိုမှမဟုတ်ရင် ဆက်လုပ်ဆောင်မလား?",
  "fishvtrash-pond-recall": "\"ငါး\"နှင့်\"ငါးမဟုတ်ပါ\"လို့သတ်မှတ်ထားတဲ့ အရာတွေကို လှည့်လည်ဖို့အတွက် ဤနေရာကိုနှိပ်ပါ။",
  "fishvtrash-predicting-init1": "ကဲ အခုဆို A.I.က \"ငါး\"ဆိုတာ ဘာနဲ့တူလဲဆိုတာကို သိသွားပြီဖြစ်ကြောင်း လေ့လာကြည့်ကြစို့။",
  "fishvtrash-predicting-init2": "A.I.က အရာ၀တ္ထုပစ္စည်းတွေရဲ့ ဘယ်လိုပုံစံမဆို အသေးစိတ်ခွဲခြမ်းစိတ်ဖြာပေးလိမ့်မယ် ပြီးတော့ သင်လေ့ကျင့်ပေးထားတဲ့အတိုင်း ထိုပစ္စည်းများကို အမည်ပေးလိမ့်မယ်။",
  "fishvtrash-predicting-init3": "ကဲ စကြစို့ !",
  "fishvtrash-training-init1": "အမှိုက်တွေကို ရေထဲသို့ပစ်ချခြင်းက ပင်လယ်နေသက်ရှိများကို  အကျိုး‌သက်ရောက်မှုရှိပါတယ်။ ဒီလုပ်ငန်းမျိုးကို သင်ကိုယ်တိုင်က ဒါက ငါးလား အမှိုက်လားဆိုတာ ခွဲခြားတတ်အောင် A.I. ကို သင်ကြားပြသပေးနိုင်ပါတယ်။ ဒါ့ကြောင့် ပင်လယ်သမုဒ္ဒရာကြီးကို သန့်ရှင်းလိုက်ကြရအောင်! ဒါ့ကြောင့် ဤမျက်နှာပြင်မှ မည်သည့်နေရာမဆို တစ်ချက်နှိပ်ပြီး ရှေ့ဆက်သွားပါ။",
  "fishvtrash-training-init2": " လူလုပ်မှတ်ဉာဏ်တု A.I နဲ့ တွေ့ကြစို့",
  "fishvtrash-training-init3": "A.I. ကတော့ ပစ္စည်းလားတစ်မျိုးလား ငါးတစ်ကောင်လား အမှိုက်လားဆိုတာကို မသိပေမယ့် သူက ရုပ်ပုံတွေနဲ့ ပုံစံတွေကိုအမျိုးအစားခွဲခြားနိုင်ခြင်းမျိုးကိုတော့လုပ်ပေးနိုင်ပါတယ်။",
  "fishvtrash-training-init4": "A.I.ကို စီစဉ်ချမှတ်နိုင်ဖို့ရန် \"ငါး\" သို့မဟုတ် \"ငါးမဟုတ်ပါ\"ဆိုသ်ကို သတ်မှတ်နိုင်ရန် ပုံကြည့်ပြီးရွေးချယ်နှိပ်ပါ။ သင်လေ့ကျင့်ချမှတ်ပေးလိုက်တဲ့ လေ့ကျင့်ပေးမှုက A.I.ကို သူ့ကိုယ်ပိုင်ပုံစံတွေမှတ်မိစေပါတယ်။ စလိုက်ကြရအောင်။",
  "fishvtrash-training-pause1": "တစ်နှစ်လျှင် ၁၇ ဘီလီယံ (၁၇,၀၀၀,၀၀၀,၀၀၀) ပေါင်တန်ချိန်ရှိသော ပလပ်စတစ်များသည် ပင်လယ်သမုဒ္ဒရာအတွင်းသို့ ‌၀င်ရောက်လေ့ရှိတယ်။",
  "fishvtrash-training-pause2": "သင်ဟာ လက်ဖြင့်တစ်ချက်နှိပ်လိုက်ရုံဖြင့် A.I.ကို အစီအစဉ် သို့မဟုတ် လေ့ကျင့်ပေးနေပါသည်။ ဆက်သွားလိုက်ပါ။",
  "fishvtrash-training-pause3": "ပင်လယ်သမုဒ္ဒရာရဲ့ ၈၀ရာခိုင်နှုန်းသော ညစ်ညမ်းမှုအညစ်အကြေးများသည် ကုန်းမြေပျက်စီးမှုအပိုင်းအစများမှဖြစ်ပြီး ထိုအပျက်အစီးများ၏ကုန်ကျစားရိတ်သည် တစ်နှစ်လျှင် ‌၁၃ဘီလီယံ (၁၃,၀၀၀,၀၀၀,၀၀၀)ဒေါ်လာနှင့်ညီမျှသည်ဟု ခန့်မှန်းထားသည်။",
  "fishvtrash-training-pause4": "A.I. သည် သင်၏ရွေးချယ်မှုများမှ လေ့လာသင်ယူတတ်သည်။ အကယ်၍ သင်သည် ရွေးချယ်မှုများမှားယွင်းသွားပါက A.I. သည်လည်း သင်၏အမှားတိုင်းလိုက်လုပ်လိမ့်မည်။ ထို့ကြောင့် ဆက်လေ့ကျင့်ပေးပါ။",
  "fishvtrash-training-pause5": "အရမ်းကောင်းတဲ့ အလုပ်ပဲ! သင်သည် A.I. ကို အချက်အလက်‌ဒေတာတွေပို ‌ထောက်ပံ့လေ့ကျင့်ပေးနိုင်လေလေ A.I. သည်လည်း ပိုပြီးလေ့လာသင်ယူနိုင်လေလေပဲ။ A.I. ကိုသာ ဆက်လေ့ကျင့်ပေးလိုက်ပါ ဒါမှမဟုတ်ရင်‌တော့  A.I. သာအဆင်သင့်ဖြစ်ရင် ဆက်လက်လုပ်ဆောင်လိုက်ပါ။",
  "fun": "ပျော်ရွှင်စရာ ",
  "glitchy": "ပစ္စည်းများရုတ်တရက် အလုပ်မလုပ်သော",
  "happy": "ပျော်ရွှင်သော",
  "hungry": "ဆာလောင်သော",
  "isThisAFish": "ဒီဟာ သည် ငါးတစ်ကောင်ဟုတ်ပါသလား",
  "isThisFish": "ငါးဟုတ်သလား (စကားလုံး)",
  "mostImportantParts": "ဒီအရာများဟာ အရေးအကြီးဆုံးငါးအစိတ်အပိုင်းများဖြစ်သည်",
  "mostImportantPartsDescription": "ဒီငါးသည် (စကားလုံး) သို့မဟုတ် (စကားလုံးမဟုတ်) ဆိုတာ ဆုံးဖြတ်ရန် ဤ အရာများသည် အရေးအကြီးဆုံး ငါးအစိတ်အပိုင်းများဖြစ်သည်",
  "mouths": "ပါးစပ်",
  "newWord": "စကားလုံးသစ်",
  "notWord": "မဟုတ်ပါ(စကားလုံး)",
  "pectoralFinsFront": "ဝမ်းဗိုက် ပိုင်း ရေယက်",
  "playful": "ပျော်ပါးသော",
  "rectangular": "ထောင့်မှန် လေးထောင့် ဖြစ်သော",
  "run": "Run",
  "scales": "အကြေးခွံများ",
  "scary": "ကြောက်စရာ ကောင်းသော",
  "silly": "စဉ်းစားဉာဏ်မရှိသော",
  "spooky": "တစ္ဆေနှင့် တူသော",
  "tails": "အမြှီး",
  "trainMore": "ပိုပြီးလေ့ကျင့်ပါ",
  "triangular": "တြိဂံ ပုံဖြစ်သော/ သုံး ထောင့် ဖြစ်သော",
  "waterCreature": "ရေနေ သတ္တဝါ",
  "wild": "ပြင်းထန်သော",
  "wordQuestionLong": "ဖန်တီးထားသောအသိဉာဏ်ကို သင်ကြားပေးရန် စကားလုံးသစ်တစ်ခု ရွေးချယ်ပါ",
  "wordQuestionShort": "ဖန်တီးထားသောအသိဉာဏ် တွေ့ရှိဖို့ ဘယ်ငါးအမျိုးအစားကို သင်လေ့ကျင့်ပေးလိုပါသလဲ"
}