{
  "fishvtrash-training-init1": "O lixo despejado na água afeta a vida marinha. Nesta atividade, você programará ou treinará a IA. (inteligência artificial) para identificar peixes ou lixo. Vamos limpar o oceano! Clique em qualquer lugar na tela para continuar.",
  "fishvtrash-training-init2": "Vamos conhecer a IA.",
  "fishvtrash-training-init3": "IA não sabe se um objeto é um peixe ou lixo, mas pode processar imagens e identificar padrões.",
  "fishvtrash-training-init4": "Para programar a IA, use os botões para rotular uma imagem como \"Peixe\" ou \"Não peixe\". O treinamento que você ministrará ensinará a IA a reconhecer padrões por conta própria. Vamos começar!",
  "fishvtrash-training-pause1": "8,5 milhões de toneladas de plástico caem no oceano a cada ano.",
  "fishvtrash-training-pause2": "Você está programando ou treinando I.A. com cada clique. Continue.",
  "fishvtrash-training-pause3": "80% da poluição oceânica provém de detritos terrestres e estima-se que custe US $ 13 bilhões de dólares por ano.",
  "fishvtrash-training-pause4": "A IA aprende com suas escolhas. Se você fizer escolhas \"erradas\", a IA repetirá seus erros.  Continue treinando.",
  "fishvtrash-training-pause5": "Ótimo trabalho! Quanto mais dados você fornece à IA, mais ela aprende.  Continue treinando a IA ou prossiga quando estiver pronto.",
  "fishvtrash-predicting-init1": "Agora vamos ver se a IA sabe qual é a aparência de um \"peixe\".",
  "fishvtrash-predicting-init2": "A IA analisará um conjunto aleatório de objetos e os rotulará com base no seu treinamento.",
  "fishvtrash-predicting-init3": "Vamos lá!",
  "fishvtrash-pond-init1": "Com base no seu treinamento, aqui estão alguns objetos que a IA identificou como “peixe”. Como a IA se saiu?",
  "fishvtrash-pond-recall": "Clique aqui para alternar entre objetos identificados como \"peixe\" e \"não peixe\".",
  "fishvtrash-pond-init2": "Você pode treinar a IA mais...",
  "fishvtrash-pond-init3": "... ou Continuar.",
  "creaturesvtrashdemo-predicting-init1": "Até agora, treinamos a IA para identificar objetos como \"peixe\" ou \"não peixe\".",
  "creaturesvtrashdemo-predicting-init2": "E se esses dados de treinamento fossem usados para decidir o que deve estar na água?",
  "creaturesvtrashdemo-predicting-init3": "O que aconteceria com outras criaturas do mar? Nossa abordagem de treinamento causaria consequências indesejadas?",
  "creaturesvtrashdemo-predicting-init4": "Vamos ver.",
  "creaturesvtrashdemo-predicting-pause1": "Você notou que a IA identificou algumas criaturas do mar como \"não peixes\"?",
  "creaturesvtrashdemo-predicting-pause2": "Embora essas criaturas marinhas não sejam peixes, elas devem estar na água.",
  "creaturesvtrashdemo-predicting-pause3": "A IA apenas aprende o que ensinamos.",
  "creaturesvtrashdemo-predicting-pause4": "Vamos treinar a IA novamente.",
  "creaturesvtrash-training-init1": "Vamos ensinar a IA para aprender quais objetos devem estar na água.",
  "creaturesvtrash-training-init2": "No oceano, detritos de plástico podem prejudicar peixes, aves marinhas e mamíferos marinhos. Proteger aves marinhas e a vida marinha é uma das muitas razões para manter os oceanos limpos.",
  "creaturesvtrash-training-init3": "Quanto mais dados de treinamento você fornecer, mais a IA aprende.  Continue a treinar.",
  "creaturesvtrash-training-init4": "A poluição por plásticos marinhos afetou pelo menos 267 espécies em todo o mundo, incluindo 86% de todas as espécies de tartarugas marinhas.",
  "creaturesvtrash-training-init5": "Continue treinando para ensinar à IA o que deve estar na água.",
  "creaturesvtrash-training-init6": "Ótimo trabalho! Quanto mais dados você fornecer à IA, melhor ela vai se sair.  Fique treinando a IA ou continue quando estiver pronto.",
  "creaturesvtrash-predicting-init1": "Você acha que a IA fará um trabalho melhor agora identificando o que deve estar na água? Vamos ver.",
  "creaturesvtrash-pond-init1": "Com base no seu treinamento, aqui estão alguns objetos que a IA identificou como \"deve estar na água\". Como a IA se saiu?",
  "fishshort-words-init1": "Inteligência artificial e aprendizado de máquina podem ser usados para ensinar novos padrões a um computador.",
  "fishshort-words-init2": "Vamos ensinar a IA uma nova palavra, mostrando exemplos desse tipo de peixe.",
  "fishshort-words-training-pause1": "Você acha que a IA tem dados de treinamento suficientes? Você pode clicar em Continuar para descobrir.",
  "fishshort-words-training-pause2": "Ótimo trabalho!  Fique treinando a IA ou continue quando estiver pronto.",
  "fishshort-predicting-init1": "Com seus dados de treinamento, você programou a IA para reconhecer peixe \"{word}\".",
  "fishshort-predicting-init2": "Vamos ver a IA identificar peixe \"{word}\".",
  "fishshort-pond-init1": "Com base no seu treinamento, a IA identificou  {n, plural,one {este peixe} other {estes peixes}} como “{word}”. Como a IA se saiu? Você pode treinar mais se quiser melhorar os resultados.",
  "fishshort-pond-init2": "Clique no botão de informação para ver o que a Inteligência Artificial aprendeu.",
  "fishlong-words-init1": "Agora vamos ver se Inteligência Artificial pode aprender uma palavra menos óbvia.",
  "fishlong-words-init2": "Vamos ensinar a Inteligência Artificial uma palavra que depende da sua opinião. Cabe a você escolher peixes que correspondam à sua palavra.",
  "fishlong-training-pause1": "É justo usar a inteligência artificial para julgar um peixe pela aparência? Embora a IA possa parecer justa e neutra, sua análise vem do treinamento que fornecemos. Que viés não intencional isso poderia causar?",
  "fishlong-training-pause2": "Mais dados de treinamento vão ajudar a I.A. aprender sua palavra. Continue a treinar.",
  "fishlong-training-pause3": "Cada escolha que você fizer pode ajudar a IA aprender. Continue o treinamento.",
  "fishlong-training-pause4": "Você acha que IA possui dados de treinamento suficientes? IA. fará melhor com mais dados. Continue treinando e quando você menos esperar a  IA. estará pronta.",
  "fishlong-training-many": "Uau. Isso é um peixe!",
  "fishlong-predicting-init1": "Com seus dados de treinamento, você programou a IA para reconhecer peixe \"{word}\".",
  "fishlong-predicting-init2": "Vamos ver a IA identificar peixe \"{word}\".",
  "fishlong-pond-init1": "Com base em seu treinamento, a IA. identificou {n, plural,one {este peixe} other {estes peixes}} como “{word}”.Como A.I. Faz?",
  "fishlong-pond-init2": "\nVocê pode treinar mais se quiser melhorar os resultados.",
  "fishlong-pond-init3": "\nOu você pode ensinar a IA. uma nova palavra escolhendo Nova palavra.",
  "didYouKnow": "Você sabia?",
  "continue": "Continuar",
  "areYouSure": "Tem certeza?",
  "eraseWarning": "A exclusão dos dados da IA ​​eliminará permanentemente todo o treinamento. É isso que você quer fazer?",
  "erase": "Apagar",
  "cancel": "Cancelar",
  "yes": "Sim",
  "no": "Não",
  "notWord": "Não {word}",
  "run": "Executar",
  "mostImportantParts": "Estas foram as partes mais importantes dos peixes:",
  "clickIndividualFish": "Clique em peixes individuais para ver suas informações.",
  "mostImportantPartsDescription": "\nEssas foram as partes mais importantes para determinar se esse peixe era \"* {word} *\" ou \"** {notWord} **\".",
  "newWord": "Nova Palavra",
  "finish": "Concluir",
  "trainMore": "Treinar mais",
  "wordQuestionShort": "\nQue tipo de peixe você deseja treinar IA para detectar?",
  "wordQuestionLong": "\nEscolha uma nova palavra para ensinar a IA.",
  "isThisFish": "Este peixe é {word}?",
  "isThisAFish": "É um peixe?",
  "doesThisBelongInWater": "Isso pertence à água?",
  "fish": "Peixe",
  "waterCreature": "Criatura da água",
  "blue": "Azul",
  "green": "Verde",
  "red": "Vermelho",
  "circular": "Circular",
  "rectangular": "Retangular",
  "triangular": "Triangular",
  "angry": "Bravo",
  "awesome": "Impressionante",
  "delicious": "Delicioso",
  "endangered": "Ameaçadas de extinção",
  "fast": "Rápido",
  "fierce": "Feroz",
  "fun": "Divertido",
  "glitchy": "Glitchy",
  "happy": "Feliz",
  "hungry": "Com fome",
  "playful": "Brincalhão",
  "scary": "Assustador",
  "silly": "Bobo",
  "spooky": "Assustador",
  "wild": "Selvagem",
  "dorsalFins": "extremidade dorsal",
  "pectoralFinsFront": "barbatanas peitorais",
  "tails": "cauda",
  "bodies": "corpo",
  "scales": "Escalas",
  "eyes": "olhos",
  "mouths": "boca",
  "colors": "cores"
}