{
  "fishvtrash-training-init1": "Odpadky vyhodené do vody ovplyvňujú morský život. V tejto aktivite budeš programovať alebo trénovať U.I. (Umelú Inteligenciu) na identifikáciu rýb alebo odpadu. Vyčistime oceán! Pre pokračovanie klikni na ľubovoľné miesto na obrazovke.",
  "fishvtrash-training-init2": "Stretnime sa s U.I.",
  "fishvtrash-training-init3": "U.I. nevie, či je objektom ryba alebo kôš, ale dokáže spracovať obrázky a identifikovať vzory.",
  "fishvtrash-training-init4": "Na programovanie U.I. použi tlačidlá na označenie obrázka ako „Ryba“ alebo ako „Nie Ryba“. Tréning, ktorý poskytneš, naučí U.I. spoznávať vzorce samú. Začnime!",
  "fishvtrash-training-pause1": "Každý rok skončí v oceáne viac ako osemtisíc ton plastu.",
  "fishvtrash-training-pause2": "U.I. programuješ alebo trénuješ s každým kliknutím. Neprestávaj pokračovať.",
  "fishvtrash-training-pause3": "80% znečistenia oceánov pochádza z ľuďmi vyprodukovaného odpadu a odhaduje sa, že bude stáť 12 miliárd euro ročne.",
  "fishvtrash-training-pause4": "U.I sa učí z tvojich rozhodnutí. Ak urobíš „nesprávne“ rozhodnutia, U.I. zopakuje tvoje chyby. Pokračuj v tréningu.",
  "fishvtrash-training-pause5": "Skvelá práca! Čím viac údajov poskytneš U.I., tým viac sa naučí. Neprestávajte s tréningom U.I. alebo stlačte pokračovať, keď budete pripravení.",
  "fishvtrash-predicting-init1": "Teraz sa pozrime, či U.I. vie, ako vyzerá „ryba“.",
  "fishvtrash-predicting-init2": "U. I. bude analyzovať náhodnú sadu objektov a označí ich na základe vášho tréningu.",
  "fishvtrash-predicting-init3": "Poďme!",
  "fishvtrash-pond-init1": "Na základe vášho tréningu, tu sú niektoré objekty, ktoré U.I. označila ako „ryba“. Ako to U.I. zvládla?",
  "fishvtrash-pond-recall": "Kliknite sem pre prepnutie medzi objektmi označenými ako „ryba“ a „nie ryba“.",
  "fishvtrash-pond-init2": "Môžete trénovať U.I. ďalej...",
  "fishvtrash-pond-init3": "... alebo môžete Pokračovať.",
  "creaturesvtrashdemo-predicting-init1": "Zatiaľ sme trénovali U.I. na identifikáciu predmetov buď ako „ryba“ alebo „nie ryba“.",
  "continue": "Pokračovať",
  "areYouSure": "Ste si istý?",
  "cancel": "Zrušiť",
  "yes": "Áno",
  "no": "Nie",
  "run": "Spustiť",
  "finish": "Dokončiť"
}