{
  "angry": "Ita",
  "awesome": "Manaia",
  "bodies": "tino",
  "cancel": "Taofi",
  "circular": "Lio",
  "clickIndividualFish": "Oomi ia taitasi e te iloa ai ni faamatalaga e faatatau ia i latou:",
  "colors": "lanu",
  "continue": "Faaauau",
  "creaturesvtrash-pond-init1": "Mai lou faasinoina o le A.I., o mea nei sa faailoa e le AI e \"mai le sami\". E a le taumafaiga a le A.I.?",
  "creaturesvtrash-predicting-init1": "E te manatu e sili atu nei le iloa o le A.I. poo a mea e tatau ona iai i le sami? Sei vaai",
  "creaturesvtrash-training-init1": "Ia toe faasino ma aoao le A.I. poo a mea e tatau ona iai i le sami. ",
  "creaturesvtrash-training-init2": "I le moana, o lapisi pa'uuna e mafai ona afaina ia, manu felelei ma isi ia o le sami. O le puipuiga o manu felelei ma figota o le sami o se tasi nei o mafuaaga e tatau ona mama ai le moana. ",
  "creaturesvtrash-training-init3": "O le tele lava o faamaumauga ma faatonuga e faasino ai le A.I., o le tele foi na o le iloa. Faaauau pea le toleniga. ",
  "creaturesvtrash-training-init4": "O otaota pa'uuna ua aafia ai le 267 o manu o le lalolagi, e aafia ai le 86% o laumei eseese uma. ",
  "creaturesvtrash-training-init5": "Ia toleni pea e aoao le A.I. poo a mea e ola i le sami",
  "creaturesvtrash-training-init6": "Manaia tele! O le tele o faamaumauga e te avatu i le A.I., o le lelei foi lena o ana galuega. Ia faasino ma aoao pea le A.I. pe faaauau pe a ua e sauni. ",
  "creaturesvtrashdemo-predicting-init1": "O le ua uma ona aoao le A.I. ina ia iloa meatotino o le 'ia' poo 'le o se ia'",
  "creaturesvtrashdemo-predicting-init2": "E a pe ana faapea o lenei faamaumauga mai toleniga e faaaoga e iloa ai poo a ni mea e tatau ona iai i le sami? ",
  "creaturesvtrashdemo-predicting-init3": "O le a se mea e tupu i isi figota o le sami? O iai ni aafiaga le fuafuaina mai le matou polokalame? ",
  "creaturesvtrashdemo-predicting-init4": "sei vaai",
  "creaturesvtrashdemo-predicting-pause1": "na e iloa na faailoa e le A.I. isi figota o le sami o le 'not fish'?",
  "creaturesvtrashdemo-predicting-pause2": "E ui lava o nei figota e le o ni ia, ae latou te omai mai le sami. ",
  "creaturesvtrashdemo-predicting-pause3": "E faataitai le A.I. i le mea na faasino ma aoao atu iai",
  "creaturesvtrashdemo-predicting-pause4": "Ia toe faapolokalame le A.I.",
  "delicious": "Manaia le ai",
  "didYouKnow": "Na e iloa?",
  "doesThisBelongInWater": "E ola i le sami lenei mea?",
  "dorsalFins": "gogo",
  "endangered": "Toeitiiti leai",
  "erase": "Aveese ma tape",
  "eraseWarning": "O le tapeina o faamaumauga a le A.I. e tape ma aveese faatumau uma ai aoaoga. O le mea lena e te manao i ai?",
  "eyes": "mata",
  "fast": "Vave",
  "fierce": "Finau",
  "finish": "Uma",
  "fish": "Ia",
  "fishlong-pond-init1": "Mai lau toleinga, na faailoa e le A.I. le (this) o (these) ia o {word}. E a se taumafaiga o A.I.? ",
  "fishlong-pond-init2": "E mafai ona e Toleni Pea pe afai e te manao e faalelei au faaiuga. ",
  "fishlong-pond-init3": "Pe e te aoao le A.I. se upu fou i le filifiliina o le New Word",
  "fishlong-predicting-init1": "Mai faamaumauga o lau toleniga, ua e faapolokalameina le A.I. ina ia iloa le ia o le {word}",
  "fishlong-predicting-init2": "Sei vaai le faailoaina e A.I. le ia {word}",
  "fishlong-training-many": "Auoka. Matua tele na ia",
  "fishlong-training-pause1": "E talafeagai le faaaogaina o le poto faakomepiuta e faailoa se i ona foliga? E ui e faapea o le A.I. e le faailogaina ma e le faaauau, o le vaai loloto a le A.I. e mafua mai i le toleniga lea matou te faia. O a ni tulagaga faaauau na le fuafuaina e ono tutupu?",
  "fishlong-training-pause2": "O nisi faamaumauga mo le aoaoina o le A.I. e fesoasoani ina ia malamalama le A.I. i lau upu. Faaauau pea toleniga. ",
  "fishlong-training-pause3": "O filifiliga e te faia e mafai ona fesoasoani ia malamalama le A.I.. Faaauau pea le toleniga. ",
  "fishlong-training-pause4": "I lou iloa, ua lava faamaumauga e faatoleni ai le A.I.? O le tele o faamaumauga o le lelei foi lena o le A.I.. Faaauau pe a e mafaufau ua lava sauni le A.I..",
  "fishlong-words-init1": "Sei vaai pe iloa nei e le A.I. se upu le iloga tele. ",
  "fishlong-words-init2": "Sei aoao le A.I., se upu e fua i lou manatu. E pule oe poo le a le ia e filifili e fesootai ma lau upu. ",
  "fishshort-pond-init1": "Mai i lau toleniga, na faailoa e le A.I. le ia o le {word}. E a le taumafai o A.I.? E mafai ona faatoleni pea pe afai e te manao e faalelei le faaiuga. ",
  "fishshort-pond-init2": "Oomi le ki o le faamaumauga i lalo e iloa ai poo a mea na aoaoina e le A.I.",
  "fishshort-predicting-init1": "Mai faamaumauga o lau toleniga, ua e faapolokalameina le A.I. ina ia iloa le ia o le {word}",
  "fishshort-predicting-init2": "Sei vaai le faailoaina o le A.I. o le ia {word}",
  "fishshort-words-init1": "O le poto faakomepiuta ma le malamalama faamasini e mafai ona faaaoga e faailoa ai i le komepiuta ni mamanu ma polokalame fou. ",
  "fishshort-words-init2": "Ia aoao le A.I. ni upu fou e ala i le faaali iai o ni faataitaiga o le ituaiga ia lena. ",
  "fishshort-words-training-pause1": "I lou mafaufau, o lava faamaumaua e faatoleni ai le A.I.? E mafai ona oomi le Continue ia iloa ai. ",
  "fishshort-words-training-pause2": "Malo le galue! Faatoleni pea le A.I. pe faaauau pe a ua e sauni. ",
  "fishvtrash-pond-init1": "E tusa ma lou aoaoina o le A.I., o nisi nei o vaega na faailoa e le A.I. o ni 'ia'. E a le taumafai a le A.I.? ",
  "fishvtrash-pond-init2": "E mafai ona e toe aoao le A.I.",
  "fishvtrash-pond-init3": "pe Faaauau",
  "fishvtrash-pond-recall": "Oomi iinei e fesuiai mea totino o loo faailoa o 'ia' ma 'le o ia'",
  "fishvtrash-predicting-init1": "Tatou vaavaai pe ua iloa e le A.I. foliga o le ia (fish). ",
  "fishvtrash-predicting-init2": "E vaai ma fuafua e le AI meatotino eseese ma faaiogaina e tusa ma lau faapolokalameina",
  "fishvtrash-predicting-init3": "Alu iai",
  "fishvtrash-training-init1": "O lapisi e tiai i le sami e afaina ai figota o le sami. O lenei galuega faatino, e te faapolokalameina pe aoaoina se AI (poto faamasini) e faailoa poo se ia poo se lapisi. Tatou faamamaina le moana. Oomi soo se mea o le screen e faaauau",
  "fishvtrash-training-init2": "Tatou feiloai i le A.I.",
  "fishvtrash-training-init3": "E le o iloa e le A.I. poo se ia poo se otaota, ae e mafai ona iloa atu poo ni ata poo ni mamanu",
  "fishvtrash-training-init4": "Mo le faapolokalameina o le A.I., faaaoga ki e faaigoa ai ata o le \"Fish\" poo le \"Not Fish\". O lou aoaoina o le e malamalama ai le AI e iloa atu lava e ia mamanu. Tatou amata. ",
  "fishvtrash-training-pause1": "Sefulufitu piliona o pauna o le pau'una e tuulafoai i le sami i tausaga taitasi",
  "fishvtrash-training-pause2": "O loo e faapolokalameina pe aoaoina le A.I. i taimi uma e te oomi ai. Fai fai pea. ",
  "fishvtrash-training-pause3": "E 80% o le leaga mai le sami e mai i le laufanua ma e taumate e $13 miliona le tau i tausaga taitasi. ",
  "fishvtrash-training-pause4": "E malamalama le A.I. mai au filifiliga. Afai e sese au filifiliga, e faapena ona faataitai le A.I. i au mea sese. Faaauau pea le toleniga. ",
  "fishvtrash-training-pause5": "Manaia tele! O le tele lava o faamaumauga e te avatu i le A.I., o le tele lava o le malamalama. Faatoleni pea le A.I. pe faaauau pea ua e sauni. ",
  "fun": "Fiafia",
  "glitchy": "Motumotu",
  "happy": "Fiafia",
  "hungry": "Fia ai",
  "isThisAFish": "O se ia lenei?",
  "isThisFish": "O se ia {word} lenei?",
  "mostImportantParts": "O vaega taua ia o le tino o le ia:",
  "mostImportantPartsDescription": "O itu pito sili ona taua i le ia i le faailoaina poo se ia na \"*{word}*\" pe \"**{notWord}**\"",
  "mouths": "gutu",
  "newWord": "Upu Fou",
  "no": "Leai",
  "notWord": "E le o le {word}",
  "pectoralFinsFront": "apaapa",
  "playful": "Taalo ",
  "rectangular": "Opeloge",
  "run": "Faaalu",
  "scales": "una",
  "scary": "Fefe",
  "silly": "Ula",
  "spooky": "Taufaafefe",
  "tails": "siusiu",
  "trainMore": "Toe fai nisi vasega",
  "triangular": "Tafatolu",
  "waterCreature": "Figota o le sami",
  "wild": "Le popoi",
  "wordQuestionLong": "Filifili se upu fou e aoao i le A.I.",
  "wordQuestionShort": "O le a le ituaiga ia e te manao e faatonu le A.I. e iloa atu?",
  "yes": "Ioe"
}