{
  "angry": "Зла",
  "areYouSure": "Справді?",
  "awesome": "Дивовижна",
  "blue": "Синя",
  "bodies": "тіло",
  "cancel": "Скасувати",
  "circular": "Кругла",
  "clickIndividualFish": "Клацай окремих риб, щоб побачити їх інформацію.",
  "colors": "кольори",
  "continue": "Продовжити",
  "creaturesvtrash-pond-init1": "Виходячи з отриманого навчання, ось деякі об'єкти, які ШІ ідентифікував як «мають знаходитись у воді». Як упорався ШІ?",
  "creaturesvtrash-predicting-init1": "Як ти думаєш, ШІ тепер краще впорається з визначенням того, що повинно бути у воді? Подивимося.",
  "creaturesvtrash-training-init1": "Навчимо ШІ тому, які об'єкти мають знаходитись у воді.",
  "creaturesvtrash-training-init2": "В океані пластикове сміття може завдавати шкоди рибам, морським птахам і ссавцям. Захист морських птахів та інших мешканців є однією з багатьох причин підтримувати океани в чистоті.",
  "creaturesvtrash-training-init3": "Чим більше навчальних даних ми надаємо, тим розумнішим стає ШІ. Продовжуй навчати.",
  "creaturesvtrash-training-init4": "Забруднення морським пластиком негативно вплинуло щонайменше на 267 видів у всьому світі, включаючи 86% всіх видів морських черепах.",
  "creaturesvtrash-training-init5": "Продовжуй навчати ШІ тому, що має знаходитись у воді.",
  "creaturesvtrash-training-init6": "Чудова робота! Чим більше даних ми надамо ШІ, тим краще він буде працювати. Навчай ШІ далі або натисни \"Продовжити\", коли він буде готовий.",
  "creaturesvtrashdemo-predicting-init1": "Досі ми навчали ШІ визначати є об'єкт \"рибою\" чи \"не рибою\".",
  "creaturesvtrashdemo-predicting-init2": "А що, якщо ми використаємо навчальні дані для визначення того, що має знаходитись у воді, а що ні?",
  "creaturesvtrashdemo-predicting-init3": "Що трапиться з іншими морськими істотами? Чи спричиняє наш підхід до навчання небажані наслідки?",
  "creaturesvtrashdemo-predicting-init4": "Подивимось.",
  "creaturesvtrashdemo-predicting-pause1": "Зверни увагу, що ШІ визначив деяких морських істот як \"не рибу\".",
  "creaturesvtrashdemo-predicting-pause2": "Ці морські істоти справді не є рибою, але ж вони мають знаходитись у воді.",
  "creaturesvtrashdemo-predicting-pause3": "ШІ засвоює тільки те, чому ми його навчаємо.",
  "creaturesvtrashdemo-predicting-pause4": "Знову потренуємо ШІ.",
  "delicious": "Смачна",
  "didYouKnow": "А ти знаєш?",
  "doesThisBelongInWater": "Це має бути у воді?",
  "dorsalFins": "спинний плавник",
  "endangered": "Зникаюча",
  "erase": "Стерти",
  "eraseWarning": "Стирання даних ШІ назавжди видалить все, що він вивчив. Це те, що ти хочеш зробити?",
  "eyes": "очі",
  "fast": "Швидка",
  "fierce": "Люта",
  "finish": "Кінець",
  "fish": "Риба",
  "fishlong-pond-init1": "На основі отриманого навчання ШІ визначив {n, plural,one {цих} other {цих}} риб як риб з характеристикою \"{word}\". Як упорався ШІ?",
  "fishlong-pond-init2": "Можеш продовжити тренувати ШІ, якщо хочеш покращити результати.",
  "fishlong-pond-init3": "Або можеш навчити ШІ нового слова, обравши \"Нове слово\".",
  "fishlong-predicting-init1": "За допомогою навчальних даних ми запрограмували ШІ розпізнавати рибу з характеристикою \"{word}\".",
  "fishlong-predicting-init2": "Подивимось, як ШІ розпізнаватиме рибу з характеристикою \"{word}\".",
  "fishlong-training-many": "Вау. Це багато риби!",
  "fishlong-training-pause1": "Чи справедливо використовувати штучний інтелект для оцінки зовнішності риби? Штучний інтелект здається справедливим та неупередженим, але його аналіз базується на отриманому від нас навчанні. Яке ненавмисне упередження це може спричинити?",
  "fishlong-training-pause2": "Більше навчальних даних допоможуть ШІ вивчити твоє слово. Продовжуй навчати.",
  "fishlong-training-pause3": "Кожен вибір, який ти робиш, може допомогти ШІ навчитися. Продовжуй тренувати.",
  "fishlong-training-pause4": "Як ти думаєш, ШІ має достатньо навчальних даних? ШІ буде краще працювати з великою кількістю даних. Продовжуй, коли вирішиш, що ШІ готовий.",
  "fishlong-words-init1": "Тепер подивимось, чи зможе ШІ засвоїти менш наочне слово.",
  "fishlong-words-init2": "Навчимо ШІ слова, яке є суб'єктивно наданою нами характеристикою. Маєш самостійно вирішити, яких риб стосується це слово.",
  "fishshort-pond-init1": "На основі отриманого навчання ШІ визначив {n, plural,one {цих} other {цих}} риб як риб з характеристикою \"{word}\". Як упорався ШІ? Можеш продовжити тренувати ШІ, якщо хочеш покращити результати.",
  "fishshort-pond-init2": "Клацни кнопку інформації, щоб побачити, що засвоїв ШІ.",
  "fishshort-predicting-init1": "За допомогою навчальних даних ми запрограмували ШІ розпізнавати рибу з характеристикою \"{word}\".",
  "fishshort-predicting-init2": "Давай подивимось, як ШІ розпізнаватиме рибу з характеристикою \"{word}\".",
  "fishshort-words-init1": "Штучний інтелект та машинне навчання можна використовувати, щоб навчити комп'ютер новим закономірностям.",
  "fishshort-words-init2": "Навчимо ШІ нового слова, показуючи приклади такої риби.",
  "fishshort-words-training-pause1": "Як думаєш, ШІ має достатньо навчальних даних? Можеш натиснути Продовжити, щоб дізнатися.",
  "fishshort-words-training-pause2": "Чудова робота! Продовжуй навчати ШІ або натисни \"Продовжити\", коли він буде готовий.",
  "fishvtrash-pond-init1": "Виходячи з отриманого навчання, ось деякі об'єкти, які ШІ ідентифікував як «рибу». Як упорався ШІ?",
  "fishvtrash-pond-init2": "Можна потренувати ШІ більше...",
  "fishvtrash-pond-init3": "...або \"Продовжити\".",
  "fishvtrash-pond-recall": "Клацай тут, щоб переключатися між об'єктами, визначеними як \"риба\" та \"не риба\".",
  "fishvtrash-predicting-init1": "Тепер подивимось, чи знає ШІ, як виглядає \"риба\".",
  "fishvtrash-predicting-init2": "ШІ проаналізує випадковий набір об’єктів та визначить їх на основі отриманого навчання.",
  "fishvtrash-predicting-init3": "Почнемо!",
  "fishvtrash-training-init1": "Сміття, яке потрапляє у воду, шкодить морським мешканцям. У цьому завданні ми будемо програмувати, тобто навчати, ШІ (штучний інтелект) визначати, що є рибою, а що сміттям. Давай очистимо океан! Клацни будь-де на екрані, щоб продовжити.",
  "fishvtrash-training-init2": "Познайомся із ШІ",
  "fishvtrash-training-init3": "ШІ не знає, є об'єкт рибою чи сміттям, але він може обробляти зображення та виявляти закономірності.",
  "fishvtrash-training-init4": "Щоб запрограмувати ШІ, позначай кожне зображення як \"Риба\" або \"Не риба\" за допомогою відповідних кнопок. Так ти навчиш ШІ самостійно розпізнавати закономірності. Розпочинаймо!",
  "fishvtrash-training-pause1": "Кожного року до океану потрапляє майже вісім з половиною мільйонів тон пластику.",
  "fishvtrash-training-pause2": "Ти програмуєш ШІ кожним клацанням. Продовжуй!",
  "fishvtrash-training-pause3": "80% забруднення океану — це сміття з суші. За оцінками, його вартість 13 мільярдів доларів США на рік.",
  "fishvtrash-training-pause4": "ШІ вчиться з твого вибору. Якщо ти робиш \"неправильний\" вибір, ШІ буде повторювати твою помилку. Продовжуй навчати.",
  "fishvtrash-training-pause5": "Чудова робота! Чим більше даних ми надаємо ШІ, тим розумнішим він стає. Продовжуй навчати ШІ  або натисни \"Продовжити\", коли він буде готовий.",
  "fun": "Весела",
  "glitchy": "Глючна",
  "green": "Зелена",
  "happy": "Щаслива",
  "hungry": "Голодна",
  "isThisAFish": "Це риба?",
  "isThisFish": "Ця риба {word}?",
  "mostImportantParts": "Це були найважливіші частини риб:",
  "mostImportantPartsDescription": "Це були найважливіші частини риби для визначення того, чи риба “*{word}*” чи “**{notWord}**”.",
  "mouths": "рот",
  "newWord": "Нове слово",
  "no": "Ні",
  "notWord": "Не {word}",
  "pectoralFinsFront": "грудний плавник",
  "playful": "Грайлива",
  "rectangular": "Прямокутна",
  "red": "Червона",
  "run": "Запустити",
  "scales": "луска",
  "scary": "Страшна",
  "silly": "Дурненька",
  "spooky": "Моторошна",
  "tails": "хвіст",
  "trainMore": "Навчати далі",
  "triangular": "Трикутна",
  "waterCreature": "Морська істота",
  "wild": "Дика",
  "wordQuestionLong": "Обери нове слово, якому ти хочеш навчити ШІ",
  "wordQuestionShort": "Який тип риби ти хочеш навчити виявляти ШІ?",
  "yes": "Так"
}