{
    "fishvtrash-training-init1": "Imríonn bruscar a dhumpáiltear san uisce tionchar ar dhúlra mara. Sa cheacht seo, déanfaidh tú traenáil ar AI (intleacht shaorga) éisc agus bruscar a aithint. Glanaimis an t-aigéan! Cliceáil áit ar bith le dul ar aghaidh.",
    "fishvtrash-training-init2": "Cé hí AI?",
    "fishvtrash-training-init3": "Ní thuigeann AI an difríocht idir éisc agus bruscar, ach is féidir léi pictiúir a phróiseáil agus patrúin a aithint.",
    "fishvtrash-training-init4": "Le AI a thraenáil, úsáid na cnaipí chun lipéad “Iasc” nó “Ní Iasc é” a chur ar gach pictiúr. Tríd an bpróiseas traenála seo, foghlaimeoidh Ai conas patrúin a aithint as a stuaim féin. Anois, ar aghaidh linn!",
    "fishvtrash-training-pause1": "Téann níos mó ná seacht mbilliún cileagram de phlaisteach isteach san aigéan gach bliain.",
    "fishvtrash-training-pause2": "Tá tú ag clárú nó ag traenáil AI le gach clic. Lean ort.",
    "fishvtrash-training-pause3": "Tagann 80% den truailliú san aigéan ó bhruscar talún, agus meastar go gcosnaíonn sé níos mó ná 12 billiún euro sa bhliain.",
    "fishvtrash-training-pause4": "Foghlaimíonn AI ó do roghanna. Má dhéanann tú roghanna \"míchearta\", déanfaidh AI na botúin sin freisin. Lean ort ag traenáil.",
    "fishvtrash-training-pause5": "Maith thú! Dá mhéad sonraí a thugann tú do AI, is ea is mó a fhoghlaimíonn sí. Lean ort ag traenáil, nó téigh ar aghaidh nuair a bheidh tú réidh.",
    "fishvtrash-predicting-init1": "Anois, fan go bhfeicfimid an dtuigeann AI cad is \"iasc\" ann.",
    "fishvtrash-predicting-init2": "Déanfaidh AI anailís ar phictiúir randamacha, agus cuirfidh sí lipéid orthu bunaithe ar an traenáil a rinne tú.",
    "fishvtrash-predicting-init3": "Ar aghaidh linn!",
    "fishvtrash-pond-init1": "Bunaithe ar an traenáil a rinne tú, seo duit roinnt rudaí ar cheap AI gur éisc iad. Conas a d'éirigh léi?",
    "fishvtrash-pond-recall": "Cliceáil anseo le malartú idir na rudaí aitheanta mar éisc agus na rudaí nach éisc iad.",
    "fishvtrash-pond-init2": "Is féidir leat tuilleadh traenála a dhéanamh...",
    "fishvtrash-pond-init3": "... nó leanúint ar aghaidh.",
    "creaturesvtrashdemo-predicting-init1": "Go dtí seo, thraenáil muid AI leis an difríocht idir éisc agus rudaí nach éisc iad a aithint.",
    "creaturesvtrashdemo-predicting-init2": "Céard a tharlódh dá n-úsáidfí na sonraí traenála seo chun cinneadh a dhéanamh ar cad ba chóir a bheith san uisce?",
    "creaturesvtrashdemo-predicting-init3": "Cad a tharlódh do na hainmhithe mara eile? An bhfuil torthaí nach rabhthas súil leo ag an bpróiseas traenála?",
    "creaturesvtrashdemo-predicting-init4": "Fan go bhfeicimid.",
    "creaturesvtrashdemo-predicting-pause1": "Ar thug tú faoi deara go ndúirt AI nach éisc iad roinnt de na hainmhithe mara?",
    "creaturesvtrashdemo-predicting-pause2": "Cé nach éisc iad na hainmhithe mara seo, ba chóir dóibh a bheith san uisce ar ndóigh.",
    "creaturesvtrashdemo-predicting-pause3": "Ní fhoghlaimíonn AI ach na rudaí a mhúinimid di.",
    "creaturesvtrashdemo-predicting-pause4": "Traenálaimis AI arís.",
    "creaturesvtrash-training-init1": "Múinimis do AI cad iad na rudaí ar chóir dóibh a bheith san uisce.",
    "creaturesvtrash-training-init2": "San aigéan, déanann smionagar plaisteach dochar d'éisc, d'éin mhara, agus do mhamaigh mhara. Seo é ceann de na cúiseanna ba chóir dúinn an t-aigéan a choinneáil glan.",
    "creaturesvtrash-training-init3": "Dá mhéad sonraí a thugann tú do AI, is ea is mó a fhoghlaimíonn sí. Lean ort ag traenáil.",
    "creaturesvtrash-training-init4": "Tá truailliú plaisteach san aigéan ag imirt drochthionchair ar níos mó ná 267 speiceas ar fud an domhain, 86% de speiceas turtar mara san áireamh.",
    "creaturesvtrash-training-init5": "Lean ort ag traenáil AI cad ba chóir a bheith san uisce.",
    "creaturesvtrash-training-init6": "Maith thú! Dá mhéad sonraí a thugann tú do AI, is ea is fearr a dhéanann sí. Lean ort ag traenáil, nó téigh ar aghaidh nuair a bheidh tú réidh.",
    "creaturesvtrash-predicting-init1": "An gceapann tú go ndéanfaidh AI jab níos fearr anois ag aithint rudaí ar chóir dóibh a bheith san uisce? Fan go bhfeicfimid.",
    "creaturesvtrash-pond-init1": "Bunaithe ar an traenáil a rinne tú, seo duit roinnt rudaí ar cheap AI gur chóir dóibh a bheith san uisce. Conas a d'éirigh léi?",
    "fishshort-words-init1": "Is féidir intleacht shaorga agus meaisínfhoghlaim a úsáid chun patrúin nua a mhúineadh don ríomhaire.",
    "fishshort-words-init2": "Múinimis focal nua do AI trí shamplaí den chineál sin éisc a thaispeáint di.",
    "fishshort-words-training-pause1": "An dóigh leat gur leor an méid sonraí traenála a chonaic AI? Cliceáil Ar aghaidh le fáil amach.",
    "fishshort-words-training-pause2": "Maith thú! Lean ort ag traenáil AI, nó téigh ar aghaidh nuair a bheidh tú réidh.",
    "fishshort-predicting-init1": "Bunaithe ar na sonraí traenála, tá AI in ann iasc a aithint mar “{word}” anois.",
    "fishshort-predicting-init2": "Anois, féachaimis an féidir le AI éisc a aithint mar “{word}”.",
    "fishshort-pond-init1": "Bunaithe ar an traenáil a rinne tú, bhí AI in ann {n, plural,one {an t-iasc seo} two {na héisc seo} few {na héisc seo} many {na héisc seo} other {na héisc seo}} a aithint mar “{word}”. Conas a d'éirigh léi? Is féidir leat tuilleadh traenála a dhéanamh más mian leat torthaí níos fearr a fháil.",
    "fishshort-pond-init2": "Cliceáil an cnaipe eolais le féachaint céard a d'fhoghlaim AI.",
    "fishlong-words-init1": "Anois, féachaimis an bhfuil AI in ann focal nach bhfuil chomh soiléir sin a fhoghlaim.",
    "fishlong-words-init2": "Múinimis focal do AI a bhraitheann ar do thuairim. Is é do rogha féin na héisc a mheaitseálann an focal.",
    "fishlong-training-pause1": "An bhfuil sé féaráilte intleacht shaorga a úsáid chun iasc a mheas ar a chosúlacht? Cé go bhfuil cuma neodrach ar intleacht shaorga, tá an anailís a dhéanann sí bunaithe ar na sonraí traenála. An bhféadfadh sé seo dochar a dhéanamh gan súil leis?",
    "fishlong-training-pause2": "Cabhraíonn tuilleadh sonraí traenála le AI an focal a fhoghlaim. Lean ort ag traenáil.",
    "fishlong-training-pause3": "Foghlaimíonn AI ó gach rogha a dhéanann tú. Lean ort ag traenáil.",
    "fishlong-training-pause4": "An dóigh leat go dteastaíonn tuilleadh sonraí traenála ó AI? Déanann sí níos fearr le go leor sonraí. Lean ar aghaidh nuair a chreideann tú go bhfuil AI réidh.",
    "fishlong-training-many": "M'anam. Mórán iasc atá ann!",
    "fishlong-predicting-init1": "Bunaithe ar na sonraí traenála, tá AI in ann iasc a aithint mar “{word}” anois.",
    "fishlong-predicting-init2": "Anois, féachaimis an féidir le AI éisc a aithint mar “{word}”.",
    "fishlong-pond-init1": "Bunaithe ar an traenáil a rinne tú, bhí AI in ann {n, plural,one {an t-iasc seo} two {na héisc seo} few {na héisc seo} many {na héisc seo} other {na héisc seo}} a aithint mar “{word}”. Conas a d'éirigh léi?",
    "fishlong-pond-init2": "Is féidir leat Tuilleadh Traenála a dhéanamh más mian leat torthaí níos fearr a fháil.",
    "fishlong-pond-init3": "Nó, is féidir leat focal nua a mhúineadh do AI trí Focal Nua a roghnú.",
    "didYouKnow": "An raibh a fhios agat?",
    "continue": "Ar aghaidh",
    "areYouSure": "An bhfuil tú cinnte?",
    "eraseWarning": "Má scriosann tú sonraí AI, caillfidh tú an traenáil a rinne tú go buan. An bhfuil tú cinnte?",
    "erase": "Tá, scrios iad",
    "cancel": "Cealaigh",
    "yes": "Tá",
    "no": "Níl",
    "notWord": "Ní {word} é",
    "run": "Rith",
    "mostImportantParts": "Seo iad na codanna éisc is tábhachtaí:",
    "clickIndividualFish": "Cliceáil iasc amháin lena fhaisnéis a fheiceáil.",
    "mostImportantPartsDescription": "Seo iad na codanna éisc is tábhachtaí le fáil amach an bhfuil an t-iasc “*{word}*” nó “**{notWord}**”.",
    "newWord": "Focal Nua",
    "finish": "Críochnaigh",
    "trainMore": "Tuilleadh Traenála",
    "wordQuestionShort": "Cén cineál éisc ar mhaith leat a aithint le AI?",
    "wordQuestionLong": "Roghnaigh focal nua le múineadh do AI.",
    "isThisFish": "An bhfuil an t-iasc seo {word}?",
    "isThisAFish": "An iasc é seo?",
    "doesThisBelongInWater": "An bhfuil sé ceart go mbeadh sé seo san uisce?",
    "fish": "Iasc",
    "waterCreature": "Ainmhí mara",
    "blue": "Gorm",
    "green": "Uaine",
    "red": "Dearg",
    "circular": "Ciorclach",
    "rectangular": "Dronuilleogach",
    "triangular": "Triantánach",
    "angry": "Feargach",
    "awesome": "Iontach",
    "delicious": "Blasta",
    "endangered": "I mBaol",
    "fast": "Sciobtha",
    "fierce": "Fíochmhar",
    "fun": "Taitneamhach",
    "glitchy": "Fabhtach",
    "happy": "Sona Sásta",
    "hungry": "Ocrach",
    "playful": "Meidhreach",
    "scary": "Scanrúil",
    "silly": "Pleidhciúil",
    "spooky": "Taibhsiúil",
    "wild": "Fiáin",
    "dorsalFins": "eite an droma",
    "pectoralFinsFront": "eití brollaigh",
    "tails": "eireaball",
    "bodies": "corp",
    "scales": "gainní",
    "eyes": "súile",
    "mouths": "béal",
    "colors": "dathanna"
}
