---
title: Завершение Часа кода со вспомогательными технологиями
---

# Завершение Часа кода со вспомогательными технологиями

Любой может попробовать Час кода в течение недели обучения информационным технологиям.

## Использование считывающих с экрана программ

Если вы используете считывающую с экрана программу, данное [кворум обучение для начинающих](https://quorumlanguage.com/hourofcode/astro1.html) или данное [ кворум обучение для комфортного изучения](https://quorumlanguage.com/hourofcode/part1.html)- лучший способ приступить к Часу кода. Кворум начинался как интерпретируемый язык, первоначальная цель которого- быть доступным через считывающие с экрана программы. Он стал языком программирования общего назначения, предназначенным для любого пользователя. И, если вы хотите изучить больше, чем Час кода, у команды кворума есть дополнительные методики и программы обучения.

[![Руководство для начинающих](https://code.org/images/fill-480x360/tutorials/hoc2017/quorum_astronomy.jpg)](https://quorumlanguage.com/hourofcode/astro1.html) [![Руководство для комфортного изучения](https://code.org/images/fill-480x360/quorum.jpg)](https://quorumlanguage.com/hourofcode/part1.html)

## Обучающие видео на сайте Code.org без аудио

Все [обучающие видео на сайте Code.org](https://studio.code.org/courses) могут использоваться как со звуком, так и без него. У всех видео есть субтитры.

## Программирование в парах

Программирование в парах- это инструмент специалиста в сфере информационных технологий, который используется для группового разрешения трудностей. Попробуйте поработать с упражнениями Часа кода с другом или одноклассником. Не забудьте [посмотреть это видео](https://www.youtube.com/watch?v=vgkahOzFH2Q), чтобы узнать лучшие методики для программирования в парах.