{
  "pl-PL": {
    "data": {
      "activity_sections": {
        "98b4c82a-3329-47a1-b2e3-3c46b97c94ba": {
          "name": "Słownictwo kluczowe",
          "description": "-   **hasło**: tajny ciąg liter, symboli i cyfr, który można użyć, aby ograniczyć, kto może uzyskać dostęp do czegoś cyfrowego\n-   **fraz**: grupa słów, które idą razem i są łatwe do zapamiętania\n-   **symbole**: znak inny niż numer lub litera, takie jak #,! lub @.\n-   **nazwa użytkownika**: nazwa, którą tworzysz, aby zalogować się do strony internetowej, aplikacji lub gry\n\n**Przed lekcją**: jako opcjonalna aktywność przed lekcją, uczniowie będą grać w grę [Password Protect](https://www.digitalpassport.org/password-protect.html) w Digital Passport™ przez Edukacja zdrowego rozsądku. Pomoże to wprowadzić kluczowe koncepcje tej lekcji. Aby dowiedzieć się więcej, zapoznaj się z [Digital Paszport Educator Guide](https://d1e2bohyu2u2w9.cloudfront.net/education/sites/default/files/tlr-asset/document-bundled-educator-guide-92018.pdf).\n\n**Ask**: \\_Co to jest coś w twoim życiu, które podejmujesz kroki, aby chronić? Dlaczego i jak go chronisz? \\_ ([Slajd 4](https://docs.google.com/presentation/d/1Pspz89jagbsbDvxndX0ULUKA9PikWMR3zpTSn8Cdjec/edit#slide=id.g3c3d552210_0_3))\n\nNiech uczniowie pomyśleli parair-share, a następnie wezwą uczniów do dzielenia się. Przykłady mogą obejmować _hiding a diary_, _using a lock_, _trzymanie zabawki w bezpiecznym miejscu_ itp Wyjaśnić, że jednym ze sposobów, w jaki ludzie coś chronią, jest ograniczenie, kto może do niego dostęp.\n\n**Ask**: \\_Pomyślmy o tym, kiedy korzystamy z urządzeń, takich jak telefon lub komputer. Jak ograniczyć, kto może uzyskać dostęp do czegoś, co chcesz chronić i dlaczego miałbyś ograniczać dostęp? \\_\n\nPrzykłady mogą obejmować ochronę hasłem, blokadę urządzeń, skaner linii papilarnych, nie pozwalając innym na korzystanie z urządzenia.\n\n**Say**: _Jednym z najczęstszych sposobów ochrony urządzeń i informacji online jest użycie hasła. **hasło** to tajny ciąg liter, symboli i cyfr, którego można używać do ograniczania dostępu do informacji cyfrowych. Niektóre hasła są jednak silniejsze od innych, ponieważ są trudniejsze do wygadania. Sprawdźmy, dlaczego silne hasła są ważne i jak możesz upewnić się, że twoje są mocne._ ([Slide 5](https://docs.google.com/presentation/d/1Pspz89jagbsbDvxndX0ULUKA9PikWMR3zpTSn8Cdjec/edit#slide=id.g3b037fe8d8_1_103))"
        },
        "8cf957f8-37f2-423d-aa96-b094d407b823": {
          "description": "**Say**: _Konsekwencje, o których właśnie rozmawialiśmy, mogą wydawać się przerażające. Ale jest coś, co możesz zrobić, aby upewnić się, że nikt nigdy nie zgadnie twojego hasła. Oto kilka ważnych kroków, aby zasiać hasło._\n\n**Dystrybutu** i wyśleć informacje [Zasilaj swoje hasło dla studentów](https://drive.google.com/open?id=1ihf7K4Kjupe3C0wrzzgUa-a9paNserfCfMAS2oj7178). Say: _Jednym ze sposobów tworzenia silnego hasła jest rozpoczęcie od pamiętnej frazy. **zwrot** to grupa słów, które idą w parze i są łatwe do zapamiętania. Będziemy ćwiczyć razem używając frazy „Nie ma mowy, żebym całował żabę”. Więc już ukończyliśmy krok pierwszy, który ma wymyślić frazę._ ([Slajd 7](https://docs.google.com/presentation/d/1Pspz89jagbsbDvxndX0ULUKA9PikWMR3zpTSn8Cdjec/edit#slide=id.g3cf30f4dfd_1_114))\n\n**Zaproś studenta** do przeczytania kroku drugiego. Zapytaj: \\_Jakie słowo będzie nasze przykładowe wyrażenie? \\_ Zaproś ucznia, aby odpowiedział i dodał „tnwikaf” na przewidywanym jałmużny.\n\n\\*\\*Powtórz kroki od 3 do 5: czytanie kroku na głos, wezwanie uczniów do odpowiedzi i ukończenie sekcji „Runda treningowa” w jałmużnie. Odpowiedzi uczniów będą się różnić, ponieważ uczniowie wybierają wielką literę i wstawiają różne liczby. W razie potrzeby wyjaśnij, że uczestnicy kursu mogą wstawiać numery w dowolnym miejscu hasła.\n\n**Say**: \\_Teraz postępujesz zgodnie z poniższymi krokami, aby wymyślić własne hasło. Pracuj niezależnie, aby ukończyć sekcję „Twoja kolej” w artykule. \\_ Pozwól studentom pięć minut na ukończenie jałmużny."
        },
        "c3da2b37-ba64-4067-99af-4310c81a0597": {
          "description": "**Project** **Póki hasła** i przeczytaj je na głos. Skieruj uczniów, aby wypełnić puste miejsca na ich jałmużny podczas ich czytania. W przypadku ostatniej wskazówki wyjaśnij, że **symbole** jest znakiem _a innym niż cyfra lub litera, np. #,! lub @._ ([Slide 8](https://docs.google.com/presentation/d/1Pspz89jagbsbDvxndX0ULUKA9PikWMR3zpTSn8Cdjec/edit#slide=id.g3d416ba77f_0_21))\n\n**Say**: _Gdy dorośniesz, mocne hasło stanie się jeszcze ważniejsze. Hasła pomogą Ci chronić profile portali społecznościowych, gdy jesteś w szkole średniej, zachować swoje oceny prywatne, gdy jesteś na studiach i chronić swoje konta bankowe i konta w sklepie internetowym, gdy jesteś dorosły._\n\n\\*\\*Uczniowie ukończyli [Quiz lekcji](https://docs.google.com/forms/u/2/d/1OBS37DZUmIxM4ZciCD6qWFMam3_u8djgZNJd9IOK6Zs/copy)."
        },
        "f6644cab-25cc-4dbd-935b-570b653f7291": {
          "description": "Oto dodatkowe zasoby, które możesz zapewnić uczniom, aby zwiększyć ich naukę:\n\n-   [Działalność rodzinna](https://drive.google.com/open?id=1jzZbfj0Y1GJa6WWTHp2EEzr7t0m-Hof-qIb-QLiAcpA)\n-   [Porady rodzinne](https://www.commonsense.org/education/family-tips/k-5-privacy-and-security)\n-   Ułatwienie związane BeaKoutedu gra, która została współtworzona z Common Sense Education, o nazwie [Lip Sync Revenge](https://platform.breakoutedu.com/game/lip-sync-revenge)! Aby uzyskać dostęp do gry i powiązanych zasobów, musisz utworzyć bezpłatne konto."
        },
        "0661508e-1aa3-488f-8064-beaec4c40e7a": {
          "name": "Przemyśl"
        },
        "835c16c0-8a24-43c1-889b-493814eb50d1": {
          "name": "Słownik",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Pokaz**: Wyświetl slajd „Słownictwo”\n\n-   **Algorytm** — lista kroków do ukończenia zadania.\n-   **Program** - Algorytm zakodowany tak, aby mógł być wykonany przez maszynę."
        },
        "d80d3591-db5f-43bb-b3be-3a0eb14690a7": {
          "name": "Wstęp"
        },
        "61f2eb20-0ecb-4319-8ea7-5a9210a1c406": {
          "name": "Programowanie na papierze milimetrowym",
          "progression_name": "Programowanie na papierze milimetrowym — Aktywność bez komputera"
        },
        "78086b29-2d45-4172-91f8-a56000ef094c": {
          "description": "_Oto obraz. Udawaj, że jestem robotem z automatyczną maszyną do realizacji (ARM). Są to jedyne instrukcje, które zrozumieć._\n\n\\_Zaczynając w lewym górnym rogu, poprowadź moje ARM głośno swoimi słowami. \\_"
        },
        "be35d4b6-5785-44f3-9d9b-158e356ebb0d": {
          "tips": [
            "Zauważ, że napisaliśmy nasz program od lewej do prawej, tak jak można przeczytać książkę w języku angielskim. Niektórzy uczniowie preferują tę metodę. Inni lubią rozpoczynać każdą linię siatki na nowej linii papieru. Sposób, w jaki piszą swój program, nie ma znaczenia tak bardzo, jak inni ludzie w ich grupach mogą podążać za sobą!"
          ]
        },
        "711dd3c2-55d7-4e71-8714-fea9ceb6cb4a": {
          "name": "Refleksja",
          "tips": [
            "Takie monity o odbicie mogą być uzupełniane w różnych stylach. Dziennikarstwo lub dyskusja (z grupami lub partnerami) to świetne opcje!"
          ]
        },
        "88774581-810b-4ffd-9baf-292c584f9a3e": {
          "description": "Użyj tych ćwiczeń, aby urozmaicić naukę uczniów. Można je wykorzystać do zajęć pozalekcyjnych albo w ramach urozmaicenia innego rodzaju\n\n**Coraz lepiej**\n\n-   Niech twoja klasa spróbuje wymyślić swoje własne obrazki. \n-   Czy jesteś w stanie wymyślić, jak zaprogramować obrazki, które oni tworzą? \n\n**Wyzwanie dla klasy**\n\n-   Jako nauczyciel narysuj obrazek na siatce 5 x 5. \n-   Czy klasa może zakodować to z Tobą?"
        },
        "96499db1-0002-4488-b370-2d718a5c90ec": {
          "name": "Przemyśl"
        },
        "c10c099e-fd94-4a79-9bd6-bfc55b2b1059": {
          "name": "Słownik",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Pokaz**: Wyświetl slajd „Słownik”\n\nTa lekcja zawiera następujące ważne słowa ze słownika:\n\n-   **Błąd** — błąd w programie, który uniemożliwia działanie programu zgodnie z oczekiwaniami.\n\n-   **Debugowanie** - Znajdowanie i naprawianie błędów w programach.\n\n-   **Pętla** – Akcja polegająca na powtarzaniu czegoś\n\n-   **Program** - Algorytm zakodowany tak, aby mógł być wykonany przez maszynę.\n\n-   **Programowanie** - Sztuka tworzenia programu."
        },
        "6dfc4361-cbe9-45f2-ad11-441b8c3afe5c": {
          "description": "Działanie to pomoże wprowadzić niepodłączone koncepcje z „Programowanie papieru wykresowego” do świata online, do którego uczniowie się przenoszą."
        },
        "802031af-637b-4e3d-bb6f-afee7b4454fa": {
          "name": "Podgląd zagadek online jako klasy"
        },
        "e4ac7ebe-4d89-46ca-a2a6-f0e819658e21": {
          "name": "Zagadki online",
          "tips": [
            "Pokaż uczniom właściwy sposób, aby pomóc kolegom z klasy:\n\n-   Nie siedź na krześle kolegi\n-   Nie używaj klawiatury kolegów z klasy\n-   Nie dotykaj myszy kolegów z klasy\n-   Upewnij się, że kolega z klasy może opisać rozwiązanie na głos, zanim odejdziesz"
          ]
        },
        "79e56cc4-0f1e-4c7f-a06d-9634f7e2c816": {
          "description": "Nauczyciele odgrywają istotną rolę w edukacji informatyki i wspierają wspólne i żywe środowisko klasowe. Podczas zajęć online rola nauczyciela jest przede wszystkim zachętą i wsparciem. Lekcje online mają być skoncentrowane na studentach, więc nauczyciele powinni unikać wchodzenia, gdy uczniowie utkną. Niektóre pomysły na to, jak to zrobić, to: \n\n-   Wykorzystanie Pair Programming, gdy tylko jest to możliwe podczas aktywności.\n-   Zachęcaj studentów z pytań/wyzwaniami do rozpoczęcia od pytania partnera.\n-   Pytania bez odpowiedzi można eskalować do pobliskiej grupy, która może już znać rozwiązanie.\n-   Niech uczniowie opisują problem, który widzą. Co to ma robić? Co to robi? Co ci to mówi?\n-   Przypomnij sfrustrowanym uczniom, że frustracja jest krokiem na drodze do nauki i że wytrwałość się opłaci.\n-   Jeśli uczeń nadal utknie po tym wszystkim, zadaj wiodące pytania, aby student samodzielnie wykrył błąd."
        },
        "2437214a-2077-4e3c-b231-e943e66a693f": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Pokaz**: Wyświetl film „Wprowadzenie do labiryntu: programowanie z użyciem bloków”",
          "progression_name": "Film: Wprowadzenie do labiryntu: Programowanie za pomocą bloków"
        },
        "4e14f7ca-7b1a-4769-ae57-9f128722a0dd": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Pokaz**: Wyświetl slajd “Poziom 2-7 - Budowanie umiejętności”",
          "progression_name": "Budowanie umiejętności"
        },
        "8e887047-0b51-46cf-8c62-4ef56d1b58c0": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Pokaz**: Wyświetl slajd \"Poziom 8-10 - Wyzwanie”"
        },
        "aa5e1de6-0f8d-4e95-82cc-da2f38e8a9ad": {
          "name": "Refleksja",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Pokaz**: Wyświetl slajd “Rozważ”\n\n**Rozważ**\n\n-   _Dlaczego ważne jest programowanie bloków w określonej kolejności?_"
        },
        "f5627332-703a-420b-ab72-660c350b87d9": {
          "name": "Przemyśl",
          "tips": [
            null
          ]
        },
        "5dbc43b8-f734-4c93-99d4-0995393a9f25": {
          "name": "Słownik"
        },
        "3ab2b28c-3947-44d9-ae6d-8d8d43320c27": {
          "name": "Wstęp",
          "description": "Przypomnijmy, że w „Graph Paper Programming” prowadziliśmy automatyczną Realizacja Maszyną (ARM) naszego kolegi za pomocą strzałek. Ta rozgrzewka przywróci te pomysły, które będą potrzebne w głównej działalności."
        },
        "02a52fe1-85a9-4a07-83a8-5469bf8ac7e6": {
          "tips": [
            "##### Porady, aby pomóc z frustracją\n\n-   Policz do 10\n-   Weź głębokie oddechy\n-   Dziennik o nich\n-   Porozmawiaj z partnerem o nich\n-   Poproś o pomoc\n\n##### Wskazówki dotyczące bycia trwałym\n\n-   Śledź to, co już próbowałeś\n-   Opisz, co się dzieje\n-   Opisz, co ma się zdarzyć\n-   Co ci to mówi?\n-   Dokonaj zmiany i spróbuj ponownie"
          ]
        },
        "29bbe8ac-7f83-407e-ad63-4fe434d80d1d": {
          "name": "Sztafeta programowania",
          "progression_name": "Programowanie przekaźników — Aktywność bez komputera"
        },
        "ca6597d4-2706-400e-9584-c644d696ddf6": {
          "description": "Z myślą o programowaniu papieru grafowego, nadszedł czas, aby podzielić się na zespoły i przygotować się do prowadzenia działalności jako przekaźnik!  \n\n**Ustawianie: \\*\\* Przygotuj pakiet aktywności**, drukując jeden egzemplarz dla każdego zespołu 4-5 uczniów. Wytnij lub złóż każdą stronę wzdłuż środkowej linii kropkowanej."
        },
        "a7cadd06-1f56-42b5-a5b0-b623a57e1fcd": {
          "tips": [
            "Oto kilka wyjaśnień, które należy udostępniać od czasu do czasu:\n\n-   Tylko jedna osoba z każdej grupy może znajdować się na obrazie w tym samym czasie.\n-   Jest w porządku, aby omówić algorytmy z resztą grupy w kolejce, nawet do momentu planowania, kto będzie pisać co, gdy dotrą do obrazu.\n-   Kiedy student debubuje program, przekreślając nieprawidłową instrukcję (lub grupowanie nieprawidłowych instrukcji), liczy się to jako cała ich kolej. Następny gracz będzie musiał dowiedzieć się, jak poprawić usunięty element."
          ]
        },
        "77e44b0c-4a6a-4eca-9347-a3395aefd2df": {
          "name": "Refleksja"
        },
        "0c752c58-d938-43f6-ac3c-a9b4556d12db": {
          "name": "Wstęp"
        },
        "dfa65e02-82a9-498c-b437-8db31c60b83b": {
          "name": "Niepodłączona aktywność z blokami papieru",
          "description": "Podziel swoją klasę na zespoły 3-5 i przejdź na dużą przestrzeń. Ta przestrzeń może być na siłowni lub na zewnątrz. W kolejce te zespoły jak w „Programowanie przekaźnikowe”. Wybierz półtrudny projekt z **\\\\ \\*Activity Packet**. Wyświetl ten projekt na końcu dużej odległości między każdą drużyną. Wraz z wyświetlaczem, zapewnić każdemu zespołowi wystarczającą ilość bloków papieru od **\\\\ \\*Manipulacje**. Każda drużyna będzie potrzebować wielu bloków `fill 1` i `move ___`. Bloki `move ___` można wypełnić przed czasem lub wypełnić w trakcie gry. Tak czy inaczej, upewnij się, że te bloki są prawidłowo zdefiniowane, gdy gra się rozgrywa.\n\nGdy wszystkie zespoły są ustawione w kolejce, wyświetl lub przeczytaj następujące zasady:\n\n-   Pierwszy uczeń w kolejce dostaje przejechać do obrazu, przejrzeć go i umieścić pierwszy blok kodu w programie, aby odtworzyć ten obraz.\n-   Pierwszy uczeń następnie biegnie z powrotem i oznacza kolejną osobę w kolejce, a następnie przechodzi do tyłu kolejki.\n-   Następna osoba w linii kreski do obrazu, przegląda obraz, przegląda program, który został już napisany, a następnie debubuje program, wyjmując nieprawidłowy blok kodu lub dodaje nowy blok w. Uczeń następnie wraca, aby oznaczyć kolejną osobę, a proces trwa do momentu zakończenia programu przez jedną grupę.\n\nUpewnij się, że uczniowie używają tylko bloków `fill 1` lub `move ___` i umieszczają tylko jeden w dół na turę. Pierwsza drużyna, która _correctly_ wypisze kod dla swojego obrazu, wygrywa.\n\n#### -lub-"
        },
        "abadfc80-b903-49eb-bbd0-19b5ac76613b": {
          "name": "Podgląd zagadek online jako klasy",
          "description": "Grupuj uczniów w zespoły po 3. Wybierz zagadkę z lekcji. Zalecamy piątą układankę. Niech uczniowie z każdego zespołu siedzą przy komputerze z wyświetlaną układanką. Każdy zespół otrzymuje tylko jeden komputer i tylko jeden uczeń może patrzeć na ekran. Wyświetl lub przeczytaj następujące zasady:\n\n-   Tylko jeden uczeń w każdej drużynie może spojrzeć na ekran. \n-   Ta osoba może usuwać lub dodawać tylko jeden blok naraz. Gdy ta osoba doda lub usunęła blok, może dotknąć ramienia następnej osoby.\n-   Następna osoba może przystąpić do gry na swoją kolej.\n-   Żadne obroty nie mogą być pominięte lub powtarzane, każdy musi grać równą kwotę.\n\nPierwsza drużyna, która zakończy układankę _correctly_, wygrywa!"
        },
        "c2a66127-5945-47ec-938a-f396824349a7": {
          "name": "Debugowanie z Laurel",
          "description": "To może być pomocne dla studentów, aby usiąść ze swoimi zespołami z zajęć pomostowych. Każdy uczeń powinien pracować nad tymi zagadkami indywidualnie lub parami, ale posiadanie ściśle zdruzanej grupy do zadawania pytań i odpowiedzi na pytania może pomóc w rozwijaniu zaufania i zrozumienia z tematem."
        },
        "bb78ee6d-4d05-4a4b-90e8-7c6cb6a099dd": {
          "progression_name": "Film: Debugowanie za pomocą przycisku Krok "
        },
        "7e3632b0-108a-4179-adf0-89a8e204b031": {
          "progression_name": "Budowanie umiejętności"
        },
        "9280e14f-90c1-467a-ab01-b3a0d7d42415": {
          "name": "Refleksja"
        },
        "037b9c5d-7263-4bb9-aef3-f818cd3d71d6": {
          "name": "Wstęp"
        },
        "5b25dba2-c68c-43c3-814f-98e4e743cf7f": {
          "name": "Zdarzenia w Bounce",
          "progression_name": "Budowanie umiejętności"
        },
        "16d61ffc-4200-4a4d-b11e-6fffb02ab38b": {
          "progression_name": "Czas na zabawę"
        },
        "77973449-e6b7-4855-a2cc-1db18970a8e0": {
          "description": "#### Online Puzzle\n\nNa końcu zestawu zagadek uczniowie będą mieli okazję, aby ich gra była wyjątkowa. Niech uczniowie wypróbują nowych sposobów, aby gra była bardziej wymagająca. Na przykład spróbuj grać z wieloma kulkami naraz lub za każdym razem, gdy piłka odbija się od ściany, uruchom więcej piłek.",
          "tips": [
            "Przypomnij uczniom, aby dzielili się swoją pracą tylko z bliskimi przyjaciółmi lub rodziną. Aby uzyskać więcej informacji obejrzyj lub pokaż klasę**\\\\ \\*Pause and Think Online** - Video."
          ]
        },
        "6483e0eb-3cdc-45fd-b834-207388a3586a": {
          "name": "Jak zdarzają się wydarzenia",
          "tips": [
            "Chociaż wprowadzone w tej lekcji, pokład slajdów \\*\\*\\\\ \\*Wydarzenia w Bounce - Jak to się dzieje? \\*\\* mogą być stosowane bardziej ogólnie w celu wyrażenia relacji między sprzętem a oprogramowaniem. W szczególności końcowy slajd upraszcza sekwencję wejścia-wyjścia i może zostać przekształcony w plakat do klasy."
          ]
        },
        "2f692035-15cf-4b35-b975-b860a75d39e8": {
          "description": "#### Zabierz mnie do gry w piłkę\n\nZabierz uczniów na zewnątrz, aby zagrać w jakąś grę w piłkę. Śledź wydarzenia i działania. Na przykład, nie dryblowanie w koszykówce powoduje faul podróży, a druga drużyna dostaje piłkę. W piłce nożnej, wyrzucanie piłki poza granice powoduje, że druga drużyna kopie piłkę w. Uzyskanie piłki do bramki skutkuje w pewnym momencie! Ułóż więcej wydarzeń, jeśli twoi uczniowie są do tego. Niech wszyscy uczniowie krzyczą „Yippee”, gdy kapitan jednej drużyny zdobędzie punkt. Niech wszyscy upadną na ziemię i toczą się, jeśli uczeń robi dwa cele z rzędu!"
        },
        "69b11f21-6d15-4588-b64d-ac6844a7763a": {
          "description": "### Dzień gry Komentarz (45-60 minut)\n\n![](https://curriculum.code.org/media/uploads/elaSmall.png) ![](https://curriculum.code.org/media/uploads/mathSmall.png) ![](https://curriculum.code.org/media/uploads/scienceSmall.png) **Nauka komputerowa + Język angielski Arts + Matematyka + Nauka**\n\n[Komentarz dnia gry](https://docs.google.com/document/d/1wdBbcgvYXN3GgA1Y2nJjloGosfLxhhWKhUpbQtZPCP0/edit#) jest opcjonalnym działaniem dostosowanym do Common Core ELA, Common Core Math i Next Generation Science Standards, napisanym przez naszą społeczność nauczycieli. W tej aktywności uczniowie będą czytać na głos instrukcje, ucząc się kodować z wydarzeniami w Bounce, aby stworzyć grę. Po zakończeniu gry uczniowie dostarczą komentarz play-by-play, ponieważ ich koledzy z klasy przewidują, w jaki sposób piłka będzie odbijać, aby zdobyć wynik. Uczniowie ukończą również model Frayer o wykresach słupkowych przed utworzeniem skalowanego wykresu słupkowego przy użyciu danych zebranych podczas gry.\n\n_Standards Addressed:_\n\n-   \\*\\*CCSS.ELA-LITERACY.RF.3.4: \\*\\* Przeczytaj z wystarczającą dokładnością i płynnością, aby wspierać zrozumienie.\n\n-   \\*\\*CCSS.ELA-LITERACY.SL.3.4: \\*\\* Zgłoś się na temat lub tekst, opowiedz historię lub przeliczyć doświadczenie z odpowiednimi faktami i odpowiednimi, opisowymi szczegółami, mówiąc wyraźnie w zrozumiałym tempie.\n\n-   \\*\\*CCSS.MATH.CONTENT.3.MD.B.3: \\*\\* Narysuj skalowany wykres obrazu i skalowany wykres słupkowy, aby reprezentować zbiór danych z kilkoma kategoriami. Rozwiąż jedno- i dwuetapowe „ile więcej” i „ile mniej” problemy, korzystając z informacji przedstawionych na skalowanych wykresach słupkowych. \n\n-   \\*\\*NGSS.3-PS2-2: \\*\\* Dokonaj obserwacji i/lub pomiarów ruchu obiektu, aby przedstawić dowody, że wzór może być użyty do przewidywania ruchu w przyszłości. "
        },
        "ea99adc6-d611-4d13-9da7-04fcb43c6df3": {
          "name": "Przemyśl",
          "tips": [
            "Jeśli nie jesteś pewien, czy odpowiedź ucznia opisuje zdarzenie, spróbuj przełamać odpowiedź. Czy istnieje akcja i odpowiedź?\n\nNa przykład:\n\n-   Przekroczenie mety i posiadanie na ekranie znaków gratuluję\n-   Znalezienie dużego garnka skarbów (lub innego przedmiotu) i oglądanie zapasów rosną\n-   Kupowanie nowych przedmiotów w sklepie gry i posiadanie przedmiotu do użycia\n-   Naciśnięcie przycisków na kontrolerze gier i posiadanie postaci zrobić coś fajnego"
          ]
        },
        "6c45fccd-0b3b-4db0-9224-2dce4fee891a": {
          "name": "Słownik"
        },
        "b7541d65-dbb6-4402-8392-0a1416e131d5": {
          "name": "Wstęp"
        },
        "77c010a8-6312-4f5a-a39a-ba6c761ba9ce": {
          "name": "Zbuduj grę Star Wars",
          "progression_name": "Film: Projekt Gwiezdne Wojny"
        },
        "eb787c9f-ed60-4591-ab5f-b76a25cf26b3": {
          "progression_name": "Budowanie umiejętności"
        },
        "cda08e32-7472-46e5-900d-947542cde40e": {
          "tips": [
            "Przypomnij uczniom, aby dzielili się swoją pracą tylko z bliskimi przyjaciółmi lub rodziną. Aby uzyskać więcej informacji obejrzyj lub pokaż klasę: \n\n**\\\\ \\*Pause and Think Online** - Video."
          ],
          "progression_name": "Czas na zabawę"
        },
        "2f77a890-cf45-4d1a-a4ca-d12e723d8d6f": {
          "name": "Refleksja"
        },
        "87103c82-3389-4983-b9dd-d8ecce58ed92": {
          "name": "Budowanie atmosfery",
          "description": "Powitaj uczniów na zajęciach i krótko przedstaw, co dziś będziecie robić."
        },
        "9014dbe4-b770-43d6-aef5-77cf1e032bb9": {
          "tips": [
            "Jeśli masz czas i chcesz przygotować swoich uczniów z niepodłączoną aktywnością, rozważ dostarczenie **\\\\ \\*Dance Party: Unplugged** przed tą lekcją. Ta krótka lekcja wprowadza uczniów do idei wydarzeń wywołujących różne ruchy taneczne."
          ]
        },
        "7c5f7ed0-8e92-4943-8403-033e846373a0": {
          "name": "Przemyśl"
        },
        "607ec054-729f-402a-9c5b-2adba3adb822": {
          "description": "Dzisiaj zrobimy coś bardzo kreatywnego. Jaka jest wasza ulubiona forma kreatywności?"
        },
        "62aac1c8-7601-454f-be68-0e7f16664f69": {
          "description": "Zachęcaj uczniów, aby dzielili się informacją, jak się twórczo wyrażają w sztuce, tańcu, muzyce czy pisaniu."
        },
        "b272663e-4596-4ddd-b25e-b3a5a0c165f7": {
          "name": "Słownik"
        },
        "4183cc0f-f87e-4c3b-80e8-9b849d0aba39": {
          "name": "Wstęp"
        },
        "1787bc40-73cb-4be2-baac-bc013ef2107e": {
          "name": "Koduj własną imprezę taneczną",
          "description": "#### Filtrowanie muzyki\n\nTen poradnik zawiera utwory od popularnych artystów. Aby wyświetlić podgląd listy utworów w tym samouczku, zapoznaj się z poniżej\\*\\*\\\\ \\*Listą odtwarzania Spotify. Używamy radiowych wersji wszystkich utworów, a dla uczniów poniżej 13 roku życia ograniczamy muzykę do tej filtrowanej listy. Jeśli chcesz korzystać z filtrowanej listy ze starszymi uczniami, możesz udostępnić swoją klasę \\*\\*\\\\ \\*Listę odtwarzania Spotify."
        },
        "6b622947-8880-4d2d-8cb2-ed13f13a63c9": {
          "name": "Poziom pomocy technicznej według poziomu",
          "progression_name": "Film:: Rozgrzewka "
        },
        "4d7270ba-f9ba-4089-b9c1-0448f6eead69": {
          "progression_name": "Ćwiczenia"
        },
        "c9ed59ff-70e5-4915-b258-f37aae334833": {
          "progression_name": "Film: Zdarzenia"
        },
        "715c15b8-ce05-4be2-a6e3-63c7addc5abf": {
          "progression_name": "Zdarzenia"
        },
        "ea2f2503-ce0e-4498-a269-25b1d203fbe4": {
          "progression_name": "Film: Takty"
        },
        "d9624c03-8570-4129-a205-a8f6ca582aed": {
          "progression_name": "Takty"
        },
        "f477b11f-b8b9-46b2-905c-f29eb3377cfc": {
          "progression_name": "Film: Wściwości"
        },
        "617957c6-14b8-4db6-8018-1f81a191b624": {
          "progression_name": "Właściwości"
        },
        "63a3dd77-4375-473b-baa6-45c56d551354": {
          "tips": [
            "W tym momencie lekcji można zauważyć, że instrukcje mają mniej nakazowy charakter. Zachęcaj uczniów, by wykazywali się kreatywnością i badali nowe, wprowadzane bloki. Od tej chwili kod ucznia pozostaje **niesprawdzony w kontekście poprawności** w celu zachęcania do eksperymentowania zamiast rozwiązywania konkretnego zadania."
          ]
        },
        "b8360827-fb73-4afe-ae5d-ee12b5ed6dde": {
          "progression_name": "Film: Podsumowanie"
        },
        "3e984275-638c-49e0-afb6-fc959cd05771": {
          "progression_name": "Czas na zabawę"
        },
        "92a12478-0870-4331-a034-b5f1ed4164af": {
          "progression_name": "Dodatki do Lekcji"
        },
        "3bda4943-2f46-49ef-b85c-3da70c805c16": {
          "name": "Refleksja"
        },
        "2c20e776-eba9-4b67-b0f1-f539ddcccf13": {
          "name": "Ocena opcjonalna",
          "description": "Poproś uczniów, aby dodali swoje karteczki samoprzylepne \"Notatki\" lub karty z notatkami do Twojej mapy myśli \"Informatyka\" wychodząc po zajęciach. Spróbuj zapełnić planszę wieloma pomysłami na temat tego, czym jest informatyka i dlaczego ma takie znaczenie."
        },
        "19085421-a961-434d-8cca-783977387177": {
          "description": "### Przetrwanie tancerzy (45-60 minut)\n\n![](https://curriculum.code.org/media/uploads/scienceSmall.png) \n\\*\\*Informatyka + Nauka \\*\\*\n\n[Przetrwanie tancerzy](https://docs.google.com/document/d/1F1E-qPyfnh7HV1euIjsRX01PZMhbOAA0q447FqRdefo/edit?usp=sharing)  jest opcjonalną aktywnością dostosowaną do Standardy nauki nowej generacji, napisane przez naszą społeczność nauczycieli. Korzystając z Dance Party, uczniowie wybierają co najmniej jeden organizm (tancerz), który doskonale nadaje się do środowiska (świata), które tworzą. Studenci są zachęcani do korzystania z bloków kodu „właściwości”, aby dostosować charakterystykę każdego organizmu (tancerza). \n\n_Standards Addressed:_\n\n-   \\*\\*NGSS.3-LS4-2: \\*\\* Użyj dowodów, aby skonstruować wyjaśnienie, w jaki sposób różnice w charakterystyce wśród osobników tego samego gatunku mogą zapewnić korzyści w przeżyciu, znajdowaniu kolegów i rozmnażaniu. \n\n-   \\*\\*NGSS.3-LS4-3: \\*\\* Zbuduj argument z dowodami, że w danym środowisku niektóre organizmy mogą przetrwać dobrze, niektóre przetrwają mniej dobrze, a niektóre w ogóle nie przetrwają. \n\n-   \\*\\*OPTIONALNE ROZWIĄZENIE: NGSS.3-LS4-4: \\*\\* Złóż oświadczenie o zaletach rozwiązania problemu spowodowanego zmianami środowiska, a rodzaje roślin i zwierząt, które tam żyją mogą ulec zmianie."
        },
        "bcde2562-834f-4054-9106-c9f0ff082258": {
          "name": "Wprowadzenie do Pętli"
        },
        "23874ed2-c11c-4626-93ce-738a948d9467": {
          "name": "Pętle w Epoce Lodowcowej"
        },
        "d9fbe733-657b-4504-8dbb-eab8104168aa": {
          "progression_name": "Budowanie umiejętności"
        },
        "b0695358-20ba-4446-aa75-c0f5657059de": {
          "progression_name": "Film: Stosowanie bloku powtórzeń"
        },
        "d278b098-4bb0-4e0e-94b2-030bcfdc25bb": {
          "progression_name": "Budowanie umiejętności"
        },
        "8a2827d2-9dd0-4b84-9694-f7f4733543d5": {
          "progression_name": "Wyzwanie"
        },
        "41598a45-8c65-4392-a301-07c4a61a2abd": {
          "progression_name": "Ćwiczenia"
        },
        "e26c0781-e8ca-4864-ab22-1af5ce60b1f4": {
          "progression_name": "Dodatki do Lekcji"
        },
        "31073c5d-beaf-420a-af98-4aa468a7b9d4": {
          "tips": [
            "Pokaż uczniom sposób _right_, aby pomóc kolegom z klasy przez:\n\n-   Nie siedź na krześle kolegi z klasy.\n-   Nie używaj klawiatury kolegi z klasy.\n-   Nie dotykaj myszy kolegi z klasy.\n-   Upewnij się, że kolega z klasy może opisać rozwiązanie na głos przed odejściem"
          ]
        },
        "426a591c-ec85-48bf-9864-5f909eafa458": {
          "description": "\\*\\*Krążenie: \\*\\* Nauczyciele odgrywają istotną rolę w edukacji informatyki i wspierają wspólne i żywe środowisko klasowe. Podczas zajęć online rola nauczyciela jest przede wszystkim zachętą i wsparciem. Lekcje online mają być skoncentrowane na studentach, więc nauczyciele powinni unikać wchodzenia, gdy uczniowie utkną. Niektóre pomysły na to, jak to zrobić, to: \n\n-   Wykorzystanie **\\\\ \\*Pause and Think Online** Video, gdy tylko jest to możliwe.\n-   Zachęcaj studentów z pytań/wyzwaniami do rozpoczęcia od pytania partnera.\n-   Pytania bez odpowiedzi można eskalować do pobliskiej grupy, która może już znać rozwiązanie.\n-   Przypomnij uczestnikom kursu o skorzystaniu z procesu debugowania przed podejściem.\n-   Niech uczniowie opisują problem, który widzą. Co to ma robić? Co to robi? Co ci to mówi?\n-   Przypomnij sfrustrowanym uczniom, że frustracja jest krokiem na drodze do nauki i że wytrwałość się opłaci.\n-   Jeśli uczeń nadal utknie po tym wszystkim, zadaj wiodące pytania, aby student samodzielnie wykrył błąd."
        },
        "cbecc5ae-dfcc-4d98-8eea-4366ee0eade0": {
          "name": "Refleksja"
        },
        "68be7923-5ba2-46af-a379-052f2bd04142": {
          "description": "Użyj tych działań, aby usprawnić naukę uczniów. Mogą być używane jako poza zajęciami klasowymi lub innym wzbogacaniem.\n\n\\*\\*Więc Moving\n\n-   Daj studentom zdjęcia działań lub ruchów tanecznych, które mogą zrobić.\n    -   Studenci organizują ruchy i dodają pętle do choreografu własnego tańca.\n-   Podziel się tańcami z resztą klasy.\n\n**Połącz It Back**\n\n-   Znajdź kilka filmów z YouTube popularnych tańców, które się powtarzają.\n-   Czy Twoja klasa może znaleźć pętle?\n-   Spróbuj tego samego z piosenkami!"
        },
        "6169bc3a-deb5-4c4f-9860-10ba26c60214": {
          "name": "Wstęp",
          "description": "Studenci powinni mieć wprowadzenie do pętli w tym momencie. W oparciu o to, z czego myślisz, że twoja klasa może skorzystać, zalecamy:\n\n-   Przegląd zagadki z ostatniej lekcji\n-   Podgląd zagadki z tej lekcji\n\nKażda z nich powinna pomóc przygotować klasę do zabawy zagadki online!"
        },
        "b232d54d-74fd-4360-bf15-83f2cd03f717": {
          "description": "#### Online Puzzle\n\nNiektórzy uczniowie mogą odkryć, gdzie dodać `repeat` pętle, pisząc program bez pętli, a następnie krążąc fragmenty powtórzeń. Jeśli uczniowie z twojej klasy wydają się, że mogą z tego skorzystać, niech trzymają papier i ołówki przy swoich komputerach. Uczniowie mogą również cieszyć się rysowaniem niektórych kształtów i figur na papierze podczas programowania online."
        },
        "bc19ceeb-4c22-40a1-9794-7b0e998b5e78": {
          "name": "Rysowanie kształtów przy pomocy pętli",
          "progression_name": "Film: Artysta wprowadzenie z JR Hildebrand"
        },
        "61fa4607-bb88-4573-8bea-10a12e88181a": {
          "progression_name": "Budowanie umiejętności"
        },
        "5f35a867-9366-4759-b0e8-be48c34c09c5": {
          "progression_name": "Film: Pętle z Artystą"
        },
        "f52282b3-cfad-49a9-a004-5297a4ca7bbc": {
          "progression_name": "Budowanie umiejętności"
        },
        "f83fde9f-a2d7-4f99-94fb-ac2fc9b79352": {
          "progression_name": "Wyzwanie"
        },
        "3f3774e2-c8fa-4318-9e6e-d58f6983e746": {
          "progression_name": "Ćwiczenia"
        },
        "3315af90-e8ff-4568-813e-2b743e90bf30": {
          "progression_name": "Dodatki do Lekcji"
        },
        "9783ff04-38bf-4b15-8993-bac43ed681b2": {
          "name": "Refleksja"
        },
        "9fe5d0e9-dadb-4541-9ebb-5eaa1acc5883": {
          "name": "Wstęp"
        },
        "2d76e0dc-c660-40b1-b975-d6f00ad0edbf": {
          "name": "Zagnieżdżone pętle w labiryncie",
          "description": "Zalecamy programowanie par dla tej lekcji. Może to nie być łatwy temat dla większości uczniów. Praca z partnerem i dyskusja na temat potencjalnych rozwiązań zagadek może złagodzić umysły uczniów.\n\nPonadto, mają papier i ołówki w pobliżu, aby uczniowie wypisali swój plan przed kodowaniem. Niektóre zagadki mają limit liczby niektórych bloków, których możesz użyć, więc jeśli uczniowie lubią pisać długą odpowiedź, aby znaleźć powtórzenia, papier może być przydatny."
        },
        "0f7a9d4d-e15d-4efc-a408-644c06c8fcb2": {
          "progression_name": "Budowanie umiejętności"
        },
        "5458d92e-83cc-46e8-8197-4d025e3e090f": {
          "progression_name": "Film: zagnieżdżone pętle z pszczółką "
        },
        "da706b15-71f6-47dd-a6de-f113b509684c": {
          "progression_name": "Przewidywanie"
        },
        "535eebb3-357a-451a-95e4-f6cce960290e": {
          "progression_name": "Budowanie umiejętności"
        },
        "355d4996-c94e-4553-ba72-f3b6faffeaea": {
          "progression_name": "Wyzwanie"
        },
        "4dc57979-b524-4f77-818e-2ff70833656b": {
          "progression_name": "Ćwiczenia"
        },
        "58d3231e-2d0e-4c78-b89b-e16fe4d117ef": {
          "progression_name": "Przewidywanie"
        },
        "791b5b99-593d-4287-ab93-a9970d63744e": {
          "progression_name": "Dodatki do Lekcji"
        },
        "69f426b1-49df-4b5c-a120-305de860c435": {
          "name": "Refleksja"
        },
        "bde81c73-ab2e-4430-88c8-7b0a493c6a18": {
          "name": "Przemyśl"
        },
        "84144ea8-ec9f-40ad-925b-6170d47437ef": {
          "name": "Słownik"
        },
        "a8dddc64-bf3e-4023-85b5-e202ec1a0eb6": {
          "name": "Wstęp"
        },
        "a89749a5-5e92-470a-90f8-0d7317019298": {
          "name": "Warunkowe z kartami",
          "progression_name": "Instrukcje warunkowe z kartami - Aktywności bez komputera"
        },
        "175f1856-2873-43ee-b172-6c73420f7af6": {
          "name": "Ocena opcjonalna"
        },
        "dda904ae-113f-4561-8a61-e9ed43297a47": {
          "tips": [
            "Pytania Flash Chat mają na celu wywołanie wielkiego obrazu myślenia o tym, jak lekcja odnosi się do większego świata i większej przyszłości uczniów. Skorzystaj ze swojej wiedzy o klasie, aby zdecydować, czy chcesz omówić je jako zajęcia, w grupach czy z partnerem łokciowym."
          ]
        },
        "5310e8c8-822b-4c59-baa0-4583cdf3d249": {
          "name": "Refleksja"
        },
        "6580e91f-9fb2-4fee-bcaf-c1425a65029a": {
          "description": "Użyj tych ćwiczeń, aby urozmaicić naukę uczniów. Można je wykorzystać do zajęć pozalekcyjnych albo w ramach urozmaicenia innego rodzaju.\n\n**Tab prawda/ fałsz**\n\n-   Ustaw uczniów w linii jakby mieli grać [Czerwone światło/ Zielone światło](http://www.gameskidsplay.net/games/sensing_games/rl_gl.htm).\n-   Wybierz jedna osobę, aby stanęła przed Wywołującym.\n-   Wywołujący wyrażenie warunkowe i prosi każdego, kto spełnił wymogi wyrażenia warunkowego, aby wystąpili o krok naprzód. \n    -   Jeśli masz czerwony pasek, wystąp o krok naprzód.\n    -   Jeśli nosisz sandały, wystąp o krok naprzód.\n-   Spróbuj się zamienić mówiąc rzeczy takie jak: \"Jeśli nie jesteś blondynką, wystąp o krok naprzód.\"\n\n**Zagnieżdżanie**\n\n-   Podziel uczniów na pary lub małe grupy.\n-   Niech napiszą wyrażenia do gry w karty na paskach papieru po:\n    -   Jeśli figurą jest trefl\n    -   Jeśli kolorem jest czerwony\n-   Niech uczniowie zrobią paski papieru na potrzeby wyników.\n    -   Dodaj jeden punkt\n    -   Odejmij jeden punkt\n-   Po wykonaniu tego niech uczniowie wybiorą trzy z każdego typu paska i trzy karty do gry, zwracając uwagę na wybrany porządek.\n-   Korzystając z trzech kawałków papieru, niech uczniowie zapiszą trzy różne programy z wykorzystaniem tylko zestawów pasków które wybrali, w dowolnym porządku.\n    -   Zachęć uczniów, aby wstawili kilka wyrażeń warunkowych \"jeśli\" do innych wyrażeń warunkowych \"jeśli\".\n-   Teraz uczniowie powinni uruchomić wszystkie trzy programy, używając kart, które wylosowali, w tym samym porządku dla każdego programu.\n    -   Czy którykolwiek z dwóch programów doprowadził z powrotem do tej samej odpowiedzi?\n    -   Czy którykolwiek doprowadził do czegoś innego?"
        },
        "ff230610-bef8-421e-b37a-6d77e490ce3e": {
          "name": "Wstęp"
        },
        "2143fa63-5aea-47af-8684-29aa626fd1d7": {
          "name": "Patrząc w przyszłość z Minecraftem",
          "description": "#### Online Puzzle\n\nStudenci są na prawdziwą ucztę z tej lekcji. Prawdopodobnie większość twoich uczniów słyszała o _Minecraft_, ale podaj krótkie wprowadzenie dla tych, którzy mogą nie wiedzieć.\n\n_Minecraft_ jest grą w kostkach. Możesz grać jako Alex lub Steve, jak pracować przez labirynty. Musisz unikać lawy, zbierać przedmioty i odkrywać w świecie składającym się z kostek rzeczy.\n\nZademonstrować jedną z zagadek do klasy (zalecamy puzzle 11.) Gdy wszystkie pytania zostały rozwiązane, studenci przejść do komputerów i pozwolić im rozpocząć programowanie pary."
        },
        "419b0732-9e07-4ab2-8c48-0fb798dfdfde": {
          "progression_name": "Budowanie umiejętności"
        },
        "c6bd1d9a-a98f-444b-b24b-05fef7ca82ec": {
          "progression_name": "Budowanie umiejętności"
        },
        "4d4e1c44-ff30-4ba6-bdcc-67dc52d3c85a": {
          "progression_name": "Wyzwanie"
        },
        "268e56b4-6f3e-4a44-8383-2e538ae1ab72": {
          "progression_name": "Czas na zabawę"
        },
        "3ea15706-caac-499b-aef5-a7210f291bfc": {
          "progression_name": "Dodatki do Lekcji"
        },
        "d9a92c19-1b83-49fa-bc9c-de8298122305": {
          "name": "Refleksja"
        },
        "10b28faf-5fc4-41f2-a0fc-6c23d80da22d": {
          "description": "Użyj tych działań, aby usprawnić naukę uczniów. Mogą być używane jako poza zajęciami klasowymi lub innym wzbogacaniem.\n\n#### Więcej Minecraft\n\nJeśli okaże się, że twoja klasa naprawdę cieszy się środowiskiem _Minecraft_, [oto kilka linków do innych gier \\_Minecraft\\_ mogą grać online](https://code.org/minecraft). Te gry będą również uczyć podstawowych umiejętności kodowania."
        },
        "8ae849bd-292d-44e8-9ccd-9d9bfc86c592": {
          "name": "Wstęp"
        },
        "e3c7f2af-1680-47d8-abac-407bcf97f905": {
          "name": "Podgląd łamigłówek online"
        },
        "a4ab31f7-6915-461a-b307-aad86879a097": {
          "name": "\"jeśli/w przeciwnym razie\" z Pszczółką",
          "description": "Te zagadki mogą wykiełkować kilka pytań, więc uczniowie muszą pracować parami lub wdrożyć zasadę „Zapytaj trzy zanim mnie poprosisz” (niech uczniowie poproszą o pomoc trzech innych rówieśników, zanim pójdą do nauczyciela.) Spowoduje to dyskusje, które będą rozwijać zrozumienie każdego ucznia."
        },
        "f581d038-c3fb-4ac3-a56e-31b84d50ba91": {
          "progression_name": "Film: Instrukcje warunkowe: Instrukcje \"jeśli\" "
        },
        "b7925091-8715-4ad6-8d94-6ca396d22fd6": {
          "progression_name": "Przewidywanie"
        },
        "c6c9457f-77f7-4a4a-9f79-72386ab1ac9a": {
          "progression_name": "Budowanie umiejętności"
        },
        "ec05bf5f-afd1-487a-a92f-45f2d0e1ddf3": {
          "progression_name": "Film: Instrukcje warunkowe: Instrukcje \"jeśli\" i \"jeśli/w przeciwnym razie\""
        },
        "106bfc79-23ce-4a84-b0b6-38740eb9df89": {
          "progression_name": "Budowanie umiejętności"
        },
        "327f687c-e443-44e3-bf1e-87dbd7e014c0": {
          "progression_name": "Przewidywanie"
        },
        "dd2b73eb-51cd-4d7e-81f8-5ed2d57b72dd": {
          "progression_name": "Wyzwanie"
        },
        "63f10835-c9b1-4799-8f26-9ec9968c100f": {
          "progression_name": "Ćwiczenia"
        },
        "8c1a0c94-5769-44d7-90a2-af9b521835d7": {
          "progression_name": "Wyzwanie"
        },
        "3edea7b4-3cb0-44c0-8705-5e2f51f2802d": {
          "progression_name": "Dodatki do Lekcji"
        },
        "a1959bb9-3d8d-46ac-826c-df29b6dcb135": {
          "name": "Refleksja"
        },
        "4bbaf90d-0e2f-4488-974a-ba90b9623e65": {
          "description": "Użyj tych ćwiczeń, aby urozmaicić naukę uczniów. Można je wykorzystać do zajęć pozalekcyjnych albo w ramach urozmaicenia innego rodzaju.\n\n**Tab prawda/ fałsz**\n\n-   Ustaw uczniów w linii jakby mieli grać [Czerwone światło/ Zielone światło](http://www.gameskidsplay.net/games/sensing_games/rl_gl.htm).\n-   Wybierz jedna osobę, aby stanęła przed Wywołującym.\n-   Wywołujący wyrażenie warunkowe i prosi każdego, kto spełnił wymogi wyrażenia warunkowego, aby wystąpili o krok naprzód. \n    -   Jeśli masz czerwony pasek, wystąp o krok naprzód.\n    -   Jeśli nosisz sandały, wystąp o krok naprzód.\n-   Spróbuj się zamienić mówiąc rzeczy takie jak: \"Jeśli nie jesteś blondynką, wystąp o krok naprzód.\"\n\n**Zagnieżdżanie**\n\n-   Podziel uczniów na pary lub małe grupy.\n-   Niech napiszą wyrażenia do gry w karty na paskach papieru po:\n    -   Jeśli figurą jest trefl\n    -   Jeśli kolorem jest czerwony\n-   Niech uczniowie zrobią paski papieru na potrzeby wyników.\n    -   Dodaj jeden punkt\n    -   Odejmij jeden punkt\n-   Po wykonaniu tego niech uczniowie wybiorą trzy z każdego typu paska i trzy karty do gry, zwracając uwagę na wybrany porządek.\n-   Korzystając z trzech kawałków papieru, niech uczniowie zapiszą trzy różne programy z wykorzystaniem tylko zestawów pasków które wybrali, w dowolnym porządku.\n    -   Zachęć uczniów, aby wstawili kilka wyrażeń warunkowych \"jeśli\" do innych wyrażeń warunkowych \"jeśli\".\n-   Teraz uczniowie powinni uruchomić wszystkie trzy programy, używając kart, które wylosowali, w tym samym porządku dla każdego programu.\n    -   Czy którykolwiek z dwóch programów doprowadził z powrotem do tej samej odpowiedzi?\n    -   Czy którykolwiek doprowadził do czegoś innego?"
        },
        "f909f46d-5551-4020-b2d5-402aa7f10361": {
          "name": "Wstęp"
        },
        "7940bfbf-6888-4db2-b1a7-290d2eb76ba4": {
          "name": "Podgląd łamigłówek online"
        },
        "6ff7be87-b051-4758-93c0-c618a6b80b3c": {
          "name": "Pętle \"dopóki\" z Rolnikiem",
          "description": "Podczas gdy pętle nie zawsze są trudną koncepcją dla uczniów do zrozumienia, ale jeśli uważasz, że twoja klasa może zmagać się z tymi zagadkami, zalecamy programowanie par. Umożliwi to studentom odbijanie pomysłów od siebie przed wdrożeniem kodu. Programowanie pary działa w celu zwiększenia pewności siebie i zrozumienia z tematów takich jak podczas pętli."
        },
        "e1adf430-4152-42c1-a520-f40716ca9378": {
          "progression_name": "Budowanie umiejętności"
        },
        "0fa595d7-bcf7-4bf3-a292-22abb41aa813": {
          "progression_name": "Film: Pętle \"dopóki\" z Farmerem"
        },
        "af4d5d9b-dc83-44f1-b884-1aa62fcf1560": {
          "progression_name": "Przewidywanie"
        },
        "26d62974-617f-4322-ab5d-29e79e49cc87": {
          "progression_name": "Budowanie umiejętności"
        },
        "9130d756-a245-4997-93d3-94264979355b": {
          "progression_name": "Wyzwanie"
        },
        "ec1b07e3-f50a-4903-85c9-b2f52b255dcd": {
          "progression_name": "Ćwiczenia"
        },
        "0d0bdf1d-d762-4967-93a2-12b0414e4ef0": {
          "progression_name": "Przewidywanie"
        },
        "98a0f038-bf2d-4af7-9608-1ca327e1ef01": {
          "progression_name": "Wyzwanie"
        },
        "3694bab1-5f1b-411a-8170-601003b9d32c": {
          "progression_name": "Dodatki do Lekcji"
        },
        "44daf4e4-d94e-4ba5-9364-8e3a93dc267e": {
          "name": "Refleksja"
        },
        "cefe1ce5-6a04-45e4-8805-e5b94fff2197": {
          "name": "Wstęp",
          "description": "W tej lekcji uczniowie będą tworzyć pętle, które będą uruchamiane tylko do momentu spełnienia warunku. Pomóż uczniom zrozumieć, jak to działa, prowadząc ich w działaniach grupowych i wykonując działania „aż do” pewnego warunku jest prawdą. Na przykład: Niech uczniowie dotkną nosa „dopóki” nie powiesz im, żeby się zatrzymali."
        },
        "88a4ca9a-f917-418e-8c1c-2cc4ac814afd": {
          "name": "Pętle \"dopóki\" w labiryncie",
          "progression_name": "Budowanie umiejętności"
        },
        "fad7d572-0e05-4122-854b-ee145920d5ec": {
          "progression_name": "Film: Instrukcje powtarzaj aż"
        },
        "0878bb75-72da-454e-8ac9-d06588287cde": {
          "progression_name": "Przewidywanie"
        },
        "34a17d75-d294-42da-b0ca-57ddd75b50cb": {
          "progression_name": "Budowanie umiejętności"
        },
        "0664bded-dced-45bc-954d-8bc7d7734235": {
          "progression_name": "Wyzwanie"
        },
        "9ee3da3a-7860-4af1-9e89-3c3f7f99192d": {
          "progression_name": "Ćwiczenia"
        },
        "c5b4eff7-95ff-4c51-acb5-2c23f8758991": {
          "progression_name": "Przewidywanie"
        },
        "baf8f43c-6977-4f51-a3c6-3b571a735941": {
          "progression_name": "Dodatki do Lekcji"
        },
        "4ebb7582-e4f3-4765-b03c-b08a688ad90f": {
          "name": "Dyskusja"
        },
        "3f2558c3-0eb6-492f-b17b-0eeb7f5f393a": {
          "name": "Refleksja"
        },
        "48252ddc-731f-41bc-9552-10c5aa32acce": {
          "name": "Refleksja"
        },
        "bee3bff0-2e37-458f-89b1-b3cf1343271d": {
          "name": "Planowanie"
        },
        "e8e5a324-ff1a-4d75-b917-b0c405905904": {
          "tips": [
            "Jeśli studenci są programowanie pary dla tego zadania, to rozgrzewka jest dla nich świetna okazja, aby ćwiczyć dzielenie się i poszanowanie pomysłów innych. Upewnij się, że uczniowie przestrzegają norm pracy grupowej, które już posiadasz w klasie. W przeciwnym razie spędź krótką chwilę przechodząc nad swoimi oczekiwaniami."
          ]
        },
        "db17d2d5-30dc-4b19-a5e6-543602d3d52e": {
          "name": "Koniec projektu kursu",
          "tips": [
            "Podczas kodowania uczniowie będą doświadczać wielu prób i błędów. Ich projekty prawdopodobnie staną się obciętymi wersjami ich pierwotnego zakresu. Przypomnij studentom, że ten rodzaj kompromisu jest powszechny w projektowaniu oprogramowania. Jest w porządku, jeśli nie uda im się zbudować w każdej funkcji, którą zaplanowali!"
          ]
        },
        "a0ef70ba-32d7-450e-85a2-d2415d14209c": {
          "progression_name": "Przykłady projektów"
        },
        "2e6af268-5fe3-4361-8108-ee1f41cd2e1e": {
          "progression_name": "Utwórz swój projekt"
        },
        "da1c017e-0efa-422b-89a6-180fcef8be6e": {
          "name": "Prezentacja"
        },
        "558c0510-2a0d-4302-82d1-98f221ecec6f": {
          "name": "Refleksja"
        },
        "3dcc5ff1-9cad-46cc-985e-e92e1989a304": {
          "name": "Lekcje rozszerzeń z mikro:bitem",
          "description": "Aby wykorzystać umiejętności, których nauczyłeś się w Kursie d Podstaw Informatyki kliknij [here](https://code.org/maker/csf-microbit), aby sprawdzić rozszerzone lekcje z micro:bitem. Te [4 lekcje z micro:bitem](https://code.org/maker/assets/CSF-Booklet-Course-D-v4.pdf) obejmują następujące tematy: Poznaj swój micro:bit, Pętle, Instrukcje warunkowe (jeśli ... to ... w przeciwnycm razie), Wejścia i Wyjścia, Zadarzenia i Zmienne."
        },
        "5284ed91-ecd3-477a-8e48-cec21b3822f4": {
          "name": "Słownictwo kluczowe",
          "description": "-   **empatia**: wyobrażać sobie uczucia, które ktoś inny doświadcza\n-   **interpret**: aby zrozumieć coś w oparciu o nasz punkt widzenia\n\n**Przed lekcją**: jako opcjonalna aktywność przed lekcją, niech uczniowie grają[E-volve](https://www.digitalpassport.org/evolve.html)gry w Digital Passport™ by Common Sense Education. Pomoże to wprowadzić kluczowe koncepcje tej lekcji. Aby dowiedzieć się więcej, zapoznaj się z [Digital Paszport Educator Guide](https://d1e2bohyu2u2w9.cloudfront.net/education/sites/default/files/tlr-asset/document-bundled-educator-guide-92018.pdf).\n\n**Project** [Slajd 4](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3da8846a99_1_0)i zapytaj uczniów: _Wyobraź sobie, kiedy wszedłeś, powiedziałem do ciebie_ [w przyjaznym tonie, z dużym uśmiechem] \\_\"Cześć!” Które emotikony by pasowały?\n\nCzy uczniowie wykazują swoją odpowiedź trzymając palce (1, 2, 3 lub 4). Jeśli ktoś trzyma numer inny niż 1, poproś go, aby podzielił się dlaczego.\n\n**Powtarzać** to jeszcze dwa razy, mówiąc _Hello_ inaczej za każdym razem: raz z gniewnym tonem i scowl, a raz z nerwowym lub przerażonym tonem.\n\n**Project** [Slajd 5](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3da8846a99_2_13)i zapytaj: \\_Co jeśli tylko go czytasz? Jak się teraz czujesz?\n\nWskazać, jak kiedy coś jest tylko w tekście, może być jeszcze trudniej zinterpretować to, co ktoś oznacza. Wyjaśnij, że ich odpowiedzi mogą się różnić w zależności od tego, kim są, ponieważ wszyscy interpretujemy świat nieco inaczej. Wyjaśnić, że interpretacja oznacza _rozumieć coś w oparciu o nasz punkt widzenia._ ([Slajd 6](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3d844aea9e_1_4))\n\n**Spowiedza**: \\_Ponieważ słowa mogą być interpretowane inaczej przez różnych ludzi, ważne jest, aby myśleć o słowach, których używamy i jak wpływają one na ludzi. Moglibyśmy powiedzieć coś po to, żeby być zabawnym, ale ktoś może potraktować to poważnie, a to może zranić ich uczucia. Może się to zdarzyć osobiście, a także może się zdarzyć online. Może się to zdarzyć nawet bardziej online, ponieważ słowa są tylko tekstem — nie jesteśmy twarzą w twarz z innymi ludźmi. \\_"
        },
        "fece081e-c02e-4b0e-a0ca-bf22c3649680": {
          "description": "**Ask**: \\_Kto słyszał o powiedzeniu „Kije i kamienie mogą złamać moje kości, ale słowa nigdy mnie nie skrzywdzą”? \\_\n\nZaproś uczniów do odpowiedzi. Odpowiedzi będą się różnić. Obserwuj, pytając uczniów, czy uważają, że to powiedzenie jest prawdziwe.\n\n**Project** [Slajd 7](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3d844aea9e_1_117)i powiedz: _Obejrzymy film zatytułowany „Moc słów”. Jak oglądamy, nadal zastanawiaj się, czy to stwierdzenie jest prawdziwe, czy nie._\n\nPokaż film [The Power of Words](https://www.commonsense.org/education/videos/the-power-of-words), a następnie zadzwoń do uczniów, aby podzielili się tym, co mówi o tym, czy stwierdzenie jest prawdziwe, czy nie. Podkreśl, że czasami trudno zignorować to, co ktoś mówi, gdy jest to podła nazwa. Nazwy mogą sprawić, że czujesz się smutny lub zraniony.\n\n**Zapyt**: \\_Dlaczego myślisz, że ci inni gracze mówili te rzeczy do Guts? \\_ ([Slajd 8](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3e3f96c340_0_0))\n\nZaproś uczniów do odpowiedzi. Odpowiedzi będą się różnić, ale możliwe przyczyny to: _oni próbowali żartować około_ lub \\_czują się źle i biorą to na kimś.\n\n**Ask**: \\_Co robi Guts w odpowiedzi na średnie słowa?\n\nZaproś uczniów, aby odpowiedzieli i wyjaśnili, że Guts rozmawiał z kimś, komu ufał, kto był w stanie wczuć się w niego i dać mu dobrą radę. Zdefiniuj empatię jako \\_imagining uczucia, których doświadcza ktoś inny. ([Slide 9](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3d844aea9e_1_109))\n\n**Project** [Slide 10](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3d844aea9e_1_157)i przejrzyj skrót S-T-O-P, aby odpowiedzieć na myśli słowa online."
        },
        "ae2a6573-1ff7-40ad-b71f-73ec9ab5e86f": {
          "description": "**Rozpowszechnia** [Words Can Hurt Student Handout](https://drive.google.com/open?id=1G7urBAgM9G3D4zI4KVRgN-yX-Q4qAyb_HWEHsnREl3M)i przeczytaj wskazówki na głos. Zezwalaj parom pięć minut na ukończenie czynności.\n\n**Zaproszeć** pary do dzielenia się odpowiedziami. Informacje na temat możliwych odpowiedzi można znaleźć w [Wersja dla nauczycieli](https://drive.google.com/open?id=1kAcaaYor5vegqj2cncK5FOgFOeg2PtKUXWw-muodELE)."
        },
        "af7e0728-c503-4364-86db-6470460a4c2c": {
          "description": "**Miejsca** ciąg znaków na całej długości sali lekcyjnej. Zaznacz połowę pokoju „OK”. Zaznacz drugą połowę „Nie w porządku”. Niech uczniowie stoją po drugiej stronie linii.\n\n**Project** [Slajd 11](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3d844aea9e_1_106)i przeczytaj na głos wskazówki.\n\n**Ma** studenci czytają wypowiedzi [Slajdy 12-15](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3e3f96c340_0_14). Po każdym zestawieniu pozostaw czas studentom na przeprowadzkę lub pobyt. Wezwij studentów, aby wyjaśnili swoje myślenie. Jeśli to możliwe, wybierz studentów z każdej strony, aby omówić powody, dla których oświadczenie jest lub nie jest w porządku.\n\nDla przykładów, w których uczniowie mówią, że to nie jest w porządku, kontynuacja, pytając ich, co mogą zrobić, gdyby otrzymali tę wiadomość od kogoś.\n\n**Opinia**, że dzieci lubią rozmawiać online, oglądać filmy, wysyłać wiadomości, grać w gry i odrabiać zadania domowe. Czasami ludzie mówią wredne lub przerażające rzeczy. Wiadomości, które sprawiają, że ludzie czują się źle, przekraczają linię.\n\n\\*\\* Uczniowie ukończyli [Quiz lekcyjny](https://docs.google.com/forms/d/1OKy2U3F37NSgCBUez9XMi0UJtlHKPXIe_rxy0l_KEOg/copy).",
          "progression_name": "Potęga słów - Aktywność bez komputera"
        },
        "d7669ec4-fda9-43e4-aec4-0292676f992a": {
          "description": "Oto dodatkowe zasoby, które możesz zapewnić uczniom, aby poprawić ich naukę:\n\n-   [Działalność rodzinna](https://drive.google.com/open?id=1jgFQhQawNgbG8VFWDgcu8jfYGeIvKz77VV54Revd0Gw)\n-   [Porady rodzinne](https://www.commonsense.org/education/family-tips/k-12-cyberbullying-digital-drama-and-hate-speech)\n-   **Przygotowa** slips papieru z komentarzami, które mówią łagodnie niemiłe rzeczy, jak:\n\n    -   Nie mogę uwierzyć, że lubisz pokazy superbohaterów. Tylko pierwszoklasiści to robią.\n    -   Jesteś dziwny.\n    -   Dlaczego nosisz tę koszulę?\n\n    <br>\n\n    Przekazać każdemu uczniowi jeden poślizg i sparować je. Niech studenci handlują zrazy i czytają je po cichu. Potem niech się odmienią i na zmianę wypowiadają komentarz na głos drugiej osobie. Zapytaj ich, jaka była różnica między pisaniem czegoś niezbyt ładnego a odpowiedzialnością za to, co mówili komuś w twarz. Podkreśl, że ludzie czasami chowają się za anonimowością swojej aktywności online. Przypomnij uczniom, że jeśli nie powiedzą czegoś w twarz innej osoby, to nie jest w porządku mówić tego w swojej aktywności online."
        },
        "4ec90698-6e58-4695-8fec-298eea182910": {
          "name": "Wstęp",
          "description": "Na tym kursie nauczymy się kodować. Kodowanie służy do tworzenia aplikacji, gier, stron internetowych, symulacji i wszelkiego rodzaju rzeczy, których używamy na komputerze."
        },
        "e49cc3d9-d33e-4a2c-a549-9ba972b2bffa": {
          "tips": [
            "Takie monity o odbicie mogą być uzupełniane w różnych stylach. Dziennikarstwo lub dyskusja (z grupami lub partnerami) to świetne opcje!"
          ]
        },
        "08317767-3cec-4407-9692-449dcd0b9cec": {
          "description": "Gdy aplikacje i gry są tworzone, są one zaprojektowane z myślą o użytkowniku. Użytkownik to Ty lub ktokolwiek będzie używał aplikacji i grał z nią. Twórcy mają pomysły na temat tego, jak powinny być używane ich aplikacje, ale to do użytkownika należy dokonanie wyborów!\nDzisiaj będziemy badać, jak (i dlaczego) twórcy aplikacji i gier pozwalają nam dokonywać wyborów."
        },
        "a64d1695-0afd-4534-a16c-a790006e0193": {
          "tips": [
            "Ta lekcja zawiera slajdy z kilkoma fałszywymi aplikacjami do wykorzystania w dyskusji. Możesz uzupełnić lub zastąpić te przykłady innymi w oparciu o zainteresowania Twoich uczniów."
          ]
        },
        "7d9676bf-c752-4032-a629-1aa3b48c7298": {
          "description": "Widzimy, że we wszystkich tych aplikacjach użytkownik może decydować o tym, jak z nich korzystać. Te wybory mogą zmotywować więcej osób do korzystania z aplikacji."
        },
        "a4614b34-d679-47a0-b4b3-36a360f0336d": {
          "name": "Wprowadzenie Sprite Lab",
          "progression_name": "Film: Przedstawiamy Sprite Lab  "
        },
        "6e47923a-1f07-4c2d-a55a-c45a35a823e9": {
          "name": "Badanie aplikacji"
        },
        "a596d7dd-5533-4dea-b9f7-7dca09bafb6e": {
          "tips": [
            "Jeśli po raz pierwszy uczestnicy kursu korzystają z Code.org, poświęć trochę czasu na pomoc uczniom w zrozumieniu, jak przejść do strony internetowej i zalogować się na swoje konta."
          ],
          "progression_name": "Eksploracja: Przykładowe aplikacje"
        },
        "1a098222-2063-4b01-8d00-34170d233880": {
          "name": "Podziel się"
        },
        "c345c420-5657-4fc7-bce8-b3bba7ebee53": {
          "name": "Zaproponuj ulepszenie"
        },
        "b747bce4-9f61-4265-a886-568636e698e4": {
          "name": "Refleksja"
        },
        "920b8921-f3cf-4726-bbac-b414917f7bd0": {
          "name": "Wstęp",
          "description": "#### Instrukcje dla Sceny"
        },
        "e2f1a967-71c0-4071-8ea6-51998c502423": {
          "description": "Ostatnim razem badaliśmy aplikacje i gry stworzone w Sprite Lab. Dzisiaj zaczniemy pisać własny kod, aby stworzyć proste animacje sprite."
        },
        "a4ff84ba-5105-458a-a950-ca4fdbc3d23b": {
          "name": "Tworzenie duszków",
          "tips": [
            " W zagadkach przewidywania uczniowie proszeni są o przeczytanie dostarczonego programu i udzielenie odpowiedzi na pytanie na jego temat. Na pytanie należy odpowiedzieć, zanim uczeń może nacisnąć przycisk „Uruchom”. Chociaż możliwe jest wykorzystanie tych pytań jako formy oceny, należy pamiętać, że są one często umieszczane na początku lekcji jako sposób, aby uczniowie kwestionowali rzeczy, zanim zostaną formalnie pokazani, jak działa coś nowego. "
          ],
          "progression_name": "Przewidywanie"
        },
        "f72fb33c-b201-40bd-a15f-439a7c4c5521": {
          "progression_name": "Film: jak utworzyć duszka"
        },
        "3f88f7fc-f308-44e8-ad91-df97a9080361": {
          "tips": [
            "Wiele lekcji na tym kursie obejmuje zarówno poziomy „Budowa umiejętności”, jak i „Praktyka”. Pod względem oceny wszyscy uczniowie powinni ukończyć sekcję budowania umiejętności. Poziomy praktyki mogą być wykorzystywane do różnicowania lub dla zapewnienia większego wyboru dla studentów."
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "0c617599-fd8c-43d4-9158-b44d201cb3aa": {
          "progression_name": "Ćwiczenia"
        },
        "98dedd12-1d66-41ed-9629-e30265862d45": {
          "tips": [
            "Poziomy Free Play mają być szybką okazją dla uczniów do kreatywnego zastosowania tego, czego się nauczyli. Studenci powinni eksperymentować z własnymi pomysłami i mogą być zachęcani do dzielenia się i współpracy ze sobą."
          ],
          "progression_name": "Czas na zabawę: Utwórz scenę"
        },
        "c0f0a327-9419-4966-a5cd-cfe23d312f09": {
          "name": "Słownik"
        },
        "7a087d45-10fc-429d-96be-3463e5a67f48": {
          "description": "Dzisiaj nauczyłeś się pisać kod do tworzenia programów w Sprite Lab. \n\n**Program** - Algorytm, który został zakodowany w coś, co może być uruchamiane przez maszynę.\n\n**Algorytm** - Lista kroków, aby wykonać zadanie."
        },
        "fd1a19e9-0bde-448a-8dd0-8e3b9db03712": {
          "name": "Przemyśl"
        },
        "e270db37-e123-4995-8e60-a5d7e9f1e6f2": {
          "description": "**Wykonaj następujące czynności: \\*\\* Przejrzyj lub wprowadź słowo \\*\\*algorytm**: listę kroków, aby wykonać zadanie."
        },
        "cf819fb5-aff2-47a4-9c0f-8ab6af6f218f": {
          "description": "Dzisiaj zaczniemy od szybkiej gry. W tej grze, będę daje wszystkie polecenia do naśladowania, a twoim zadaniem jest podążanie za algorytm\\*\\*. Polecenia zawsze zaczynają się od „start” lub „stop”. Jeśli powiem ci, żebyś zaczął coś robić, musisz zacząć to zachowanie i kontynuować, dopóki nie powiem ci, żebyś przestał. Mogę również powiedzieć, żebyś „zatrzymał wszystko”, co oznacza, że możesz zakończyć wszystkie zachowania, które ci dałem do tej pory. Zagramy 3 rundy i po każdej rundzie zadam wam kilka pytań.",
          "tips": [
            "Pamiętaj, aby dać trochę miejsca między poleceniami. Dla każdej z tych sekcji rozważ przebieganie przez całą sekwencję bez dyskusji, a następnie powtórzenie jej ponownie po tym, jak wszyscy mieli szansę na przesłuchanie i przetworzenie wszelkich nieporozumień."
          ]
        },
        "3aa37d43-0bc2-433c-9fdd-59a704d6d5f8": {
          "name": "Duszki w akcji",
          "progression_name": "Przewidywanie"
        },
        "fa8242f4-3cba-4a2c-bd5b-069a58450349": {
          "progression_name": "Film: Duszki w akcji"
        },
        "ddbb537c-edf8-479c-b44d-8188941c0655": {
          "progression_name": "Budowanie umiejętności"
        },
        "a25d6587-66bc-42ea-9a27-47b5f3586878": {
          "progression_name": "Ćwiczenia"
        },
        "d5632c3a-b496-41b6-a90f-1c738211a438": {
          "tips": [
            "Wybór darmowej gry w tej lekcji odzwierciedla te z poprzedniej lekcji. W rzeczywistości każdy kod studencki z ostatniej lekcji zostanie przeniesiony na dzisiaj. Główną różnicą jest to, że teraz uczniowie mają dodatkowe bloki w swoich narzędziach, których powinni używać, aby uczynić ich programy bardziej interesującymi lub złożonymi. "
          ],
          "progression_name": "Czas na zabawę: Utwórz interaktywną scenę"
        },
        "ec95fadb-9235-4f39-b4f7-f9b02e2fecdb": {
          "name": "Przemyśl"
        },
        "c129fbec-8adf-45f8-9920-ccac97d6022f": {
          "name": "Wstęp"
        },
        "89eea455-9916-4a03-b782-7c22b535cb4a": {
          "name": "Wirtualny zwierzak z Sprite Lab",
          "description": "\\*\\*Cel: \\*\\* Dzisiaj uczniowie będą tworzyć własne wirtualne zwierzaka! Zaczną od rysowania lub wyboru nowego kostiumu dla ikonki. Następnie będą tworzyć zdarzenia, które powodują działania i zachowania po interakcji."
        },
        "f64df1a5-3d41-4029-9a8c-1439d98d7386": {
          "description": "#### Online Puzzle\n\n\\*\\*Przejście: \\*\\* Przenieś uczniów do swoich maszyn. Zachęcaj uczniów do przestrzegania instrukcji dla każdej układanki. Pomóż im zrozumieć, że jest to twórcze działanie, które ma pomóc im w nauce Sprite Lab. ",
          "tips": [
            "Zachęcaj uczniów do zadawania pytań/wyzwań do rozpoczęcia od pytania partnera. Pytania bez odpowiedzi można eskalować do pobliskiej grupy, która może już znać rozwiązanie. Niech uczniowie opisują problem, który widzą:  \n\n-   Co to ma zrobić? \n-   Co to robi? \n-   Co ci to mówi?"
          ]
        },
        "428a4506-b3e9-418c-9351-455bc0eacd55": {
          "description": "\\*\\*Przypomnienie: \\*\\* Jeśli zagadki są udostępniane, przypomnij uczniom, aby dzielili się swoją pracą tylko z bliskimi przyjaciółmi lub rodziną. "
        },
        "29dc277a-e2ce-49f2-bc02-9f0c6cd0b490": {
          "progression_name": "Eksploracja"
        },
        "e9443a1f-ef37-4cb8-8d8c-415f2ceaf8ee": {
          "progression_name": "Mini-projekt: Stwórz wirtualnego zwierzaka"
        },
        "70b98dfc-752d-47f0-a29f-2c39cbad42be": {
          "progression_name": "Czas na zabawę"
        },
        "6007c0c9-9fe0-4bf5-9861-e64847bd3161": {
          "name": "Refleksja"
        },
        "73bf4d55-3d84-4105-868f-eb0a20a55388": {
          "description": "### Zapewnienie energii dla wirtualnego zwierzaka (60-90 minut)\n\n![](https://images.code.org/5066103b929a2811e50d5bd54fbb114e-elaSmall.png)\n![](https://images.code.org/6a1508aeb443e243f595f88ecfa9ed7a-mathSmall.png)\n![](https://images.code.org/54b84cd74790e8e37daeff6cd826c185-scienceSmall.png) **Informatyka + Język angielski Arts + Science**\n\n[Zapewnienie energii dla wirtualnego zwierzaka](https://docs.google.com/document/d/1SV51NrXzinuXHLToGarIDnVMd6GA8ZaD2LfWMDqTg0M/edit?usp=sharing) to opcjonalne działanie dostosowane do wspólnych podstawowych standardów ELA i nauk nowej generacji, napisane przez naszą społeczność nauczycieli. Uczniowie stworzą model naukowy, który pokazuje, jak ich wirtualne zwierzaki otrzyma energię potrzebną do przetrwania. \n\n_Standards Addressed:_\n\n-   \\*\\*CCSS.ELA.RI.5.7: \\*\\* Opieraj się na informacjach z wielu źródeł drukowanych lub cyfrowych, demonstrując możliwość szybkiego zlokalizowania odpowiedzi na pytanie lub skutecznego rozwiązania problemu. \n\n-   \\*\\*CCSS.ELA.RI.5.9: \\*\\* Zintegruj informacje z kilku tekstów na ten sam temat w celu napisania lub mówienia na ten temat. \n\n-   \\*\\*5- PS3-1: \\*\\* Użyj modeli, aby opisać, że energia w żywności zwierząt (wykorzystywana do naprawy ciała, wzrostu, ruchu i utrzymania ciepła ciała) była kiedyś energią słoneczną. \n\n-   \\*\\*5-LS2-1: \\*\\* Opracuj model opisujący ruch materii między roślinami, zwierzętami, rozkładaczami i środowiskiem \n\n-   \\*\\*SL.5.5: \\*\\* Uwzględnij komponenty multimedialne (np. grafikę, dźwięk) i wyświetlacze wizualne w prezentacjach, gdy odpowiednie do zwiększenia rozwoju głównych idei lub tematów. "
        },
        "36b84666-22b3-4032-b1ef-863aca87cfd9": {
          "name": "Ulubiony posilek"
        },
        "c9d09795-0970-471d-ac5d-b745bdc7c6ee": {
          "description": "Za chwilę będę miał ochotników, którzy pomogą nam wypełnić puste puste miejsce. Będziemy używać kopert, by śledzić informacje, które dostarczają. Każda koperta ma etykietę, która pasuje do jednego z pustych spacji. Jeśli dam ci kopertę, napisz słowo, które pasuje do tej etykiety i umieść ją w środku, a potem oddaj mi."
        },
        "a9d9d0a1-8f04-4fc0-8e1d-444f0ded3552": {
          "description": "\\*\\*Zrób to: \\*\\* Ułatwiaj rozdawanie i zbieranie kopert oznaczonych „obiekt”, „płynny” i „numer”. Po zebraniu, trzymaj koperty zamknięte i zacznij czytać historię. Tylko wtedy, gdy dojdziesz do każdego pustego pola, otwórz kopertę i odczytaj zapisaną wartość."
        },
        "580f30a2-5998-427d-9399-f52a5426e91d": {
          "name": "Zabawy na imprezy"
        },
        "c173338f-588c-408f-a20a-9fff31d41a14": {
          "description": "Dzisiaj będziesz pracować z grupą, aby utworzyć własną historię o pustej przestrzeni. "
        },
        "242b6738-c71f-43a4-9a76-2e90e657ff70": {
          "progression_name": "Film: Zmienne w kopertach bez komputera"
        },
        "a39aeb31-f24a-4a70-b481-9fb3172e76cb": {
          "tips": [
            "Pisanie fabuły pustej przestrzeni może być wyzwaniem. Pomocne może być przekazanie uczniom sugestii tematów, aby inspirować i skupić się na ich pisaniu. Rozważ, aby uczniowie pracowali nad tym zadaniem w grupach, aby mogli współpracować.\n\n\\*\\*Propozycje tematu: \\*\\*\n\n-   wyimaginowana wycieczka terenowa\n\n-   nietypowe wakacje\n\n-   przegląd filmu\n\n-   poranna rutyna\n\n-   dzień na plaży\n\n-   jak latawiec latawiec"
          ]
        },
        "4a32f72b-2376-432d-8b3a-983f0fe9488b": {
          "tips": [
            "\\*\\*Oszczędzaj historie uczniów! \\*\\*\n\nNa kilku lekcjach uczniowie zastosują to, czego się nauczyli, aby stworzyć kolejny projekt Sprite Lab. Istnieje kilka opcji dla tego projektu, ale jedną z nich jest stworzenie cyfrowej historii pustej przestrzeni.\n\nNa przykład [here](https://studio.code.org/levels/27026) to wersja Sprite Lab historii _Party Games_ z tej lekcji. "
          ]
        },
        "4bff0457-cc5d-4e24-a3e8-51093371c51e": {
          "name": "Wprowadzenie zmiennych"
        },
        "c7ac5782-093f-43a4-a9df-c9b507e35a30": {
          "name": "Refleksja"
        },
        "50cb30b6-f77f-4ca8-a7aa-477fc5de0b70": {
          "description": "### Zmienne łańcucha pokarmowego (45-60 minut)\n\n![](https://curriculum.code.org/media/uploads/elaSmall.png) ![](https://curriculum.code.org/media/uploads/mathSmall.png) ![](https://curriculum.code.org/media/uploads/scienceSmall.png) **Informatyka + Język angielski Arts + Matematyka + Nauka**\n\n[\\*\\*Zmienne łańcucha żywności\\*\\*](https://docs.google.com/document/d/1td4o1Oj1Syw_WwVAJ2CMDdWhvwp9DwMdbwv0gV0azOs/edit?usp=sharing) jest opcjonalnym działaniem dostosowanym do Common Core ELA, Common Core Math i Next Generation Science Standards, napisanym przez naszą społeczność nauczycieli. Studenci identyfikują różne wartości zmiennych występujących w łańcuchach pokarmowych (przykład: rośliny, zwierzęta, dekompozytor itp.), ponieważ dokumentują te wartości na notatnikach i pokazują przepływ materii przez środowisko. Studenci zapoznają się również z regułą 10% i opiszą przepływ energii za pomocą monitu o pisanie.\n\n_Standards Adressed:_\n\n-   \\*\\*CCSS.ELA-LITERACY.W.5.2.B: \\*\\* Opracuj temat z faktami, definicjami, konkretnymi szczegółami, cytatami lub innymi informacjami i przykładami związanymi z tematem.\n\n-   \\*\\*CCSS.MATH.CONTENT.5.NF.B.7.C: \\*\\* Rozwiąż problemy świata rzeczywistego polegające na podziale ułamków jednostkowych przez niezerowe liczby całkowite i dzieleniu liczb całkowitych przez ułamki jednostkowe, np. za pomocą wizualnych modeli ułamków i równań do reprezentowania problemu. \n\n-   \\*\\*NGSS.5-LS2-1: \\*\\* Opracuj model opisujący ruch materii między roślinami, zwierzętami, rozkładaczami i środowiskiem. "
        },
        "48748da0-02c7-49dd-9376-c8bacabc64ea": {
          "name": "Przejrzyj"
        },
        "384bc094-bdd1-4218-83e6-361c012c6c89": {
          "description": "Pod koniec ostatniej lekcji przyjrzeliśmy się podobieństwom między historiami pustych przestrzeni a aplikacjami, które pytają użytkownika o wprowadzenie danych. \nGdy komunikat na ekranie komputera czeka na dane wejściowe, nazywamy to monitem. \nGdy użytkownik wpisze do monitu, to tak, jakby komputer przechowuje informacje w kontenerze.\nEtykieta zmiennej mówi nam, jakiego rodzaju informacje się spodziewać.\nDzisiaj mamy zamiar nauczyć się kodu, aby utworzyć monit w Sprite Lab."
        },
        "14e9da9c-a429-47db-b4bd-c07d5dc4401f": {
          "name": "Przechowywanie i przetwarzanie tekstu",
          "progression_name": "Przewidywanie"
        },
        "71f32e49-99e7-46d2-9a4d-a6b0b07d5a17": {
          "tips": [
            "Podobnie jak w przypadku, gdy uczniowie piszą lub komunikują się ustnie, ważne jest, aby ustawić oczekiwania dotyczące właściwego używania słów w tej aktywności. Studenci powinni zrozumieć, że są odpowiedzialni za kod, który piszą, w tym za każdy tekst wyświetlany na ekranie. Tekst powinien być pełen szacunku, a także bezpieczny. Uczniowie mogą ćwiczyć nieudostępnianie danych osobowych w swoich programach, zwłaszcza jeśli chcą dzielić się z innymi osobami.\nNależy pamiętać, że wszelkie informacje wpisane w monicie Lab Sprite nie są zapisywane długoterminowo. Słowa i wiadomości wpisane przez użytkowników tych aplikacji znikną po zresetowaniu aplikacji."
          ],
          "progression_name": "Film:  Tekst i monity"
        },
        "304fbec8-0776-402a-9eeb-1e774da6bc0c": {
          "tips": [
            "Ta lekcja ma więcej poziomów budowania umiejętności i praktyki niż poprzednie lekcje, ponieważ uczniowie uczą się kilku nowych umiejętności naraz. W związku z tym nie ma dedykowanego poziomu „darmowej gry”. Jednak uczniowie, którzy czują się pewni swoich nowych umiejętności, mogą wybrać ostatnią opcję praktyki, aby zacząć od zera z pustym projektem. Podczas następnej lekcji uczniowie będą również pracować wyłącznie nad własnym projektem, który planują i projektują z wyprzedzeniem."
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "a2280341-dec1-43b0-9269-e8719a92375d": {
          "progression_name": "Ćwiczenia"
        },
        "1025db18-dae1-40a6-ac7e-b38ceed1360d": {
          "name": "Przejrzyj"
        },
        "6def65c9-7628-4d25-866a-1b2c428fbaa6": {
          "description": "Gdy użytkownik wprowadzi informacje do monitu, komputer przechowuje je ze zmienną. Monit może również wywołać zdarzenie. Jeśli kod używa zmiennej, komputer będzie szukał dopasowanej etykiety, aby znaleźć przechowywane informacje."
        },
        "fdbe210a-89d4-489c-a834-a293569d0274": {
          "name": "Refleksja"
        },
        "aef1a460-c4ee-406c-9f3e-2e9243f88502": {
          "name": "Przejrzyj",
          "tips": [
            "Jedną z najtrudniejszych części zmiennych uczenia się jest upewnienie się, że etykieta zmiennej zawsze pasuje. Na tym poziomie upewnij się, że uczestnicy kursu zauważają różnicę między zmienną **posiłk** a zmienną **food**. Studenci powinni zrozumieć, że najlepszym sposobem rozwiązania tego problemu byłoby użycie jednej zmiennej, upewniając się, że etykieta zawsze pasuje.\n\nMożesz także przejść swoją klasę poprzez korygowanie błędów w tym programie za pomocą tego [Piaskownica nauczyciela](https://studio.code.org/levels/27300) poziomu z projektorem."
          ],
          "progression_name": "Przewidywanie"
        },
        "b70948ff-b376-41dc-8c46-6572c8ab8241": {
          "tips": [
            "Jeśli masz krótki czas lub chcesz zminimalizować przejścia, ukończ tę część lekcji jako dyskusję grupową. Możesz przypomnieć studentom, że mogą ponownie odwiedzić te programy później, jeśli mają pytanie o to, jak coś działa.\n\nJeśli sam przeszedłeś całą lekcję, możesz również pokazać im swój własny gotowy program inspiracji!"
          ],
          "progression_name": "Eksploracja: Przykładowe programy"
        },
        "cbd68965-84ed-4389-8fc1-b9f4ed5094e6": {
          "name": "Programy wprowadzania danych przez użytkownika"
        },
        "9eb4bb34-8e86-4041-a410-dd8f833d20a4": {
          "tips": [
            "Jeśli masz krótki czas, akceptowalne jest, aby uczniowie skupili się na pierwszej stronie przewodnika planowania. Uczniowie mogą również ponownie wykorzystać te same historie, które ukończyły podczas lekcji „Puste Space Stories”."
          ],
          "progression_name": "Planowanie"
        },
        "ee6223c9-e041-4165-b451-70f4c8416e23": {
          "tips": [
            "Ten poziom przedstawia studentom menu opcji odpowiadających głównym typom projektów, z których wybrali. Głównymi różnicami między tymi podnajemami są instrukcje i domyślne kostiumy sprite. Uczniowie mogą potrzebować naprawdę jasnych instrukcji, aby zrozumieć, jak poruszać się po wyborach tutaj. Dla każdego z wyborów projektu, istnieją dwa poziomy podrzędne tutaj. Na początek uczniowie powinni wybrać jeden z poziomów oznaczonych „Część 1\". Gdy skończą ten poziom, powinni wrócić tutaj i wybrać „Część 2\" tego samego projektu. Pierwszy poziom dla każdego wyboru zapewni studentom informacje zwrotne, ponieważ umieścili podstawowe elementy swojego projektu razem. Drugi poziom to „darmowa gra”, która ma na celu umożliwienie uczniom wprowadzania zmian w ich kodzie, które im się podoba."
          ],
          "progression_name": "Mini-projekt: Programy z danymi użytkownika"
        },
        "f25b421f-f40b-496b-b754-f7b0bf806b85": {
          "name": "Prezentacja"
        },
        "2db78276-8789-4046-8488-4ce232bc6bb2": {
          "name": "Wstęp"
        },
        "86834c6e-de76-4d6a-bc8d-5c6d2e8d760a": {
          "tips": [
            null
          ]
        },
        "76b1642d-383d-49c3-b43d-7bf347ea1bb5": {
          "name": "Wiele duszków"
        },
        "56262489-b084-4a55-a4e2-b45138492e6c": {
          "progression_name": "Przewidywanie"
        },
        "9a30234f-6c15-4525-aa78-4b8905d29133": {
          "progression_name": "Film: Wiele Duszków"
        },
        "e2e2e67f-7883-47c0-b018-118af90abc79": {
          "progression_name": "Budowanie umiejętności"
        },
        "b1b312f7-6502-4335-907d-9663f892dc6f": {
          "progression_name": "Ćwiczenia"
        },
        "6962360d-5a78-47ae-8686-4038e83ebfbf": {
          "progression_name": "Czas na zabawę"
        },
        "95e83631-dfdc-4398-bde7-941a56206de6": {
          "name": "Przemyśl"
        },
        "7d525905-cfd3-47a7-b70a-2d2a28c13fac": {
          "name": "Wstęp"
        },
        "44ade190-d83f-4460-87ae-c1e4dcaef911": {
          "tips": [
            null
          ]
        },
        "8477c71b-b998-4915-9ed2-96f5adefe860": {
          "name": "Przejrzyj"
        },
        "93c00345-f28f-4bbf-b7b5-7d4ae0f3941d": {
          "description": "Gdy użytkownik wprowadzi informacje do monitu, komputer przechowuje je ze zmienną. Monit może również wywołać zdarzenie. Jeśli kod używa zmiennej, komputer będzie szukał dopasowanej etykiety, aby znaleźć przechowywane informacje."
        },
        "37b1afe8-191f-4950-a1a9-3d3ba93ae3a0": {
          "tips": [
            null
          ]
        },
        "04c4b8b1-e89f-4593-b843-2c7ef2ed3299": {
          "name": "Liczenie ze zmiennymi"
        },
        "51946ebc-7151-47c2-88bb-29d89d0338c5": {
          "progression_name": "Przewidywanie"
        },
        "75a9857e-a926-4c5a-a1ff-2307afce0d11": {
          "tips": [
            null
          ]
        },
        "f621cd05-64b4-41d4-8c9a-b310731edecb": {
          "progression_name": "Budowanie umiejętności"
        },
        "30357f1e-97b8-43b2-9fa9-edace8299c36": {
          "name": "Przemyśl"
        },
        "37214efe-4044-4968-8924-71472b1d2725": {
          "name": "Wstęp"
        },
        "229b6ed8-f28d-4d6b-98ea-39fe3ac44fab": {
          "name": "Mini-projekt: Gra kolekcjonera"
        },
        "22b7037c-93fc-4723-a172-22f1501dbf3b": {
          "progression_name": "Eksploracja: Przykładowe programy"
        },
        "61043979-dfcc-47f4-b882-94ea107cd123": {
          "progression_name": "Mini-projekt: Gra kolekcjonera"
        },
        "0e088be7-4df3-4826-842b-2c6655bc02e9": {
          "name": "Prezentacja"
        },
        "08a15ab5-ba6f-4d69-b493-cae09147c210": {
          "name": "Przemyśl"
        },
        "280458d7-1de1-46dc-b42c-2be014890b38": {
          "name": "Wstęp"
        },
        "c5ce3765-d4c5-4159-8e5c-39035697517e": {
          "name": "Symulowanie eksperymentów",
          "progression_name": "Uruchom symulację"
        },
        "a30085db-0943-45a2-87c4-6a1ef63df09c": {
          "progression_name": "Zmień zmienne symulacji"
        },
        "65a5c77d-65a0-4744-b99b-26f05b60ebf2": {
          "name": "Refleksja"
        },
        "cbd047b0-88f2-4fdd-8307-afe5ade83470": {
          "name": "Dostosowywanie symulacji",
          "progression_name": "Dostosuj"
        },
        "966897db-4aa7-4d18-81a8-27b4ef5100fe": {
          "name": "Wstęp"
        },
        "49647f1f-bc9a-402c-85c0-6338ea7c9541": {
          "name": "Epidemia"
        },
        "f43a5b4e-6e2d-4f24-b566-f942dc8ce78b": {
          "description": "_Na dzisiejszej lekcji udasz się do Miasta potworów, gdzie niedługo nastąpi epidemia wirusa. Dr Monster potrzebuje Twojej pomocy, aby spowolnić rozprzestrzenianie się wirusa._\n\n_Stworzysz symulator epidemii w Sprite Lab, a następnie użyjesz go, aby zrozumieć, w jaki sposób wirus może się rozprzestrzeniać. Pomożesz też wszystkim potworom odzyskać zdrowie!_",
          "progression_name": "Epidemia"
        },
        "8cbb7cae-6857-4d95-8401-9d1198ee0aec": {
          "description": "**Wykonaj to:** Przeczytaj _Witamy w Mieście potworów_ jako klasa."
        },
        "7fb7bd27-6ada-4f30-9422-37c9ea683969": {
          "progression_name": "Witamy w mieście potworów"
        },
        "5f45c495-ac96-4203-8eb1-92fe77e81b68": {
          "description": "**Wykonaj to:** Przejrzyj słownictwo, **modele i symulacje** z uczniami, korzystając z poprzedniej lekcji. Symulacja to komputerowy model procesu lub systemu."
        },
        "12dc3a29-9b6a-448a-91d7-c795731e097b": {
          "tips": [
            "Bloki zdarzeń w tej lekcji są bardziej zaawansowane niż te, które studenci dotychczas używali w trakcie kursu. Upewnij się, że uczniowie wiedzą, że mogą rozwinąć zielone bloki zdarzeń, naciskając przycisk +. Studenci pracują dziś z dużą ilością sprites. Zwykle polecenia w Sprite Lab wpływają na wszystkie ikonki z tym samym kostiumem. Bloki wewnątrz bloku zdarzeń sprawią, że każda dołączona akcja wpływa tylko na elementy, które były zaangażowane w to zdarzenie."
          ],
          "progression_name": "Film: Wiele Duszków"
        },
        "fc407406-3b2b-46cd-be85-000640f4f949": {
          "progression_name": "Budowanie umiejętności"
        },
        "21348baa-81f3-473d-a4d8-bfdef00cc99e": {
          "progression_name": "Budowanie umiejętności"
        },
        "9456da46-d269-42c3-ab51-42e617b07542": {
          "progression_name": "Uczenie się na podstawie symulacji"
        },
        "7e9c17d4-3d1e-4a6c-a9ef-e1d09bfedee1": {
          "progression_name": "Mini-projekt: Symulator pandemii "
        },
        "40fc31a6-1dc5-41dd-88d1-80206579453f": {
          "progression_name": "Mini-projekt: Symulator pandemii "
        },
        "c154010a-b763-41df-9fcf-67e0ba44fdd7": {
          "description": "_Symulacje to świetny sposób na naukę o tym, co trudno zaobserwować w rzeczywistości. Pomagają naukowcom rozwiązywać problemy, przewidywać sposób ich rozwiązania oraz bezpiecznie i skutecznie testować nowe pomysły. Twoja symulacja to sposób na pokazanie, jak może wyglądać epidemia wirusa w Mieście Potworów._"
        },
        "63fcf28c-54ae-4953-acfd-397dff2ce9d3": {
          "name": "Refleksja"
        },
        "bcf8a087-827a-435a-9ea1-1b5708a800c2": {
          "name": "Buduj napięcie!"
        },
        "9630adaa-f7c1-4efa-8f7e-5d3ceb155b0b": {
          "name": "AI dla oceanów",
          "tips": [
            "Ta lekcja nie powie uczniom, czy ukończyli poziom poprawnie. Możliwe jest szybkie pomijanie różnych części aktywności. Zachęcaj uczniów do oglądania filmów, przeczytania instrukcji i wypróbowania różnych rzeczy po drodze. W każdej chwili uczniowie mogą podzielić się swoimi ustaleniami z Tobą lub kolegą z klasy."
          ],
          "progression_name": "Film - AI: Co to jest uczenie maszynowe?"
        },
        "138f82fc-c0fe-4836-a4f8-a38e874680b5": {
          "tips": [
            "Każdy obraz w tej części lekcji jest wprowadzany do sieci neuronowej, która została wcześniej przeszkolona na ogromnym zbiorze danych o nazwie [ImageNet](http://www.image-net.org/). Baza danych zawiera ponad 14 milionów obrazów z adnotacjami ręcznymi. iMANet zawiera ponad 20 000 kategorii o typowej kategorii, takiej jak „balon” lub „truskawka”, składający się z kilkuset obrazów. Kiedy A.I. skanuje nowe obrazy i tworzy własne prognozy w lekcji, faktycznie porównuje możliwe kategorie nowego obrazu ze wzorami znalezionymi w zbiorze danych szkoleniowych. "
          ],
          "progression_name": "Trenuj AI, by czyścił ocean"
        },
        "d1a3c948-ad03-4d96-81c4-6588163a3015": {
          "progression_name": "Film: Dane treningowe i stronniczość"
        },
        "97505f9d-3e88-4a48-8fb1-66a0dcb61e9e": {
          "tips": [
            "Ryby w tym samouczku są generowane losowo w oparciu o niektóre wstępnie zdefiniowane elementy, w tym usta, ogony, oczy, łuski i płetwy, z losowo wybranym kolorem, kształtem i rozmiarem ciała. Zamiast patrzeć na rzeczywiste dane obrazu, sztuczna inteligencja szuka teraz wzorców w tych elementach na podstawie tego, jak uczeń klasyfikuje każdą rybę. Bardziej prawdopodobne jest oznaczenie ryby w taki sam sposób, jak uczeń to zrobił, jeśli ma ona przystające cechy."
          ],
          "progression_name": "Używanie danych treningowych"
        },
        "febd53d5-1b5e-4e73-a843-482a6a9a0781": {
          "progression_name": "Film: Wpływy na społeczeństwo"
        },
        "4cbe4554-d9fd-4e24-9f7c-572f2874fee9": {
          "progression_name": "Ucz A.I. nowego słowa"
        },
        "f3a8670b-9954-45f9-af08-1689c799a427": {
          "tips": [
            "Możesz opowiedzieć te historie w swojej klasie, aby pomóc jej zrozumieć, jak sztuczna inteligencja będzie oddziaływać na przyszłość.\n\n-   [Marnowanie żywności stanowi poważny problem. Sztuczna inteligencja stara się go rozwiazać](https://singularityhub.com/2019/11/03/food-waste-is-a-serious-problem-ai-is-trying-to-solve-it/)\n-   [Technologia sztucznej inteligencji jest w stanie zidentyfikować zaburzenia genetyczne na podstawie ludzkiej twarzy](https://mashable.com/video/ai-identify-genetic-disorders-photo/?)\n-   [W jaki sposób sztuczna inteligencja zaprojektowała kandydata na nowy lek zaledwie w 46 dni](https://singularityhub.com/2019/09/09/how-an-ai-startup-designed-a-drug-candidate-in-just-46-days/)\n-   [Sztuczna inteligencja uczelni MIT AI jest w stanie prognozować raka piersi z piecioletnim wyprzedzeniem](https://techcrunch.com/2019/06/26/mit-ai-tool-can-predict-breast-cancer-up-to-5-years-early-works-equally-well-for-white-and-black-patients/)\n-   [Wojsko przyspiesza tempo pojazdów samobieżnych](https://www.axios.com/us-army-military-casualties-autonomous-vehicles-1ff51e01-3b16-4a1c-9587-ce55dee74788.html?)\n-   [W San Francisco mówi się o korzystaniu ze sztucznej inteligencji w celu wyeliminowania uprzedzeń przy oskarżaniu ludzi o przestępstwa](https://www.theverge.com/2019/6/12/18663093/ai-sf-district-attorney-police-bias-race-charge-crime)\n-   [AI is helping scholars restore ancient Greek texts on stone tablets](https://techcrunch.com/2019/10/18/ai-is-helping-scholars-restore-ancient-greek-texts-on-stone-tablets/)"
          ]
        },
        "676b1021-0b14-463c-85eb-beca19002ac2": {
          "description": "\\*\\*Dyskutuj: \\*\\* Zaczynając od małych grup, a następnie przechodząc do całej klasy, uczniowie dzielą się swoimi odpowiedziami.\n\n\\*\\*Cel: \\*\\* Zapoznaj studentów ze światem sztucznej inteligencji.  "
        },
        "56809556-ceb9-4fbb-b3c7-e5345d64ffe8": {
          "description": "**Say: \\*\\* \\_**Uczenie maszynowe\\*\\* odnosi się do komputera, który potrafi rozpoznać wzorce i samodzielnie podejmować decyzje na podstawie danych. W tej aktywności masz zamiar dać dane komputera, aby go trenować. Wyobraź sobie ocean, który zawiera stworzenia takie jak ryby, ale zawiera również śmieci wyrzucane przez ludzi. Co jeśli moglibyśmy wyszkolić komputer, by odróżnić, a potem użyć tej technologii do oczyszczenia oceanu? \\_"
        },
        "5f554a52-41ac-4982-bfd0-e3deb97bc410": {
          "name": "Refleksja"
        },
        "04f13b6a-1f5c-4c1f-8c9e-cbb4dca0273b": {
          "name": "A.I. w bieżących wydarzeniach",
          "description": "Możesz opowiedzieć te historie w swojej klasie, aby pomóc jej zrozumieć, jak sztuczna inteligencja będzie oddziaływać na przyszłość.\n\n-   [Marnowanie żywności stanowi poważny problem. Sztuczna inteligencja stara się go rozwiazać](https://singularityhub.com/2019/11/03/food-waste-is-a-serious-problem-ai-is-trying-to-solve-it/)\n-   [Technologia sztucznej inteligencji jest w stanie zidentyfikować zaburzenia genetyczne na podstawie ludzkiej twarzy](https://mashable.com/video/ai-identify-genetic-disorders-photo/?)\n-   [W jaki sposób sztuczna inteligencja zaprojektowała kandydata na nowy lek zaledwie w 46 dni](https://singularityhub.com/2019/09/09/how-an-ai-startup-designed-a-drug-candidate-in-just-46-days/)\n-   [Sztuczna inteligencja uczelni MIT AI jest w stanie prognozować raka piersi z piecioletnim wyprzedzeniem](https://techcrunch.com/2019/06/26/mit-ai-tool-can-predict-breast-cancer-up-to-5-years-early-works-equally-well-for-white-and-black-patients/)\n-   [Wojsko przyspiesza tempo pojazdów samobieżnych](https://www.axios.com/us-army-military-casualties-autonomous-vehicles-1ff51e01-3b16-4a1c-9587-ce55dee74788.html?)\n-   [W San Francisco mówi się o korzystaniu ze sztucznej inteligencji w celu wyeliminowania uprzedzeń przy oskarżaniu ludzi o przestępstwa](https://www.theverge.com/2019/6/12/18663093/ai-sf-district-attorney-police-bias-race-charge-crime)\n-   [AI is helping scholars restore ancient Greek texts on stone tablets](https://techcrunch.com/2019/10/18/ai-is-helping-scholars-restore-ancient-greek-texts-on-stone-tablets/)"
        },
        "768fdc30-25c8-40ae-846a-6de108de3a9f": {
          "name": "Wstęp"
        },
        "f7e2b7b8-84ff-442f-bd6a-831da855966f": {
          "tips": [
            null
          ]
        },
        "1b0d023d-bf54-4703-af7e-5d9fd45d755d": {
          "tips": [
            "Istnieje kilka świetnych filmów z YouTube na ten temat, które mogą sprawić, że ta lekcja będzie nieco łatwiejsza do zrozumienia. Możesz pokazać je klasie z wyprzedzeniem lub po prostu obejrzeć je samodzielnie. [Oto jeden z filmów z serii wideo Code.org na temat „Jak działa Internet\"](https://www.youtube.com/watch?v=5o8CwafCxnU&list=PLzdnOPI1iJNfMRZm5DDxco3UdsFegvuB7&index=3). \n(Zalecamy oglądanie od 1:44 - 5:13, jeśli to możliwe). Reszta playlisty jest dostępna [here](https://www.youtube.com/watch?v=Dxcc6ycZ73M&list=PLzdnOPI1iJNfMRZm5DDxco3UdsFegvuB7)."
          ]
        },
        "07e83a27-5530-4af9-bc71-88838f668e86": {
          "tips": [
            "Jeśli myślisz, że jest to dużo tekstu i byłoby bardzo nudne, aby spróbować pouczać to do klasy pełnej dzieci w szkole podstawowej, masz absolutną rację!\nJeśli nie jesteś w stanie pokazać filmu z YouTube w klasie, aby pomóc wyjaśnić to wszystko, gorąco polecam rysowanie zdjęć w celu wyjaśnienia każdego pomysłu powyżej, lub wybranie uczniów jako wolontariuszy do działania, co opisujesz podczas wyjaśniania. Nie oczekuje się, że w tym momencie uzyskają każdy szczegół i definicję, tylko po to, by uzyskać ekspozycję."
          ]
        },
        "0965b5bc-06b2-458d-b6c5-9c6f9f2f6340": {
          "name": "Internet",
          "progression_name": "Internet - Aktywność bez komputera"
        },
        "3b419e1c-6cbf-4940-b2a0-c12606b359e1": {
          "tips": [
            "Jeśli wydaje się, że istnieje zbyt wiele zasad, aby wyjaśnić wprost, nie krępuj się, aby umieścić je na planszy i po prostu wyjaśnić grę, jak idziesz. Możesz grać wiele rund, dopóki klasa naprawdę zrozumie."
          ]
        },
        "fc104032-9a2d-443a-96d0-e7f4c6de6782": {
          "name": "Refleksja",
          "tips": [
            "Pytania Flash Chat mają na celu wywołanie wielkiego obrazu myślenia o tym, jak lekcja odnosi się do większego świata i większej przyszłości uczniów. Skorzystaj ze swojej wiedzy o klasie, aby zdecydować, czy chcesz omówić je jako zajęcia, w grupach czy z partnerem łokciowym."
          ]
        },
        "f26ccabe-2b34-481f-b142-b6227421df3e": {
          "name": "Odkrywaj"
        },
        "f8419af8-d199-4cb6-b4dc-ea619a1ea802": {
          "progression_name": "Przykłady projektów"
        },
        "ad3b60a9-c96d-4e0b-b124-5f6f34d1c85c": {
          "progression_name": "Utwórz swój projekt"
        },
        "ba61b408-4ce9-4056-8e42-3efac281242e": {
          "name": "Definiowanie i przygotowanie"
        },
        "de7ab6f7-a853-4f00-b05d-a9db0bb2da2d": {
          "tips": [
            "Zaoszczędź 5 minut na koniec dnia, aby uczniowie wymieniali arkusze ostatecznego projektu projektu, aby przyjrzeć się swojej pracy. Pomoże to upewnić się, że nic nie zostanie pominięte ani pominięte."
          ]
        },
        "3591fc28-830a-4a32-94e4-3468853cea32": {
          "name": "Spróbuj"
        },
        "bad6c34f-b32e-4116-908c-7eb4fc2ca6a4": {
          "tips": [
            null
          ]
        },
        "38c0b06f-e0b8-4739-b359-6513f419fd11": {
          "tips": [
            "Nauczyciele powinni unikać przypisywania ostatniej części pracy projektowej jako pracy domowej, chyba że mają pewność, że uczniowie mieszkają w bliskiej odległości od siebie **i** mają dostęp do Internetu w domu."
          ]
        },
        "0d190d49-c24a-4c56-8322-5a72e797a075": {
          "name": "Prezentacje - Dzień 5"
        },
        "4b48da8b-113d-4b9b-94ff-c776a0cab3b9": {
          "tips": [
            "Jeśli szukasz sekcji tej serii, aby przypisać jako zadanie domowe, to jest to! Projekty nie muszą być prezentowane w formie elektronicznej, więc jest to świetna opcja offline."
          ]
        },
        "321cfa4e-750c-424e-a221-8c22a0a592c5": {
          "name": "Prezentacje - Dzień 6",
          "description": "Studenci będą w dalszym ciągu prezentować swoje projekty w sposób zatwierdzony (pisemny, ustny lub multimedialny)."
        },
        "1b707283-b28d-4147-921e-691c3e5325fe": {
          "tips": [
            null
          ]
        },
        "e5a4600f-c0cb-4f61-82bc-b1fdff9ad731": {
          "name": "Przemyśl "
        },
        "c3102dcc-a35a-489f-8461-06e0aa3d5125": {
          "description": "Jeśli Twoi uczniowie czują się swobodnie z koncepcjami kodowania, spróbuj skłonić ich do tworzenia swoich projektów w innej platformie, takiej jak [Scratch](https://scratch.mit.edu/) lub [Alice](http://www.alice.org/index.php)."
        },
        "d7eee78e-d5fd-418e-9dce-3cb0f1be8122": {
          "name": "Lekcje rozszerzeń z mikro:bitem",
          "description": "Aby wykorzystać umiejętności, których nauczyłeś się w Kursie F Podstaw Informatyki kliknij [here](http://code.org/maker/csf-microbit), aby sprawdzić rozszerzone lekcje z micro:bitem. Te [4 lekcje z micro:bitem](https://code.org/maker/assets/CSF-Booklet-Course-F-v3.pdf) obejmują następujące tematy: Poznaj swój micro:bit, Zmienne, Dane, Zdarzenia, Symulacja, Pętle, i Instrukcje warunkowe."
        },
        "b01367f6-8c61-4417-9d29-193fd67ddac0": {
          "name": "Słownictwo kluczowe"
        },
        "3c23fa37-7254-47f3-b576-da07d0b605dd": {
          "progression_name": "Bądź Super Cyfrowym Obywatelem"
        },
        "8a089041-e523-46ab-99f6-80c9f1f22523": {
          "name": "Słownictwo kluczowe"
        },
        "7af8b468-66ad-4d3b-a9c3-2ff50362f027": {
          "name": "Wstęp",
          "tips": [
            "Takie monity o odbicie mogą być uzupełniane w różnych stylach. Dziennikarstwo lub dyskusja (z grupami lub partnerami) to świetne opcje!"
          ]
        },
        "9a18adb7-3bfe-410d-89dc-79ccde9c3419": {
          "tips": [
            null
          ]
        },
        "8ad1b5bf-8e05-4fad-89fc-ef821c11b02f": {
          "name": "Pływająca ryba w Sprite Lab"
        },
        "9e16dba8-c792-499c-aa27-cbea95bf15cd": {
          "description": "\\*\\*Przejście: \\*\\* Przenieś uczniów do swoich komputerów. Zachęcaj uczniów do przestrzegania instrukcji dla każdej układanki. Pomóż im zrozumieć, że jest to twórcze działanie, które ma pomóc im w nauce Sprite Lab. Nie jest to żaden rodzaj działalności oceniającej.",
          "tips": [
            "Zachęcaj uczniów do zadawania pytań/wyzwań do rozpoczęcia od pytania partnera. Pytania bez odpowiedzi można eskalować do pobliskiej grupy, która może już znać rozwiązanie. Niech uczniowie opisują problem, który widzą:  \n\n-   Co to ma zrobić? \n-   Co to robi? \n-   Co ci to mówi?"
          ]
        },
        "14e8ba9a-beb7-4dfa-8f45-6b763221f4c1": {
          "progression_name": "Film: Przedstawiamy Sprite Lab  "
        },
        "6387c7a5-11bc-4b51-9079-ba599124ce44": {
          "progression_name": "Przewidywanie"
        },
        "ff7aa3e1-8328-41bf-b516-51ca5ea0a800": {
          "progression_name": "Budowanie umiejętności"
        },
        "1a4debc6-59c9-4c5a-8811-8a3cadf8be7a": {
          "progression_name": "Film: jak utworzyć duszka"
        },
        "a5c4b601-4e45-4261-b7a6-9ffefd154aa2": {
          "progression_name": "Ćwiczenia"
        },
        "dce569eb-0a60-42a9-9e31-855a6b138f92": {
          "progression_name": "Czas na zabawę"
        },
        "470b57f7-12df-47d0-acc3-63cb72051541": {
          "name": "Refleksja"
        },
        "66c1f19a-bfc9-4569-8b6c-c0eb3b6336ae": {
          "name": "Budowanie atmosfery"
        },
        "c348bc71-c908-4f5f-8ebe-b5dcd92cd4dc": {
          "name": "Seria wydarzeń"
        },
        "0dfd76e3-4d45-4581-b98f-141d1fcfc804": {
          "description": "_W tym ćwiczeniu będziemy dobrze się bawić tworząc interaktywny świat pełen zabawnych postaci zwanych duszkami. Będziesz w stanie sprawiać, by duszki mówiły różne rzeczy korzystając z \"dymków z wypowiedziami\", jakie można zobaczyć w komiksie lub w powieści graficznej i nauczysz się odpowiadać automatycznie, gdy Ty lub ktoś inny je klika._\n\n_Dzisiaj będziecie pisać \"kod\", oznaczający zestaw instrukcji, które komputer jest w stanie zrozumieć. Pisząc opowieść musisz uważnie dobierać słowa. Gdy będziesz pisał kod, musisz uważnie zastanawiać się nad tym, jakie instrukcje przekazujesz komputerowi_"
        },
        "59a9f2f9-23f8-4562-a6ed-09063806bcff": {
          "name": "Ogólne wsparcie",
          "description": "Oto kilka wskazówek, które powinny pomóc uczniom niezależnie od poziomu, na którym pracują\n\n-   **Współpracuj z Sąsiadami:** Zachęcaj uczniów, aby kontaktowali się z sąsiadem, gdy \"utkną\" na czymś. W zależności od wieku i możliwości Twoich uczniów, możesz zastanowić się nad podzieleniem swojej klasy na pary, aby ukończyli samouczek korzystając z [programowania w parach](https://youtu.be/vgkahOzFH2Q).  \n\n-   **Przeczytaj instrukcje:** W instrukcjach podsuwa się zwykle pomocne wskazówki na temat tego, jak przejść poziom. Zanim podaniem uczniom odpowiedzi upewnij się, czy uważnie zapoznali się z instrukcjami, wskazówkami, filmami i kodem pocztkowym.\n\n-   <img src=\"https://curriculum.code.org/media/uploads/hint.png\" style=\"height: 35px;\"> **Utknąłeś? Szukaj wskazówek:** Każdy poziom zawiera wskazówkę z poradą, jak go przejść, z uwzględnieniem bloków kodu do wypróbowania.\n\n-   **Nie spiesz się i eksperymentuj.** Instrukcje zasadniczo \"mówią\" uczniom co mają robić, ale powinni czuć, że mają swobodę, która pozwala wypróbowywać własne pomysły."
        },
        "3f7d6459-ecb9-4e7a-bf73-8cb15f8e9c4b": {
          "name": "Witaj świecie"
        },
        "5c9fce3b-e030-4ff3-8943-67f13f9dbbf8": {
          "progression_name": "Budowanie umiejętności"
        },
        "0121aca1-bd15-436e-ac4d-5424f269e25a": {
          "progression_name": "Budowanie umiejętności"
        },
        "83a864f0-7f6f-4ef6-8969-b0627bf8ef55": {
          "progression_name": "Czas na zabawę"
        },
        "ff807207-f4fc-4368-8df5-b4a35942dd53": {
          "description": "Jeśli jakaś grupa lub osoba skończy szybciej, zachęcaj do kontynuowania budowania projektu na ostatnim poziomie. Jeśli uczniowie nie mają pewności, co jeszcze mają zrobić, możesz podpowiedzieć im posługując się następującymi pytaniami:\n\n-   Jakie inne duszki mógłbyś dodać do swojego projektu?\n-   Czy przeglądałeś bibliotekę kostiumów, czy próbowałeś rysować swój własny kostium duszka?\n-   Do mówienia czego jeszcze mógłbyś skłaniać swoje duszki?\n-   Co powinny robić Twoje duszki, gdy ktoś je kliknie?\n-   Zachęć uczniów do ujawniania swoich pomysłów i uczenia się od siebie wzajemnie. Mogą również wypróbowywać inny samouczek wchodząc na [code.org/learn](https://code.org/learn)."
        },
        "ebbcd2fa-1991-41d3-a054-232b53cf8f17": {
          "name": "Refleksja"
        },
        "8489f43d-dff8-41c9-aeca-e699cb7e8adc": {
          "name": "Wstęp"
        },
        "e3d34b0d-b3a0-49a0-9ff0-6d7bf1679b1c": {
          "tips": [
            null
          ]
        },
        "e56da37d-683e-4dc5-89f1-da5e039357d9": {
          "progression_name": "O mnie ze Sprite Lab"
        },
        "163b611c-e2ba-4242-8842-33cb5c319a9b": {
          "name": "Podziel się"
        },
        "f3d434b2-d9ce-4dce-b77b-2ed20f99734b": {
          "name": "Refleksja"
        },
        "d058a787-37d6-4c25-b5c0-c427b5bc9373": {
          "name": "Wstęp"
        },
        "11131345-98a9-4474-8782-c0d97fe84206": {
          "name": "Rysowanie przy pomocy pętli ",
          "progression_name": "Film: Artysta wprowadzenie z JR Hildebrand"
        },
        "d8046ff6-568f-4a94-a37c-3f32f63b19fe": {
          "progression_name": "Budowanie umiejętności"
        },
        "69565308-7412-44cc-a895-b4162321caa9": {
          "progression_name": "Film: Pętle z Artystą"
        },
        "56779577-ac08-415f-b1bd-9ba7abdcf29e": {
          "progression_name": "Budowanie umiejętności"
        },
        "943384fb-1136-4a81-95e0-d5d6f1f9b817": {
          "progression_name": "Ćwiczenia"
        },
        "0f2d930f-f0ed-4b9a-b2f4-ba259ad3ee4a": {
          "progression_name": "Dodatki do Lekcji"
        },
        "9bc82847-83ea-45a1-bbf6-219144c13563": {
          "name": "Refleksja"
        },
        "83e6c37d-1cc1-49b9-b208-79567063fb20": {
          "name": "Wstęp"
        },
        "1c8c1c88-3c2e-4c1b-bcf8-4e217730d0a6": {
          "tips": [
            null
          ]
        },
        "fe5271b2-e5f3-44f5-94d8-d4630bb9d37d": {
          "progression_name": "Budowanie umiejętności"
        },
        "9c33a50c-2471-4797-b3c7-024447bf16ff": {
          "progression_name": "Film: zagnieżdżone pętle"
        },
        "7571aba3-7786-43cb-91e3-4d1a3218c6cc": {
          "progression_name": "Budowanie umiejętności"
        },
        "0ecc0bd0-6893-4e8d-abf3-176120a15c2b": {
          "progression_name": "Ćwiczenia"
        },
        "45275988-8cf4-4043-b5a4-659cc090346a": {
          "progression_name": "Czas na zabawę"
        },
        "cd8571ad-24a7-4231-92f5-ec2e33b8c7c2": {
          "progression_name": "Dodatki do Lekcji"
        },
        "0b5c0d6e-7e98-4c6e-afe5-0ef4e99677b0": {
          "name": "Refleksja"
        },
        "0242f01c-8a92-4d38-9d15-93132d346a76": {
          "name": "Wstęp"
        },
        "7823fbff-f32d-4f4f-808e-1bc340e10cf2": {
          "name": "Zagnieżdżone pętle w Krainie Lodu",
          "progression_name": "Mini-projekt: Płatek śniegu #1"
        },
        "2bbcbfb8-df97-457d-9891-719b479cd6b0": {
          "progression_name": "Mini-projekt: Płatek śniegu #2"
        },
        "f826bb4e-317d-4660-9b78-cd1ddb2adc50": {
          "name": "Refleksja"
        },
        "b6db9c2f-2e77-42e0-bc68-93d8f8e9b4b4": {
          "name": "Wstęp"
        },
        "fa573a03-86f6-43da-ad41-1e726bc6fd8a": {
          "tips": [
            null
          ]
        },
        "7633c66a-ea8d-4974-9b0a-3b1eeb1e7fa8": {
          "tips": [
            null
          ]
        },
        "d3f1d3da-8013-4459-a62c-4a67b4457c61": {
          "name": "Pisanie piosenek",
          "progression_name": "Pisanie piosenek — Funkcje, aktywność bez komputera"
        },
        "850fd05d-eae1-4111-a12a-31ab15e4d5be": {
          "tips": [
            null
          ]
        },
        "85d7cd29-59ea-4d90-909c-a8a16824797f": {
          "name": "Refleksja",
          "tips": [
            "Pytania Flash Chat mają na celu wywołanie wielkiego obrazu myślenia o tym, jak lekcja odnosi się do większego świata i większej przyszłości uczniów. Skorzystaj ze swojej wiedzy o klasie, aby zdecydować, czy chcesz omówić je jako zajęcia, w grupach czy z partnerem łokciowym."
          ]
        },
        "c314e193-0618-4863-9796-8c72975804fc": {
          "description": "Użyj tych ćwiczeń, aby urozmaicić naukę uczniów. Można je wykorzystać do zajęć pozalekcyjnych albo w ramach urozmaicenia innego rodzaju.\n\n**Funkcjonalne łapacze słońca [Functional Suncatchers]**\nWejdź na [\"Tabelę w trybie \"unplugged\" - bez komputera - Podstaw informatyki\" {CS Fundamentals Unplugged Table}](https://code.org/curriculum/unplugged) lub  kliknij w link do [\"Funkcjonalnych łapaczy słońca\" {Functional Suncatchers}](https://studio.code.org/s/course3/stage/4/puzzle/1). Na te zajęcia potrzebne są pewne materiały ze sklepu dla majsterkowiczów, ale dzięki nim uczniowie mogą zobaczyć wartość wywoływania wielu funkcji. \n\n**Utwórz swoją piosenkę**\n\n-   Zacznij od skomponowania refrenu, a następnie powtórz go między zwrotkami piosenki, którą go obudowujesz.\n-   Wprowadź zmianę do refrenu i zastanów się o ile łatwiejsze jest wprowadzenie zmiany tylko w jednym miejscu. \n-   Zmień refren jeszcze raz, niech tym razem będzie dłuższy niż za pierwszym razem.\n-   Dodaj drugi refren i stosuj je zamiennie pomiędzy zwrotkami.\n\n**Pisanie programu na zasadzie piosenki**\n\n-   A jeśli odgrywalibyśmy piosenki zamiast je śpiewać? Nagle nasz refren stałby się funkcją powtarzanych czynności, a nie słowami.\n-   Wykorzystaj koncepcje strzałek z lekcji \"Programowanie na papierze milimetrowym\" i utwórz program, w którym będzie mnóstwo powtarzających się instrukcji. \n    -   Otocz kółkiem te powtarzające się czynności, aby klasa mogła zobaczyć, gdzie one są. \n    -   Zdefiniuj funkcję zwaną \"Refrenem\" nad programem. \n    -   Wykreśl wszędzie tam, gdzie pojawiają się powtarzające się działania w programie i zamiast tego napisz \"Refren\".\n-   Powtarzaj aż do momentu, w którym klasa będzie w stanie przejść proces uzyskując zaledwie niewielkie instrukcje. "
        },
        "e46c5e2b-810a-412d-b3c8-4866111b0589": {
          "name": "Wstęp"
        },
        "39448b98-4357-44bc-ad9a-84ed2a9b36a8": {
          "tips": [
            "Bloki funkcyjne:\n\n![](https://images.code.org/88901576439e1a7b660a87952d4bf7de-E.7-lesson-hint.png)\n\nBlok po lewej stronie jest deklaracją funkcji, blok, który uczniowie będą wymieniać i używać do wypełnienia funkcji. Blok po prawej stronie jest wywołanie funkcji, blok, który sprawia, że kod funkcji działa. Studenci będą potrzebować wielu bloków wywołania funkcji."
          ]
        },
        "21c9ad75-e56e-4462-ae9a-178a2fd85e3a": {
          "name": "Podgląd łamigłówek online"
        },
        "b52ccd27-4398-4746-83f5-b510154fb1d7": {
          "name": "Funkcje w Minecrafcie",
          "tips": [
            "Zalecamy dostarczenie studentom papieru i ołówków do pisania (lub rysowania) pomysłów. Ponadto, jeśli uczniowie mają problemy z rozpoznaniem wzorców, mają one pracować z partnerem na trudniejsze zagadki."
          ],
          "progression_name": "Film: Minecraft - Agent"
        },
        "db999346-e73e-4580-8c5f-d76e30ab2b7d": {
          "progression_name": "Budowanie umiejętności"
        },
        "5607dcf8-03d6-4b10-8dcc-afa2beb681c7": {
          "progression_name": "Film: Minecraft - Pętle powtarzania"
        },
        "3ee7b90a-c59c-47ae-96f2-c5e9bc506d2a": {
          "progression_name": "Budowanie umiejętności"
        },
        "d24f28cb-b90f-45e4-bca2-b2a2f75ffde5": {
          "progression_name": "Film: Minecraft - Funkcja"
        },
        "356734de-fbb9-4ac7-b554-2daaa9d70fee": {
          "progression_name": "Budowanie umiejętności"
        },
        "89ce0165-42fa-489a-bc9a-96ddcd686360": {
          "progression_name": "Film: Minecraft - Gratulacje"
        },
        "6ddf83bf-3856-4d68-a048-ac5a0ac26349": {
          "progression_name": "Czas na zabawę"
        },
        "78a9d808-3832-4ea0-976e-f89295d9e96f": {
          "name": "Refleksja"
        },
        "73440a78-9446-4eb3-859e-35c77ce9f79a": {
          "name": "Wstęp"
        },
        "ad4c144f-f494-49ec-8184-dcf881dc5823": {
          "name": "Funkcje z Artistą",
          "progression_name": "Przewidywanie"
        },
        "ada4de0f-53bc-4130-bd2f-0da228ca7b7e": {
          "progression_name": "Budowanie umiejętności"
        },
        "ed239e2c-51b5-4a74-a44b-3a8e2486ba1b": {
          "progression_name": "Ćwiczenia"
        },
        "6698a795-4281-4c01-a74e-ec5703f653b9": {
          "progression_name": "Dodatki do Lekcji"
        },
        "d6f43957-de44-4e64-8418-331e0bb6ee14": {
          "name": "Refleksja"
        },
        "70ad846c-ec79-4734-b49f-bf65648266a4": {
          "description": "Użyj tych działań, aby usprawnić naukę uczniów. Mogą być używane jako poza zajęciami klasowymi lub innym wzbogacaniem.\n\n#### Draw by Functions\n\nPodziel klasę na grupy 2-3 uczniów. Niech każda grupa napisze funkcję, która rysuje jakiś kształt i program, który korzysta z tej funkcji. W zależności od kreatywności lub skupienia grup studentom może być konieczne przypisanie kształtu do utworzenia. Gdy każda grupa jest wykonywana, mają grupy przełączać programy. Na osobnym kawałku papieru każda grupa powinna narysować to, co tworzy program. Grupy powinny następnie zwrócić programy i rysunki do pierwotnej grupy.\n\nCzy każda grupa otrzymała rysunek, którego oczekiwali? Jeśli nie, to co poszło nie tak? Niech klasa przejdzie przez proces debugowania i spróbuj ponownie."
        },
        "8628e382-350f-40de-9e22-d522ab7fd289": {
          "name": "Wstęp"
        },
        "931a781a-12c2-4079-842c-71002b1bb8a2": {
          "name": "Wyrażenia warunkowe w Minecrafcie: Wodna podróż",
          "progression_name": "Film: Minecraft - Wodna Podróż - Wprowadzenie"
        },
        "09b06756-c981-4af6-a6ea-5697f8fa78e2": {
          "progression_name": "Budowanie umiejętności"
        },
        "60e4bed4-0af0-4f4c-87fd-d778bc66f1c8": {
          "progression_name": "Film: Minecraft - Wodna Podróż - Powtarzaj aż"
        },
        "d2e8a5d0-a31d-4a17-a649-8e1cc2aa735a": {
          "progression_name": "Budowanie umiejętności"
        },
        "1d87b667-a7f7-4fb7-811b-304ff0178d97": {
          "progression_name": "Film: Minecraft - Wodna Podróż - Warunki"
        },
        "6d700f77-eea3-46c2-8ea6-27454cbaf9ab": {
          "progression_name": "Budowanie umiejętności"
        },
        "cc1c1ece-121e-4dd3-a117-dadaddcc56d1": {
          "progression_name": "Film: Minecraft: Wodna Podróż - Gratulacje"
        },
        "cbae92bc-d7b3-4707-a5f9-c5b373bdaee7": {
          "progression_name": "Czas na zabawę"
        },
        "a8369823-7441-45a9-993c-3546a2f85efe": {
          "name": "Refleksja"
        },
        "40e44f38-d3c6-46d5-a9c6-c9951512063e": {
          "description": "Użyj tych działań, aby usprawnić naukę uczniów. Mogą być używane jako poza zajęciami klasowymi lub innym wzbogacaniem.\n\n#### Więcej Minecraft\n\nJeśli okaże się, że twoja klasa naprawdę cieszy się środowiskiem _Minecraft_, [oto kilka linków do innych gier \\_Minecraft\\_ mogą grać online](https://code.org/minecraft). Te gry będą również uczyć podstawowych umiejętności kodowania."
        },
        "7538f281-8565-4235-a3f1-a40a2679d73d": {
          "name": "Wstęp"
        },
        "a24e03d0-5524-46ec-ab96-a0b1d9b24d8b": {
          "name": "Wyrażenia warunkowe z interfejsem Farmer",
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "bfb6e1c5-96c2-4d97-932f-2ca660c2854f": {
          "progression_name": "Film: Pętle \"dopóki\" z Farmerem"
        },
        "ee4b7d3c-b6b2-4e05-bcb8-cedc77db80c0": {
          "progression_name": "Przewidywanie"
        },
        "2908bd65-d321-4b6f-a5f3-6d550564bbaa": {
          "progression_name": "Budowanie umiejętności"
        },
        "e81da78c-ac8a-4212-bbe4-07ba9cfebc9e": {
          "progression_name": "Film: Bloki powtarzaj aż"
        },
        "62f9f06c-c008-464b-b1fb-86e224ce1018": {
          "progression_name": "Budowanie umiejętności"
        },
        "2c2983a7-3e7f-4e05-bc7f-c5663ad6e446": {
          "progression_name": "Film: \"jeśli/w przeciwnym razie\""
        },
        "2b231315-7f71-4e5f-a7b9-e32def714216": {
          "progression_name": "Wyzwanie"
        },
        "64fc9e91-c7c8-496d-8820-e7ae95fba0ee": {
          "progression_name": "Ćwiczenia"
        },
        "4bfcc176-30cf-46d2-b6a1-7878cd32087f": {
          "name": "Refleksja"
        },
        "93c7190d-ff63-4aa2-a7f5-cf7546acdb61": {
          "name": "Wstęp"
        },
        "64c2a884-631f-45d1-b192-29788fe3e807": {
          "name": "Zagadki online",
          "progression_name": "Film: Kombajn"
        },
        "19a96cd7-57c5-4a55-a7a2-e71a01464fb4": {
          "progression_name": "Budowanie umiejętności"
        },
        "33f5530f-7a4e-49ee-b9e3-b4c4a8ddc597": {
          "progression_name": "Wyzwanie"
        },
        "fa627e9a-9b25-4ce7-8b89-e5d4da2c3a22": {
          "progression_name": "Ćwiczenia"
        },
        "023d0047-47de-45f4-8a03-a913ca40ace6": {
          "progression_name": "Przewidywanie"
        },
        "be75c786-414d-4ba7-a1cf-bd5b444be3b2": {
          "name": "Refleksja"
        },
        "2cf54fda-a233-45c5-a347-5ea0150eb697": {
          "name": "Projektowanie pod kątem dostępności",
          "progression_name": "Projektowanie pod kątem dostępności"
        },
        "e1fe5c10-383e-402b-a4c2-1efbbb6641c1": {
          "name": "Refleksja"
        },
        "179685a9-6ed2-454f-8a2b-76c4032f1d16": {
          "tips": [
            null
          ]
        },
        "90986348-020e-4b00-b92f-ba4160018feb": {
          "name": "Udostępnianie cyfrowe",
          "progression_name": "Udostępnianie cyfrowe — Aktywność bez komputera"
        },
        "3f9da29a-6132-4d1b-937a-5732b48eeb94": {
          "tips": [
            null
          ]
        },
        "26e345f8-d754-44a5-9197-e0554116562e": {
          "name": "Refleksja"
        },
        "6ef6c719-244f-449d-9d81-75283f9d48e4": {
          "description": "Prosimy o  upewnienie się, że odwiedzicie [Copyright & Creativity ](https://copyrightandcreativity.org), aby znaleźć lekcje dotyczące praw do cyfrowego udostępniania i twórczości."
        },
        "b032e6b2-4dfd-431c-a938-06a8bd4a8056": {
          "name": "Odkrywaj"
        },
        "8c2b4d58-a189-4531-bc7c-bfcb4bce7ca8": {
          "progression_name": "Przykłady projektów"
        },
        "e43bfad4-b411-4e0d-a59c-2e4764fd9c65": {
          "progression_name": "Utwórz swój projekt"
        },
        "2b896f9c-c882-4d79-8e23-1c8dc76cac95": {
          "name": "Definiowanie i przygotowanie"
        },
        "a0f0bda0-512f-4e9c-8c28-1f749a2a7431": {
          "tips": [
            null
          ]
        },
        "228ce73f-d412-4eb0-a561-eadaff60821f": {
          "name": "Spróbuj"
        },
        "84a78eea-27de-4815-8e24-1323addfe7ab": {
          "tips": [
            null
          ]
        },
        "0eedf65b-e0ac-4592-bb40-fa06cd21b31a": {
          "name": "Prezentacje - Dzień 5"
        },
        "5fa5c47a-6198-4e47-b5e6-f7784b309d54": {
          "tips": [
            null
          ]
        },
        "53b377b0-6916-4b90-977b-bd9dab3dc424": {
          "name": "Prezentacje - Dzień 6"
        },
        "9946dfc7-dce9-4ead-bbdc-aec0d224bbc9": {
          "name": "Przemyśl"
        },
        "be35b565-6d45-46fa-ae1a-c5d1aeb2f901": {
          "name": "Lekcje rozszerzeń z mikro:bitem",
          "description": "Aby wykorzystać umiejętności, których nauczyłeś się w Kursie E Podstaw Informatyki kliknij [here](https://code.org/maker/csf-microbit), aby sprawdzić rozszerzone lekcje z micro:bitem. Te [4 lekcje z micro:bitem](https://code.org/maker/assets/CSF-Booklet-Course-E-v5.pdf) obejmują następujące tematy: Poznaj swój micro:bit, Zdarzenia, Wpływ informatyki, Projektowanie dla dostępnosci, Pętle, Instrukcje warunkowe (jeśli ... to), i Funkcje."
        },
        "a4e7ad08-e07b-4d9b-bc75-838ae92df60d": {
          "name": "Słownictwo kluczowe",
          "description": "-   **online**: korzystanie z komputera, telefonu lub tabletu do odwiedzenia strony internetowej lub aplikacji\n\n**Ask**: \\_Co oznacza zachowanie? \\_ ([Slajd 3](https://docs.google.com/presentation/d/1IXZ_WSxUuenF42ZzWk5pXTD8-Yy8P4nV2ihHd5-FotY/edit#slide=id.g590d551e23_0_56))\n\nOdpowiedzi uczniów będą się różnić, ale wyróżnij następujące kwestie: naśmiewanie się z tego, jak ktoś wygląda, rozprzestrzenianie kłamstw o kimś i mówienie im niegrzecznych rzeczy.\n\n**Ask**: \\_Jak to zachowanie sprawia, że ludzie czują się? \\_\n\nZaproś uczniów do odpowiedzi. Odpowiedzi będą się różnić, ale możliwe odpowiedzi obejmują uczucie bólu, zły, zdenerwowany i przestraszony.\n\n**Zapyt**: \\_Co należy zrobić, jeśli kiedykolwiek doświadczysz, że ktoś jest dla ciebie niemiły lub jeśli widzisz kogoś wrednego dla innej osoby?\n\nZaproś uczniów do odpowiedzi i podkreśl, że powinni zawsze powiedzieć zaufanej osobie dorosłej, jeśli doświadczy lub jest świadkiem jakiejkolwiek formy podłości.\n\n**Say**: _Internet jest wypełniony zabawnymi i ciekawymi rzeczami, ale czasami ludzie mogą być dla siebie niemili w Internecie._\n\nWyjaśnij, że **online** oznacza używanie komputera, telefonu lub tabletu do odwiedzenia strony internetowej lub aplikacji ([Slajd 4](https://docs.google.com/presentation/d/1IXZ_WSxUuenF42ZzWk5pXTD8-Yy8P4nV2ihHd5-FotY/edit#slide=id.g5bf47fcc31_0_2))\n\nWyjaśnij studentom, że niektóre przykłady podłości online to: \n\n-   Wysyłanie komuś średniej wiadomości\n-   Publikowanie myśli o kimś na stronie\n-   Nabijając się z kogoś online\n-   Robi myśli czyjejś postaci w grze online\n\nJeśli studenci są zaznajomieni z terminem **cyberbullying**, \\_używając urządzeń cyfrowych, witryn i aplikacji, aby zastraszyć, szkody, i zdenerwować kogoś, możesz użyć tego terminu zamiast.\n\n**Ask**: \\_Czy kiedykolwiek widziałeś kogoś, kto sprawia, że ktoś inny czuje się źle online? \\_\n\nZaproś uczniów do dzielenia się parami, ale podkreśl, że potrafią wyjaśnić, co się stało, ale nie używać prawdziwych nazwisk. \n\nWyjaśnij, że dowiedzą się więcej o tym, jak może się zdarzyć podłość online i co zrobić, gdy dzieje się z nimi lub z kimś, kogo znają."
        },
        "66084458-7f47-4487-a1b0-3cedb9cf04b0": {
          "description": "**Ask**: \\_Dlaczego uważasz, że ktoś byłby niemiły dla kogoś innego online? \\_ ([Slide 5](https://docs.google.com/presentation/d/1IXZ_WSxUuenF42ZzWk5pXTD8-Yy8P4nV2ihHd5-FotY/edit#slide=id.g5bfb202a4d_0_4))\n\nOdpowiedzi będą się różnić, ale możliwe przyczyny to: próbowali żartować wokół, lub źle się czują i wyjmują na kogoś. Uczniowie mogą również zauważyć, że ludzie mogą mówić rzeczy online, których nie będą twarzą w twarz.\n\n**Say**: _Czasami łatwiej jest ludziom być wrednymi online kontra osobiście, ponieważ nie muszą widzieć osoby twarzą w twarz i widzieć emocji drugiej osoby._\n\n**Wyjaśnia** uczniom, że będą udawać wypchane zwierzę to właściwie ktoś, kogo znasz. W obliczu wypchanego zwierzęcia, powiedzmy (średnim tonem): \\_Nie mogę uwierzyć, że lubisz pokazy superbohaterów. To jest coś, co mój młodszy brat ogląda! \\_  \n\nNastępnie projekt [Slajd 6](https://docs.google.com/presentation/d/1IXZ_WSxUuenF42ZzWk5pXTD8-Yy8P4nV2ihHd5-FotY/edit#slide=id.g5c0ff197bf_0_0) i niech uczniowie po cichu przeczytają rozmowę na czacie.\n\n**Ask**: \\_Jaka była różnica między napisaniem czegoś znacznego, a powiedzeniem tego osobie? \\_ \nProjekt [Slajd 7](https://docs.google.com/presentation/d/1IXZ_WSxUuenF42ZzWk5pXTD8-Yy8P4nV2ihHd5-FotY/edit#slide=id.g5c0ff197bf_0_67) i zebrać odpowiedzi studentów na wykresie t-. \n\nPodkreślić, że oba były niemiłe (mówiąc twarzą w twarz i online), ale że prawdopodobnie łatwiej było go wpisać niż powiedzieć to osobie, ponieważ nie trzeba widzieć reakcji danej osoby i nie słychać tonu głosu.\n\n**Say**: \\_Pamiętaj, że jeśli nie chcesz powiedzieć czegoś do twarzy innej osoby, to zdecydowanie nie jest w porządku, aby powiedzieć to w Internecie. \\_"
        },
        "883ba863-2991-41ca-88a9-4d85003b42da": {
          "description": "**Rozpowszechnia** [STOP Online Meanness Student Handout](https://docs.google.com/document/d/1gXXWbEocNfvw4fWdo7nQJ0r2FjoNeyElr8IcANUqLlo/edit). Niech uczeń przeczyta na głos scenariusz [Slajd 8](https://docs.google.com/presentation/d/1IXZ_WSxUuenF42ZzWk5pXTD8-Yy8P4nV2ihHd5-FotY/edit#slide=id.g5bfb202a4d_0_27) . Pozwolić parom pięć minut na wypełnienie dwóch pierwszych pytań.\n\n\\*\\*Zaproście uczniów do dzielenia się swoimi odpowiedziami z klasą.\n\n**Say**: \\_Jeśli kiedykolwiek doświadczysz podłości online, pamiętaj, aby STOP! \\_ \n\n**Project** [Slajd 9](https://docs.google.com/presentation/d/1IXZ_WSxUuenF42ZzWk5pXTD8-Yy8P4nV2ihHd5-FotY/edit#slide=id.g5bfb202a4d_0_12) i przejrzyj cztery zasady postępowania z podłość online. Podczas przeglądania każdej reguły należy zadać następujące pytania uzupełniające, aby poprowadzić dyskusję.\n\n**S**: Step away\n\n-   \\_Dlaczego uważasz, że powinieneś przestać używać swojego urządzenia i odejść? \\_\n\n**T**: Powiedz zaufanej osobie dorosłej\n\n-   \\_Jeśli ktoś sprawia, że czujesz się zły, smutny lub przerażony online, których dorosłych możesz powiedzieć i poprosić o pomoc? \\_\n\n**O**: OK witryn tylko\n\n-   \\_Dlaczego ważne jest, aby przejść do trybu online tylko z osobą dorosłą, lub gdy osoba dorosła mówi, że jest OK? \\_\n\nPodkreśl, że niektóre witryny nie są przeznaczone dla dzieci i pozwalają dzieciom komunikować się z innymi. Otwiera to możliwości wystąpienia podłości online.\n\n**P**: Przerwa i pomyśl\n\n-   \\_Czy byłoby pomocne, aby porozmawiać z osobą, która była wredna? \\_\n\n**Ask**: \\_Jaką radę udzieliłbyś Jadzie, aby zareagować na tę sytuację? Pamiętaj S-T-O-P!\n\nStudenci muszą wypełnić 3 pytanie [STOP Online Meanness Student Handout](https://docs.google.com/document/d/1gXXWbEocNfvw4fWdo7nQJ0r2FjoNeyElr8IcANUqLlo/edit) , a następnie zaprosić uczniów do podzielenia się swoimi odpowiedziami z klasą. \n\n-   **S**: Jada powinna odsunąć się od komputera.\n-   **T**: Jada powinna powiedzieć dorosłemu, że ufa temu, co się stało. \n-   **O**: Jada nie powinna wracać do trybu online ani wracać na stronę kucyka, dopóki osoba dorosła nie stwierdzi, że jest OK.\n-   **P**: Jada powinna poświęcić chwilę na zatrzymanie i zastanowienie się nad sytuacją. Jeśli Jada i Michael są dobrymi przyjaciółmi, Jada może chcieć powiedzieć Michaelowi, jak czuła się jego czyny, po tym jak dostanie porady od osoby dorosłej. Jeśli Michael nadal będzie dla niej niemiły, powinna natychmiast powiedzieć dorosłemu.\n\n**Ask**: \\_Które z 4 zasad S-T-O-P według ciebie jest najważniejsze? Dlaczego?\n\nDaj uczniom chwilę do namysłu, a potem nieformalnie ankietować klasę. Pamiętaj, aby podkreślić, że mówienie zaufanej osoby dorosłej (T) jest najważniejszą rzeczą, jaką powinni zrobić, jeśli kiedykolwiek doświadczą podłości online."
        },
        "4e3ea462-5fc3-475d-b6c7-571dc74746a2": {
          "description": "**Say**: \\_Przechodzimy online, aby oglądać filmy, wysyłać wiadomości do ludzi, których znamy, grać w gry i odrabiać pracę domową. Czasami ludzie mówią wredne lub przerażające rzeczy. Jeśli kiedykolwiek doświadczysz, że ktoś jest wredny online, pamiętaj o S-T-O-P! \\_\n\n**Skieruj studentów** do momentu Pause & Think na stronie 2 [STOP Online Meanness Student Handout](https://docs.google.com/document/d/1gXXWbEocNfvw4fWdo7nQJ0r2FjoNeyElr8IcANUqLlo/edit). Przeczytaj na głos wskazówki i pozwól uczniom na samodzielne zakończenie refleksji. ([Slajd 10](https://docs.google.com/presentation/d/1IXZ_WSxUuenF42ZzWk5pXTD8-Yy8P4nV2ihHd5-FotY/edit#slide=id.g590d551e23_0_356))\n\n**Zaproszeć** uczniów do dzielenia się swoimi refleksjami z klasą. Zbieraj materiały informacyjne, aby ocenić naukę uczniów."
        },
        "a3b81bea-2a8e-4fe9-907f-45ba73aa23e2": {
          "description": "Oto dodatkowe zasoby, które możesz zapewnić uczniom, aby poprawić ich naukę:\n\n-   [Działalność rodzinna](https://drive.google.com/open?id=1tsYWY76Y9BJpl_mHcxb0-BiLIHL2PrGBt3GqeeBNAD8)\n-   [Porady rodzinne](https://www.commonsense.org/education/family-tips/k-12-cyberbullying-digital-drama-and-hate-speech)"
        },
        "5fc2cc60-64ea-4c01-8c9e-21280799d17b": {
          "name": "Przemyśl"
        },
        "9f5921d9-6813-471c-8c16-40e622971021": {
          "name": "Słownik"
        },
        "a37ca2d2-fd44-4b34-ad75-d6caf1c8fffa": {
          "name": "Wstęp"
        },
        "cc4be77d-c35b-4bd7-9a84-ba4caf731e76": {
          "description": "\\*\\*Say: \\*\\* \\_Roboty mogą robić tylko to, co im kazano, ale nie mówimy im tylko słowami. Aby coś zrobić, robot musi mieć listę kroków, które może odczytać. Dzisiaj dowiemy się, co trzeba, aby to się stało. \\_"
        },
        "4e9eaee6-773f-429b-b274-d6c22d4c6457": {
          "name": "Moi przyjaciele wśród robotów",
          "progression_name": "Moi robotyczni przyjaciele — Aktywność bez komputera"
        },
        "e06b00b8-14c2-4a71-b479-4dfe82accabe": {
          "description": "<img alt=\"Robot Symbols\" src=\"https://curriculum.code.org/media/uploads/Screenshot-2018-03-13-19.49.03.png\" style=\"float: left; max-width: 200px; margin: 10px;\">"
        },
        "3a67bae9-a51b-4f5a-a4c6-99da3b5103b6": {
          "description": "#### Wprowadzenie i modelowanie\n\n\\*\\*Skonfiguruj: \\*\\* Masz stosy kubków lub trapezów papierowych dostępne dla grup.",
          "tips": [
            "### Poręczne zasady:\n\n-   **W górę** oznacza, że kubek automatycznie podnosi się tak wysoko, jak to konieczne.\n-   **W dół** oznacza, że automatycznie idzie w dół, dopóki na czymś nie wyląduje.\n    -   Ręka automatycznie powraca do kubka po ustawieniu kubka.\n-   **Do przodu** oznacza, że robot porusza się o jeden krok (1/2 szerokości kubka) do przodu.\n-   **Do tyłu** oznacza, że robot przesuwa się o jeden krok (szerokość 1/2 kubka) do tyłu.\n    -   Uwaga: Uczniowie nie mogą używać wstecz w tym wieku, chyba że chcą budować kubki w odwrotnej kolejności (co jest również w porządku).\n-   Programiści nie mogą rozmawiać, gdy robot pracuje. Obejmuje to wyblurting się odpowiedzi lub wskazując, kiedy robot zrobił coś złego.\n-   Programiści powinni podnieść rękę, jeśli widzą błąd.\n\n* * *\n\n### Opcje różnicowania:\n\n\\*\\*Uprość: \\*\\* Czy to wszystko jest trochę skomplikowane dla uczniów?  \n\nNie zapomnij modelować tego przed klasą, dopóki uczniowie nie zrozumieją wszystkich zasad. Jeśli nadal jest to mylące, spróbuj uruchomić całą tę aktywność razem jako klasa, używając wolontariuszy jako roboty, zamiast rozbić się na grupy!\n\n\\*\\*Intensyfikacja: \\*\\* Czy Twoi uczniowie są bardziej zaawansowani? Czy chcesz, aby ta lekcja była bardziej zbliżona do zagadek internetowych? Oto kilka modyfikacji, które możesz wykonać:\n\n-   Jedna strzałka odpowiada jednemu ruchowi:\n    -   Kiedy kubek zostanie usunięty ze stosu, powraca do poziomu tabeli przed przejściem.\n    -   Studenci muszą użyć wielu strzałek „w górę”, aby podnieść kubek na wielu poziomach.\n    -   Studenci muszą użyć wielu strzałek „w dół”, aby obniżyć kubki wielu poziomów.\n    -   Studenci muszą użyć strzałek „wstecz”, aby wrócić do stosu kubków."
          ]
        },
        "e24379b7-bf97-4179-948d-ea5af39d8089": {
          "name": "Refleksja",
          "tips": [
            "Takie monity o odbicie mogą być uzupełniane w różnych stylach. Dziennikarstwo lub dyskusja (z grupami lub partnerami) to świetne opcje!"
          ]
        },
        "3cb8c1e4-0403-4132-8933-b25bfb5c7985": {
          "name": "Przemyśl"
        },
        "f200bbb3-21c5-4805-ae91-c6418a1309b7": {
          "name": "Słownik"
        },
        "b5199fed-e3e0-4a59-b01f-e9b40b861d5c": {
          "name": "Wstęp"
        },
        "a18732fa-a8a6-4b88-9271-ac93e89a6d0f": {
          "name": "Przejście z Unplugged do Online"
        },
        "419ccfc2-9bbd-4a25-9bcc-3a0ca5bab33e": {
          "description": "Uczniowie powinni teraz być gotowi, aby zobaczyć prawdziwą zagadkę w akcji!"
        },
        "3fa1b9bd-496c-4731-90d8-c5710952901e": {
          "tips": [
            "Niektórzy uczniowie mogą zmagać się z obracaniem ptaka we właściwym kierunku, szczególnie gdy ptak nie jest skierowany do góry. Przypomnij uczniom, że kiedy mówimy skręcić w lewo lub w prawo, dajemy wskazówki z punktu widzenia ptaka."
          ]
        },
        "bb92650a-2be6-4f30-b851-611c2401aa32": {
          "name": "Programowanie z Angry Birds",
          "tips": [
            "Pokaż uczniom właściwy sposób, aby pomóc kolegom z klasy:\n\n-   Nie siedź na krześle kolegi\n-   Nie używaj klawiatury kolegów z klasy\n-   Nie dotykaj myszy kolegów z klasy\n-   Upewnij się, że kolega z klasy może opisać rozwiązanie na głos, zanim odejdziesz"
          ]
        },
        "41ceab11-c3ad-4289-a806-f178063736d8": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Pokaz**: Wyświetl film „Wprowadzenie do labiryntu: programowanie z użyciem bloków”",
          "progression_name": "Film: Wprowadzenie do labiryntu: Programowanie za pomocą bloków"
        },
        "a0390c7b-253b-4729-bda9-791ef82df43b": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Pokaz**: Wyświetl slajd “Poziom 2-7 - Budowanie umiejętności”",
          "progression_name": "Budowanie umiejętności"
        },
        "757cf81a-cc11-4113-8734-0888328aba75": {
          "progression_name": "Wyzwanie"
        },
        "c0d3a625-32cc-4184-bf79-be7f1066ca97": {
          "progression_name": "Ćwiczenia"
        },
        "5c62deea-ea90-4eaa-9d64-de185304d795": {
          "progression_name": "Przewidywanie"
        },
        "3d28912c-9140-40fb-af73-171c9a7e0176": {
          "progression_name": "Ćwiczenia"
        },
        "314f4a1b-1e3f-437f-805a-a0ecbfe8fa62": {
          "progression_name": "Dodatki do Lekcji"
        },
        "56c77c77-8074-4fec-b1ee-50ad68c2a10d": {
          "name": "Refleksja"
        },
        "1e38b7d2-95ff-48a4-92f2-b34838d662d6": {
          "description": "Użyj tych ćwiczeń, aby urozmaicić naukę uczniów. Można je wykorzystać do zajęć pozalekcyjnych albo w ramach urozmaicenia innego rodzaju\n\n**Utwórz swój własny**\n\nW małych grupach pozwól uczniom zaprojektować swoje własne labirynty i postawić sobie wzajemnie wyzwanie, by je rozwiązały. Będzie większa zabawa jeśli zrobisz labirynty normalnej wielkości, a uczniowie wystąpią w roli świnki i ptaka."
        },
        "8b028da0-4c8f-4097-be2f-fea9ab560217": {
          "description": "### Błędy, Bugs & Więcej błędów (45-60 minut)\n\n![](https://curriculum.code.org/media/uploads/elaSmall.png) ![](https://curriculum.code.org/media/uploads/mathSmall.png) **Nauka komputerowa + English Language Arts + Matematy**\n\n[Błędy, Bugi i więcej błędów](https://docs.google.com/document/d/1TdvVXM9Tf8lv9L3rgDqMJFTe-iG0PjTpMtBb2f4pXDo/edit#)  jest opcjonalne działania dostosowane do standardów Common Core ELA i Math, napisane przez naszą społeczność nauczycieli. Studenci będą ćwiczyć debugowanie, naprawiając kod, poprawiając problem matematyczny i korektę próbek pisania.\n\n_Standards Addressed_:\n\n-   \\*\\*CCSS.ELA-LITERACY.L.2.1.B: \\*\\* Formulować i używać często występujących nieregularnych rzeczowników mnogich (np. stopy, dzieci, zęby, myszy, ryby).\n\n-   \\*\\*CCSS.ELA-LITERACY.L.2.2.A: \\*\\* Kapitalizuj święta, nazwy produktów i nazwy geograficzne.\n\n-   \\*\\*CCSS.ELA-LITERACY.L.2.2.C: \\*\\* Użyj apostrofu do tworzenia skurczów i często występujących zaborców.\n\n-   \\*\\*CCSS.MATH.CONTENT.2.OA.B.2: \\*\\* Płynne dodawanie i odejmowanie w ciągu 20 z wykorzystaniem strategii mentalnych.\n\n-   \\*\\*CCSS.MATH.CONTENT.2.NBT.A.4: \\*\\* Porównaj dwie trzycyfrowe liczby na podstawie znaczeń setek, dziesiątek i jedynych cyfr, używając symboli >, = i\\\\ \\<, aby zapisać wyniki porównań."
        },
        "ea522c1a-0f1d-4224-9a6c-25852564554a": {
          "name": "Przemyśl"
        },
        "0d59aa71-1a4e-4fd3-8a95-3f0f23933b47": {
          "name": "Słownik"
        },
        "e681233b-1029-4530-a3ef-4842b8254aa6": {
          "name": "Wstęp"
        },
        "1df7d894-eea7-4874-8ae7-b88b4503b76b": {
          "name": "Debugowanie w labiryncie",
          "description": "Zanim pozwolisz uczniom zacząć od komputera, przypomnij im o zaletach programowania par i poproś swoich rówieśników o pomoc. Usiądź uczniów parami i polecam poprosić co najmniej dwóch rówieśników o pomoc, zanim przyjdą do nauczyciela."
        },
        "c3172960-9aa5-4221-b1ab-2d35fb80653e": {
          "progression_name": "Film - Debugowanie za pomocą przycisku K "
        },
        "2029eb81-02c4-400f-9c31-585c5a3f2118": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Pokaz**: Wyświetl slajd “Poziom 2-7 - Budowanie umiejętności”",
          "progression_name": "Budowanie umiejętności"
        },
        "c3c4cc5c-8b5b-4f3f-aa71-9c20db1f148c": {
          "progression_name": "Wyzwanie"
        },
        "840f0979-0841-4874-9b50-dfa816eb4930": {
          "progression_name": "Przewidywanie"
        },
        "821cc31c-fbe6-4890-bf1f-4e3c3248149c": {
          "progression_name": "Ćwiczenia"
        },
        "04d056ec-242f-479a-b11e-eee90775ef0f": {
          "progression_name": "Dodatki do Lekcji"
        },
        "a3eda6de-a7c5-4e22-b968-aa2785a55313": {
          "description": "Jak wspomniano w celu tej lekcji, upewnij się, że uczniowie są świadomi, że będą musieli zmierzyć się z frustrującymi zagadkami. Powiedz im, że w porządku jest czuć się sfrustrowany, ale ważne jest, aby rozwiązać problem i poprosić o pomoc. Gdy uczniowie pracują nad zagadkami, chodzić dookoła, aby upewnić się, że żaden uczeń nie czuje się tak utknięty, że nie są skłonni do kontynuowania."
        },
        "b29c4e41-3e9a-45c7-8132-e66d4af738b9": {
          "name": "Refleksja"
        },
        "02b3715d-7036-47da-84c1-c9478fe67b8f": {
          "description": "Użyj tych ćwiczeń, aby urozmaicić naukę uczniów. Można je wykorzystać do zajęć pozalekcyjnych albo w ramach urozmaicenia innego rodzaju.\n\n**Sadzenie błędów**\n\nNiech uczniowie przejdą przez poprzednie poziomy, celowo dodając błędy do swoich rozwiązań. Potem mogą zwrócić się do innych uczniów z prośbą o zdebudowanie ich pracy. Można to również przeprowadzić za pomocą łamigłówek papierowych. \n\nW czasie, gdy inni uczniowie przeprowadzają debugowanie, upewnij się, że dokonujesz konstruktywnej krytyki. Jeśli to może stanowić problem dla Twojej klasy, przejdź przez debugowanie z szacunkiem przed podjęciem tych zajęć w formie odgrywania ról z innym uczniem."
        },
        "fb89a68d-3b84-40eb-8670-33a34ad4431b": {
          "name": "Przemyśl"
        },
        "7e073b00-f336-4d89-a848-f79ee9a8bc23": {
          "name": "Słownik"
        },
        "505c83de-b318-4a7d-9a4b-9da377a5b0d8": {
          "name": "Wstęp"
        },
        "f6bf2eb5-a621-45b5-a038-0dbbb36152ee": {
          "name": "Podgląd łamigłówek online jako klasa"
        },
        "2780e63f-ba52-459a-9176-4208568b6163": {
          "name": "Zbieranie skarbów z Laurel",
          "description": "_Laurel the Adventurer_ chce zebrać jak najwięcej skarbów, jak tylko może. Poinstruuj uczniów, aby przemierzać zagadkę, aby zebrać wszystko, co mogą. Niektóre poziomy będą wymagać, aby odebrać tylko jeden kawałek skarbu, ale inni będą wymagać, aby odebrać każdy kawałek skarbu. Zwróć uwagę na instrukcje, aby wiedzieć, co robić!"
        },
        "f3c465c8-b7b0-4b73-8afc-5f30c132f35b": {
          "progression_name": "Film: Kolekcjoner"
        },
        "581b9960-a83f-4bdd-87d8-7007977e087c": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Pokaz**: Wyświetl slajd “Poziom 2-7 - Budowanie umiejętności”",
          "progression_name": "Budowanie umiejętności"
        },
        "eddda354-d5be-46f5-96fb-453befa94962": {
          "progression_name": "Wyzwanie"
        },
        "c6479440-7f5b-4d91-829d-92cc5daff4fc": {
          "progression_name": "Ćwiczenia"
        },
        "c6a14661-c9e0-4aab-bf9f-5f90e7210276": {
          "progression_name": "Przewidywanie"
        },
        "c6cca796-344f-48df-a35f-3b1e0613ee0c": {
          "progression_name": "Ćwiczenia"
        },
        "520f7482-b58c-4d37-94b7-fa8c4d83314b": {
          "progression_name": "Dodatki do Lekcji"
        },
        "4ab4040a-556d-4dfd-9d56-8730be8041ac": {
          "name": "Refleksja"
        },
        "ea8d0dcc-28b3-440d-b100-c036b74d9499": {
          "name": "Przemyśl"
        },
        "7e945f73-76d3-4b83-817d-2b9af9789dd7": {
          "name": "Słownik"
        },
        "9f1508f1-3a4b-42fb-82fb-d31a0aad9576": {
          "name": "Wstęp"
        },
        "285edd36-99af-46e6-ba3a-91300c2ef572": {
          "name": "Tworzenie grafiki przy pomocy kodu"
        },
        "0b1b669c-1acf-42de-9f59-8182f34db782": {
          "progression_name": "Film: Artysta wprowadzenie z JR Hildebrand"
        },
        "efbbafe6-1b5a-4084-be1d-a0adf068fe3c": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Pokaz**: Wyświetl slajd “Poziom 2-7 - Budowanie umiejętności”",
          "progression_name": "Budowanie umiejętności"
        },
        "12b5328f-3f65-46e2-b3e7-9426b47e1f31": {
          "tips": [
            "Ósma zagadka prosi uczniów o narysowanie 6-stronnego wielokąta. To może być trudne dla niektórych studentów. Zalecamy, aby uczniowie spróbowali kilka razy, poprosili rówieśnika, a następnie poprosili nauczyciela o pomoc. Poniżej znajduje się obraz, który może być pomocny dla uczniów.\n\n![](https://images.code.org/6675ec0ae84db90ee699a8be4c7b23a6-hexagon2018.png)"
          ],
          "progression_name": "Wyzwanie"
        },
        "7bfffd70-d646-4e36-adc5-21d888afa1f0": {
          "progression_name": "Ćwiczenia"
        },
        "05c4267a-d165-4de4-a19c-a86d0ad3639f": {
          "progression_name": "Przewidywanie"
        },
        "5e09ab58-a2b1-48ad-89fd-47565cfa09e3": {
          "progression_name": "Dodatki do Lekcji"
        },
        "fb85f373-fbf3-4b4c-a7d4-878c77ab3d99": {
          "name": "Refleksja"
        },
        "0093a5bf-2292-49ed-aa6e-993a701ff025": {
          "description": "Użyj tego działania, aby usprawnić naukę uczniów. Może być stosowany jako poza aktywności klasowej lub innego wzbogacania.\n\n**Maszyna kopiowa**\n\n-   Daj studentom dwie kartki papieru\n-   Na jednym arkuszu narysuj prosty obraz, używając tylko linii prostych.\n-   Na drugim arkuszu narysuj instrukcje odtworzenia tego obrazu, aby poruszać się prosto i obracać pod różnymi kątami.\n-   Handluj arkuszami instrukcji i spróbuj odtworzyć obraz za pomocą tylko podanych instrukcji."
        },
        "705b24e9-5ae8-4bcd-b340-b49399c94aa5": {
          "description": "### Kształty i krajobrazy (45-60 minut)\n\n![](https://images.code.org/5066103b929a2811e50d5bd54fbb114e-elaSmall.png)\n![](https://images.code.org/6a1508aeb443e243f595f88ecfa9ed7a-mathSmall.png)\n![](https://images.code.org/54b84cd74790e8e37daeff6cd826c185-scienceSmall.png)  **Informatyka + Język angielski Arts + Matematyka + Science**\n\n[Shapes & Landscapes](https://docs.google.com/document/d/1cPejd3i4v1A6iTMDtyOvlOfTVU9nlMg21bovwFThvvc/edit#) to opcjonalne działanie dostosowane do standardów Common Core ELA, Common Core Math i Next Generation Science Standards, napisanych przez naszą społeczność nauczycieli. Studenci proszeni są o zaprojektowanie tamy, aby zapobiec przyszłym powodziom. Używając kodu, stworzysz plan pokazujący miejscowej radzie miasta, jak będzie wyglądać twoja tama.\n\n_Standards Adressed:_\n\n-   \\*\\*CCSS.ELA-LITERACY.W.2.8: \\*\\* Przywołaj informacje z doświadczeń lub zbieraj informacje z dostarczonych źródeł, aby odpowiedzieć na pytanie.\n\n-   \\*\\*CCSS.MATH.CONTENT.2.MD.A.3: \\*\\* Oszacuj długości za pomocą jednostek cali, stóp, centymetrów i metrów.\n\n-   \\*\\*NGSS.2-ESS2-1: \\*\\* Porównaj wiele rozwiązań zaprojektowanych w celu spowolnienia lub zapobiegania zmianie kształtu terenu przez wiatr lub wodę."
        },
        "38f1faf6-557e-4278-8336-2ae0d394cce1": {
          "name": "Przemyśl"
        },
        "bcf1fc52-7c45-4c27-928d-9535649691dc": {
          "name": "Słownik"
        },
        "129d2408-3ca5-4a8e-90b1-f5ad3d0e6c48": {
          "name": "Wstęp"
        },
        "3ff8ec4d-fe12-413a-975d-69e143845e37": {
          "name": "Moi zapętleni robotyczni przyjaciele",
          "progression_name": "Moi robotycznie zapętleni przyjaciele - Aktywność bez komputera"
        },
        "b1974523-e458-4364-aeb2-80f00e6de4bd": {
          "tips": [
            "\\*\\*Poszukiwanie pętli: \\*\\* Pamiętaj, aby mieć oczy otwarte dla uczniów korzystających z pętli. Staraj się unikać korygowania ich ogólnych algorytmów lub przepisywania rozwiązania, ale zachęcamy uczniów do kierowania do wzorców, które można skrócić za pomocą powtarzającego się okręgu. \n\nOglądaj studentów, gdy biegają przez kod. Są jakieś robaki? Skorzystaj z pytań debugowania, aby pomóc im znaleźć rozwiązanie.\n\n-   Co to robi?\n-   Co to ma robić?\n-   Co ci to mówi?\n-   Czy to działa na pierwszym etapie?\n-   Czy to działa na drugim etapie?\n-   Gdzie przestaje działać?"
          ]
        },
        "373c8a50-ff0d-4677-98aa-a2492f33c9f2": {
          "name": "Refleksja"
        },
        "67661253-89da-4066-9383-89d7193835ec": {
          "description": "Użyj tych działań, aby usprawnić naukę uczniów. Mogą być używane jako poza zajęciami klasowymi lub innym wzbogacaniem.\n\n-   Niech uczniowie narysować własne kreacje kubek układania dla kogoś innego do kodowania.\n-   Zapewnienie studentom algorytmów wykorzystujących powtórzenia, a następnie niech rozszerzą program z powrotem do pełnej wersji krok po kroku."
        },
        "6ad48bbf-6b60-4210-99ba-722ef48e2ea4": {
          "name": "Przemyśl"
        },
        "25f3c528-ac14-47ff-b254-cd071d8737ff": {
          "name": "Słownik"
        },
        "be9470c8-795f-4e1d-83f2-069961c852d2": {
          "name": "Wstęp"
        },
        "a8481f49-9b56-474e-8c05-28251c46f468": {
          "name": "Odłączona aktywność za pomocą bloków papieru",
          "description": "Odwiedź ponownie „Moi Loopy Robotic Friends”. Tym razem pracuj z klasą, aby „kod” go za pomocą **\\\\ \\*manipulacje** zamiast pisać instrukcje na papierze. Upewnij się, że uczniowie wiedzą, że bloki muszą przejść od góry do dołu i wszyscy muszą się dotknąć!\n\n#### -lub-"
        },
        "6adb6ede-2fc4-47f7-97d8-32cd0c02402f": {
          "name": "Podgląd łamigłówek online jako klasa",
          "description": "Podciągnij puzzle online i wybierz puzzle do zrobienia przed klasą. Zalecamy puzzle 10 ze względu na jego wzór klatki schodowej. Poproś uczniów, aby napisali program do rozwiązania zagadki na papierze. Niech uczniowie okrążą powtarzające się kawałki i etykietują z liczbą powtórzeń, tak samo jak w „My Loopy Robotic Friends”."
        },
        "fe682113-6220-4a20-b2a7-009bde3d8e27": {
          "name": "Pętle z Rey i BB-8",
          "progression_name": "Film: Programowanie z Rey i BB-8"
        },
        "336c18d5-0c32-44c2-b35c-a6f7eec5abff": {
          "progression_name": "Budowanie umiejętności"
        },
        "4faf8753-aee7-43d6-9f6f-0e0033aa315f": {
          "progression_name": "Przewidywanie"
        },
        "ac539445-fa4c-45cd-8d04-d794a3041826": {
          "progression_name": "Film: Bloki powtarzania z BB-8"
        },
        "78b79d53-246f-40a9-ab3a-557fba2f5c1a": {
          "progression_name": "Budowanie umiejętności"
        },
        "70017f05-4f16-45ff-9175-91445fd1802d": {
          "progression_name": "Wyzwanie"
        },
        "0c3ea776-e22f-422f-b617-998f13aa2ff5": {
          "progression_name": "Ćwiczenia"
        },
        "d952a432-408a-4c84-adf2-d3a023cce77c": {
          "progression_name": "Przewidywanie"
        },
        "f26e056f-e9c9-4a0a-95f8-64e3044c86c9": {
          "progression_name": "Ćwiczenia"
        },
        "a9c1c890-7b91-4f1a-a207-155306c84f5e": {
          "progression_name": "Dodatki do Lekcji"
        },
        "5cee1155-602d-42ba-8af2-467aae697539": {
          "description": "Gdy uczniowie pracują nad zagadkami, sprawdź, czy potrafią dowiedzieć się, ile bloków używają z pętlą, a nie za pomocą pętli. **\\\\ \\*Programowanie par - Student Video** działa naprawdę dobrze z tym zestawem zagadek, ponieważ istnieje kilka sposobów, aby wypełnić pętle. Naciśnij na przyjazną dyskusję między parami w przypadkach braku zgody na to, jak rozwiązać zagadkę. Czy uczniowie zadają sobie nawzajem pytania, takie jak:\n\n-   \\_Jak wymyśliłeś to rozwiązanie? \\_\n-   \\_Jakie są pewne korzyści z rozwiązywania zagadki w ten sposób? \\_\n\nZalecamy również posiadanie papieru pod ręką, aby uczniowie zapisali swój kod i znajdowali jakiekolwiek powtórzenia do użycia w pętlach."
        },
        "58e08b96-df9d-4862-98c6-872f29a5e215": {
          "name": "Refleksja"
        },
        "ab2c8aa4-322c-4ac6-b003-7fbf0dfb807b": {
          "description": "Wykorzystaj te zajęcia do urozmaicenia nauki ucznia. Można je wykorzystać jako zajęcia pozalekcyjne lub innego wzbogacenia.\n\n\\*\\*\\* No to ruszamy\n\n-   Daj uczniom obrazki czynności lub ruchów tanecznych, które mogą wykonywać.\n    -   Niech uczniowie zaaranżują ruchy i dodadzą pętle do choreografii swojego własnego tańca.\n-   Udostępnij tańce reszcie klasy.\n\n**Połącz to z powrotem**\n\n-   Znajdź jakieś filmy wideo na YouTube ze znanymi tańcami, które się powtarzają.\n-   Czy Twoja klasa może znaleźć pętle?\n-   Spróbuj tego samego w odniesieniu do piosenek!"
        },
        "b57a66a7-3da1-4c20-8d0a-9b5da066c07e": {
          "name": "Przemyśl"
        },
        "3c79c590-2f48-4931-b8fa-736281002766": {
          "name": "Słownik"
        },
        "d9c07104-b142-42fc-abf8-4b34d8429b7a": {
          "name": "Żniwa z użyciem pętli",
          "progression_name": "Film: Kombajn"
        },
        "38b1f726-8881-479b-a9e5-7fd354aacf31": {
          "progression_name": "Budowanie umiejętności"
        },
        "7d2a391e-fb8f-4791-841a-f31ddac790b7": {
          "progression_name": "Wyzwanie"
        },
        "e68467ed-58ff-45fe-b064-90e8dbca1c3d": {
          "progression_name": "Ćwiczenia"
        },
        "be50d0ba-53db-4cb0-b970-f8fda6cf3ec1": {
          "progression_name": "Przewidywanie"
        },
        "d83224a8-1d43-4640-9bd6-929d52011c77": {
          "progression_name": "Dodatki do Lekcji"
        },
        "63b4337c-4ae6-43ee-99ae-3f637cd0c29d": {
          "name": "Refleksja"
        },
        "97ec11ba-87bb-4b11-9a21-da5ebf94b45b": {
          "description": "Użyj tych ćwiczeń, aby urozmaicić naukę uczniów. Można je wykorzystać do zajęć pozalekcyjnych albo w ramach urozmaicenia innego rodzaju.\n\n**Żniwa pomocy naukowych**\n\n-   Niech uczniowie tworzą sterty szkolnych pomocy naukowych na ławkach (ołówków, gumek, itp.)\n-   Niech partnerzy wymyślą,  jak żniwiarka będzie przechodziła od snopka do snopka, zbierając każdą grupę po drodze. \n-   Udostępnij programy pozostałej części klasy."
        },
        "55ca2f35-4da6-4b33-8af2-9e7f39161d96": {
          "description": "### Harvester's Farm (60-75 minut)\n\n![](https://curriculum.code.org/media/uploads/elaSmall.png) ![](https://curriculum.code.org/media/uploads/mathSmall.png) ![](https://curriculum.code.org/media/uploads/scienceSmall.png) **Informatyka + Język angielski Arts + Matematyka + Nauka**\n\n[\\*\\*Farm\\*\\*](https://docs.google.com/document/d/1EgX8toSxV0gB-n2XTQVckeNhnYzsP7iYiO1H0vNGMKM/edit#heading=h.oa0z8i3xy1ys)  jest opcjonalnym działaniem dostosowanym do Common Core ELA, Common Core Math i Next Generation Science Standards, napisanym przez naszą społeczność nauczycieli. Studenci wykorzystają dostarczonych organizatorów graficznych do klasyfikowania i opisywania przedmiotów na farmie zbożowej. Organizatorzy grafik będą służyć jako komponent wstępny jako uczniowie, a następnie napiszą tekst informacyjny/wyjaśniający informujący czytelników o tym, co kombajn robi na swojej farmie. \n\n_Standards Addressed:_\n\n-   \\*\\*CCSS.ELA-LITERACY.W.2.2: \\*\\* Napisz teksty informacyjne/wyjaśniające, w których wprowadzają temat, wykorzystują fakty i definicje w celu rozwijania punktów oraz dostarczają oświadczenie końcowe lub sekcję.\n\n-   \\*\\*CCSS.ELA-LITERACY.W.2.5: \\*\\* Z poradnictwem i wsparciem ze strony dorosłych i rówieśników, skup się na temat i wzmocnienie pisania w razie potrzeby poprzez zmianę i edycję.\n\n-   \\*\\*CCSS.MATH.CONTENT.2.OA.B.2: \\*\\* Płynne dodawanie i odejmowanie w ciągu 20 z wykorzystaniem strategii mentalnych.\n\n-   \\*\\*NGSS.2-PS1-1: \\*\\* Zaplanuj i przeprowadzaj dochodzenie w celu opisania i sklasyfikowania różnych rodzajów materiałów według ich obserwowalnych właściwości."
        },
        "9fde8e2d-856f-4b87-924a-15d076522654": {
          "name": "Przemyśl"
        },
        "305f3738-2a15-46f7-bef1-c405a63b948d": {
          "name": "Słownik"
        },
        "f4370643-7030-4064-a1a5-5d5385a91c80": {
          "name": "Wstęp"
        },
        "f5af8f45-b9fa-46f2-8006-05af25fe0b04": {
          "name": "Grafika naklejek przy pomocy pętli",
          "description": "Zachęcaj kreatywność podczas tej działalności! Instrukcje podają przykłady, ale studenci mogą eksperymentować z różnymi naklejkami lub rodzajami wzorów. Nawet przykładowe rozwiązania, które dostarczamy, nie są rozwiązaniami _only_!",
          "tips": [
            "Ta lekcja może się bardzo różnić od tego, co przyszło wcześniej w trakcie kursu. Poziomy te mają kilka nowych cech, które warto zbadać przed rozpoczęciem. Kod, który uczniowie piszą na jednym poziomie, automatycznie przeniesie się do innych. To pozwala im budować stopniowo i iteracji na swoich pomysłów, jak się uczą. Należy pamiętać, że te poziomy nie są sprawdzane pod kątem poprawności, aby umożliwić bardziej otwartą kreatywność. Uprawnienie uczniom do samodzielnego ustalenia, kiedy wykonają każde zadanie."
          ]
        },
        "c5f36648-ac0d-405f-af7a-3020ebdce7f3": {
          "progression_name": "Czas na zabawę"
        },
        "1163bfb9-3f53-490d-92b6-b6b38765a05e": {
          "description": "Niektórzy uczniowie mogą odkryć, gdzie dodać powtarzające się pętle, pisząc program bez pętli, a następnie okrążając sekcje powtórzeń. Jeśli uczniowie z twojej klasy wydają się, że mogą z tego skorzystać, niech trzymają papier i ołówki przy swoich komputerach. Uczniowie mogą również cieszyć się rysowaniem niektórych kształtów i figur na papierze, zanim zaprogramują je online. (Podczas rysowania znaczków łatwiej jest symbolizować te o prostych kształtach, takich jak koła i kwadraty.)"
        },
        "5ef885b2-0000-4e19-b7be-39fe06f3b7e7": {
          "name": "Refleksja"
        },
        "306e1cde-195c-4cbe-aaff-04da61ae8f2c": {
          "description": "### Loopy Formy i ich funkcje (45-60 minut)\n\n![](https://images.code.org/5066103b929a2811e50d5bd54fbb114e-elaSmall.png)\n![](https://images.code.org/6a1508aeb443e243f595f88ecfa9ed7a-mathSmall.png)\n![](https://images.code.org/54b84cd74790e8e37daeff6cd826c185-scienceSmall.png)  **Informatyka + English Language Arts + Matematyka + Science**\n\n[\\*\\*Loopy Forms i ich funkcje\\*\\*](https://docs.google.com/document/d/1F2wNw1yUfaob_-PXLN_A7k0mm0uSaa7fYtMhGJOC95U/edit) to opcjonalne działanie dostosowane do wspólnych podstawowych standardów ELA, wspólnych podstawowych matematyk i nauk nowej generacji, napisanych przez naszą społeczność nauczycieli. Artysta musi pomóc swoim przyjaciołom zaprojektować swój dom poprzez rysowanie planów. Ważne jest, aby uczniowie rozumieli podstawowe kształty i sposób, w jaki każdy kształt pełni różne funkcje w planach domu. Następnie będą pisać opinie, przyczyny dostaw i używać słów łączących, aby uzasadnić swoje wybory projektowe.\n\n_Standards Addressed:_\n\n-   \\*\\*CCSS.ELA-LITERACY.W.2.1: \\*\\* Napisz opinie, w których wprowadzają temat lub książkę, o której piszą, podaj opinię, powody uzasadniające opinię, użyj słów łączących (np. ponieważ, a także) , aby połączyć opinię i powody, a także dostarczyć oświadczenie końcowe lub sekcję.\n\n-   \\*\\*CCSS.MATH.CONTENT.2.G.A.1: \\*\\* Rozpoznaj i narysuj kształty posiadające określone atrybuty, takie jak określona liczba kątów lub określona liczba równych powierzchni.1 Zidentyfikuj trójkąty, czworokąty, pięciokąty, sześciokąty i kostki.\n\n-   \\*\\*NGSS.K-2-ETS1-2: \\*\\* Opracuj prosty szkic, rysunek lub model fizyczny, aby zilustrować, jak kształt obiektu pomaga mu funkcjonować zgodnie z potrzebami do rozwiązania danego problemu."
        },
        "1d2e55e1-c5d3-4689-a7ab-824bdc250f02": {
          "name": "Przemyśl"
        },
        "438866ae-0223-4f9f-badd-3457a85f7c7a": {
          "name": "Wstęp"
        },
        "b5d0ecce-50d3-4d8f-8143-eb3bcd6a52b0": {
          "name": "Słownik"
        },
        "8816065c-5d3c-4cc9-95a3-f96c88edbb62": {
          "name": "Wielkie wydarzenie",
          "progression_name": "Wielkie wydarzenie - Aktywność bez komputera"
        },
        "81ac2e94-8470-41a8-a506-505bf1bd3fac": {
          "tips": [
            "Jeśli twoi uczniowie wydają się zdezorientowani, porozmawiaj o swoich ulubionych grach i wszystkich sposobach, w jaki sposób pozwolą bohaterom wiedzieć, co mają robić. Wskazać, jak gra byłaby naprawdę nudna, gdyby biegła od początku do końca bez żadnych zdarzeń wymaganych."
          ]
        },
        "072ac15c-51ea-444a-ba24-2d1da32a8b2d": {
          "name": "Refleksja",
          "tips": [
            "Studenci powinni wykazać, że wydarzenia są czymś, co może spowodować inne działania. Odwołaj się do wcześniejszych przykładów z lekcji lub zachęć uczniów do wymyślania własnych."
          ]
        },
        "5cf1fa0d-17cd-4b82-b0eb-608c2078afbf": {
          "description": "Użyj tych działań, aby usprawnić naukę uczniów. Mogą być używane jako poza zajęciami klasowymi lub innym wzbogacaniem.\n\n**Wydarzenie jednej osoby jest akcją innej jednej**\n\n-   Przypisz każdemu uczniowi wydarzenie, na które należy uważać i odpowiednią reakcję na to wydarzenie. Łańcuch działania tak, że działanie każdego dziecka staje się zdarzeniem, które wywołuje reakcję innego ucznia. Przypisywać, aż każdy będzie miał coś do zrobienia i każdy sprawi, że ktoś zareaguje.\n\n**Eventopalooza**\n\n-   Podziel klasę na grupy. Korzystając z kontrolera zdarzeń, przypisz każdej grupie inną reakcję do tego samego przycisku. Zrób to dla wszystkich trzech przycisków, a następnie obserwuj chaos!"
        },
        "c14e31a9-2968-4510-926a-0227df66db89": {
          "tips": [
            "Studenci będą mieli możliwość udostępnienia swojego produktu końcowego za pomocą linku. To świetna okazja, by pokazać swoją społeczność szkolną, co robią twoi uczniowie. Monitoruj i zbieraj wszystkie linki do projektów i przechowuj je na swojej stronie internetowej klasy, aby wszyscy mogli zobaczyć!"
          ]
        },
        "02b80534-5007-46a8-9992-3e0323c49a92": {
          "name": "Przemyśl"
        },
        "4184cd8d-7e62-44ac-91e2-fa4c825a3aa7": {
          "name": "Słownik"
        },
        "49e86e55-b607-4af6-bdb6-b912549b69ea": {
          "name": "Wstęp"
        },
        "1a9e3fe9-eb6a-4e32-8e8a-e53a469f6d4a": {
          "description": "Działania te pomogą wprowadzić unplugged koncepcje z „The Big Event” do świata online, do którego uczniowie się wprowadzają. Wybierz _one_ z następujących czynności, aby zrobić z klasą:"
        },
        "40fa01ec-8eb2-4f37-af04-b4a4ec5bdad8": {
          "name": "Odłączona aktywność za pomocą bloków papieru",
          "description": "Korzystając z pilota z kontrolera zdarzeń **\\\\ \\*i \\*\\*\\\\ \\*Manipulatives**, zbierz swoją klasę, aby powtórzyć aktywność z poprzedniej lekcji. Zapytaj klasę \\_\"kiedy naciśnięty jest guzik, co robimy?” \\_ następnie wypełnij jeden z bloków zdarzeń `kiedy` i jeden z niebieskich bloków akcji odpowiednio. Upewnij się, że uczniowie rozumieją, że bloki `kiedy` muszą znajdować się na niebieskim bloku i muszą się dotknąć, aby program działał.\n\n#### -lub-"
        },
        "c18dfa97-b98e-4a9b-99e1-59c56b29905b": {
          "name": "Podgląd zagadek online jako klasy"
        },
        "afa7c923-ac99-4097-b70d-c27072b62bcc": {
          "name": "Zbuduj grę z Flappym",
          "progression_name": "Film: Zakoduj własną grę z Flappym"
        },
        "70706f4c-ac33-422e-86fd-6f20f63e4438": {
          "progression_name": "Budowanie umiejętności"
        },
        "665856d7-1e75-4dcb-bb62-7926daecbcb3": {
          "progression_name": "Mini-projekt: Gra z Flappym"
        },
        "ddee86f6-7f1f-41b8-bd96-f891312addb0": {
          "tips": [
            "Przypomnij uczniom, aby dzielili się swoją pracą tylko z bliskimi przyjaciółmi lub rodziną. Aby uzyskać więcej informacji obejrzyj lub pokaż klasę**\\\\ \\*Wstrzymaj i Think Online Video**\n."
          ]
        },
        "d0ea24ff-eed4-4232-af00-1aebf8a9c264": {
          "name": "Refleksja"
        },
        "74689c78-e316-444c-a7bf-f3a647b20e8c": {
          "description": "### Zostań projektantem gier (45-135 minut)\n\n![](https://curriculum.code.org/media/uploads/mathSmall.png) ![](https://curriculum.code.org/media/uploads/scienceSmall.png) **Informatyka + Matematyka + Nauka**\n\n[\\*\\*Zostań projektantem gry\\*\\*](https://docs.google.com/document/d/1QfcYmWyn2U1X2IZO9Kpt2rH3uoxPpcEtp3ypVWcmBC8/edit?usp=sharing) jest opcjonalnym zgodnie ze standardami Common Core Math i Next Generation Science Standards, napisanymi przez naszą społeczność nauczycieli. Uczniowie staną się projektantami gier podczas tworzenia i testowania gry. Studenci będą również rejestrować wyniki, dokonywać obserwacji, tworzyć wykres słupkowy, analizować wyniki i uzasadniać zmiany, które wprowadziliby w swojej grze.\n\n_Standards Adressed:_\n\n-   \\*\\*2.MD.D.10: \\*\\* Narysuj wykres obrazkowy i wykres słupkowy (ze skalą pojedynczą jednostkową), aby reprezentować zbiór danych z maksymalnie czterema kategoriami. \n\n-   \\*\\*K-2 ETS1-1: \\*\\* Zadawaj pytania, czyń obserwacje i zbieraj informacje o sytuacji, którą ludzie chcą zmienić, aby zdefiniować prosty problem, który można rozwiązać poprzez opracowanie nowego lub ulepszonego obiektu lub narzędzia.\n\n-   \\*\\*K-2 ETS1-3: \\*\\* Analizuj dane z testów obiektu lub narzędzia, aby określić, czy działa zgodnie z przeznaczeniem, aby porównać mocne i słabe strony każdego z nich."
        },
        "a1420040-a891-4dd5-8aa7-127bac142431": {
          "name": "Przemyśl"
        },
        "8f34487c-1c94-4472-80bd-7e53befee5f6": {
          "name": "Słownik"
        },
        "e0573e5e-1308-46de-b4aa-d856b692817d": {
          "name": "Wstęp"
        },
        "6728fc70-4eea-4c9e-8b55-b5643cb406f1": {
          "name": "Gra w berka ze zdarzeniami",
          "tips": [
            "Studenci będą mieli możliwość udostępnienia swojego produktu końcowego za pomocą linku. To świetna okazja, by pokazać swoją społeczność szkolną, co robią twoi uczniowie. Zbierz wszystkie linki i trzymaj je na swojej stronie internetowej klasy dla wszystkich, aby zobaczyć!\n\nPrzypomnij uczniom, aby dzielili się swoją pracą tylko z bliskimi przyjaciółmi lub rodziną. Aby uzyskać więcej informacji obejrzyj lub pokaż klasę\\*\\*\\\\ \\*Wstrzymaj i Think Online Video. \\*\\*"
          ]
        },
        "bd4cd8f9-a5e1-4bfa-b3be-85bf3c6c7119": {
          "progression_name": "Film: Przedstawiamy Play Lab  "
        },
        "ab11c643-bd9d-44fb-822b-1eda83be85fd": {
          "progression_name": "Budowanie umiejętności"
        },
        "1b396a72-6c8e-4667-a4a5-8ef61ac9687f": {
          "progression_name": "Mini-projekt: Wyścig"
        },
        "657133fd-6697-4f38-8ef7-8f53811eb2ef": {
          "progression_name": "Czas na zabawę"
        },
        "f0b5eef7-fc2b-430a-84d1-0db90863beac": {
          "progression_name": "Dodatki do Lekcji"
        },
        "6449b59e-03df-41af-9bea-a74772120074": {
          "name": "Refleksja"
        },
        "950a6b1c-582f-4078-a44f-b28902a797e0": {
          "description": "Użyj tych ćwiczeń, aby urozmaicić naukę uczniów. Można je wykorzystać do zajęć pozalekcyjnych albo w ramach urozmaicenia innego rodzaju.\n\n**Zajrzyj pod maskę**\n\nGdy udostępniasz link do swojej historii, udostępniasz również cały kod, który się za nim kryje. To jest świetny sposób nauki uczniów wzajemnie od siebie. \n\n-   Zamieść linki do kompletnych historii online.\n    -   Spraw, by historia stała się również Twoją historią, którą udostępnisz!\n-   Gdy uczniowie ładują link, niech klikną przycisk \"Jak to działa\", aby zobaczyć kod kryjący się za tą historią.\n-   Omów, jako grupa, różne sposoby, w jakie Twoi koledzy z klasy kodują swoje historie.\n-   Co Cię zaskoczyło?\n    -   Co chciałbyś wypróbować?\n-   Wybierz historię kogoś innego i kliknij \"Remiksuj\", aby na niej budować (Nie martw się, oryginalna historia będzie bezpieczna)."
        },
        "0dd3008c-14b5-47c3-9913-65bd3bf87655": {
          "name": "Przemyśl"
        },
        "565fdda1-dbbe-4521-aacf-966c4aa204e3": {
          "name": "Słownik"
        },
        "d7a9e0cd-a7e6-46de-910f-3f0e1216f055": {
          "name": "Wstęp"
        },
        "7416084b-fb76-4855-aabe-eeaf20181d79": {
          "name": "Zobrazowanie Danych",
          "progression_name": "Zobrazowanie Danych"
        },
        "4a782ed3-3443-4139-a1bd-88f562c4386e": {
          "tips": [
            "Ten program generuje losowy asortyment zwierząt za każdym razem, gdy jest uruchomiony. Jeśli projektujesz program dla całej klasy do użycia, rozważ uruchomienie go wiele razy i prosząc różne grupy uczniów o śledzenie numerów za każdym razem tak, że nie będzie różnorodność w ich odpowiedziach na późniejszą dyskusję."
          ]
        },
        "f1f2356e-8e7b-400a-9635-bb31159e2a0f": {
          "name": "Refleksja"
        },
        "a3f5e809-2960-4f58-92e2-42b5ddf0d058": {
          "name": "Przemyśl"
        },
        "ac8248ed-61d0-4366-876a-0c145094fa03": {
          "name": "Słownik"
        },
        "04091b34-9c0a-44fa-bce4-dd57c3c8f2b2": {
          "name": "Wstęp"
        },
        "fee740e0-f88d-4032-b68e-a6e113d2195d": {
          "name": "Binarne bransoletki",
          "progression_name": "Binarne bransoletki - Aktywności bez komputera"
        },
        "c4611983-43d6-441a-9663-bda13932452c": {
          "tips": [
            "Znasz swoją klasę najlepiej. Jako nauczyciel zdecyduj, czy uczniowie powinni robić to indywidualnie, czy uczniowie powinni pracować w parach lub małych grupach."
          ]
        },
        "55aaddae-3714-4289-8bdc-04796645b397": {
          "tips": [
            "Jeśli Twoja klasa ma dodatkowy budżet na materiały, spróbuj wykonać to ćwiczenie za pomocą nici (lub środków do czyszczenia rur) i koralików, aby utworzyć binarne bransoletki zamiast długopisu i papieru. Możesz zapewnić studentom dowolną kombinację dwóch kolorów w koralikach, ale czarno-białe wydają się najłatwiejsze, biorąc pod uwagę sposób, w jaki klucz jest zrobiony."
          ]
        },
        "3568529d-36f9-48e4-8075-63bf63a1b309": {
          "name": "Refleksja"
        },
        "640bd9a2-11c5-4489-a1df-454c930054de": {
          "description": "Użyj tych ćwiczeń, aby urozmaicić naukę uczniów. Można je wykorzystać do zajęć pozalekcyjnych albo w ramach urozmaicenia innego rodzaju.\n\n**Binarne obrazki**\n\n-   Jest kilka świetnych materiałów w sieci, które pozwolą wynieść te zajęcia na wyższy poziom.\n-   Jeśli Twoich uczniów interesuje sposób przestawienia obrazków (a nawet muzyki) w zapisie binarnym, więcej informacji można znaleźć na   [Bombkach binarnych](http://code.org/files/CSEDbinary.pdf) firmy Thinkersmith."
        },
        "a373c46d-9bd4-493e-8f40-27654f2c0c62": {
          "name": "Przemyśl"
        },
        "eb8e74ca-2768-4a33-9c4d-0493db0c6aaa": {
          "name": "Planowanie"
        },
        "a16a72da-1747-44b6-a670-d0b62d971c17": {
          "description": "Mieliśmy już szansę na zbudowanie projektu w Play Lab. Dziś to doświadczenie będzie znacznie bardziej otwarte, więc będzie wymagało wcześniejszego planowania! Planowanie jest bardzo ważną częścią kodowania gry lub innego rodzaju oprogramowania. Zanim więc wskoczymy na komputery, poświęcimy trochę czasu na planowanie projektów, które chcemy zbudować."
        },
        "02b5b8f3-446d-44c5-a594-570e2ff87324": {
          "tips": [
            "Jeśli studenci są programowanie pary dla tego zadania, to rozgrzewka jest dla nich świetna okazja, aby ćwiczyć dzielenie się i poszanowanie pomysłów innych. Upewnij się, że uczniowie przestrzegają norm pracy grupowej, które już posiadasz w klasie. W przeciwnym razie spędź krótką chwilę przechodząc nad swoimi oczekiwaniami."
          ]
        },
        "e1b47918-ca9e-4c5f-ad78-4fe271e12f47": {
          "name": "Projekt kodowania",
          "description": "Uczniowie, wyposażeni w ukończone przewodniki planowania, są teraz gotowi do ożywienia swoich projektów. Poziomy te odpowiadają strukturze przewodnika planowania i pomagają poruszać się studentom przez proces przekształcania ich pomysłów w kod.",
          "tips": [
            "Podczas kodowania uczniowie będą doświadczać wielu prób i błędów. Ich projekty prawdopodobnie staną się obciętymi wersjami ich pierwotnego zakresu. Przypomnij studentom, że ten rodzaj kompromisu jest powszechny w projektowaniu oprogramowania. Jest w porządku, jeśli nie uda im się zbudować w każdej funkcji, którą zaplanowali!"
          ]
        },
        "80142989-2849-4df1-9fee-2803f9575ed6": {
          "progression_name": "Eksploracja: Przykładowe projekty"
        },
        "b8275a09-3de2-42a9-844f-0ac27f7ee3ea": {
          "progression_name": "Projekt"
        },
        "e5d05d8d-961f-4885-b074-cfce5bb4f87d": {
          "name": "Prezentacja"
        },
        "5f1c9827-a478-4cf6-98b2-8834ef534cff": {
          "name": "Refleksja"
        },
        "e79ff65f-c393-4328-8530-e40474ddbca1": {
          "name": "Lekcje rozszerzeń z mikro:bitem",
          "description": "Aby wykorzystać umiejętności, których nauczyłeś się w Kursie C Podstaw Informatyki kliknij [here](https://code.org/maker/csf-microbit), aby sprawdzić rozszerzone lekcje z micro:bitem. Te [4 lekcje z micro:bitem](https://code.org/maker/assets/CSF-Booklet-Course-C-v8.pdf) obejmują następujące tematy: Poznaj swój micro:bit, Zdarzenia, Wejścia i Wyjścia, Sekwencjonowanie, Pętle, Dane i Zmienne."
        },
        "3640be62-d6b4-4e99-a1c0-b4a53c1e202f": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "acdc585d-30c8-48ed-b16a-58520ba95ad6": {
          "tips": [
            null
          ]
        },
        "384bdd56-c982-4818-8992-b99c712a0447": {
          "tips": [
            null
          ]
        },
        "cf42cf3a-ea05-4add-ba3c-5d6347ee0c2b": {
          "tips": [
            null
          ]
        },
        "f49cc7fb-17b7-482c-8260-9da83497dd13": {
          "description": "#### Reprezentacja ma znaczenie"
        },
        "abd4d47d-e2e9-45b7-8f4b-da8bacb716be": {
          "name": "Osoba 1",
          "description": "**„Jestem uczulony na jajka.”**"
        },
        "672f84db-fe9c-4efc-bd10-0b013d67e5ce": {
          "tips": [
            null
          ]
        },
        "7063e8ee-eeae-4c1d-88f9-c7c8549cd5cd": {
          "name": "Osoba 2"
        },
        "eb28d16b-3f85-4d5c-983f-dba0ad4534bd": {
          "name": "Osoba 3",
          "description": "**„Staram się oszczędzać pieniądze.”**"
        },
        "c5063545-52ce-4399-9b2e-d6b8f87d5229": {
          "tips": [
            null
          ]
        },
        "eae21d0d-ee1e-4ac1-87fe-e6ca2c554dee": {
          "name": "Osoba 4"
        },
        "fdfdcb30-4add-4085-92b4-8117d5804672": {
          "name": "Refleksja"
        },
        "87757ac9-054d-44fe-a4ea-d16c676b25c7": {
          "tips": [
            null
          ]
        },
        "fa647a4b-7f87-4443-81a0-6689b4a0fb32": {
          "name": "Dziennik"
        },
        "359e9024-3c43-45d1-b97a-c3cd961072ca": {
          "name": "Dziennik"
        },
        "94e2383d-41c6-47c3-8e37-25f8292e3bcd": {
          "tips": [
            null
          ]
        },
        "2f3d392c-19a3-4b82-a1e6-977a854b26b0": {
          "tips": [
            null
          ]
        },
        "c678e55a-ce95-477d-a922-c0af9bdee376": {
          "tips": [
            null
          ]
        },
        "88d023b5-61ca-4479-a1d7-c0e10deb037e": {
          "tips": [
            null
          ]
        },
        "b827cda1-4747-4fec-bb45-211d5fef4afa": {
          "tips": [
            null
          ]
        },
        "85f7797b-3767-49de-b73d-7438f212b0fb": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "91ea767f-5555-482d-b1d9-72c3add2d18f": {
          "name": "Dziennik"
        },
        "af4d57ca-aa05-4939-90a0-b33473c20e29": {
          "tips": [
            null
          ]
        },
        "4cd3a74e-a2da-4135-9069-9f1f2899035a": {
          "tips": [
            null
          ]
        },
        "4bb168d6-0600-4e3f-bd81-ea93fb336d2b": {
          "tips": [
            null
          ]
        },
        "0394a786-495e-41e4-88a5-3a01e1144ce7": {
          "name": "Dziennik"
        },
        "cd8aaa2a-8c2a-45fa-933f-f13b26222877": {
          "tips": [
            null
          ]
        },
        "60bf58c9-e6cf-4141-b54f-9de09511a02c": {
          "tips": [
            null
          ]
        },
        "3e3e9560-9fea-441c-9dbf-8a417798ab43": {
          "name": "Gadżet pikselacyjny",
          "progression_name": "Reprezentowanie obrazów"
        },
        "6f09e5ac-c9e6-4892-bef2-6502389eb59e": {
          "tips": [
            null
          ]
        },
        "240f02dc-9009-4261-84ab-b0fadb89f99b": {
          "tips": [
            null
          ]
        },
        "e0c60df8-326c-4fc8-9412-f83c7c9b19f0": {
          "tips": [
            null
          ]
        },
        "560edb73-df71-429b-a0ec-dc90ec3aa662": {
          "name": "Dziennik"
        },
        "ce4d1117-caa6-4f81-8be0-ee03fcecddad": {
          "tips": [
            null
          ]
        },
        "53756372-5575-4056-bc75-35a2c9217bce": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "da53f000-0b90-4bca-82b2-1d0c660a4ada": {
          "tips": [
            null
          ]
        },
        "6f60fc01-bbaa-4bff-986a-4715875380d2": {
          "tips": [
            null
          ]
        },
        "28e494e6-0dda-4fc1-b20a-a8a811b350f6": {
          "tips": [
            null
          ]
        },
        "cacfe459-bd5f-40ec-ba14-122bb639c1cb": {
          "tips": [
            null
          ]
        },
        "8a2809d2-8749-402e-9d1d-65ff875d072e": {
          "tips": [
            null
          ]
        },
        "e6c4a521-3a5a-4d98-b443-d62fde18aa3f": {
          "name": "Dziennik"
        },
        "4ca366db-9339-4717-8d57-e016c88c22e4": {
          "tips": [
            null
          ]
        },
        "25887431-6715-4d88-a4ce-542837e86482": {
          "tips": [
            null
          ]
        },
        "bd6862b6-2207-4980-95f6-2126695db9ef": {
          "tips": [
            null
          ]
        },
        "eecd6444-ce89-4341-9ba9-c0ab05d21323": {
          "tips": [
            null
          ]
        },
        "6925d871-b4de-4782-ae71-af992d2a3858": {
          "tips": [
            null
          ]
        },
        "6a335115-e7ff-4a4d-babb-a4dcd87bf5fe": {
          "name": "Dziennik"
        },
        "be9774f6-7659-41fa-a4c9-50f2f19cbc9f": {
          "name": "Dziennik"
        },
        "2fda0628-b71c-4fef-abc2-6a84a2ca75f7": {
          "tips": [
            null
          ]
        },
        "2c784167-4990-4d67-b3bc-b38d0528f5f5": {
          "tips": [
            null
          ]
        },
        "31feefc0-55c2-4ea6-b791-ff499fa23e65": {
          "tips": [
            null
          ]
        },
        "2ea6e43b-40a5-40e8-a103-28b0addc4b29": {
          "tips": [
            null
          ]
        },
        "01da949b-5828-4955-8771-1641ebb1307e": {
          "name": "Dziennik"
        },
        "0f29b553-4121-4462-8026-4b2fdf2a2a87": {
          "tips": [
            null
          ]
        },
        "c691ebb6-d9a7-4885-8798-fbdcdcff2a21": {
          "name": "Dziennik"
        },
        "eaf2384a-7d50-4d27-a183-5b52cda51cf3": {
          "tips": [
            null
          ]
        },
        "436698db-a532-4140-a499-439275b977cf": {
          "tips": [
            null
          ]
        },
        "4465daca-68f4-43e3-b1f3-be0a5e9cd954": {
          "tips": [
            null
          ]
        },
        "3ce88e08-4bf9-472a-9514-7522190cfd22": {
          "tips": [
            null
          ]
        },
        "e42ba6e9-b2bf-485f-8508-5c23d2aed69c": {
          "tips": [
            null
          ]
        },
        "76b97707-cfda-4c90-aa8f-979737de848f": {
          "progression_name": "Refleksja"
        },
        "14d40634-7f9c-4900-a967-43e90ef50e63": {
          "tips": [
            null
          ]
        },
        "3d67b110-1ea4-474e-9283-8eac0691a512": {
          "name": "Zdefiniuj"
        },
        "692200ce-e899-4496-8102-0469b632dcbf": {
          "tips": [
            null
          ]
        },
        "55b399b1-a659-47ea-99f8-4bebb1f2bd80": {
          "name": "Przygotuj"
        },
        "6d634e26-0b18-4647-837c-22de4349ad0d": {
          "tips": [
            null
          ]
        },
        "d786ade9-97e9-4f24-8fa5-bfa44655ca7a": {
          "name": "Spróbuj"
        },
        "d4a8b272-6dc8-4569-81c0-fc3a6aa53104": {
          "tips": [
            null
          ]
        },
        "cb92b010-3e5b-4a84-8896-e66f5c6b616e": {
          "name": "Przemyśl"
        },
        "6d5fb16d-f3dc-4fe6-a834-467055fa501a": {
          "name": "Dziennik"
        },
        "dbdc2d27-d021-449d-82a0-9cfad4e53ee8": {
          "tips": [
            null
          ]
        },
        "a09f3e78-b86a-4960-8341-1c62f55e2f05": {
          "tips": [
            null
          ]
        },
        "e82fb226-0de2-43bc-8959-4138ea310a32": {
          "tips": [
            null
          ]
        },
        "1dee759d-a8ee-42d2-8305-5f10dad3afd2": {
          "tips": [
            null
          ]
        },
        "9845b625-2f34-4c54-acea-f8e2646d3134": {
          "tips": [
            null
          ]
        },
        "ccbf98a0-6bf6-4d21-94a6-26fd505cda22": {
          "name": "Dziennik"
        },
        "261e9382-1d53-41e9-b78c-6a4fa85b96b2": {
          "name": "Dziennik"
        },
        "326ca827-2ecb-4126-946a-aa7e7a9488cb": {
          "tips": [
            null
          ]
        },
        "506f655e-2bcd-475c-bf65-8741ee623736": {
          "tips": [
            null
          ]
        },
        "88db3a69-5712-4764-9623-c4d6f70cb148": {
          "tips": [
            null
          ]
        },
        "447fe389-e539-495f-b953-732589958fe1": {
          "tips": [
            null
          ]
        },
        "ff31bb77-56aa-45f3-a76d-ee7295e067ad": {
          "tips": [
            null
          ]
        },
        "5867d6b2-c6ff-4ffc-929a-55fc6363cfab": {
          "name": "Dziennik ",
          "tips": [
            null
          ]
        },
        "39f0ae8b-2cc4-468f-9d54-ee2f135a8e57": {
          "name": "Dziennik"
        },
        "cc136989-6409-4e43-bfa8-9426863276e2": {
          "tips": [
            null
          ]
        },
        "44bdfd2b-bc86-48d5-8c77-fc7e7580486c": {
          "tips": [
            null
          ]
        },
        "3aaee050-5c69-44ec-ac57-203a9e912cde": {
          "tips": [
            null
          ]
        },
        "a5199b52-add3-496f-86dc-2bd58b3cef71": {
          "tips": [
            null
          ]
        },
        "4e937d3d-4edc-4a22-b865-60ceb8351f35": {
          "tips": [
            null
          ]
        },
        "c4c75cdc-d53f-4be3-8cfb-f2038597a23c": {
          "name": "Dziennik"
        },
        "d2a37433-5d9b-4058-965a-db022c242213": {
          "tips": [
            null
          ]
        },
        "917ef840-8612-4cc6-8e9d-f9995eea7651": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "afa5214a-7e0c-41f7-af44-2a6089bdca2d": {
          "tips": [
            null
          ]
        },
        "f5d1f044-dc9f-4efc-83e9-2073b932fc84": {
          "tips": [
            null
          ]
        },
        "7466038a-d4e2-40c0-9244-aa5c5590d1ce": {
          "name": "Dziennik"
        },
        "dd6dc59e-0e2a-4d77-8da4-000f137ac48d": {
          "tips": [
            null
          ]
        },
        "e09f63d1-4630-4e47-856c-1743ca0d3b93": {
          "tips": [
            null
          ]
        },
        "4cd77239-83c3-48d8-a811-94008bd69ea0": {
          "tips": [
            null
          ]
        },
        "e1011570-b361-4f02-a53a-50ca9fa8ec73": {
          "tips": [
            null
          ]
        },
        "add28f98-e478-45dc-9865-64c6f3e3ff12": {
          "tips": [
            null
          ]
        },
        "132ab7a3-bbdf-4b76-957b-4703696a572f": {
          "name": "Refleksja"
        },
        "cedb888c-1e43-4d22-993c-f44cd678f585": {
          "name": "Dziennik"
        },
        "b7c8a3e6-45ea-4bd6-aa2c-80d11a359a37": {
          "tips": [
            null
          ]
        },
        "22a64b3c-8208-47f4-897a-d41a892a3ba2": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "9c1a5ab6-13b8-46ac-acea-0917ce994e8a": {
          "tips": [
            null
          ]
        },
        "c1041947-a7d4-41f5-ad1b-84a785a7bbfb": {
          "tips": [
            null
          ],
          "progression_name": "AI dla oceanów: ryby kontra nie ryby"
        },
        "88bf5a1b-6fb2-4b9f-b57f-9ae388535572": {
          "description": "**Wskazówka:** Jak, twoim zdaniem, dane treningowe wpłynęły na wyniki wygenerowane przez sztuczną inteligencję?",
          "tips": [
            null
          ]
        },
        "320ceb07-4a69-4d4b-be08-cd23e1ae2521": {
          "tips": [
            "Ryby w tym samouczku są generowane losowo w oparciu o niektóre wstępnie zdefiniowane elementy, w tym usta, ogony, oczy, łuski i płetwy, z losowo wybranym kolorem, kształtem i rozmiarem ciała. Zamiast patrzeć na rzeczywiste dane obrazu, sztuczna inteligencja szuka teraz wzorców w tych elementach na podstawie tego, jak uczeń klasyfikuje każdą rybę. Bardziej prawdopodobne jest oznaczenie ryby w taki sam sposób, jak uczeń to zrobił, jeśli ma ona przystające cechy."
          ]
        },
        "f1238482-df77-4638-b841-bb0688e717f5": {
          "progression_name": "AI dla oceanów: rodzaje ryb"
        },
        "3bc167da-d402-4233-b682-5c6551c04bd1": {
          "tips": [
            null
          ]
        },
        "3a011835-84a4-44a6-a2cd-47fddd47d637": {
          "name": "Dziennik",
          "tips": [
            "Możesz opowiedzieć te historie w swojej klasie, aby pomóc jej zrozumieć, jak sztuczna inteligencja będzie oddziaływać na przyszłość.\n\n-   [Marnowanie żywności stanowi poważny problem. Sztuczna inteligencja stara się go rozwiazać](https://singularityhub.com/2019/11/03/food-waste-is-a-serious-problem-ai-is-trying-to-solve-it/)\n-   [Technologia sztucznej inteligencji jest w stanie zidentyfikować zaburzenia genetyczne na podstawie ludzkiej twarzy](https://mashable.com/video/ai-identify-genetic-disorders-photo/?)\n-   [W jaki sposób sztuczna inteligencja zaprojektowała kandydata na nowy lek zaledwie w 46 dni](https://singularityhub.com/2019/09/09/how-an-ai-startup-designed-a-drug-candidate-in-just-46-days/)\n-   [Sztuczna inteligencja uczelni MIT AI jest w stanie prognozować raka piersi z piecioletnim wyprzedzeniem](https://techcrunch.com/2019/06/26/mit-ai-tool-can-predict-breast-cancer-up-to-5-years-early-works-equally-well-for-white-and-black-patients/)\n-   [Wojsko przyspiesza tempo pojazdów samobieżnych](https://www.axios.com/us-army-military-casualties-autonomous-vehicles-1ff51e01-3b16-4a1c-9587-ce55dee74788.html?)\n-   [W San Francisco mówi się o korzystaniu ze sztucznej inteligencji w celu wyeliminowania uprzedzeń przy oskarżaniu ludzi o przestępstwa](https://www.theverge.com/2019/6/12/18663093/ai-sf-district-attorney-police-bias-race-charge-crime)\n-   [AI is helping scholars restore ancient Greek texts on stone tablets](https://techcrunch.com/2019/10/18/ai-is-helping-scholars-restore-ancient-greek-texts-on-stone-tablets/)"
          ]
        },
        "11306709-3638-4e86-a897-0e8c2b7f7a94": {
          "name": "Dziennik"
        },
        "627715bc-b88f-44b5-82f3-6542b6a13c1a": {
          "tips": [
            null
          ]
        },
        "3f9bd4ac-771a-469d-bc19-c1cf2d53f6d2": {
          "tips": [
            null
          ]
        },
        "9faf6871-9df9-4b23-8908-7457317068af": {
          "tips": [
            null
          ]
        },
        "3965a4d3-9081-49cf-b5ec-16dcec0a1713": {
          "tips": [
            null
          ]
        },
        "25a6af85-19a0-42b6-a40a-f818f77b9f60": {
          "tips": [
            null
          ]
        },
        "849f06fe-e199-40d7-9d2d-a5a156fdc261": {
          "tips": [
            null
          ]
        },
        "0518bac2-14a4-4835-b9ce-d5e22936b367": {
          "tips": [
            null
          ]
        },
        "2d9a4aa2-3e55-4963-9a65-c4645d1b685d": {
          "tips": [
            null
          ]
        },
        "63bed78d-f5a0-44ae-8f02-99c0bb81ba05": {
          "name": "Testy po realizacji projektu"
        },
        "03be329c-2229-48ad-8fac-33cc0bb896bb": {
          "tips": [
            null
          ],
          "progression_name": "Instrukcje do ankiety końcowej"
        },
        "106d7fb4-a226-4d8f-abb9-6ee0065bc685": {
          "tips": [
            null
          ]
        },
        "56d3bbbd-9eec-4102-8e92-91724e9cdf52": {
          "tips": [
            null
          ]
        },
        "ed04f320-0cda-418a-a633-200cc4862c9f": {
          "tips": [
            null
          ]
        },
        "1847a908-f5a4-40a2-9248-958ecb67bc4a": {
          "tips": [
            null
          ]
        },
        "db70080e-e443-42ef-af8d-df3a0d609324": {
          "progression_name": "Przykładowe Programy"
        },
        "f3567ee3-1a31-40e8-9a59-6455234aab7a": {
          "tips": [
            null
          ]
        },
        "4b5a1abe-5e14-4ee2-989f-dce58df4d3c5": {
          "tips": [
            null
          ]
        },
        "dcb349df-44ca-433f-a670-d46ae55d0eee": {
          "tips": [
            null
          ]
        },
        "ab42adf1-c807-4ea4-9d9d-32b3065c36d6": {
          "tips": [
            null
          ]
        },
        "78052447-5273-4332-ac91-67b5274abb15": {
          "tips": [
            null
          ]
        },
        "11eec8ff-c9ac-49fd-ab5a-816ead35f2f6": {
          "tips": [
            null
          ]
        },
        "344501ed-df11-442a-b23b-062199520cc2": {
          "tips": [
            null
          ]
        },
        "3639ace8-523d-473d-aa8c-f86d30d7bac4": {
          "tips": [
            null
          ]
        },
        "9d8d4859-912e-435c-a495-6f38bfd1672a": {
          "tips": [
            null
          ]
        },
        "5e3a3411-6b46-44fc-aeeb-d8949db8bcfd": {
          "tips": [
            null
          ]
        },
        "758fad94-1dcd-41f4-8d52-1042f9951697": {
          "tips": [
            null
          ]
        },
        "7ac34d77-29c1-48f2-83f9-2958ace257d6": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "39e245a3-6023-4437-9b2d-be1302738dcf": {
          "tips": [
            null
          ],
          "progression_name": "Ćwiczenia"
        },
        "598a2627-2915-46fd-849b-409a7702f66b": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "d9ef6c27-268b-4f69-83c3-19fb2d607d28": {
          "tips": [
            null
          ],
          "progression_name": "Wyzwania"
        },
        "c3b5a0f9-6e09-4f19-9195-4cb22f27cced": {
          "name": "Kształty różnych rozmiarów"
        },
        "85fd91f5-29ae-413c-bbf4-4f8f71bcf462": {
          "tips": [
            null
          ]
        },
        "18df6cd3-adee-415d-abd4-71263ef3de6c": {
          "name": "Programowanie z parametrami",
          "tips": [
            null
          ]
        },
        "8edada5b-86d6-4a42-ac50-b07edf4532b9": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "1bc2e752-54a3-46b5-bc7e-a5577c5df169": {
          "progression_name": "Ćwiczenia"
        },
        "688da228-b907-4c2c-9da1-994c310ee90a": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "d412b429-353c-467e-bee1-ad7bf774a5a4": {
          "progression_name": "Wyzwania"
        },
        "75801e87-9bc4-4934-ad31-2eae1c5452db": {
          "name": "Dziennik"
        },
        "1abfbbcd-8efd-43b2-9138-3825b3d1bad5": {
          "tips": [
            null
          ]
        },
        "de1129c2-dd57-441d-8703-cfad937ab506": {
          "tips": [
            null
          ]
        },
        "e7468f3b-3e70-492a-9749-a45d6df1c3f7": {
          "name": "Programowanie ze zmiennymi",
          "tips": [
            null
          ]
        },
        "d26059f8-ed8e-47d8-a1e4-00864675f48b": {
          "tips": [
            null
          ],
          "progression_name": "Przewidywanie"
        },
        "f4cd99ba-c2ae-43dd-a4d2-132f33b8aff4": {
          "tips": [
            null
          ]
        },
        "07fe88bf-35a4-4aa8-acf7-9c1007644cde": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "776180c9-718c-4f21-ad57-d17a427825a7": {
          "progression_name": "Ćwiczenia"
        },
        "f74ad1cc-b5f7-449b-a326-539985fed8e8": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "78e71e88-379f-4d51-8093-be0dbf6bd701": {
          "progression_name": "Wyzwania"
        },
        "a941f6f3-3bda-4a2b-abcd-6f302ebaa80a": {
          "name": "Refleksja"
        },
        "e651c11f-635c-442f-a480-19faf1ce4c52": {
          "tips": [
            null
          ]
        },
        "7826369e-acab-4eb4-9bec-ae4ae31ff5f7": {
          "tips": [
            null
          ]
        },
        "a8fb986b-7cf6-4689-a9ef-5d8804fa6d98": {
          "tips": [
            null
          ]
        },
        "30726a72-deac-4fe2-b10e-fed405d0536c": {
          "progression_name": "Eksploracja"
        },
        "a0264725-895e-4d0e-b484-80c5a27e5cc2": {
          "progression_name": "Budowanie umiejętności"
        },
        "7b403cb4-85e7-44dd-8ee3-76a8d74b415f": {
          "progression_name": "Ćwiczenia"
        },
        "5faee321-0fce-40db-840a-01d1c60a93f3": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "b1eaa064-1d9e-4ef0-bdd3-42b4309db3f1": {
          "progression_name": "Wyzwania"
        },
        "04722dc8-fe8c-4917-84b1-968a45eae782": {
          "tips": [
            null
          ]
        },
        "b5100bff-91b6-4d88-9b64-9c5f9f373ff0": {
          "tips": [
            null
          ]
        },
        "a84eba1a-65fd-4b4f-8d51-ef8d0f9f3041": {
          "tips": [
            null
          ]
        },
        "11981557-3131-4ac6-acbc-71778988951f": {
          "progression_name": "Eksploracja"
        },
        "2316d41b-d99d-4130-bdb5-5170bec21044": {
          "tips": [
            null
          ]
        },
        "d57fe82a-42f4-4970-93f4-0986d14634d8": {
          "progression_name": "Budowanie umiejętności"
        },
        "b4a96bd4-10b7-422b-b6da-c47207c5dfab": {
          "tips": [
            null
          ]
        },
        "2e9880cf-89f3-43ae-9c97-f6cf3b433745": {
          "name": "Budowanie umiejętności",
          "progression_name": "Budowanie umiejętności"
        },
        "02eabbcf-c82e-4e83-9647-adf3ba1a339e": {
          "name": "Ćwiczenia",
          "progression_name": "Ćwiczenia"
        },
        "165877c4-3e03-481d-a154-fb67246e645f": {
          "name": "Ocena",
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "f0ba6339-f4c5-4949-a07d-6eeeb3a7a283": {
          "name": "Wyzwania",
          "tips": [
            null
          ],
          "progression_name": "Wyzwania"
        },
        "372e8871-7995-4ac8-939b-1010b9fe065c": {
          "name": "Dziennik"
        },
        "89554ea0-87be-41f1-abc5-89af821069b3": {
          "tips": [
            null
          ]
        },
        "a748f14d-ac72-4518-affc-f8afdbd5f545": {
          "tips": [
            null
          ]
        },
        "e2958d9a-e321-4132-8424-6103f6e7f76b": {
          "progression_name": "Przewidywanie"
        },
        "5220005a-c3fe-43a5-b9bb-19b36903e4ad": {
          "progression_name": "Budowanie umiejętności"
        },
        "cfa9155d-05b2-42fb-8665-0c3d0821c886": {
          "progression_name": "Ćwiczenia"
        },
        "80c13844-f45f-4521-8389-785692d08d25": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "e3094f44-0792-4a47-9bb3-116d2d6d3c59": {
          "progression_name": "Wyzwania"
        },
        "432c556b-4ab9-4f93-893c-8791fc2da4ee": {
          "tips": [
            null
          ]
        },
        "a1b6c071-7374-44ea-86f5-4edfcf34e891": {
          "name": "Dziennik"
        },
        "143eb56e-c445-4fde-a1f6-845371db821c": {
          "tips": [
            null
          ]
        },
        "1248d040-dd08-49f6-b5ee-07852b579c56": {
          "progression_name": "Przewidywanie"
        },
        "e34ce1fc-a4e7-49bf-80a6-e2b858117d2f": {
          "progression_name": "Budowanie umiejętności"
        },
        "634137c7-4e45-4a9d-ac02-1dcb163ddea7": {
          "progression_name": "Ćwiczenia"
        },
        "6e1156cb-9a38-4700-be52-a89c8369e931": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "d1e52b76-3fa0-482e-a33b-40d5b838e345": {
          "progression_name": "Wyzwania"
        },
        "28f996fb-791f-418c-a658-5bb9f61a6046": {
          "name": "Dziennik "
        },
        "b55f48f2-da20-4402-a7c6-6f15c513bab3": {
          "tips": [
            null
          ]
        },
        "46b4635e-6be9-405b-8908-45fb42051125": {
          "name": "Przejrzyj"
        },
        "ac7201df-9190-4002-9d03-fb5d0f2cfd83": {
          "tips": [
            null
          ]
        },
        "773f3c7e-a2a9-4c2d-8a88-5050f38d0d1f": {
          "tips": [
            null
          ]
        },
        "576907fe-bf93-4136-b9cb-e36310bca046": {
          "tips": [
            null
          ]
        },
        "449a73b9-9e17-4a54-bbc6-8eacad2cfd30": {
          "tips": [
            null
          ]
        },
        "f051c037-8ea5-41f3-85cd-98d856936a33": {
          "progression_name": "Dodaj duszki"
        },
        "8d77cdeb-94a3-4e11-8443-6f0f4011df27": {
          "progression_name": "Dodaj tekst"
        },
        "a3005adc-9fdc-44c5-b692-236229a2d521": {
          "tips": [
            null
          ]
        },
        "e8a0d208-1976-4956-88a3-fca1973867ed": {
          "name": "Dziennik"
        },
        "3ab2ab8d-202d-414b-b9d8-6ea7e07be33d": {
          "tips": [
            null
          ]
        },
        "f2a585b2-ec25-4b7c-aef8-c1b5e342e9d5": {
          "tips": [
            null
          ]
        },
        "dfdf1139-c8f8-4be7-a21c-a43ce12665bb": {
          "tips": [
            null
          ]
        },
        "aea2bc61-b817-404c-90e4-7fcadd60412a": {
          "tips": [
            null
          ],
          "progression_name": "Eksploracja"
        },
        "8f51b172-1a29-4573-a1fd-0033d63b8da1": {
          "progression_name": "Budowanie umiejętności"
        },
        "74e39a1e-2693-4a64-a2ec-c48bac2b2c63": {
          "tips": [
            null
          ],
          "progression_name": "Przewidywanie"
        },
        "bf47c328-bb3b-4bfa-9c8b-feb889ea9ba3": {
          "progression_name": "Budowanie umiejętności"
        },
        "01c89214-adeb-487b-8341-07aaba169306": {
          "progression_name": "Ćwiczenia"
        },
        "295153cb-f9cb-4b1b-94a2-2e5f8588f879": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "69bd94e3-84b7-42e9-b97c-85fc528c1e77": {
          "progression_name": "Wyzwania"
        },
        "420ec72c-1862-4390-9688-09522a96b50e": {
          "tips": [
            null
          ]
        },
        "6fd9ab72-80da-493f-ab59-5dfbafb42241": {
          "tips": [
            null
          ]
        },
        "286a1590-1a6c-4029-91c1-9166ef1ff766": {
          "tips": [
            null
          ]
        },
        "d63180f7-6d8c-4704-a4d5-ea038e0ae74d": {
          "progression_name": "Przewidywanie"
        },
        "71d5879b-edde-44e5-98d6-5142ca670b6b": {
          "tips": [
            null
          ]
        },
        "ae66fc73-77cf-4997-89b6-e462459ec4af": {
          "progression_name": "Budowanie umiejętności"
        },
        "8e829dd7-8b23-4202-95b9-45f79a72a4b7": {
          "progression_name": "Ćwiczenia"
        },
        "22bee33a-d845-4e5a-8a7a-568e3d59d2ed": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "3ff14f84-b067-4a4c-9dab-91248b595474": {
          "progression_name": "Wyzwania"
        },
        "ad631d29-bfdd-4a95-a7d6-fd4ef3aabbf9": {
          "name": "Dziennik"
        },
        "802739a3-c8c1-4fcf-a8c9-8187017e644e": {
          "tips": [
            null
          ]
        },
        "c670f4a3-be88-4250-8b4a-9a52d71bf906": {
          "name": "Przejrzyj"
        },
        "f6edd2f9-b7be-443d-9fd6-9dc806356400": {
          "tips": [
            null
          ]
        },
        "d4023790-1810-4ddd-a510-133df9586856": {
          "tips": [
            null
          ]
        },
        "539b36c9-fdb1-4f96-af81-fe2ceda35ba6": {
          "tips": [
            null
          ]
        },
        "37116129-33c9-43a6-be07-a81b0bf2f8b5": {
          "tips": [
            null
          ]
        },
        "4d82a10e-f3f1-4e52-a97a-d0ec605c3a84": {
          "tips": [
            null
          ],
          "progression_name": "Dodaj duszki"
        },
        "cf6e179d-f1d7-427d-8eff-8e47893e30d3": {
          "progression_name": "Dodaj tekst"
        },
        "40657117-7d56-4a65-b054-6e21c1ee2d40": {
          "tips": [
            null
          ]
        },
        "c8eafe87-b709-4147-8f9e-5d9d761cf63e": {
          "name": "Dziennik"
        },
        "53b7a2ec-d562-4eb3-b2f1-394197fca053": {
          "tips": [
            null
          ]
        },
        "09eb4e6e-0ed4-4f7d-8d3e-261dafc9cd93": {
          "tips": [
            null
          ]
        },
        "28c29188-79eb-4c14-860a-d2f252e77aa6": {
          "tips": [
            null
          ]
        },
        "f0528d6a-0b12-4ff1-aa3a-51f47643023b": {
          "name": "Zdania z warunkami",
          "tips": [
            null
          ]
        },
        "ed3cc380-cd93-4699-9f7c-878fd09f8b03": {
          "progression_name": "Przewidywanie"
        },
        "c297d4f8-ff08-487f-bd68-ca4d186d6e84": {
          "tips": [
            null
          ]
        },
        "6d194426-183e-4481-bbce-fb81d3e1e56b": {
          "progression_name": "Budowanie umiejętności"
        },
        "36ef31fd-2fa5-4094-94cb-7ac969d0ce87": {
          "tips": [
            null
          ]
        },
        "45b91d61-4ce0-4926-958e-854ae5d14009": {
          "progression_name": "Budowanie umiejętności"
        },
        "e758e909-93c1-4c6a-9d5a-4a3e520d662a": {
          "progression_name": "Ćwiczenia"
        },
        "a165a923-3695-4f37-b717-2fb10df4bbc1": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "78ab0dda-9cf8-4c30-8a64-a6d75525ec4b": {
          "progression_name": "Wyzwania"
        },
        "cc784b8a-e12b-44fe-8ecf-8e93680a2d5f": {
          "tips": [
            null
          ]
        },
        "217f0a53-2dbd-4305-8f50-4728d7679aee": {
          "name": "Pobieranie wejścia",
          "tips": [
            null
          ]
        },
        "e7c40cc1-5969-4bdb-bd17-0c0f786b9d76": {
          "name": "Wejście z klawiatury",
          "tips": [
            null
          ]
        },
        "4975dfd3-be92-408b-9518-8a4cae7701a9": {
          "progression_name": "Przewidywanie"
        },
        "8b674ee3-5e12-41cb-ada9-79231faed7a1": {
          "progression_name": "Budowanie umiejętności"
        },
        "8c58a84d-d3b1-4ed9-9525-5447618e5914": {
          "progression_name": "Ćwiczenia"
        },
        "36faa123-8d61-46f0-96f8-0582020a1720": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "f8e35151-4a98-4092-95c9-5326b105c163": {
          "progression_name": "Wyzwania"
        },
        "cf0de8fe-104f-47f5-b201-978567846542": {
          "tips": [
            null
          ]
        },
        "ac698d02-ec2a-44b9-bee2-9889a2b5317d": {
          "tips": [
            null
          ]
        },
        "1069a7b9-54f5-4414-bec3-3a7b86d799a1": {
          "progression_name": "Przewidywanie"
        },
        "71dc54d3-ec2d-4193-84cd-9e994129aa36": {
          "tips": [
            null
          ]
        },
        "3b5b4962-1d02-4591-a4c6-fd1f81665d68": {
          "progression_name": "Budowanie umiejętności"
        },
        "5335d3f1-8560-4aee-b39d-3975f9f29b91": {
          "progression_name": "Ćwiczenia"
        },
        "8eb9e876-638b-43a9-bacf-9b3b7a51cd6c": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "ddb4fa76-4a0e-48a4-b50a-8412650ed813": {
          "progression_name": "Wyzwania"
        },
        "92a73697-24cd-48cc-ba19-2889073f4ad1": {
          "name": "Zakończenie"
        },
        "6aa2ee53-e19e-4f39-b28b-698cae041a4c": {
          "tips": [
            null
          ]
        },
        "db100e06-789d-4fe7-81ee-66eb35ca8f17": {
          "name": "Dziennik"
        },
        "87a795e1-f7e8-49a2-a7a3-d2b6a0a34868": {
          "tips": [
            null
          ]
        },
        "6fc9f0d1-23f2-45bf-879f-69b222793806": {
          "tips": [
            null
          ]
        },
        "c0090e7c-168b-4591-9c94-d636a0033dbe": {
          "tips": [
            null
          ]
        },
        "4e0723c7-38ba-4d47-82fa-957aed03bab9": {
          "tips": [
            null
          ],
          "progression_name": "Praca Projektowa"
        },
        "799864a6-e271-42bf-aaf5-5b2bae771ac9": {
          "name": "Wzajemne recenzje"
        },
        "a0806898-ec72-4982-9038-2a0a13dd5651": {
          "tips": [
            null
          ]
        },
        "84b16461-6513-4cd8-8d78-733683d5f996": {
          "name": "Przemyśl"
        },
        "b4586fcf-10f1-49a7-91d3-689c725c116f": {
          "progression_name": "Refleksja"
        },
        "25fef8a5-04b6-4e56-bc58-c302940bc2c7": {
          "name": "Refleksja"
        },
        "d93c1d30-e2ca-4dc4-a176-227dd405df25": {
          "tips": [
            null
          ]
        },
        "e16bcb96-aa05-4fb1-8ac9-d3908e077e9a": {
          "tips": [
            null
          ]
        },
        "66c70a69-b26c-448c-bda8-2276640f676f": {
          "progression_name": "Budowanie umiejętności"
        },
        "6bfb34b7-8459-40b8-8d0b-72a3527e83c6": {
          "tips": [
            null
          ]
        },
        "640a6355-8d52-44a5-a894-575214bda979": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "a7d734dd-4c2a-4868-9266-2b08631b7d14": {
          "progression_name": "Ćwiczenia"
        },
        "c93790fe-02a3-47ad-9199-92f4842aadc8": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "119db3bc-fff1-4bec-8b1b-06faa2076b66": {
          "progression_name": "Wyzwania"
        },
        "5ecf8acf-14b0-4a8b-880c-690c6e03c186": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "dcf7442e-44b4-4ed2-8508-b658af76f6fd": {
          "tips": [
            null
          ]
        },
        "2fe0046f-7337-4431-9704-c591d26367b2": {
          "tips": [
            null
          ]
        },
        "64a8ae9e-f9ad-422b-88e4-44d0fa1da466": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "65458df6-0997-4cd9-9f44-09d08c08bede": {
          "progression_name": "Ćwiczenia"
        },
        "7864c72c-12b6-4eea-acff-8a373828ad58": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "ec39bcae-5b7f-48ad-b115-f6298edd6f9a": {
          "progression_name": "Wyzwania"
        },
        "c3962fc3-3756-4a8a-9606-adc39b40ddd9": {
          "tips": [
            null
          ]
        },
        "4d0e1b05-6764-45b5-85f0-d956e11f0704": {
          "tips": [
            null
          ]
        },
        "847ce2b1-b2de-4932-af9c-ad5b8ca0499b": {
          "tips": [
            null
          ]
        },
        "fb103c70-07e6-49be-a12a-ce480a70c199": {
          "tips": [
            null
          ]
        },
        "3f6d101f-bccb-4a4d-9b16-5db525802046": {
          "tips": [
            null
          ]
        },
        "5cb88190-4077-42c3-8202-97e9e6eaf470": {
          "tips": [
            null
          ],
          "progression_name": "Przewidywanie"
        },
        "bf671c2c-974c-4324-bd4a-9616e5bb20e4": {
          "progression_name": "Budowanie umiejętności"
        },
        "823c5cf0-3bcd-4bcc-ab35-475ef66af4d5": {
          "progression_name": "Ćwiczenia"
        },
        "a67f4422-b407-43b2-a7bf-e06224301f5c": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "577eb3cb-db08-487b-a9e3-687b7fe76bb3": {
          "progression_name": "Wyzwania"
        },
        "6c332044-1efd-4d8e-99ef-1751b148aa15": {
          "tips": [
            null
          ]
        },
        "28e4fa06-b7f2-4e45-b829-f8f0cd9f3e24": {
          "tips": [
            null
          ]
        },
        "23d7a87f-664b-4fb0-b2e9-d2e1acbee2d8": {
          "tips": [
            null
          ]
        },
        "ece5c717-91f6-4f17-9c1d-b969a37e5571": {
          "tips": [
            null
          ]
        },
        "05ef129f-8107-4bce-820e-4eb2ab52c896": {
          "tips": [
            null
          ]
        },
        "d6732922-69fb-4e9c-b948-66f12e6f57a3": {
          "progression_name": "Budowanie umiejętności"
        },
        "9b5724a8-5499-40c4-804b-7f9fffd4b4c3": {
          "progression_name": "Ćwiczenia"
        },
        "f9222c7e-7a06-45fb-a1e1-ba6451ebab35": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "e82267dc-18bf-4453-a182-fdc94148509b": {
          "progression_name": "Wyzwania"
        },
        "f33dbadc-c684-43e0-b4b5-c6dc25940860": {
          "tips": [
            null
          ]
        },
        "19ffef2d-aa7f-40fd-bb4b-b075ac7306c4": {
          "tips": [
            null
          ]
        },
        "1acd883d-261b-4c22-8a50-167d3ab9832f": {
          "tips": [
            null
          ]
        },
        "1f891879-1df5-43fa-8960-39d2465556c7": {
          "progression_name": "Ruch duszka"
        },
        "ae1e06e8-299e-4d75-beba-a0c0bf96af15": {
          "tips": [
            null
          ]
        },
        "a8add3df-984e-4df0-86c1-2c6b44e21870": {
          "tips": [
            null
          ],
          "progression_name": "Film: Funkcje"
        },
        "13ca0af7-3563-408a-830b-ff9cf0dfba21": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "2b837cc6-474a-4bb8-9a2e-92b36aa92c6c": {
          "tips": [
            null
          ],
          "progression_name": "Ćwiczenia"
        },
        "3bcae8d2-a829-4fab-aef2-444e9e331654": {
          "tips": [
            null
          ],
          "progression_name": "Gra Kolekcjonerska"
        },
        "27a6e960-e29f-4ace-b464-1062d314e4dc": {
          "progression_name": "Wyzwania"
        },
        "b9b27e11-e4de-4db4-b247-2138a0de2b65": {
          "tips": [
            null
          ]
        },
        "55a29565-ffaf-4613-bd05-04ad86588d7b": {
          "tips": [
            null
          ]
        },
        "0fc03ce6-b771-406c-8575-a7595d8ff53f": {
          "tips": [
            null
          ]
        },
        "58520a27-0f13-4ade-ab46-3f4d55e8ff4b": {
          "progression_name": "Zaplanuj swój projekt"
        },
        "6261b5c2-3c97-43dc-943a-6e8b41340a20": {
          "tips": [
            null
          ],
          "progression_name": "Wyzwania"
        },
        "62908970-ef2b-4351-b8bd-076318231639": {
          "tips": [
            null
          ]
        },
        "85a6b769-2b7f-42d2-8f30-b4cbef66c7f0": {
          "tips": [
            null
          ]
        },
        "8b312715-dd5d-4438-851c-95ebcabd2051": {
          "tips": [
            null
          ]
        },
        "153580fd-9c88-4066-9a75-2cdb676fa703": {
          "progression_name": "Buduj Platformę Jumper"
        },
        "94019161-7a1f-4a69-b254-01f430e0e3dc": {
          "progression_name": "Skoczek - tło i zmienne"
        },
        "6c69b281-b2b4-4d39-b2c4-cb194e5aae00": {
          "progression_name": "Skoczek - platformy"
        },
        "6754ec06-8c9f-4168-a9c6-db105d652a32": {
          "progression_name": "Skoczek - elementy"
        },
        "c585e9bd-2f17-42d7-8d8c-7aa6627dbbb6": {
          "progression_name": "Skoczek - gracz"
        },
        "6f08e987-f061-4974-a750-5db13229a6ac": {
          "tips": [
            null
          ]
        },
        "c87e787e-1579-4250-80f8-6e8e434a3a2e": {
          "progression_name": "Wyzwania"
        },
        "1a6968dc-dfa0-428e-afb9-00667d968878": {
          "name": "Dziennik"
        },
        "e6250418-b491-436b-993c-02db6b0115bc": {
          "tips": [
            null
          ]
        },
        "4cedbe11-f01d-4877-8772-99baae5c7d46": {
          "tips": [
            null
          ]
        },
        "2f874f2f-5f9e-4d5a-a84f-61151378280c": {
          "tips": [
            null
          ]
        },
        "b8798164-0848-4f12-b1c2-4e41799cda93": {
          "tips": [
            null
          ]
        },
        "244c4366-1d73-41c1-bdd4-f151ee576403": {
          "tips": [
            null
          ]
        },
        "0296c25a-c7e0-4f70-9254-e3742c469a84": {
          "tips": [
            null
          ],
          "progression_name": "Projekt - Tło i Zmienne"
        },
        "e2bfdd8b-2cbb-41be-b227-37e15a8fef70": {
          "progression_name": "Projekt - Duszki i Interakcje"
        },
        "6a47a229-617f-41c5-a439-47dacbf2aeb4": {
          "tips": [
            null
          ]
        },
        "f5d590b3-559c-47e9-9222-72691313c104": {
          "name": "Udostępnij"
        },
        "92443dc3-c244-44a5-ab89-dcd237a5f2ed": {
          "name": "Dziennik"
        },
        "574e77dd-d6f7-4d59-80db-f24e54851aa1": {
          "name": "Przemyśl"
        },
        "324ed892-67b4-45b3-96d1-5e0ea6563e2e": {
          "name": "Testy po realizacji projektu"
        },
        "1aa3af1b-96de-45d7-9726-1af4861f2d87": {
          "tips": [
            null
          ],
          "progression_name": "Instrukcje do ankiety końcowej"
        },
        "d34d3ef7-b3ad-41de-8b49-c7460f8b1450": {
          "tips": [
            null
          ]
        },
        "9c23f514-e5e6-45f4-9038-c8c68e26c041": {
          "name": "Zainspiruj się"
        },
        "ecaf188e-1d18-4418-9881-296b1f090f2e": {
          "name": "Innowacyjne badania"
        },
        "9e9ce748-fed7-4391-a28d-6c9e5da3cf27": {
          "tips": [
            null
          ]
        },
        "fe954bee-319a-49ec-a2d1-033dd539a59b": {
          "tips": [
            null
          ],
          "progression_name": "Innowacyjne badania"
        },
        "2bddbd31-7cae-4867-96fd-f8ba2f18b6c8": {
          "tips": [
            null
          ]
        },
        "f14cc941-af61-4deb-8c16-be730ded1849": {
          "tips": [
            null
          ],
          "progression_name": "Ustawianie Właściwości"
        },
        "fe4404fa-4e67-4c56-b117-6aa3dd7fd8ef": {
          "tips": [
            null
          ],
          "progression_name": "Zdarzenia i Właściwości"
        },
        "12af028a-bc38-49f4-8fda-8cd49963e102": {
          "progression_name": "Tworzenie aplikacji"
        },
        "053cf5c9-1dd1-4da7-8fca-82dd5780c4b0": {
          "tips": [
            null
          ]
        },
        "8cb231b2-ab63-4868-a949-bc91e701ea7d": {
          "tips": [
            null
          ]
        },
        "dafc849e-b1f0-4767-aa97-69090169177e": {
          "tips": [
            null
          ]
        },
        "9fc2aec4-9f01-4726-82a7-306e613d936e": {
          "tips": [
            null
          ]
        },
        "1890c047-5983-4093-99a8-08fcb099c0e0": {
          "tips": [
            null
          ],
          "progression_name": "Stosując LED"
        },
        "bc4c9c62-accc-4be6-a733-2a6acf678ec7": {
          "tips": [
            null
          ],
          "progression_name": "Aplikacje LED"
        },
        "b297e101-f4cd-4ddd-ae0f-42e87ed683d0": {
          "tips": [
            null
          ]
        },
        "0904effb-8684-4f4b-8bbf-795b9787b83e": {
          "progression_name": "Przykłady Wejść"
        },
        "5037ffb9-a7e8-4abc-81cc-e72d58b5e31c": {
          "name": "Dane wejściowe dla bez komputera"
        },
        "c932e879-ed85-4226-b025-a1dbb22da379": {
          "tips": [
            null
          ]
        },
        "4c3af8fe-b972-410f-a839-00f38e6a51ce": {
          "name": "Refleksja",
          "tips": [
            null
          ]
        },
        "42897a7c-47b8-426e-9d2f-c9177a06433e": {
          "progression_name": "Zdarzenia na tablicy"
        },
        "70584163-7483-4f54-b414-11925175ca74": {
          "progression_name": "Stosując Przełącznik"
        },
        "15e99a5a-e49e-47de-8eb1-f01b08a46a42": {
          "progression_name": "Brzęczyk"
        },
        "7091d49a-c4ac-4c04-aaa4-290efb0ee705": {
          "tips": [
            null
          ]
        },
        "2224615d-c083-4694-b797-4b3c8e8d84da": {
          "tips": [
            null
          ],
          "progression_name": "Właściwości getterów"
        },
        "bf62acfd-9cbc-4232-ba68-d86ced8e58bc": {
          "progression_name": "Suwaki"
        },
        "aa167cb8-d7fb-4c0f-8a8a-55ee234635da": {
          "progression_name": "Zmień"
        },
        "a7dd4853-b8c3-44d2-a03b-f5e5e23ff0ac": {
          "progression_name": "Motocykl"
        },
        "c7ee1edc-3c31-4a6a-a814-1bc69360e6fe": {
          "progression_name": "Dodatkowe wyzwania"
        },
        "d0e85c72-53c1-4429-91ab-3d160fc10b20": {
          "tips": [
            null
          ]
        },
        "f5a1e7d6-5715-4050-bfed-a5e0663486c4": {
          "tips": [
            null
          ]
        },
        "ad9b3ec1-2ac4-49e3-ae20-08ed7b100017": {
          "progression_name": "Czytanie Czujników"
        },
        "dd5aab7d-3ee7-465c-9668-d584bf8b416c": {
          "progression_name": "Zdarzenia Czujnika"
        },
        "ef9ec42f-f86e-4636-a45b-5da0d208b714": {
          "tips": [
            null
          ],
          "progression_name": "Czujniki do Kolorów"
        },
        "1a668f58-e58e-4624-a911-fcfc3188df23": {
          "progression_name": "Dodatkowe wyzwania"
        },
        "dd376cda-c9b9-4bf6-9cd4-be44b1ec632f": {
          "tips": [
            null,
            null
          ]
        },
        "0d9ecf02-4bac-4dc3-86c4-ba83c96e8a14": {
          "tips": [
            null
          ]
        },
        "63168e8f-2bcc-445c-9dbc-96df54a86560": {
          "progression_name": "Zaplanuj swój projekt"
        },
        "5959a534-f372-4111-a8d2-4e94de572996": {
          "progression_name": "Projekt Ekranu"
        },
        "01addbef-11df-4c62-a099-ae69c66c7c1c": {
          "tips": [
            null
          ],
          "progression_name": "Kończąc funkcje"
        },
        "33168786-d600-4b6c-a947-045b8a466d7c": {
          "tips": [
            null
          ],
          "progression_name": "Szukanie Zwycięzcy"
        },
        "8259e743-5c84-4516-8f31-300f06de6ab0": {
          "tips": [
            null
          ]
        },
        "b1e96083-0678-461f-9c8c-68145c384ab8": {
          "progression_name": "Zaplanuj swój projekt"
        },
        "2248f61c-7cfa-491e-87f6-fba7f80558b9": {
          "progression_name": "Projekt Ekranu"
        },
        "9afdcdd9-6cf6-481c-86b4-312da18c7cc3": {
          "progression_name": "Zdarzenia"
        },
        "b919f5c1-5152-4baa-bddb-112275d049ac": {
          "progression_name": "Funkcje"
        },
        "ec8d5281-885f-4d9d-af4e-2d28ecfb94c6": {
          "progression_name": "Końcowe poprawki"
        },
        "5efa89cb-f262-4f85-afb8-752e1495d920": {
          "name": "Udostępnianie projektów"
        },
        "187cdb02-266e-41c6-a35e-8d31c07cfdff": {
          "progression_name": "Refleksja"
        },
        "316f977f-5ad8-4565-b6d1-1c62507ba565": {
          "tips": [
            null
          ]
        },
        "81d447de-9abb-4bc8-af49-9d823c30e8cb": {
          "name": "Tablice i kolorowe LEDy"
        },
        "701df007-2fc2-4907-bdae-63ea39ea0649": {
          "tips": [
            null
          ]
        },
        "528b9a48-dd5d-4f52-b455-be650f9ed180": {
          "tips": [
            null
          ],
          "progression_name": "Wprowadzenie do tablic"
        },
        "624b7f1b-43ad-451a-80bb-86622fe827e6": {
          "progression_name": "Kolorowe LED"
        },
        "3f472ce9-f1fe-4be7-8849-5ba3155f2d11": {
          "tips": [
            null
          ],
          "progression_name": "Pokaz świateł"
        },
        "45cd46c8-3f06-4b93-8688-a6da5a670734": {
          "progression_name": "Poziomy Wyzwań"
        },
        "78b871d6-dd5f-4ad8-b32b-97df938ae849": {
          "tips": [
            null
          ]
        },
        "0d6b1fbb-59d1-4a90-a5f7-e6fdbabcdfb6": {
          "tips": [
            null
          ]
        },
        "a5ccf2e8-f9e7-42df-a5e1-2c86349bf620": {
          "name": "Tworzenie muzyki"
        },
        "658d5770-5620-4be8-b722-0c8cfa66fe52": {
          "progression_name": "Granie z nut"
        },
        "4563c715-0a30-419a-9eca-d5b41089e165": {
          "tips": [
            null
          ],
          "progression_name": "Muzyczne tablice"
        },
        "28fb99c8-886a-4ed6-859a-1fb1a813c484": {
          "tips": [
            null
          ],
          "progression_name": "Tworzenie Piosenek"
        },
        "99bb7a42-a203-480b-af5d-4e828d85e452": {
          "progression_name": "Dodatkowe"
        },
        "eb895db7-aeb1-4efe-9eb8-c314cd7a2621": {
          "name": "Dziennik ",
          "tips": [
            null
          ]
        },
        "0874692e-8e17-4b1d-9232-f11c61106af0": {
          "tips": [
            null
          ]
        },
        "e91b0fe3-8fe2-463c-b2fe-349fcbc510b7": {
          "name": "Tablice i pętle \"dla\""
        },
        "d4f41f0f-3bd8-493c-b4c6-9ec09058247b": {
          "progression_name": "Programy, które Powtarzają"
        },
        "d5b2ea3b-4370-4cf8-a9ed-670e789d812f": {
          "tips": [
            null
          ]
        },
        "2aed74d8-d9e0-4c5d-b0bc-7bc5e90ce0df": {
          "progression_name": "Pętle dla (for)"
        },
        "4eae7990-8111-4f59-a7ef-212acf9f054f": {
          "tips": [
            null
          ],
          "progression_name": "Pętle 'dla' i kolorowe LEDy"
        },
        "020265fb-ab0b-4d77-8cf9-30fb0228a37b": {
          "name": "Dziennik"
        },
        "5cf3a5e9-20b3-4eb3-bc30-8f7676bfbfc8": {
          "tips": [
            null
          ]
        },
        "387ec0d5-447c-41a9-ad6d-5383ce38f8f6": {
          "progression_name": "Orientacja"
        },
        "88fbe9b6-7233-4617-a579-4eea7041c1b0": {
          "tips": [
            null
          ],
          "progression_name": "Akcelerometr Zdarzeń"
        },
        "83dadfe8-ec04-4986-9e4b-8fcb301bce51": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "61efbeb1-5fcd-4dec-9265-4628f24745de": {
          "tips": [
            null
          ]
        },
        "de64b098-e02d-4a21-9965-1e7217f40ebd": {
          "progression_name": "Funkcje z parametrami"
        },
        "fca31602-8539-4b94-968a-9a98631d3394": {
          "progression_name": "Iteracja i Parametry"
        },
        "02b60bab-d184-4bce-859c-5438c9e37cc4": {
          "tips": [
            null
          ],
          "progression_name": "Łowca Gwiazd"
        },
        "3b0572f2-01eb-48b0-96a1-43739f98575a": {
          "tips": [
            null
          ]
        },
        "38e26d5e-b651-4c50-b791-10455112e4ba": {
          "tips": [
            null
          ]
        },
        "4d9d84e9-900f-4816-81fd-b70a1ca43b16": {
          "progression_name": "Proste układy"
        },
        "c814528c-f376-440e-849f-19d8790e7d92": {
          "tips": [
            null
          ],
          "progression_name": "Mądry rower - migacze"
        },
        "8521f45a-fff7-43d7-bd5a-d32077c26151": {
          "tips": [
            null
          ]
        },
        "420da788-7b37-45e7-b940-ae08c8f90b25": {
          "tips": [
            null
          ]
        },
        "90ed38ab-3eec-449a-a2dd-dccd4a1aa26d": {
          "progression_name": "Obwody przycisku "
        },
        "672d26f8-cbd5-46ea-8482-d84b0be3e335": {
          "tips": [
            null
          ],
          "progression_name": "Ukończ Prototyp"
        },
        "a3f5dca7-56ea-4d7e-9f37-b1ae9f46aef5": {
          "tips": [
            null
          ]
        },
        "0516be14-10b2-4124-af7c-3d76c5177d95": {
          "tips": [
            null
          ]
        },
        "cb822f4d-fa13-460e-ba94-c491e4763a13": {
          "progression_name": "Zaprojektuj swój prototyp"
        },
        "1f452df6-46c4-4e9d-82b5-6efe4fd98928": {
          "progression_name": "Interfejs użytkownika"
        },
        "aff65857-e7c8-4c2c-91b8-ea88ac74042c": {
          "progression_name": "Wejście i Wyjście Płyty"
        },
        "e94b332f-1746-4ad8-ad48-f3a337b69c2c": {
          "progression_name": "Końcowe poprawki"
        },
        "7550d329-92cf-4cd3-b0b5-c918c24f2105": {
          "progression_name": "Refleksja"
        },
        "44000645-7870-4e71-b27e-75cd70b6dbb9": {
          "tips": [
            null
          ]
        },
        "a76a28bd-8ddb-4b39-8ce7-6663e81bfd1b": {
          "name": "Udostępnij",
          "tips": [
            null
          ]
        },
        "a237ce6e-b99e-4117-afee-b384cfd9fc4f": {
          "tips": [
            null
          ],
          "progression_name": "Instrukcje do ankiety końcowej"
        },
        "322ad615-5d42-4b54-ab60-5d7b7d36e277": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "3e097460-3cde-4714-ba16-61de8a8439ac": {
          "tips": [
            null
          ]
        },
        "cf324018-6258-4c8b-98e8-f5de7f3cec14": {
          "tips": [
            null
          ]
        },
        "443a800b-e1ba-4bfa-b6d5-c13f6a72ab2c": {
          "description": "#### Reprezentacja ma znaczenie"
        },
        "a55ce75b-80e1-4daa-973e-40ccf2cfc730": {
          "name": "Osoba 1",
          "description": "**„Jestem uczulony na jajka.”**"
        },
        "617e101b-5c13-40e7-be75-6a4626bebe3e": {
          "tips": [
            null
          ]
        },
        "2d53240d-98ed-4acc-8197-0f8b303689e1": {
          "name": "Osoba 2"
        },
        "7b4894fa-f2e6-41dc-b9e5-fa22de67c9f1": {
          "name": "Osoba 3",
          "description": "**„Staram się oszczędzać pieniądze.”**"
        },
        "e94772c1-7ac5-4e4f-b9b3-021ba4b36ef5": {
          "tips": [
            null
          ]
        },
        "1ec61889-d528-4888-8568-7b059e9a2d7c": {
          "name": "Osoba 4"
        },
        "c670c339-5f6d-475c-b6cf-ad8a35c2d8a2": {
          "name": "Refleksja"
        },
        "0d5d0634-6b05-4c47-b187-594dfd30d625": {
          "tips": [
            null
          ]
        },
        "a050b814-d2e2-4a84-8fee-d1320e9bb9ea": {
          "name": "Dziennik"
        },
        "a8a0cd51-12b0-4c58-8d16-b4b4778d2719": {
          "name": "Dziennik"
        },
        "c80549fe-fb7e-4eef-ba30-247264bf0e1f": {
          "tips": [
            null
          ]
        },
        "7e296c41-f0fb-4d31-8b13-31f6e7abe2f5": {
          "tips": [
            null
          ]
        },
        "98a216a1-8aa6-4216-ad6e-b7ab5abca491": {
          "tips": [
            null
          ]
        },
        "addfcb6c-dafa-4e9d-b5fc-8d2c400714aa": {
          "tips": [
            null
          ]
        },
        "05ef09a7-e47c-4238-b280-31aeb3b4dc00": {
          "tips": [
            null
          ]
        },
        "cc06e6ea-b748-4c9d-b201-ccb10cd77cf6": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "71a4871e-99e0-48c7-8dbc-e651828553d8": {
          "name": "Dziennik"
        },
        "cbce24b3-baeb-42f3-978b-e4262e9e38b7": {
          "tips": [
            null
          ]
        },
        "d324e413-50c5-4135-97ad-610430cd5a97": {
          "tips": [
            null
          ]
        },
        "bb61bac7-12c5-4854-9cce-2450dae006fb": {
          "tips": [
            null
          ]
        },
        "1ab47faa-8f31-4cdf-8fab-39b193dee663": {
          "name": "Dziennik"
        },
        "604675cc-016d-4706-ad48-32d1547d7a74": {
          "tips": [
            null
          ]
        },
        "8aadfdde-40ea-48c0-b369-3e9a0213c31b": {
          "tips": [
            null
          ]
        },
        "2c878939-14f1-4cca-a6a5-d1bcc71ffb84": {
          "name": "Gadżet pikselacyjny",
          "progression_name": "Reprezentowanie obrazów"
        },
        "0cb3b9f4-af2b-43e0-bdaa-4ce6ff013a37": {
          "tips": [
            null
          ]
        },
        "2f614323-09fc-4fc3-949a-d8326ea2dedf": {
          "tips": [
            null
          ]
        },
        "17536ac7-f578-4492-9a2b-034697748108": {
          "tips": [
            null
          ]
        },
        "d49613fe-8fcf-4801-a656-6bd752db7c1b": {
          "name": "Dziennik"
        },
        "143b040a-8c9e-4653-92d4-f58ea9ffef72": {
          "tips": [
            null
          ]
        },
        "85c49ae4-5b52-40ad-96eb-424f02d8539e": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "7383a881-4001-478a-8e89-5169fc76e2fb": {
          "tips": [
            null
          ]
        },
        "5e396df7-105a-46f4-8083-63f1c708ca2a": {
          "tips": [
            null
          ]
        },
        "c71003ba-e08d-4d77-b308-5cc6ee941091": {
          "tips": [
            null
          ]
        },
        "30ef889b-387b-4dbd-b6bc-96ca25489944": {
          "tips": [
            null
          ]
        },
        "59dffdf2-728b-4b66-a29b-7635c858be00": {
          "tips": [
            null
          ]
        },
        "f5e577d7-b133-493e-995f-76c9ef44de1d": {
          "name": "Dziennik"
        },
        "5ab922e3-8512-4c62-83c7-e17aa282377d": {
          "tips": [
            null
          ]
        },
        "1282f8e7-0fd9-47bc-b7b4-75b4025eedb5": {
          "tips": [
            null
          ]
        },
        "13abae06-0500-42e9-a486-940684c9ba87": {
          "tips": [
            null
          ]
        },
        "a4df917c-be45-4977-bc95-fbe945f3c3cf": {
          "tips": [
            null
          ]
        },
        "38324708-63cb-4738-92c9-af06aed187f7": {
          "tips": [
            null
          ]
        },
        "8df6cc07-f2c4-499d-87e8-6ffe1c84ebd0": {
          "name": "Dziennik"
        },
        "b5f6e7d0-04f2-4175-897c-236e80570d9e": {
          "name": "Dziennik"
        },
        "95c12363-142c-4e82-bed6-76541ed021c4": {
          "tips": [
            null
          ]
        },
        "2c09cb98-721d-4c28-add5-bc717980da1e": {
          "tips": [
            null
          ]
        },
        "e5d5e7ac-2362-41f9-a3ba-b78deaee4edc": {
          "tips": [
            null
          ]
        },
        "bc476ecb-65ea-4f30-a970-81feb995c71c": {
          "tips": [
            null
          ]
        },
        "cc154748-5e22-45df-9986-66cabc550f17": {
          "name": "Dziennik"
        },
        "112b54ac-5751-4635-8275-23e6acc5947c": {
          "tips": [
            null
          ]
        },
        "a4878e11-13db-48d2-907c-c08afff5a2f1": {
          "name": "Dziennik"
        },
        "1fcec88e-f931-4ece-95d2-966a9ce0d0eb": {
          "tips": [
            null
          ]
        },
        "317d7606-342d-4068-939d-b4abefb7867f": {
          "tips": [
            null
          ]
        },
        "4e8ecb03-3abf-412e-96bb-102eb61294aa": {
          "tips": [
            null
          ]
        },
        "89ef6969-5f33-411f-905d-93ffc791d9f8": {
          "progression_name": "Refleksja"
        },
        "c74f28dc-8f61-443c-b03a-4943b65c8824": {
          "tips": [
            null
          ]
        },
        "928ac428-64ef-4359-ad63-12d175fa700e": {
          "name": "Zdefiniuj"
        },
        "d19d7358-a136-4eae-a082-fb508284fb50": {
          "tips": [
            null
          ]
        },
        "35745fa0-2097-414b-beb8-eca436c1d5b9": {
          "name": "Przygotuj"
        },
        "2cd98702-4332-403a-8ce9-01db36e361ab": {
          "tips": [
            null
          ]
        },
        "799529e8-aa6b-44e9-a270-1db8052d7df3": {
          "name": "Spróbuj"
        },
        "fae06660-56ad-41e5-8af3-bbfbe36ebb97": {
          "tips": [
            null
          ]
        },
        "7080a972-d63e-4299-8260-f1df2f234857": {
          "name": "Przemyśl"
        },
        "08bb2602-af7f-4afc-91ee-cc1b81b67264": {
          "name": "Dziennik"
        },
        "cb6b53c4-832b-4488-b7d8-e235460c633c": {
          "tips": [
            null
          ]
        },
        "4701e66f-6c37-4ae3-a6d9-b94b4c45704c": {
          "tips": [
            null
          ]
        },
        "28dfd4cd-0d62-4c35-bed0-d6038adf4813": {
          "tips": [
            null
          ]
        },
        "2bd9ece8-996d-4561-9ff9-b702ac019d12": {
          "tips": [
            null
          ]
        },
        "b22284df-c9d1-4046-93d8-4cd7339b1ec0": {
          "tips": [
            null
          ]
        },
        "197e10c6-aca0-4198-8c55-08b02638a517": {
          "name": "Dziennik"
        },
        "21d25224-74a0-4aeb-9fdf-edbb7db6a111": {
          "name": "Dziennik"
        },
        "b65a936d-eb48-4c6f-a0bf-751bb0829269": {
          "tips": [
            null
          ]
        },
        "a6b0da50-c2de-4f78-98e0-5f01500c1845": {
          "tips": [
            null
          ]
        },
        "a8280172-5d5d-4d29-b6ec-bc98ae0e3e08": {
          "tips": [
            null
          ]
        },
        "c72ef18c-8a87-40ab-9a07-260f89fad275": {
          "tips": [
            null
          ]
        },
        "45d58868-a7ed-43a5-ae94-c64de3cc4dd5": {
          "tips": [
            null
          ]
        },
        "46bfc542-d2d8-4124-a4cd-d7e53fff618e": {
          "name": "Dziennik ",
          "tips": [
            null
          ]
        },
        "ff83c374-628a-4388-8d39-29a2a7030ab9": {
          "name": "Dziennik"
        },
        "501ce03f-e483-4e6d-bbc8-dc26c9a3a265": {
          "tips": [
            null
          ]
        },
        "3cf5b5f5-208d-4801-b616-a877e120f6ca": {
          "tips": [
            null
          ]
        },
        "c3c51f8c-dafe-485c-9fb6-9e10a686097d": {
          "tips": [
            null
          ]
        },
        "456fda46-f469-47e7-991c-6fd3efb1c0f6": {
          "tips": [
            null
          ]
        },
        "1d7c5ce3-6ee6-408f-9723-8fdfb8b2fda3": {
          "tips": [
            null
          ]
        },
        "8848bff8-2f99-42e1-b248-8c56fea22e1f": {
          "name": "Dziennik"
        },
        "400536e8-3e68-4e2e-a1cb-15abe6e78255": {
          "tips": [
            null
          ]
        },
        "1fd332bf-4d3a-4fb3-8585-11aa036c87ff": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "1d708064-9b0b-4a56-bccf-715c91c2cf6d": {
          "tips": [
            null
          ]
        },
        "a367b3e1-6f45-49c0-8429-9e2b607560a2": {
          "tips": [
            null
          ]
        },
        "1d97d183-068b-4f5a-b823-e6b47f686a81": {
          "name": "Dziennik"
        },
        "e4a6519f-4954-49e6-8914-83043cd945d7": {
          "tips": [
            null
          ]
        },
        "e84d2260-141b-4899-971d-0e0e33eb12d2": {
          "tips": [
            null
          ]
        },
        "caccc30a-07e9-465a-a077-65788e7b4f1b": {
          "tips": [
            null
          ]
        },
        "83b2e7f4-a01c-491f-a3e1-29ac12d01a13": {
          "tips": [
            null
          ]
        },
        "f6b744db-baed-4e9d-bdf4-1f1399bf716a": {
          "tips": [
            null
          ]
        },
        "1f315b3a-9470-42be-95de-4b2327b9a338": {
          "name": "Refleksja"
        },
        "cab8946a-af60-4101-9f3b-a6ea464f6601": {
          "name": "Dziennik"
        },
        "85bda82c-51d9-4b18-a377-4ecd142855c0": {
          "tips": [
            null
          ]
        },
        "8ff48983-ab23-42db-8ad0-d0d690bafad5": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "7d58d643-efce-44e7-a3e4-7b3492c72250": {
          "tips": [
            null
          ]
        },
        "f8f9a770-42a2-4c1d-9b51-52f46ff9360d": {
          "tips": [
            null
          ],
          "progression_name": "AI dla oceanów: ryby kontra nie ryby"
        },
        "914c565c-fb6d-490c-a14a-b289ac56d720": {
          "description": "**Wskazówka:** Jak, twoim zdaniem, dane treningowe wpłynęły na wyniki wygenerowane przez sztuczną inteligencję?",
          "tips": [
            null
          ]
        },
        "4ed5db10-7aec-4ab8-802b-10ccc9710ed5": {
          "tips": [
            "Ryby w tym samouczku są generowane losowo w oparciu o niektóre wstępnie zdefiniowane elementy, w tym usta, ogony, oczy, łuski i płetwy, z losowo wybranym kolorem, kształtem i rozmiarem ciała. Zamiast patrzeć na rzeczywiste dane obrazu, sztuczna inteligencja szuka teraz wzorców w tych elementach na podstawie tego, jak uczeń klasyfikuje każdą rybę. Bardziej prawdopodobne jest oznaczenie ryby w taki sam sposób, jak uczeń to zrobił, jeśli ma ona przystające cechy."
          ]
        },
        "0644d195-c0b2-4557-9f2c-116b259fe74a": {
          "progression_name": "AI dla oceanów: rodzaje ryb"
        },
        "92b13324-8ae5-4796-9071-694683704daa": {
          "tips": [
            null
          ]
        },
        "7c5c8f29-ab7a-4891-b135-182f4222a591": {
          "name": "Dziennik",
          "tips": [
            "Możesz opowiedzieć te historie w swojej klasie, aby pomóc jej zrozumieć, jak sztuczna inteligencja będzie oddziaływać na przyszłość.\n\n-   [Marnowanie żywności stanowi poważny problem. Sztuczna inteligencja stara się go rozwiazać](https://singularityhub.com/2019/11/03/food-waste-is-a-serious-problem-ai-is-trying-to-solve-it/)\n-   [Technologia sztucznej inteligencji jest w stanie zidentyfikować zaburzenia genetyczne na podstawie ludzkiej twarzy](https://mashable.com/video/ai-identify-genetic-disorders-photo/?)\n-   [W jaki sposób sztuczna inteligencja zaprojektowała kandydata na nowy lek zaledwie w 46 dni](https://singularityhub.com/2019/09/09/how-an-ai-startup-designed-a-drug-candidate-in-just-46-days/)\n-   [Sztuczna inteligencja uczelni MIT AI jest w stanie prognozować raka piersi z piecioletnim wyprzedzeniem](https://techcrunch.com/2019/06/26/mit-ai-tool-can-predict-breast-cancer-up-to-5-years-early-works-equally-well-for-white-and-black-patients/)\n-   [Wojsko przyspiesza tempo pojazdów samobieżnych](https://www.axios.com/us-army-military-casualties-autonomous-vehicles-1ff51e01-3b16-4a1c-9587-ce55dee74788.html?)\n-   [W San Francisco mówi się o korzystaniu ze sztucznej inteligencji w celu wyeliminowania uprzedzeń przy oskarżaniu ludzi o przestępstwa](https://www.theverge.com/2019/6/12/18663093/ai-sf-district-attorney-police-bias-race-charge-crime)\n-   [AI is helping scholars restore ancient Greek texts on stone tablets](https://techcrunch.com/2019/10/18/ai-is-helping-scholars-restore-ancient-greek-texts-on-stone-tablets/)"
          ]
        },
        "7833e351-1d81-480d-bf06-6c70c8374072": {
          "name": "Dziennik"
        },
        "375e017e-8620-4d95-a1f5-89fda22729ac": {
          "tips": [
            null
          ]
        },
        "24a8f1ab-d8eb-4738-b114-0534be713085": {
          "tips": [
            null
          ]
        },
        "ff9b8b39-860d-427b-9a2d-80c537bc539f": {
          "tips": [
            null
          ]
        },
        "4bc50ef6-5978-4a80-943a-49fc0cffb23e": {
          "tips": [
            null
          ]
        },
        "2d923b7c-56a0-462a-b7c4-5350cfe28ac0": {
          "tips": [
            null
          ]
        },
        "92566744-182e-416d-b7c7-2f5b2a92026b": {
          "tips": [
            null
          ]
        },
        "22ca7a0f-899a-4cd3-8fbd-14afbf396317": {
          "progression_name": "Refleksja"
        },
        "ec94d489-2b99-408d-bcce-782db2cdba44": {
          "tips": [
            null
          ],
          "progression_name": "Instrukcje do ankiety końcowej"
        },
        "2e17eccc-2343-4bde-849c-eaf270f343f8": {
          "tips": [
            null
          ]
        },
        "f348d317-252e-4581-b489-fe1bbe700f67": {
          "tips": [
            null
          ]
        },
        "caeb42d3-998b-49fd-99ec-4c36e013206f": {
          "tips": [
            null
          ]
        },
        "1d9fcb2e-5d45-47f4-b834-65c714a78452": {
          "progression_name": "Przykładowe Programy"
        },
        "31ee2243-fd15-45ab-a0d7-80c2c97d88c7": {
          "tips": [
            null
          ]
        },
        "e82622fb-a1cf-45c8-a0f2-7929503c4bfe": {
          "tips": [
            null
          ]
        },
        "2725045e-4a46-449e-9a1e-ecf266e6755d": {
          "tips": [
            null
          ]
        },
        "3c78bafa-e216-4280-a965-d982d319d15a": {
          "tips": [
            null
          ]
        },
        "a929ea0c-ccdf-4e2c-9751-3012d428dcd6": {
          "tips": [
            null
          ]
        },
        "0a01de04-3b8f-4025-864a-8a2f48f9fd09": {
          "tips": [
            null
          ]
        },
        "b0b45a9e-53a8-4d5e-a248-7a7d042dd2b8": {
          "tips": [
            null
          ]
        },
        "935fb22e-ea0b-4c9b-92fc-61c39895fca9": {
          "tips": [
            null
          ]
        },
        "9663d7f7-168d-4f85-8f8a-cc2d6f86efa3": {
          "tips": [
            null
          ]
        },
        "c838ee44-b6fd-467e-8733-9b52d9727b08": {
          "tips": [
            null
          ]
        },
        "74393dee-626c-4743-b131-1566ed43d56c": {
          "progression_name": "Budowanie umiejętności"
        },
        "9612456b-5030-4f4c-a11b-893694130773": {
          "tips": [
            null
          ],
          "progression_name": "Ćwiczenia"
        },
        "ea1a9294-f250-4c26-8032-c497088f8206": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "897f445d-23b2-4083-8982-ec4ea7cecbec": {
          "tips": [
            null
          ],
          "progression_name": "Wyzwania"
        },
        "1f66ca37-97c5-48be-9f14-d7f4938b2632": {
          "tips": [
            null
          ]
        },
        "267a9bc0-eca4-43ff-9a91-64c0b389089c": {
          "description": "1.  [\\`ellipse()\\`(#4dd0e1)](/docs/gamelab/ellipse/)\n2.  [\\`rect()\\`(#4dd0e1)](/docs/gamelab/rect/)"
        },
        "97278350-36a0-4119-8163-a2cc0d7defa8": {
          "name": "Kształty różnych rozmiarów"
        },
        "11f4055c-bcd6-4b74-8f9a-5d69502955f2": {
          "tips": [
            null
          ]
        },
        "4835b1ef-9adb-4122-a243-7a8c5f994638": {
          "name": "Programowanie z parametrami"
        },
        "4c1fe47c-e862-4d73-9a70-66843600aa20": {
          "progression_name": "Budowanie umiejętności"
        },
        "b5f4b746-8e7a-4a6d-8f2c-39ec9d4dc3d7": {
          "progression_name": "Ćwiczenia"
        },
        "ef33e6f2-c5d9-4d5d-85fc-4434062b105f": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "a09c360f-651e-4539-94b3-620914e17cf2": {
          "tips": [
            null
          ],
          "progression_name": "Wyzwania"
        },
        "0e7890f7-6b15-4d74-9d06-39410d94914b": {
          "name": "Dziennik"
        },
        "5485407f-b2b9-433e-86a4-6da5afa523f5": {
          "tips": [
            null
          ]
        },
        "9e754b3d-83a4-4fb3-bdf5-331c02667465": {
          "tips": [
            null
          ]
        },
        "bf59eb2b-defb-469f-b80f-f6583ba14219": {
          "name": "Programowanie ze zmiennymi"
        },
        "6638d677-a241-4922-bc90-a10daceb1787": {
          "progression_name": "Przewidywanie"
        },
        "df26b7e2-cb48-40b2-b360-d0e9770b8802": {
          "tips": [
            null
          ]
        },
        "a14285ec-28bc-4b44-a63c-204c0034c19f": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "b55ffb73-9837-4f02-8ad8-6465f209cbd7": {
          "progression_name": "Ćwiczenia"
        },
        "58908247-dbee-4578-8155-09f7d934c017": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "04d00beb-b2b6-4f05-8529-f018aef183c0": {
          "progression_name": "Wyzwania"
        },
        "ad26b802-3d93-4e28-bf0c-2b04b8127c12": {
          "name": "Refleksja"
        },
        "e13128cb-3a56-488b-86db-0a2edd7aff6d": {
          "tips": [
            null
          ]
        },
        "61d2c0ea-b465-4fe7-8906-7b4d6a8820cd": {
          "tips": [
            null
          ]
        },
        "841704c1-3513-4bb1-bfd7-0a0783072b45": {
          "progression_name": "Eksploracja"
        },
        "cd7e0902-f7eb-47aa-b09c-b506a3860ff0": {
          "progression_name": "Budowanie umiejętności"
        },
        "da183609-402a-448c-9d31-e3cb729a0d56": {
          "progression_name": "Ćwiczenia"
        },
        "dfafff33-7c5b-4a4a-9d38-647e60b34160": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "3acf7a09-7059-4259-b07f-d404e0c3f7da": {
          "progression_name": "Wyzwania"
        },
        "e3a151f2-e5d3-4a66-9eed-6bc74f6adecb": {
          "tips": [
            null
          ]
        },
        "04061607-035b-48a3-ad8e-33fed692aa2b": {
          "tips": [
            null
          ]
        },
        "068fe268-da1d-49ed-8628-408960971d4a": {
          "progression_name": "Eksploracja"
        },
        "f52c22d8-72a7-44d1-91d2-66aacf92c1a8": {
          "tips": [
            null
          ]
        },
        "31324d8c-8187-4b66-b0fe-ff74bbb6077e": {
          "progression_name": "Budowanie umiejętności"
        },
        "8f56a7b9-e17b-4173-bae9-c996824270b4": {
          "tips": [
            null
          ]
        },
        "d78f2220-48f9-4316-aaeb-7b6131700133": {
          "name": "Budowanie umiejętności",
          "progression_name": "Budowanie umiejętności"
        },
        "b2d492ac-9752-4402-8d16-c80b49172609": {
          "name": "Ćwiczenia",
          "progression_name": "Ćwiczenia"
        },
        "234316a5-009b-44bd-a51d-fdcb54cc8903": {
          "name": "Ocena",
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "2057627a-c665-4a63-8aed-c1123ce9796a": {
          "name": "Wyzwania",
          "tips": [
            null
          ],
          "progression_name": "Wyzwania"
        },
        "7fe0e935-1853-4c68-a62c-332e86840c6d": {
          "name": "Dziennik"
        },
        "5989291d-e9d4-4f14-bdf6-399b69b96cec": {
          "tips": [
            null
          ]
        },
        "08b6ad2a-7ff0-429d-bc3b-e83030e2fcbc": {
          "progression_name": "Przewidywanie"
        },
        "d77cb04c-3156-47e2-88d1-bbb3c891d9b1": {
          "progression_name": "Budowanie umiejętności"
        },
        "b0d26289-6dd8-4acd-ac6b-c93dbe519272": {
          "progression_name": "Ćwiczenia"
        },
        "34fcaf28-d278-49ff-877f-a5f79f77af59": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "9925febf-964d-468b-8ad0-b76a389d4498": {
          "progression_name": "Wyzwania"
        },
        "f455bf72-f2c8-4bf2-970f-af533ef80342": {
          "tips": [
            null
          ]
        },
        "bc610d8b-c45e-48e4-a5de-63a7f8bf5a3b": {
          "name": "Dziennik"
        },
        "de715c3f-0860-4e19-acb1-ebcb230a19a8": {
          "progression_name": "Przewidywanie"
        },
        "57f321f4-4d9c-4cfe-9142-513345b6aaec": {
          "progression_name": "Budowanie umiejętności"
        },
        "abf0a52f-bd1d-457e-a3ce-77ec28543885": {
          "progression_name": "Ćwiczenia"
        },
        "2d0fc04c-aa1b-4148-9efd-06764f14c100": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "06559d3f-7ebd-4356-a06d-c16cdeaebde5": {
          "progression_name": "Wyzwania"
        },
        "d437ce8a-62d4-422b-9626-0f7ef6f4603f": {
          "name": "Dziennik "
        },
        "7e2e7a3e-fd91-4ab5-8b46-f8ae96c91169": {
          "tips": [
            null
          ]
        },
        "67d8c4d5-fda2-47c0-a7a3-164eb669718f": {
          "name": "Przejrzyj"
        },
        "0b250aa0-f3fa-4530-bef8-e328e4d93620": {
          "tips": [
            null
          ]
        },
        "853974f1-7e3b-4403-a475-5af28d960115": {
          "progression_name": "Dodaj duszki"
        },
        "c0fc532b-e6eb-4858-af5b-5032cd917616": {
          "progression_name": "Dodaj tekst"
        },
        "fe60d6bf-420e-474d-8b50-0ff252e6c6bf": {
          "tips": [
            null
          ]
        },
        "4638c8d2-4376-4673-979e-66a86d260573": {
          "name": "Dziennik"
        },
        "760b0216-8c5d-4954-ac35-fd42c527ac66": {
          "tips": [
            null
          ]
        },
        "c490c403-c5dc-4755-a03b-1532565b1119": {
          "tips": [
            null
          ]
        },
        "6cf8f316-c11f-4cc5-85a3-1596303e4317": {
          "tips": [
            null
          ]
        },
        "18bcf449-d684-4e93-abbd-5af4e82d1e7b": {
          "tips": [
            null
          ]
        },
        "09ba5105-6934-4a31-9684-3e62192e7542": {
          "progression_name": "Eksploracja"
        },
        "71831a0f-cae7-4f2f-be4d-8d29515588aa": {
          "progression_name": "Budowanie umiejętności"
        },
        "fcb22a6b-b548-4ea4-b2bf-23f3db9dde29": {
          "tips": [
            null
          ],
          "progression_name": "Przewidywanie"
        },
        "323374c7-2b08-4f0b-a97d-cab7f3f81de7": {
          "progression_name": "Budowanie umiejętności"
        },
        "d707e22e-3f7e-4e4e-aa2d-a31cb12357da": {
          "progression_name": "Ćwiczenia"
        },
        "d1f93971-c590-43fb-be4d-a3ced983e77a": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "c2703579-0081-4ecf-8aa2-500ed370fb99": {
          "tips": [
            null
          ],
          "progression_name": "Wyzwania"
        },
        "4e97aa36-b285-40f3-83cb-383e83158dc5": {
          "tips": [
            null
          ]
        },
        "b8ce874f-8e09-4a78-aa14-7b32de942c69": {
          "tips": [
            null
          ]
        },
        "93b30d12-a9fb-473d-88e3-55b1c6948991": {
          "progression_name": "Przewidywanie"
        },
        "a6ebae49-e1ca-4918-9d7f-4c0e33cdf00e": {
          "tips": [
            null
          ]
        },
        "1b41610c-933d-416a-b713-b4d975f298f9": {
          "progression_name": "Budowanie umiejętności"
        },
        "dd261f84-96e5-4abe-94dc-5af81c906ff0": {
          "progression_name": "Ćwiczenia"
        },
        "bccfd2b8-dd73-4be5-ab15-2dfa4024312b": {
          "progression_name": "Ocena"
        },
        "23d183b4-c898-41d3-b5c7-de7336534cd5": {
          "progression_name": "Wyzwania"
        },
        "a8fccbf5-3042-489e-97eb-19fb589b606d": {
          "name": "Dziennik"
        },
        "06cad4ef-4d60-42e4-829c-02fd3364c31e": {
          "tips": [
            null
          ]
        },
        "eb0d27fe-7158-49fe-9e96-bbc70d2fa158": {
          "name": "Przejrzyj"
        },
        "a5361b9b-6e15-4bba-9b35-ae31a1e1b525": {
          "tips": [
            null
          ]
        },
        "68f06aee-a50d-4b3e-9323-16f4812eb23a": {
          "progression_name": "Dodaj duszki"
        },
        "6e3a6230-12e7-4b7f-90a7-ec8574647b3b": {
          "progression_name": "Dodaj tekst"
        },
        "fa1f1ad4-aadd-49d1-9138-887450893813": {
          "tips": [
            null
          ]
        },
        "8ad6136f-ee41-4b14-8866-2d4d8b0d9779": {
          "name": "Dziennik"
        },
        "f54152bb-4d02-459d-beea-ceeb422be02a": {
          "tips": [
            null
          ]
        },
        "fbcd5bf0-4c6e-4142-934d-e4f4ebe17ad2": {
          "tips": [
            null
          ]
        },
        "8ed5e3eb-5ffa-473f-b166-3ea936d0c9e7": {
          "tips": [
            null
          ]
        },
        "02bcc907-1476-4a48-90ea-a56c5c91e6d4": {
          "name": "Zdania z warunkami"
        },
        "970064bc-3023-4f10-9359-91868ff9c77d": {
          "progression_name": "Przewidywanie"
        },
        "230cf2d8-bf75-4b73-aa29-4e468f203e78": {
          "tips": [
            null
          ]
        },
        "ba88e2d6-49b9-4e4b-a34f-3a7804ea1ce5": {
          "progression_name": "Budowanie umiejętności"
        },
        "030bb18c-bfaf-4c13-8ca7-9b251c26c162": {
          "tips": [
            null
          ]
        },
        "b3b4d1e4-17c7-4933-8ba6-03ac7a46839a": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "a9e1809e-78f0-42a5-b9b3-f680e95c5d15": {
          "progression_name": "Ćwiczenia"
        },
        "461492e7-43b9-4c58-9ee4-b63b716dbded": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "30bb6b07-5257-4a19-89a0-02be767443b5": {
          "progression_name": "Wyzwania"
        },
        "2b5e9944-1e90-4362-98e9-ef74a8d1d48b": {
          "tips": [
            null
          ]
        },
        "0ee8704d-9ad3-4a31-816f-555813322a78": {
          "name": "Pobieranie wejścia",
          "tips": [
            null
          ]
        },
        "55c35c06-acaf-41fa-b001-47448467e841": {
          "name": "Wejście z klawiatury"
        },
        "1cc6a39c-ad40-4484-941a-cfedaee5e669": {
          "progression_name": "Przewidywanie"
        },
        "7f5ec4ec-e8ef-46fb-98db-48db8f4510d2": {
          "progression_name": "Budowanie umiejętności"
        },
        "21c5c04b-1e3d-4de7-9694-083ed04efc2b": {
          "progression_name": "Ćwiczenia"
        },
        "9345c305-ff75-4d36-a595-b0b7a69c094f": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "d489f6eb-e7e8-45ba-ac13-a12a78c22a08": {
          "progression_name": "Wyzwania"
        },
        "e016d4b6-9ebd-4c6c-9697-b368a0c90bd8": {
          "tips": [
            null
          ]
        },
        "04c8e14b-6000-4ac2-9f56-6dd8b660b460": {
          "progression_name": "Przewidywanie"
        },
        "48c9aa57-b904-4660-b629-e49bf606fad7": {
          "tips": [
            null
          ]
        },
        "991be916-6a79-484c-95a2-0e6f753d9ac8": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "a24db1f0-f6cf-4e74-91e7-5b4ba3746db2": {
          "progression_name": "Ćwiczenia"
        },
        "fb40596d-a877-43f3-87b7-325a2fd79c37": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "8615ab59-fb2e-47e1-8f04-ab9d578fbc79": {
          "progression_name": "Wyzwania"
        },
        "957a684d-5930-4823-99fa-0af6c5701b6f": {
          "name": "Zakończenie"
        },
        "b9716428-aedc-4578-8328-379b70cb0d50": {
          "tips": [
            null
          ]
        },
        "e4ea6961-efa2-4cc3-806d-a32d96885abf": {
          "name": "Dziennik"
        },
        "09884749-ea7e-4df2-94f7-f73308052d81": {
          "tips": [
            null
          ]
        },
        "4b3c39d2-a62c-43c3-b5ae-048ef270624a": {
          "tips": [
            null
          ]
        },
        "1f6b91fb-f2a1-4585-bb33-4ede2232a20d": {
          "progression_name": "Praca Projektowa"
        },
        "187ab288-8997-4b05-90b2-993b1d29c6ba": {
          "name": "Wzajemne recenzje"
        },
        "4bfb9e2c-557b-464a-9a07-7190bc4dce87": {
          "tips": [
            null
          ]
        },
        "b2ad1d43-99f9-40fa-9f88-d8b42f8c723e": {
          "name": "Przemyśl"
        },
        "d8f8a198-8cc9-47f1-b6c9-f03f573fe546": {
          "progression_name": "Refleksja"
        },
        "360d3353-5639-4dfb-a66d-784a152e1794": {
          "name": "Refleksja"
        },
        "a2fda764-6cf6-419d-a9cb-7d62a2749660": {
          "tips": [
            null
          ]
        },
        "498b10a2-a029-449b-a37d-0b85141e917b": {
          "progression_name": "Budowanie umiejętności"
        },
        "42d0eae6-06b2-4aa6-a8f6-6081ce2fa560": {
          "tips": [
            null
          ]
        },
        "e8b8a1b0-89e9-4b09-978f-11db835db760": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "b61a7b78-619b-46fd-a7f4-e5e3f9e2a976": {
          "progression_name": "Ćwiczenia"
        },
        "a0ba31d0-91f2-4271-aacb-bf5c614aabc3": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "c7ff9236-7fd7-41ce-968f-0261551fd3b5": {
          "progression_name": "Wyzwania"
        },
        "864f7c7f-a19d-4470-8d53-52e790f5e783": {
          "name": "Dziennik",
          "tips": [
            null
          ]
        },
        "28c72532-e347-4f43-81ea-7b83a4e336d1": {
          "tips": [
            null
          ]
        },
        "57411d29-c010-41c3-82bc-be6b7025c796": {
          "tips": [
            null
          ]
        },
        "49cfe240-7090-4fbd-9e61-ef725f8bddb1": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "9f5f2c6e-0979-4ada-bfbb-8be2fb0e7642": {
          "progression_name": "Ćwiczenia"
        },
        "ef8e8137-1524-4b5d-9e2a-6c6d535cda60": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "db772045-97b4-4f93-8e9d-8b9d015190a2": {
          "progression_name": "Wyzwania"
        },
        "1e949591-d103-4f64-9c54-eeac71cc51d3": {
          "tips": [
            null
          ]
        },
        "560aac86-3e4c-411b-be1c-9cc37704fd3f": {
          "tips": [
            null
          ]
        },
        "c87f7c08-8f60-4810-9e6f-10ae69319288": {
          "tips": [
            null
          ],
          "progression_name": "Przewidywanie"
        },
        "e327d5f5-1886-4b6a-ba54-7eb091abc739": {
          "progression_name": "Budowanie umiejętności"
        },
        "1697fdd9-29f2-46d5-8091-5b5028ffc925": {
          "progression_name": "Ćwiczenia"
        },
        "96cef9d3-a478-4852-9dff-061a5fa5dc79": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "077d6880-3d7a-4c59-a63c-06ab77e3e0d8": {
          "progression_name": "Wyzwania"
        },
        "443eb6ca-6406-4399-b140-a4d6ec3f0bca": {
          "tips": [
            null
          ]
        },
        "136ec817-6a58-41db-aae8-3238b015ce63": {
          "tips": [
            null
          ]
        },
        "29881c8e-82cb-4886-8e1f-7f101c91bae9": {
          "tips": [
            null
          ]
        },
        "4c0ed738-4808-45b2-aaae-965d536ffc6a": {
          "tips": [
            null
          ]
        },
        "0d8cc1e7-4e01-4315-a98c-87fcc7031ca7": {
          "tips": [
            null
          ]
        },
        "c6e363e6-23a1-466a-9589-a4b871989618": {
          "progression_name": "Budowanie umiejętności"
        },
        "97db6b61-4e7a-4ce8-8b03-698a3b983f8c": {
          "progression_name": "Ćwiczenia"
        },
        "6b47f10d-a466-436e-ad48-25f2404ae07a": {
          "tips": [
            null
          ],
          "progression_name": "Ocena"
        },
        "e0a4583c-3ca6-4235-a457-774d3696a07d": {
          "progression_name": "Wyzwania"
        },
        "d2cc216a-b098-4754-bb18-087f42007b46": {
          "tips": [
            null
          ]
        },
        "a7af5fa7-b9bc-4779-bf77-e349bd07d0f2": {
          "progression_name": "Ruch duszka"
        },
        "40b22769-f206-4725-b2f4-fd3f71c15101": {
          "tips": [
            null
          ]
        },
        "52d53651-705c-47ec-a68f-d014f3499a99": {
          "tips": [
            null
          ],
          "progression_name": "Film: Funkcje"
        },
        "085e06bd-a991-42ec-b8e2-2e27712cf7dd": {
          "tips": [
            null
          ],
          "progression_name": "Budowanie umiejętności"
        },
        "e4283f2d-5933-4812-80df-341067426cc8": {
          "tips": [
            null
          ],
          "progression_name": "Ćwiczenia"
        },
        "fa4f0ee7-664c-4e90-b170-12f4cfb45ef5": {
          "tips": [
            null
          ],
          "progression_name": "Gra Kolekcjonerska"
        },
        "c3302e9a-4da1-4c1b-96ca-232b7026ea9c": {
          "progression_name": "Wyzwania"
        },
        "3dfe6414-c583-4af9-a55d-7da0d06783ef": {
          "tips": [
            null
          ]
        },
        "9fba4c16-6103-4cb5-88a4-1a250ec8abdb": {
          "tips": [
            null
          ]
        },
        "e068a067-ade8-4f5c-bfad-661fdff103ed": {
          "tips": [
            null
          ]
        },
        "f2e6c88e-bc52-4073-b67d-69a0dda590a7": {
          "progression_name": "Zaplanuj swój projekt"
        },
        "d0d85465-a081-4c09-ae83-8b454e76c2ff": {
          "tips": [
            null
          ],
          "progression_name": "Wyzwania"
        },
        "4304b5c8-73c0-44c3-bd18-3ec32f1e947d": {
          "tips": [
            null
          ]
        },
        "70b55a3a-e9cd-435d-a426-ab6e80a725cb": {
          "tips": [
            null
          ]
        },
        "79ced720-4977-4d65-9163-acd0147f2552": {
          "tips": [
            null
          ]
        },
        "96fe06b7-2d5b-434f-bb02-bc5e4bb74eaf": {
          "progression_name": "Buduj Platformę Jumper"
        },
        "b51fe24a-e404-4c6e-9fe1-8916f81f0e85": {
          "progression_name": "Skoczek - tło i zmienne"
        },
        "acfd2ab2-c569-4af6-b8c4-95bcf48e5f87": {
          "progression_name": "Skoczek - platformy"
        },
        "c8f33ef3-d45e-4cdc-9b94-b621dab81076": {
          "progression_name": "Skoczek - elementy"
        },
        "e41b90a3-20b1-45d9-9e3d-490c083587ea": {
          "progression_name": "Skoczek - gracz"
        },
        "b29f40dd-4e28-4c22-8aa8-9e387819622c": {
          "tips": [
            null
          ]
        },
        "3732107f-02cf-4117-941b-725824574e50": {
          "progression_name": "Wyzwania"
        },
        "193dc0bf-c474-4454-bb43-8a430a12634d": {
          "name": "Dziennik"
        },
        "7e64a6bf-73b9-4cd3-be58-402b3da57768": {
          "tips": [
            null
          ]
        },
        "686b638e-1a29-49cc-8711-191165d251b9": {
          "tips": [
            null
          ]
        },
        "c06da82f-6be2-49e8-8d8b-6579ef11f06d": {
          "progression_name": "Projekt - Tło i Zmienne"
        },
        "f582ab6b-ecf5-438c-9782-e7dbbc1dc1a9": {
          "progression_name": "Projekt - Duszki i Interakcje"
        },
        "59ca85ff-b7b0-450d-b354-1c9938c4a615": {
          "tips": [
            null
          ]
        },
        "d1ae9072-39e7-4cd7-81eb-6434e0b2e39d": {
          "name": "Udostępnij"
        },
        "a151ee83-294e-43ad-83ec-6047931fc83d": {
          "name": "Dziennik"
        },
        "2d58346e-e123-4477-8995-fefc448b3fe3": {
          "name": "Przemyśl",
          "progression_name": "Refleksja"
        },
        "b44faa8f-43ae-4899-b299-888d85f57d48": {
          "tips": [
            null
          ],
          "progression_name": "Instrukcje do ankiety końcowej"
        },
        "beb5adaf-44d3-48fe-bb2d-99a2f55caeff": {
          "tips": [
            null
          ]
        },
        "1dca60be-eb7f-40ef-8b91-8ca231c1b14a": {
          "tips": [
            null
          ]
        },
        "1c951438-4727-4ea5-84d9-560f7dac9204": {
          "tips": [
            null
          ]
        },
        "37d397d0-785f-4dc7-b172-2b51e5757ba3": {
          "tips": [
            null
          ]
        },
        "5166952d-961b-4ba8-b379-c4101d84b4de": {
          "tips": [
            null
          ]
        },
        "79ffacab-f428-4e4f-8f85-e9409b2e43a3": {
          "tips": [
            null
          ]
        },
        "6470c3f3-0547-4d23-bede-dbac0704a029": {
          "tips": [
            null
          ]
        },
        "e1fdc61e-61b5-4b5d-b46a-62a26f7cca05": {
          "tips": [
            null
          ]
        },
        "fc1bd727-4c35-4405-a14f-a713bcd7e532": {
          "name": "Przemyśl"
        },
        "82378234-dc3a-4578-a458-e237d6b9b729": {
          "tips": [
            null
          ]
        },
        "fabada45-479f-44d4-bc2d-dbeb8a8e7abd": {
          "tips": [
            null,
            null
          ]
        },
        "23f003b6-2c1b-4e88-a343-f77714a50d89": {
          "name": "Proces rozwiązywania problemów",
          "tips": [
            null
          ],
          "progression_name": "Nagranie: Proces Rozwiązywania Problemów"
        },
        "f3ad86f7-7c83-415c-aa5a-a276d6186faa": {
          "tips": [
            null
          ]
        },
        "e3e59454-f8cc-47ef-a206-23e55cf74c89": {
          "tips": [
            null
          ]
        },
        "971b5c08-a61d-400c-a1ff-8ac3139a3c7c": {
          "tips": [
            null
          ]
        },
        "03418848-4f2d-4f45-8f25-38012b191a2a": {
          "tips": [
            null
          ]
        },
        "10aec291-0c45-453c-8609-5386783ff20e": {
          "tips": [
            null
          ]
        },
        "11b483ae-c3f6-467d-85c3-9427203e2488": {
          "tips": [
            null
          ]
        },
        "d7edf595-a13a-4992-b963-58a034f34112": {
          "tips": [
            null
          ]
        },
        "7accdcb0-3787-4a97-9ac5-4044890f8c12": {
          "tips": [
            null
          ]
        },
        "555a0b86-988d-4c75-ad9a-e3fc127d44c3": {
          "tips": [
            null
          ]
        },
        "7e307eaa-f893-47b4-94ce-38801b41592a": {
          "tips": [
            null
          ]
        },
        "4436ad56-59ce-4b60-8e8e-bd0c9f80626a": {
          "description": "![](https://images.code.org/e5a08f29a9c4e306de5553dafca9fb5d-image-1467913845542.gif)"
        },
        "c21034e8-cca8-4197-9819-081e4114ef36": {
          "tips": [
            null
          ]
        },
        "06af5ad1-d9b6-4834-b94a-12f5c46232c7": {
          "tips": [
            null
          ]
        },
        "ec21fe96-de6c-4818-bf1a-c02c1f4b66ff": {
          "tips": [
            null
          ]
        },
        "ecb7626b-e9dc-4011-b1a2-54f138d54872": {
          "tips": [
            null
          ]
        },
        "5733d57d-7dc2-45ba-885b-e223a44ad2af": {
          "tips": [
            null
          ],
          "progression_name": "Wideo: Co czyni komputer komputerem?"
        },
        "900764b3-0256-4cc9-b88f-1b8c4992e653": {
          "tips": [
            null
          ]
        },
        "e623c176-d684-43c0-ad4b-9f33a3acc00f": {
          "name": "Dziennik",
          "tips": [
            null,
            null
          ]
        },
        "396fe142-472b-4c62-976b-578e5ff5bff0": {
          "tips": [
            null
          ]
        },
        "502a9053-c029-441d-aac1-5dcfc540fe9d": {
          "name": "Wejścia i wyjścia"
        },
        "a52b80a3-f6a7-4e24-8347-1eb0be4ccddf": {
          "tips": [
            null
          ]
        },
        "e606d7d3-d552-4db3-91b7-c26f98da237c": {
          "tips": [
            null
          ]
        },
        "f1388388-8631-479b-bca9-ffe97206edf8": {
          "tips": [
            null
          ]
        },
        "ce77f101-8880-4264-bf0e-b2d95e40c080": {
          "tips": [
            null
          ]
        },
        "584f3a53-ab7b-421d-a8a4-bc8c106ead2a": {
          "tips": [
            null
          ]
        },
        "4d905d80-5cc4-4017-88ab-904e5092fe0c": {
          "tips": [
            null
          ]
        },
        "fb64c101-5e75-4908-9b31-15d964b4ffa9": {
          "tips": [
            null
          ]
        },
        "21e51178-7062-468a-b8e1-a9227a0ac5eb": {
          "tips": [
            null
          ]
        },
        "95323c16-49dc-4c54-9bf5-c351b458beb7": {
          "tips": [
            null
          ]
        },
        "ed3fc57d-be54-4625-bae7-5cac4680d615": {
          "tips": [
            null
          ]
        },
        "071466cb-7d6b-4e91-93bb-261e508f89dc": {
          "tips": [
            null
          ]
        },
        "9c0439ca-8ac8-463f-889c-47df291b32d9": {
          "tips": [
            null
          ]
        },
        "59845bd6-dedc-4283-9cbd-f3c574fd99ab": {
          "tips": [
            null
          ]
        },
        "fa03e441-7483-4193-a5f7-20fa4bb081bf": {
          "tips": [
            null
          ]
        },
        "4cefb9ba-ffbc-40ba-bc37-dae06e608b67": {
          "tips": [
            null
          ]
        },
        "2d4d1c53-92af-4087-b1e7-964f95e3c3da": {
          "name": "Dziennik"
        },
        "40b16a1c-add1-445a-81de-c281c495fe6f": {
          "tips": [
            null
          ]
        },
        "a5bc259a-2779-4488-b754-f6485a212933": {
          "name": "Przewodnik projektu"
        },
        "254a27b6-75fb-4f5f-bdf1-2ac909f01f75": {
          "tips": [
            null
          ]
        },
        "e7394c68-613b-4772-90c8-dcf1228ba5dc": {
          "tips": [
            null
          ]
        },
        "6a60775b-f641-46a0-820d-f6895dd26fed": {
          "tips": [
            null
          ]
        },
        "709fc018-84ca-4c5c-af4e-bae11c2867b1": {
          "tips": [
            null
          ]
        },
        "06fa61d8-63d0-49d0-b9d1-77ec59c88d72": {
          "tips": [
            null
          ]
        },
        "03ad2f47-6f62-4854-b398-3075d952d71e": {
          "name": "Refleksja",
          "progression_name": "Refleksja"
        },
        "7d3700c3-08ad-41e8-bee3-19384d50e4c4": {
          "tips": [
            null
          ]
        },
        "68d48a87-2999-499a-962e-a0a177e1c4e6": {
          "tips": [
            null
          ]
        },
        "f51c4e46-0b95-4035-bbef-921e12d33e3c": {
          "tips": [
            null
          ]
        },
        "922ac8cd-6633-48ac-bcb7-85fb1d2e711a": {
          "tips": [
            null
          ]
        },
        "f3726d11-0690-46a9-b742-f48b4a80ab33": {
          "tips": [
            null
          ]
        },
        "6cd90ae5-5c64-45e8-a9c5-c1e01bdddd64": {
          "tips": [
            null
          ]
        },
        "caf7880a-40b3-4252-865e-a81d22f30d07": {
          "tips": [
            null
          ]
        },
        "17a60d00-0762-4796-8bb7-c953b2f53867": {
          "name": "Przemyśl"
        },
        "04f7b740-ae5f-4f12-9867-27f7b08eff1e": {
          "tips": [
            null
          ]
        },
        "c55fae38-7795-4027-b469-a3238f34efe5": {
          "tips": [
            null
          ]
        },
        "418d731c-d516-4e49-8547-9313763526ca": {
          "tips": [
            null
          ]
        },
        "c941f0ac-38f6-4828-9ca4-e8b600868807": {
          "tips": [
            null
          ]
        },
        "c209191d-c268-4f8e-b40c-93a5de206b76": {
          "tips": [
            null
          ]
        },
        "09e4642c-bedd-44e7-a7a7-ed2f85ece6c1": {
          "tips": [
            null
          ]
        },
        "740f2761-b6d0-4d82-97ec-2c97d92e2859": {
          "tips": [
            null
          ]
        },
        "193961e8-e637-4d45-bb0b-014a3e8d1bbb": {
          "tips": [
            null
          ]
        },
        "cebe2e73-7783-4bbf-9469-c2084423900d": {
          "name": "Przemyśl"
        },
        "01c916af-970c-4e2f-a98e-38cbc436eefc": {
          "tips": [
            null
          ]
        },
        "163d7212-c083-4ba8-bb87-6150a37f8f0f": {
          "tips": [
            null
          ]
        },
        "9823b27f-66ca-4ea1-860d-3472e5317340": {
          "tips": [
            null
          ]
        },
        "77c22840-b9e9-4426-9894-30f101f2c00e": {
          "tips": [
            null
          ]
        },
        "b452ecde-f660-4d52-9ab7-8b33989681f0": {
          "tips": [
            null
          ]
        },
        "f5570fab-fdee-464e-b569-ec19142fc35d": {
          "tips": [
            null
          ]
        },
        "661c94ca-9d68-45ee-afca-2ff357684bf3": {
          "tips": [
            null
          ]
        },
        "bc8e4c54-e3ca-42f2-b613-2b383783dad8": {
          "tips": [
            null
          ]
        },
        "ba9df800-646b-4324-9b35-b3f6564ba061": {
          "name": "Przemyśl"
        },
        "f25bdc7d-2ab6-493a-a4e7-e46dbeaa01c4": {
          "tips": [
            null
          ]
        },
        "48dcb032-0dad-4177-89a7-066d60d785f5": {
          "tips": [
            null
          ]
        },
        "7ce61da1-8486-4987-a971-d02802cf3223": {
          "tips": [
            null
          ]
        },
        "be784b81-94c2-46a8-9f54-6eb72fa47020": {
          "tips": [
            null
          ]
        },
        "90e3e011-8930-435c-8840-88bcb72a94b1": {
          "tips": [
            null
          ]
        },
        "e550c27b-967f-46f1-a1bf-96eb4e4ccc2e": {
          "tips": [
            null
          ]
        },
        "05109520-cc5d-4422-8447-09b5e315232c": {
          "tips": [
            null
          ]
        },
        "8e2e9def-edb6-462f-b068-2be956dcc3c0": {
          "tips": [
            null
          ]
        },
        "9844b63f-04a1-4011-87f7-eec3c63a5496": {
          "tips": [
            null
          ]
        },
        "59cd3f12-f9b1-4cbd-bf6b-3507adc264bc": {
          "tips": [
            null
          ]
        },
        "ed9353fe-9f41-42ef-9c2e-2e07231422ab": {
          "tips": [
            null
          ]
        },
        "9ceef85f-40f8-4692-bcb4-1a689968a685": {
          "tips": [
            null
          ]
        },
        "ab4371e8-c868-4587-9f32-2a0f857b910d": {
          "tips": [
            null
          ]
        }
      }
    }
  }
}