{
  "uz-UZ": {
    "data": {
      "activity_sections": {
        "5284ed91-ecd3-477a-8e48-cec21b3822f4": {
          "name": "Asosiy Lug‘at",
          "description": "-   **empatiya**: boshqa birov boshdan kechirayotgan his-tuyg'ularni tasavvur qilish\n-   \\*\\* sharhlash\\*\\*: bizning nuqtai nazarimiz asosida biror narsani tushunish\n\n**Darsdan oldin**: Dars oldidan ixtiyoriy mashg‘ulot sifatida talabalardan Common Sense Education tomonidan Digital Passport™ ilovasida [E-volve](https://www.digitalpassport.org/evolve.html) o‘yinini o‘ynashlarini taklif qiling. Bu ushbu darsning asosiy tushunchalarini kiritishga yordam beradi. Batafsil maʼlumot olish uchun [Raqamli pasport oʻqituvchilari uchun qoʻllanma](https://d1e2bohyu2u2w9.cloudfront.net/education/sites/default/files/tlr-asset/document-bundled-educator-guide-92018.pdf) bilan tanishing.\n\n**Loyiha** [4-slayd](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3da8846a99_1_0) va talabalardan so'rang: _Tasavvur qiling-a, siz ichkariga kirganingizda, men sizga_ [do'stona ohangda, katta tabassum bilan] _\"Salom!\" Qaysi emoji mos keladi?_\n\nTalabalarga javoblarini barmoqlarini (1, 2, 3 yoki 4) yuqoriga ko'tarish orqali ko'rsatishlarini so'rang. Agar kimdir 1 dan boshqa raqamni ushlab tursa, nima uchun ekanligini aytib berishlarini so'rang.\n\n**Buni yana ikki marta takrorlang**, har safar turlicha _Salom_ deb ayting: bir marta g'azablangan ohang bilan va bir marta asabiy yoki qo'rqib ketgan ohang bilan.\n\n**Loyiha** [5-slayd](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3da8846a99_2_13) va so‘rang: _Agar uni endigina o‘qiyotgan bo‘lsangiz-chi? Endi bu sizni qanday his qilmoqda?_\n\nAgar biror narsa faqat matnda bo'lsa, kimdir nimani anglatishini tushunish yanada qiyinroq bo'lishi mumkinligini ko'rsating. Ularning javoblari kim ekanligiga qarab farq qilishi mumkinligini tushuntiring, chunki biz hammamiz dunyoni biroz boshqacha talqin qilamiz. Talqin qilish _bizning nuqtai nazarimiz asosida biror narsani tushunishni anglatishini aniqlang._ ([6-slayd](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3d844aea9e_1_4))\n\n**Ayting**: _So‘zlarni har xil odamlar turlicha talqin qilishi mumkinligi sababli, biz ishlatadigan so‘zlar va ularning odamlarga qanday ta’sir qilishi haqida o‘ylash muhim. Biz shunchaki kulgili bo'lish uchun nimadir deyishimiz mumkin, lekin kimdir buni jiddiy qabul qilishi va bu ularning his-tuyg'ulariga zarar etkazishi mumkin. Bu shaxsan sodir bo'lishi mumkin va u onlayn ham sodir bo'lishi mumkin. Bu hatto onlaynda ham sodir bo'lishi mumkin, chunki so'zlar shunchaki matndir -- biz aslida boshqa odamlar bilan yuzma-yuz emasmiz._"
        },
        "fece081e-c02e-4b0e-a0ca-bf22c3649680": {
          "description": "**So'rang**: _\"Tayoq va toshlar suyaklarimni sindirishi mumkin, lekin so'z meni hech qachon og'ritmaydi\" degan gapni kim eshitgan?_\n\nTalabalarni javob berishga taklif qiling. Javoblar har xil bo'ladi. Talabalardan so'zni to'g'ri deb hisoblaydilarmi, deb so'rang.\n\n**Loyiha** [7-slayd](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3d844aea9e_1_117) va ayting: _Biz hozir “So‘z kuchi” deb nomlangan videoni tomosha qilamiz. Biz tomosha qilar ekanmiz, bu gap to'g'ri yoki noto'g'ri ekanligi haqida o'ylang._\n\n[So'zning kuchi](https://www.commonsense.org/education/videos/the-power-of-words) videosini ko'rsating va so'ng talabalarni gapning to'g'ri yoki noto'g'ri ekanligi haqida nima deyilganini aytib berishga chaqiring. Shuni ta'kidlash kerakki, ba'zida kimdir yomon ism bo'lsa, uning so'zlariga e'tibor bermaslik qiyin. Ismlar sizni g'amgin yoki xafa qilishi mumkin.\n\n**So'rang**: _Nima uchun o'sha boshqa o'yinchilar Gutsga shunday dedilar?_ ([8-slayd](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3e3f96c340_0_0))\n\nTalabalarni javob berishga taklif qiling. Javoblar har xil bo'ladi, lekin mumkin bo'lgan sabablar orasida ular hazil qilmoqchi bo'lganlar yoki _o'zlarini yomon his qilishgan va buni kimgadir olishmoqda_.\n\n**So'rang**: _Guts ma'noli so'zlarga javoban nima qiladi?_\n\nTalabalarni javob berishga taklif qiling va Guts o'zi ishongan, unga hamdard bo'lgan va unga yaxshi maslahat bera olgan kishi bilan gaplashganini tushuntirishga taklif qiling. Empatiyani boshqa birov boshdan kechirayotgan his-tuyg'ularni tasavvur qilish deb belgilang. ([9-slayd](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3d844aea9e_1_109))\n\n**Loyiha** [10-slayd](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3d844aea9e_1_157) va onlayn ma'noli so'zlarga javob berish uchun S-T-O-P qisqartmasini ko'rib chiqing."
        },
        "ae2a6573-1ff7-40ad-b71f-73ec9ab5e86f": {
          "description": "**Tarqatish** [So‘zlar o‘quvchiga zarar yetkazishi mumkin] [0] va yo‘riqnomani ovoz chiqarib o‘qing. Mashqni bajarish uchun juftliklarga besh daqiqa vaqt bering.\n\n**Juftlarni o'z javoblarini baham ko'rishga taklif qiling**. Mumkin boʻlgan javoblar uchun [Oʻqituvchi versiyasi](https://drive.google.com/open?id=1kAcaaYor5vegqj2cncK5FOgFOeg2PtKUXWw-muodELE) ga qarang."
        },
        "af7e0728-c503-4364-86db-6470460a4c2c": {
          "description": "**Sinfning uzunligi bo'ylab ipni qo'ying**. Xonaning yarmini \"OK\" deb belgilang. Ikkinchi yarmini \"Yaxshi emas\" deb belgilang. Talabalarning hammasini chiziqning OK tomonida turishlarini so'rang.\n\n**Loyiha** [11-slayd](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3d844aea9e_1_106) va yoʻnalishlarni ovoz chiqarib oʻqing.\n\n**O‘quvchilarga [12-15-slaydlar](https://docs.google.com/presentation/d/1kUVxRuQ_CUDpeSm3Sqg4yyueITjc3qQMUpSTi0WP4so/edit#slide=id.g3e3f96c340_0_14)dagi bayonotlarni o‘qib berishlari shart**. Har bir bayonotdan so'ng talabalarga harakat qilish yoki qolish uchun vaqt bering. Talabalarni fikrlarini tushuntirishga chaqiring. Iloji bo'lsa, bu bayonot nima uchun noto'g'ri yoki noto'g'ri ekanligi sabablarini muhokama qilish uchun har tomondan talabalarni tanlang.\n\nTalabalar bu noto'g'ri deb aytadigan misollar uchun, agar kimdandir bu xabarni olgan bo'lsa, nima qilishlari mumkinligini so'rang.\n\n**Ko‘rib chiqing**, bolalar suhbatlashish, video tomosha qilish, xabar yuborish, o‘yin o‘ynash va uy vazifasini bajarish uchun internetga kirishni yaxshi ko‘radilar. Ba'zan odamlar yomon yoki qo'rqinchli narsalarni aytishadi. Odamlarni yomon his qiladigan xabarlar chegarani kesib o'tadi.\n\n**Talabalarga** [Lesson Quiz](https://docs.google.com/forms/d/1OKy2U3F37NSgCBUez9XMi0UJtlHKPXIe_rxy0l_KEOg/copy) ni bajarishga ruxsat bering.",
          "progression_name": "So'zlarning Qudrati - Unplugged Faoliyat"
        },
        "d7669ec4-fda9-43e4-aec4-0292676f992a": {
          "description": "Talabalarga o'z bilimlarini oshirish uchun taqdim etishingiz mumkin bo'lgan qo'shimcha manbalar:\n\n-   [Oilaviy faoliyat](https://drive.google.com/open?id=1jgFQhQawNgbG8VFWDgcu8jfYGeIvKz77VV54Revd0Gw)\n-   [Oilaviy maslahatlar](https://www.commonsense.org/education/family-tips/k-12-cyberbullying-digital-drama-and-hate-speech)\n-   **Tayyorlang** qog'oz varaqlari, masalan, yumshoq nojo'ya so'zlarni aytadi:\n\n    -   Superqahramonlar namoyishini yoqtirishingizga ishonmayman. Faqat birinchi sinf o'quvchilari buni qilishadi.\n    -   Siz g'alatisiz.\n    -   Nega o'sha ko'ylakni kiyasan?\n\n     <br>\n\n     Har bir talabaga bittadan qog'oz tarqating va ularni juftlashtiring. Talabalar varaqlarni almashishlarini va ularni jimgina o'qishlarini so'rang. Keyin ularni qaytarib almashishlarini so'rang va navbatma-navbat izohni boshqa odamga ovoz chiqarib ayting. Ulardan unchalik yoqimli bo'lmagan narsa yozish va birovning yuziga aytgan gaplari uchun javob berish o'rtasidagi farq nima ekanligini so'rang. Odamlar ba'zan o'zlarining onlayn faoliyatining anonimligi orqasida yashirinishlarini ta'kidlang. Talabalarga, agar ular boshqa birovning yuziga biror narsa demasalar, onlayn faoliyatlarida buni aytish to'g'ri emasligini eslating."
        },
        "4ec90698-6e58-4695-8fec-298eea182910": {
          "name": "Kirish",
          "description": "Ushbu kursda biz kodlashni o'rganamiz. Kod ilovalar, o'yinlar, veb-sahifalar, simulyatsiyalar va biz kompyuterda foydalanadigan barcha turdagi narsalarni yaratish uchun ishlatiladi."
        },
        "e49cc3d9-d33e-4a2c-a549-9ba972b2bffa": {
          "description": "**Display:** “Reflect” slaydni ko‘rsatish\n**Mulohaza yuriting**:\n\n-   \\_ Sizning sevimli o'yiningiz yoki ilovangiz qaysi?\\_\\_\n-   Foydalanishda qanday tanlov qilish kerak?\\_",
          "tips": [
            "Bu kabi aks ettirish takliflari turli uslublarda bajarilishi mumkin. Jurnal yoki munozara (guruhlar yoki hamkorlar bilan) ajoyib tanlovdir!"
          ]
        },
        "a3afffcf-62c7-438f-be0d-dd323af31c71": {
          "description": "**Display:** “Lug‘at” slaydni ko‘rsatish\n\n-   **Sprite** - joylashuvi, o'lchami va ko'rinishi bilan ekrandagi grafik.\n-   **Foydalanuvchi** - Ob'ektdan, jumladan, dasturiy ta'minot va apparat vositalaridan foydalanadigan kishi."
        },
        "c20aa378-fd8e-4295-afaf-fdaf97e7c528": {
          "description": "**Display:** Keyingi slaydni ko‘rsatish\n\n**Buni bajaring:** Dars slaydlari yoki doskadan foydalanib, o‘quvchilarga chap tomonda “Sevimli ilovalar va o‘yinlar” va o‘ngda “Bizga ular nima uchun yoqadi” deb yozilgan T-diagrammani ko‘rsating. Bitta misol bilan modellashtirgandan so'ng, talabalar ro'yxatga o'zlarining qo'shimchalarini taklif qiling. Talabalar ma'lum bir ilovani nima uchun yoqtirishlarini tushuntirar ekan, o'z g'oyalarini takrorlang va _tanlovlar_ va foydalanuvchi uni qanday o'ynashi yoki ishlatishini \\_tanlash vaqtiga e'tibor qarating. Talabalar odamlar tanlov qilish imkoniyatini afzal ko'radigan aloqani ko'rganlarida davom eting."
        },
        "08317767-3cec-4407-9692-449dcd0b9cec": {
          "description": "Ilovalar va o'yinlar yaratilganda, ular foydalanuvchini hisobga olgan holda ishlab chiqilgan. Foydalanuvchi siz yoki ilovadan foydalanayotgan va o‘ynagan odamsiz. Ijodkorlar o'z ilovalaridan qanday foydalanish kerakligi haqida g'oyalarga ega, ammo tanlov qilish foydalanuvchiga bog'liq!\nBugun biz ilova va oʻyin ishlab chiqaruvchilar bizga qanday qilib (va nima uchun) tanlov qilishga imkon berishini koʻrib chiqamiz."
        },
        "a64d1695-0afd-4534-a16c-a790006e0193": {
          "description": "**Displey:** “Foydalanuvchi tanlovlari” slaydni ko‘rsatish\n\n**Muhokama:** Har bir ilova uchun talabalardan ilova ishlab chiquvchilari foydalanuvchiga qanday tanlov berishini so‘rang. Nega ular bu tanlovni o'z ichiga oladi?\n\n**Maqsad:** Muhokamalarda talabalar foydalanuvchi qilishlari kerak bo'lgan aniq tanlovlarni, shuningdek, ilovalar nima haqida ekanligini o'z ichiga olishi kerak. Masalan, Talk Box foydalanuvchilarga avatar yoki raqamli tasvirni tanlash imkonini beradi. Bu tanlov yaxshi narsa, chunki u foydalanuvchiga ilova haqiqatan ham ular uchun ekanligini his qilishiga yordam beradi.",
          "tips": [
            "Ushbu darsda muhokama qilish uchun foydalanish uchun ba'zi soxta ilovalarga ega slaydlar mavjud. Siz o'quvchilaringizning qiziqishlaridan kelib chiqib, ushbu misollarni boshqalar bilan to'ldirishingiz yoki almashtirishingiz mumkin."
          ]
        },
        "7d9676bf-c752-4032-a629-1aa3b48c7298": {
          "description": "Biz ushbu ilovalarning barchasida foydalanuvchi undan qanday foydalanishi haqida tanlov qilishini ko'rishimiz mumkin. Ushbu tanlovlar ko'proq odamlarni ilovadan foydalanishga undashi mumkin."
        },
        "a4614b34-d679-47a0-b4b3-36a360f0336d": {
          "name": "Sprite laboratoriyasi bilan tanishish",
          "description": "**Displey:** “Sprite Lab bilan tanishish” videosini ko‘rsating",
          "progression_name": "Video: Sprite laboratoriyasi bilan tanishish"
        },
        "a51c715f-33a7-4a01-982d-69dfff59847d": {
          "description": "Tez orada biz kod yozishni va o'zimizning Sprite Lab loyihalarimizni yaratishni o'rganamiz. Biz mumkin bo'lgan narsalarni o'rganishdan boshlaymiz. Bugun siz foydalanuvchisiz! Sizning vazifangiz Code.org veb-saytida topiladigan namunaviy dasturlar bilan o'ynashdir. Siz sinab ko'rgan har biringiz uchun siz ko'rgan sprayt kostyumlarini va foydalanuvchi sifatida qilish kerak bo'lgan har qanday tanlovingizni tasvirlab berasiz."
        },
        "6e47923a-1f07-4c2d-a55a-c45a35a823e9": {
          "name": "Exploring Apps",
          "description": "**Displey**: “Sprite Lab Exploration” slaydni ko‘rsatish\n\nBugun talabalar Sprite Lab yordamida yaratilgan ba'zi namunaviy dasturlarni ko'rib chiqadilar. Ular interaktiv ilovalar, o‘yinlar va simulyatsiyalarni sinab ko‘rishadi.\n\n                                                                                                **Displey**: “Namunaviy dasturlar” slaydni ko‘rsatish"
        },
        "2e96e617-a103-481f-a836-7e50b4c3de75": {
          "description": "_Kod.org saytida kamida 3 ta Sprite Lab dasturini oʻrganing. Har bir dastur uchun siz ko'rgan spritlarni sanab o'tasiz va foydalanuvchi sifatida qilgan tanlovlaringizni tasvirlab berasiz._"
        },
        "a596d7dd-5533-4dea-b9f7-7dca09bafb6e": {
          "description": "**Display**: “O‘rganish” slaydni ko‘rsatish\n\n**Buni bajaring:**\n\n-   Har bir shaxsga (yoki guruhga) **\\*Exploring Apps** ish varag‘ining jismoniy yoki raqamli nusxasini taqdim eting.\n\n-   Talabalarni Code Studio dasturining 2-bosqichiga yo'naltiring (Exploration: Sample Apps).\n\n-   Talabalar vazifani mustaqil bajarishdan oldin sinf bilan bitta ilovani modellashtirishni ko'rib chiqing.",
          "tips": [
            "Agar bu sizning talabalaringiz Code.org'dan birinchi marta foydalanayotgan bo'lsa, talabalarga veb-saytga qanday o'tish va o'z hisoblariga kirishni tushunishlariga yordam berish uchun qo'shimcha vaqt ajrating."
          ],
          "progression_name": "Tadqiqot: namunaviy ilovalar"
        },
        "1a098222-2063-4b01-8d00-34170d233880": {
          "name": "Ulashing",
          "description": "**Display**: “Share Out” slaydni ko‘rsatish\n\n**Muhokama qiling:** Ushbu ilovalar yordamida eng qiziqarli tanlovlar qanday edi? Ilovada biror narsani o'zgartirishni orzu qilgan, lekin tanlash huquqi berilmagan vaqtingiz bo'lganmi?\n\n**Maqsad:** Talabalar o‘zlari qilgan aniq tanlovlarni nomlashlari kerak, lekin ular nima uchun yaratuvchi bizga bunday tanlov berganini ham muhokama qilishlari kerak. Ajratish uchun siz kiritgan so'zlar (masalan, Chat Bot), ishlatiladigan spritlar turi (masalan, Kollektor o'yini) yoki biror narsa bilan o'zaro munosabatingiz kiradi."
        },
        "c345c420-5657-4fc7-bce8-b3bba7ebee53": {
          "name": "Yaxshilashni taklif qiling",
          "description": "**Display**: “Yaxshilashni taklif qilish” slaydni ko‘rsatish\n\n**Ilova:** Foydalanilgan ilova haqida o‘ylab ko‘ring va foydalanuvchiga ko‘proq tanlash imkoniyatini berish orqali uni yaxshilash yo‘lini o‘ylab ko‘ring.\n\nVaqt imkon bersa, talabalardan quyidagi usullardan biri yoki bir nechtasi orqali yuqoridagi taklifni ko'rib chiqishlarini so'rang:\n\n-   Ko'ngillilar butun guruh muhokamasida g'oyalarni taklif qilishlari kerak.\n-   Juftlik yoki kichik guruhlar bilan kichik munozarada qatnashing.\n-   Talabalarga o'z g'oyalari bilan eskiz yoki plakat yaratish."
        },
        "aa0405ab-2bef-40c6-a15b-90ce49e66f4c": {
          "description": "**Displey**: “Sprite” yakuniy slaydni ko‘rsatish"
        },
        "63d09936-fa79-407b-bde3-02b68680a4b1": {
          "description": "Bugun biz ilova yaratuvchilari bizga foydalanuvchi sifatida tanlov qilish usullari haqida bilib oldik. Biz Spritlar haqida ham bilib oldik. Spritlar - bu o'lcham, aylanish va joylashuv kabi turli xil xususiyatlarga ega ekrandagi grafikalar."
        },
        "74d5ded9-cee0-440d-833d-0ed2680deab3": {
          "description": "**Displey**: “Sprite kostyumlari” sarlavhali slaydni ko‘rsatish"
        },
        "baabe2fd-906a-48fc-84e1-4e5419c84ad8": {
          "description": "Spritlarda, shuningdek, ularning qanday paydo bo'lishini belgilaydigan kostyum bor."
        },
        "b747bce4-9f61-4265-a886-568636e698e4": {
          "name": "Reflection",
          "description": "**Displey**: “Reflect” slaydni ko‘rsatish\n\n**Mulohaza yuriting**:\n\n-   _Siz foydalanadigan oʻyinlar yoki ilovalarda qanday tanlov qilishni xohlaysiz?_\n-   _Qanday ilova yoki oʻyin yaratmoqchisiz?_"
        },
        "920b8921-f3cf-4726-bbac-b414917f7bd0": {
          "name": "Kirish"
        },
        "f1d2b78c-40c3-4225-80db-f2aa35971fd9": {
          "description": "**Displey:** “Ko‘rsatmalar” slaydni ko‘rsatish\n\nKeyinchalik, ushbu loyiha uchun ishlatiladigan haqiqiy kodni ko'rsating va talabalarni uni o'qishga taklif qiling.\n\n**Display:** “Reflect” slaydni ko‘rsatish\n\n**Mulohaza yuriting:** _Bizning ko‘rsatmalarimiz va ushbu kod nimasi bilan bir xil yoki farq qiladi?_                                                                   "
        },
        "470e9d49-1566-4ec5-9d35-114c8ae013f9": {
          "description": "#### Lug'at\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> \\*\\*Displey: \\*\\* Show “Vocabulary” slayd\n\n-   **Algoritm** - Vazifani bajarish uchun qadamlar ro'yxati.\n-   **Xulq-atvor** - Sprite laboratoriyasida sprite to'xtashi aytilguncha doimiy ravishda bajaradigan harakat.\n-   **Dastur** - Mashina tomonidan boshqarilishi mumkin bo'lgan narsaga kodlangan algoritm.\n-   **Sprite** - Joylashuvi, o'lchami va tashqi ko'rinishi bilan ekrandagi grafik."
        },
        "a4ff84ba-5105-458a-a950-ca4fdbc3d23b": {
          "name": "Sprayt yasash",
          "description": "#### Bashorat (3 daqiqa)\n\n                            **Displey:** “1-daraja – bashorat qilish” slaydni ko‘rsatish\n\n**Buni bajaring:** Talabalarga taqdim etilgan kodni o‘qib chiqing va nima bo‘lishini bashorat qiling. “Ishga tushirish” tugmasini bosgandan so‘ng, o‘quvchilarga o‘zlari qiziq bo‘lgan yoki ularni hayratda qoldirgan narsa haqida mulohaza yuritishlari uchun vaqt bering.",
          "tips": [
            null
          ],
          "progression_name": "Oldindan ko'rish"
        },
        "f72fb33c-b201-40bd-a15f-439a7c4c5521": {
          "description": "**Display:** “Qanday qilib Sprite qilish kerak” videosini ko‘rsating"
        },
        "3f88f7fc-f308-44e8-ad91-df97a9080361": {
          "name": "Ko'nikmalarni shakllantirish va amaliyot",
          "description": "**Displey:** “3-7-darajali – malaka oshirish” slaydni ko‘rsating\n\n**O'tish:** Talabalarga kompyuterlariga o'tishlarini va tizimga kirishlarini so'rang.\n\nUshbu mashg'ulotlar mustaqil o'rganish yoki juftlik bilan dasturlash uchun javob beradi.\n\nTalabalar malaka oshirish darajalarini to'ldirishlari va keyin qolgan vaqtlarini turli Amaliy mashg'ulotlardan tanlashga sarflashlari kerak.",
          "tips": [
            null
          ],
          "progression_name": "Malaka orttirish"
        },
        "0c617599-fd8c-43d4-9158-b44d201cb3aa": {
          "description": "**Displey**: “8-daraja – Amaliyot (tanlov)” slaydni ko‘rsatish.\n\nUshbu jumboqlar qo'shimcha mashq qilish uchun mavjud. Talabalar o'zlari tanlagan bir yoki bir nechta boshqotirmalarni bajarishlari kerak.",
          "progression_name": "Amaliyot"
        },
        "98dedd12-1d66-41ed-9629-e30265862d45": {
          "description": "#### Bepul o'yin (10 daqiqa)\n\n                                  **Displey**: “9-daraja – Bepul o‘ynash” slaydni ko‘rsatish\n\n**O'tish:** Talabalar endi o'zlarining loyihalarini yaratishlari mumkin bo'lgan darsning yakuniy bosqichiga o'tishlari kerak. Bu yerdagi har bir tanlov o‘quvchilarga turli xil sprayt kostyumlar to‘plamini taqdim etadi. Talabalar boshlash uchun birini tanlashlari kerak.",
          "tips": [
            null
          ]
        },
        "c0f0a327-9419-4966-a5cd-cfe23d312f09": {
          "name": "Lug‘at",
          "description": "**Display:** “Lug‘at” slaydni ko‘rsatish"
        },
        "fd1a19e9-0bde-448a-8dd0-8e3b9db03712": {
          "name": "O‘ylamoq",
          "description": "**Display:** “Reflect” slaydni ko‘rsatish\n\nTalabalarga o'zlari o'rganganlari, nima uchun foydaliligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Mulohaza yuriting:** _Sprite Lab-da o'z dasturlarini yaratishga qiziqqan do'stingizga qanday maslahat berasiz?_"
        },
        "d954cdfd-7126-43ca-a817-12ef8812a38a": {
          "description": "**Displey**: “Algoritmga amal qilish” slaydni ko‘rsatish"
        },
        "cf819fb5-aff2-47a4-9c0f-8ab6af6f218f": {
          "tips": [
            null
          ]
        },
        "63d6026f-81bb-4c3b-9564-ff4ba627b7c2": {
          "description": "**Displey**: “1-tur - Asosiy” slaydni ko‘rsatish\n\n#### 1-tur (asosiy):\n\n-   Joyda yurishni boshlang.\n-   O'z joyida yurishni to'xtating.\n-   Qarsak chalishni boshlang.\n-   Qarsak chalishni bas qiling.\n-   Joyda yurishni boshlang.\n-   Qarsak chalishni boshlang.\n-   Hammasini to'xtat.\n\n**Displey**: “Debrief” slaydni ko‘rsatish\n\n**Buyuk ma'lumot:**\n\n-   _Sizga qarsak chalish aytilganda nima bo'ldi, lekin siz allaqachon o'rningizda yurgan edingiz?_\n-   _Birdaniga ikki xil xatti-harakatni boshlash aytilsa nima bo'ladi?_\n\nTalabalar bir vaqtning o'zida bir nechta xatti-harakatlar sodir bo'lishi mumkinligini tushunishlari kerak.\n\n**Displey**: “2-bosqich - O‘rta” slaydni ko‘rsatish\n\n#### 2-tur (O'rta):\n\n-   Qo'llaringizni havoda silkitishni boshlang.\n-   Boshingizni chayqashni boshlang.\n-   Qo'llaringizni havoda silkitishni to'xtating.\n-   Boshingizni chayqashni bas qiling.\n-   Tizlaringizni silkitishni boshlang.\n-   Qush kabi qo'llaringizni silkitishni boshlang.\n-   Tizlaringizni silkitishni to'xtating.\n-   Boshingizni chayqashni boshlang.\n-   Joyda yurishni boshlang.\n-   Qo'llaringizni qushdek chayqashni bas qiling.\n-   Hammasini to'xtat.\n\n**Displey**: “Debrief” slaydni ko‘rsatish\n\n**Buyuk ma'lumot:**\n\n-   _Qanday ko'rsatmalar odamlarni xato qilishga majbur qildi?_\n-   _Ko'rsatmalarga to'g'ri amal qilishingizga ishonch hosil qilish uchun qanday strategiyalar foydali deb o'ylaysiz?_\n-   _Nima uchun har bir xatti-harakatni alohida kuzatib borish muhim?_\n\nTalabalar har bir xatti-harakatni alohida to'xtatish kerakligini tushunishlari kerak. Ular har birini alohida kuzatib borishlari kerak.\n\n**Displey**: “3-tur – qiyin” slaydni ko‘rsatish\n\n#### 3-tur (qiyin):\n\n-   Cho'kishni boshlang.\n-   Boshingizni urishni boshlang.\n-   Cho'kishni bas qiling.\n-   Boshingizni urishni bas qiling.\n-   Yuqoriga va pastga sakrashni boshlang.\n-   Boshingizni urishni boshlang.\n-   Hammasini to'xtat.\n-   Qarsak chalishni boshlang.\n-   Qush kabi qo'llaringizni silkitishni boshlang.\n-   Hammasini to'xtat.\n-   Cho'kishni boshlang.\n-   Yuqoriga va pastga sakrashni boshlang.\n-   Hammasini to'xtat.\n-   Tizlaringizni urishni boshlang.\n-   Boshingizni urishni boshlang.\n-   Hammasini to'xtat.\n-   Chapga aylanishni boshlang.\n-   O'ngga aylanishni boshlang.\n-   Chapga aylanishni to'xtating.\n-   O'ngga aylanishni to'xtating.\n\n**Displey**: “Reflect” slaydni ko‘rsatish\n\n**Ko'zda tuting:**\n  _Agar ikkita xatti-harakat bir-biriga zid bo'lib tuyulsa nima bo'ladi?_\n\n**Muhokama maqsadi:** Talabalar ba'zi xatti-harakatlar bir-biriga zid bo'lib, kutilmagan natijalarga olib kelishi mumkinligini tushunishlari kerak. Ikki qarama-qarshi xatti-harakat bir-birini samarali ravishda bekor qilishi mumkin.\n\n**Qo'shimcha maslahatlar:**\n\n-   _Bir vaqtning o'zida qo'llaringizni urish va qo'llaringizni urish deyishganda nima qilish kerak?_\n\n-   _Qanday qilib cho'kkalab tepaga va pastga sakrash mumkin?_\n\n-   _Bir vaqtning o'zida tizzalaringizni va boshingizni urish kerak bo'lsa nima bo'ladi?_\n\n-   _Sizga qarama-qarshi tomonga aylanishni aytishganda, odamlarning nima qilayotganini ko'rdingiz?_\n\n-   _Agar sizga bir vaqtning o'zida chapga va o'ngga aylanishni aytishsa nima bo'lardi?_"
        },
        "7eecd59e-72e7-4806-b1aa-87f5565daf4b": {
          "description": "#### Lug'at\n\n**Display**: “Lug‘at” slaydni ko‘rsatish\n\n-   **Algoritm** - vazifani bajarish uchun qadamlar ro'yxati.\n-   **Hodisa** - Nimadir sodir bo'lishiga sabab bo'ladigan harakat."
        },
        "3aa37d43-0bc2-433c-9fdd-59a704d6d5f8": {
          "name": "Spraytlar amalda",
          "description": "#### Bashorat (2 daqiqa)\n\n**Displey:** “1-daraja – bashorat qilish” slaydni ko‘rsatish\n\n**Buni bajaring:** Bu daraja sinf sifatida bajarilishi kerak. Talabalarga taqdim etilgan kodni o'qib chiqing va nima bo'lishini bashorat qiling. “Ishga tushirish” tugmasini bosgandan so‘ng, o‘quvchilarga o‘zlari qiziq bo‘lgan yoki ularni hayratda qoldirgan narsa haqida mulohaza yuritishlari uchun vaqt bering.",
          "progression_name": "Oldindan ko'rish"
        },
        "fa8242f4-3cba-4a2c-bd5b-069a58450349": {
          "description": "#### Video: Spritlar harakatda (3 daqiqa)\n\n**Display**: “Sprites in Action” videosini ko‘rsatish"
        },
        "ddbb537c-edf8-479c-b44d-8188941c0655": {
          "description": "#### Ko'nikmalarni shakllantirish va amaliyot (20 daqiqa)\n\n**Displey**: “3-7-darajali – malaka oshirish” slaydni ko‘rsatish\n\n**O‘tish:** Talabalarga kompyuterlariga o‘tishlari va tizimga kirishlari kerak. Bu mashg‘ulotlar mustaqil o‘rganish yoki juft dasturlash uchun mos keladi.\n\nTalabalar malaka oshirish darajalarini to'ldirishlari va keyin qolgan vaqtlarini turli Amaliy mashg'ulotlardan tanlashga sarflashlari kerak.",
          "progression_name": "Malaka orttirish"
        },
        "a25d6587-66bc-42ea-9a27-47b5f3586878": {
          "description": "**Displey**: “8-daraja – Amaliyot” slaydni ko‘rsatish",
          "progression_name": "Amaliyot"
        },
        "d5632c3a-b496-41b6-a90f-1c738211a438": {
          "description": "#### Bepul o'yin (10 daqiqa)\n\n**Displey**: “9-daraja – Bepul o‘ynash” slaydni ko‘rsatish\n\n**O‘tish:** Talabalar endi oldingi darslardagi kabi bepul o‘yin variantlarini ko‘radigan darsning oxirgi bosqichiga o‘tishlari kerak. Talabalarni o'z loyihalariga oxirgi marta voqealar qo'shishga yoki yangi loyihani boshlashga undash.",
          "tips": [
            null
          ]
        },
        "04a61c5c-7ed1-4db4-8ba7-9f46de81dd30": {
          "description": "**Displey:** “Hodisalar qanday ishlaydi?” ko‘rsatish slayd"
        },
        "8af29cc7-6e43-400d-8410-17b8758b9183": {
          "description": "Voqealar qanday ishlaydi?\n\n1.  Foydalanuvchi klaviaturadagi tugmachani bosadi.\n2.  Klaviatura kompyuterga signal yuboradi.\n3.  Kompyuter kod asosida qaror qabul qiladi.\n4.  Kompyuter displeyni yangilaydi."
        },
        "ec95fadb-9235-4f39-b4f7-f9b02e2fecdb": {
          "name": "O‘ylamoq",
          "description": "**Display:** “Reflect” slaydni ko‘rsatish\n\n**Ko'zda tuting:**\n_Oʻq tugmalari dasturni yanada interaktiv qilishning bir usuli hisoblanadi._\n\n-   _Ilova yoki o'yinda nima sodir bo'lishini foydalanuvchiga yana qanday usullar bilan boshqarishimiz mumkin?_\n\nTalabalarga o'zlari o'rganganlari, nima uchun foydaliligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi."
        },
        "c129fbec-8adf-45f8-9920-ccac97d6022f": {
          "name": "Kirish",
          "description": "**Display:** “Reflect” slaydni ko‘rsatish\n\n**Ko'rib chiqish:**\n\n-   _Hodisa nima ekanligini eslaysizmi?_\n\n-   _Xulq-atvor nima ekanligini eslaysizmi?_\n\n-   _Qo'llagan xatti-harakatlaringizdan ba'zilarini eslay olasizmi? Ular nima qilishadi?_\n    -   _\"patrullik\"_\n    -   _\"jitirlash\"_\n    -   _\"o'ngga/chapga aylanish\"_\n\n**Display:** “Lug‘at” slaydni ko‘rsatish\n\n-   **Xulq-atvor** - Sprite laboratoriyasida sprayt to'xtatish aytilgunga qadar doimiy ravishda bajaradigan harakat.\n-   **Hodisa** - Nimadir sodir bo'lishiga sabab bo'ladigan harakat.\n\n**Buni bajaring**: dasturlashda _hodisalar_ va _xatti-harakatlar_ ni qayta ko'rib chiqing. Bundan tashqari, talabalarga o'zlarining kostyumlarini chizish imkonini beruvchi Sprite Lab \"Kostyumlar\" vositasini taqdim eting.\n\n**Displey:** “1-daraja – tadqiqot” slaydni ko‘rsating\n\n**Display:** O‘quvchilaringizga bugungi darsning 1-darajasini ko‘rsatishdan boshlang.\n\n**O'ylab ko'ring/juftlashing:** Talabalardan kod ishga tushganda nima bo'lishini bashorat qilishni va qo'shnilari bilan muhokama qilishni so'rang. Kodni ishga tushiring va natijani muhokama qiling.\n\n**Displey:** “2-darajali – malaka oshirish” slaydni ko‘rsating\n\n**Display:** 2-darajani ko‘rsatish. Quyidagilarni qanday bajarish kerakligini qisqacha ko‘rsating:\n\n-   _Kod_ va _Kostyumlar_ yorliqlari orasida harakatlaning.\n-   Kostyum chizing.\n-   Kostyumlar kutubxonasidan kostyumni tanlang.\n-   Virtual uy hayvonlarining sprite kostyumini maxsus kiyimga o'zgartiring."
        },
        "89eea455-9916-4a03-b782-7c22b535cb4a": {
          "name": "Virtual Pet with Sprite Lab"
        },
        "f64df1a5-3d41-4029-9a8c-1439d98d7386": {
          "tips": [
            null
          ]
        },
        "29dc277a-e2ce-49f2-bc02-9f0c6cd0b490": {
          "progression_name": "O‘rganish"
        },
        "e9443a1f-ef37-4cb8-8d8c-415f2ceaf8ee": {
          "description": "**Displey:** “3-6-darajali – Virtual uy hayvonini yaratish” slaydni ko‘rsating"
        },
        "70b98dfc-752d-47f0-a29f-2c39cbad42be": {
          "description": "**Displey:** “7-darajali – Bepul o‘ynash” slaydni ko‘rsating"
        },
        "6007c0c9-9fe0-4bf5-9861-e64847bd3161": {
          "name": "Reflection",
          "description": "**Display:** “Reflect” slaydni ko‘rsatish\n**Ko'zda tuting:**\n\n-   Bugungi dars nima haqida edi?\\_\n-   \\_ Uy hayvoningizga yana qanday imkoniyatlarni berishni xohlaysiz?\\_"
        },
        "6587bc74-8dc2-4a3d-a7f2-118582b1454a": {
          "description": "**Displey**: \"Narsalar qanday saqlanadi?\" slayd"
        },
        "36b84666-22b3-4032-b1ef-863aca87cfd9": {
          "name": "Sevimli Taom"
        },
        "c9d09795-0970-471d-ac5d-b745bdc7c6ee": {
          "description": "Tez orada menda bo'sh joylarni to'ldirishda yordam beradigan ko'ngillilar bo'ladi. Biz ular taqdim etgan ma'lumotlarni kuzatib borish uchun konvertlardan foydalanamiz. Har bir konvertda bo'sh joylardan biri bilan birga keladigan yorliq mavjud. Agar sizga konvertni uzatsam, iltimos, o'sha yorliq bilan mos keladigan so'zni yozing va uni ichiga qo'ying, keyin uni menga qaytaring."
        },
        "a9d9d0a1-8f04-4fc0-8e1d-444f0ded3552": {
          "description": "**Buni bajaring:** “Obyekt”, “suyuqlik” va “raqam” deb belgilangan konvertlarni tarqatish va yig‘ishni osonlashtiring. Yig'ib bo'lgach, konvertlarni yopiq holda saqlang va hikoyani o'qishni boshlang. Faqat har bir bo'sh joyga yetganingizda, konvertni oching va saqlangan qiymatni o'qing."
        },
        "580f30a2-5998-427d-9399-f52a5426e91d": {
          "name": "Partiya o'yinlari"
        },
        "c173338f-588c-408f-a20a-9fff31d41a14": {
          "description": "Bugungi mashg'ulotda siz o'zingizning bo'sh joy hikoyangizni yaratish uchun guruh bilan ishlaysiz."
        },
        "242b6738-c71f-43a4-9a76-2e90e657ff70": {
          "progression_name": "Video: konvertlarda o'chirilgan o'zgaruvchilar"
        },
        "a39aeb31-f24a-4a70-b481-9fb3172e76cb": {
          "tips": [
            "Bo'sh joy hikoyasini yozish qiyin bo'lishi mumkin. Talabalarga yozishni ilhomlantirish va diqqatini jamlash uchun mavzular bo'yicha takliflar berish foydali bo'lishi mumkin. Talabalar hamkorlik qilishlari uchun bu vazifani guruhlarda ishlashlarini o'ylab ko'ring.\n\n**Mavzu bo'yicha takliflar:**\n\n-   xayoliy sinf ekskursiyasi\n\n-   g'ayrioddiy bayram\n\n-   kino sharhi\n\n-   ertalabki tartib\n\n-   plyajda bir kun\n\n-   uçurtmani qanday uchish kerak"
          ]
        },
        "4a32f72b-2376-432d-8b3a-983f0fe9488b": {
          "tips": [
            "**Talabalarning hikoyalarini saqlang!**\n\nBir necha darsda talabalar o‘rganganlarini boshqa Sprite Lab loyihasini yaratishda qo‘llashadi. Ushbu loyiha uchun bir nechta variant mavjud, ammo ulardan biri raqamli bo'sh joy hikoyasini yaratishdir.\n\nMasalan, [bu yerda](https://studio.code.org/levels/27026) bu darsdagi _Party Games_ hikoyasining Sprite Lab versiyasidir."
          ]
        },
        "4bff0457-cc5d-4e24-a3e8-51093371c51e": {
          "name": "O'zgaruvchilar bilan tanishtirish"
        },
        "d1b404e0-f066-4a95-9ac9-f0426512392e": {
          "description": "**Display**: Keyingi slaydni ko‘rsatish"
        },
        "c7ac5782-093f-43a4-a9df-c9b507e35a30": {
          "name": "Reflection"
        },
        "50cb30b6-f77f-4ca8-a7aa-477fc5de0b70": {
          "description": "### Oziq-ovqat zanjiri o'zgaruvchilari (45-60 daqiqa)\n\n![](https://curriculum.code.org/media/uploads/elaSmall.png) ![](https://curriculum.code.org/media/uploads/mathSmall.png) [2] **Informatika + ingliz tili san'ati + matematika + fan**\n\n[\\*\\*Oziq-ovqat zanjiri oʻzgaruvchilari\\*\\*](https://docs.google.com/document/d/1td4o1Oj1Syw_WwVAJ2CMDdWhvwp9DwMdbwv0gV0azOs/edit?usp=sharing) oʻqituvchilar hamjamiyatimiz tomonidan yozilgan Common Core ELA, Common Core Math va Next Generation Science standartlariga moslashtirilgan ixtiyoriy faoliyatdir. Talabalar oziq-ovqat zanjirlarida joylashgan o'zgaruvchilar uchun turli qiymatlarni aniqlaydilar (Misol: o'simliklar, hayvonlar, parchalanuvchi va h.k.), ular bu qiymatlarni qayd kartalarida hujjatlashtiradi va materiyaning atrof-muhit bo'ylab harakatini ko'rsatadi. Talabalar, shuningdek, 10% qoidasi bilan tanishadilar va energiya oqimini yozma so'rov bilan tavsiflaydilar.\n\n_Manzil qilingan standartlar:_\n\n-   **CCSS.ELA-LITERACY.W.5.2.B:** Mavzuga oid faktlar, ta'riflar, aniq tafsilotlar, iqtiboslar yoki boshqa ma'lumotlar va misollar bilan mavzuni ishlab chiqing.\n\n-   **CCSS.MATH.CONTENT.5.NF.B.7.C:** Birlik kasrlarni nolga teng bo'lmagan butun sonlarga bo'lish va butun sonlarni birlik kasrlarga bo'lish bilan bog'liq haqiqiy muammolarni hal qiling, masalan, ingl. muammoni ifodalash uchun kasr modellari va tenglamalar.\n\n-   **NGSS.5-LS2-1:** O'simliklar, hayvonlar, parchalanuvchilar va atrof-muhit o'rtasidagi materiyaning harakatini tasvirlash uchun model ishlab chiqing."
        },
        "48748da0-02c7-49dd-9376-c8bacabc64ea": {
          "name": "Sharh"
        },
        "384bc094-bdd1-4218-83e6-361c012c6c89": {
          "description": "Oxirgi dars oxirida biz bo'sh joy haqidagi hikoyalar va foydalanuvchidan ma'lumot so'raydigan ilovalar o'rtasidagi o'xshashlikni ko'rib chiqdik.\nKompyuter ekranidagi xabar sizning kiritishingizni kutayotganda, biz buni taklif deb ataymiz.\nFoydalanuvchi so'rovni kiritganda, kompyuter ma'lumotni konteynerda saqlayotganga o'xshaydi.\nO'zgaruvchining yorlig'i bizga qanday ma'lumotni kutish kerakligini aytadi.\nBugun biz Sprite Lab-da taklif yaratish kodini o'rganamiz."
        },
        "14e9da9c-a429-47db-b4bd-c07d5dc4401f": {
          "name": "Matn va takliflar",
          "progression_name": "Oldindan ko'rish"
        },
        "71f32e49-99e7-46d2-9a4d-a6b0b07d5a17": {
          "tips": [
            "Talabalar yozayotganda yoki og'zaki muloqot qilganda bo'lgani kabi, ushbu faoliyatda so'zlardan to'g'ri foydalanishga umid qilish muhimdir. Talabalar o'zlari yozgan kod, shu jumladan ekranda ko'rsatiladigan har qanday matn uchun javobgar ekanligini tushunishlari kerak. Matn hurmatli va xavfsiz bo'lishi kerak. Talabalar o'z dasturlarida shaxsiy ma'lumotlarni baham ko'rmaslikni mashq qilishlari mumkin, ayniqsa ular boshqalar bilan baham ko'rishni xohlasalar.\nEsda tutingki, Sprite Lab soʻroviga kiritilgan har qanday maʼlumot uzoq muddatda saqlanmaydi. Ushbu ilovalar foydalanuvchilari tomonidan kiritilgan so'zlar va xabarlar ilova qayta o'rnatilgandan so'ng yo'qoladi."
          ],
          "progression_name": "Video: matn va takliflar"
        },
        "304fbec8-0776-402a-9eeb-1e774da6bc0c": {
          "tips": [
            "Bu dars avvalgi darslarga qaraganda ko'proq mahorat va amaliyot darajalariga ega, chunki talabalar bir vaqtning o'zida bir nechta yangi ko'nikmalarni o'rganmoqdalar. Shunday qilib, maxsus \"erkin o'yin\" darajasi mavjud emas. Biroq, o'zlarining yangi ko'nikmalariga ishonch hosil qilgan talabalar bo'sh loyiha bilan noldan boshlash uchun oxirgi amaliyot variantini tanlashlari mumkin. Keyingi darsda talabalar faqat oldindan rejalashtirgan va loyihalashtirgan o'zlarining loyihalari ustida ishlaydilar."
          ],
          "progression_name": "Malaka orttirish"
        },
        "a2280341-dec1-43b0-9269-e8719a92375d": {
          "progression_name": "Amaliyot"
        },
        "1025db18-dae1-40a6-ac7e-b38ceed1360d": {
          "name": "Sharh"
        },
        "6def65c9-7628-4d25-866a-1b2c428fbaa6": {
          "description": "Foydalanuvchi so'rovga ma'lumot kiritganda, kompyuter uni o'zgaruvchi bilan saqlaydi. So'rov voqeani ham boshlashi mumkin. Agar kod o'zgaruvchidan foydalansa, kompyuter saqlangan ma'lumotni topish uchun mos keladigan yorliqni qidiradi."
        },
        "fdbe210a-89d4-489c-a834-a293569d0274": {
          "name": "Reflection"
        },
        "aef1a460-c4ee-406c-9f3e-2e9243f88502": {
          "name": "Sharh",
          "tips": [
            "O'zgaruvchilarni o'rganishning eng qiyin qismlaridan biri bu o'zgaruvchining yorlig'i doimo mos kelishiga ishonch hosil qilishdir. Bu darajada talabalar **meal** o‘zgaruvchisi va **ovqat** o‘zgaruvchisi o‘rtasidagi farqni payqashlariga ishonch hosil qiling. Talabalar buni hal qilishning eng yaxshi yo'li faqat bitta o'zgaruvchidan foydalanish ekanligini tushunishlari kerak, bu yorliq har doim mos kelishiga ishonch hosil qiladi.\n\nShuningdek, proyektoringiz bilan ushbu [Teacher Sandbox](https://studio.code.org/levels/27300) darajasidan foydalanib, ushbu dasturdagi xatolarni tuzatish orqali sinfingiz bilan tanishishingiz mumkin."
          ],
          "progression_name": "Oldindan ko'rish"
        },
        "b70948ff-b376-41dc-8c46-6572c8ab8241": {
          "tips": [
            "Agar vaqtingiz kam bo'lsa yoki o'tishlarni minimallashtirishni istasangiz, darsning ushbu qismini butun guruh muhokamasi sifatida yakunlang. Talabalarga biror narsa qanday ishlashi haqida savol tug'ilsa, keyinroq bu dasturlarni qayta ko'rib chiqishlari mumkinligini eslatishingiz mumkin.\n\nAgar siz butun darsni o'zingiz o'tkazgan bo'lsangiz, ularga ilhom olish uchun o'zingizning tayyor dasturingizni ko'rsatishingiz mumkin!"
          ],
          "progression_name": "Tadqiqot: Namuna dasturlari"
        },
        "cbd68965-84ed-4389-8fc1-b9f4ed5094e6": {
          "name": "Foydalanuvchi kiritish dasturlari"
        },
        "9eb4bb34-8e86-4041-a410-dd8f833d20a4": {
          "tips": [
            null
          ],
          "progression_name": "Planning"
        },
        "ee6223c9-e041-4165-b451-70f4c8416e23": {
          "tips": [
            null
          ],
          "progression_name": "Chat-Bot yaratish"
        },
        "2db78276-8789-4046-8488-4ce232bc6bb2": {
          "name": "Kirish",
          "description": "**Displey**: “Ushbu interaktiv sahnani qanday tasvirlagan bo‘lardingiz?” ko‘rsatish. slayd\n\n**Muhokama qiling**:\n\n-   _Ushbu interaktiv sahnani qanday tasvirlagan bo'lardingiz?_\n-   _Agar siz ushbu sahnani Sprite Laboratoriyasida yaratmoqchi bo'lsangiz, sizga qanday kod bloklari kerak bo'lardi?_\n\n**Muhokama maqsadi**: Talabalar sahnaning qanday yaratishni tushunadigan qismlarini, masalan, spritlar yaratish va ularga xatti-harakatlarni berishni bilishlari kerak. Shuningdek, ular bir vaqtning o'zida ko'plab spritlar yaratilishini va har bir sprayt foydalanuvchi uni boshqa vaqtda bosganiga javob berishini payqashlari kerak. Bu bu yerda ishlatilishi mumkin bo'lgan yangi kod bloklari haqida muhokamani taklif qilishi mumkin."
        },
        "86834c6e-de76-4d6a-bc8d-5c6d2e8d760a": {
          "tips": [
            "Animatsiya namunasi murakkab ko'rinadi, chunki harakatlanuvchi spritlar juda ko'p. Shuni ta'kidlash kerakki, talabalar bir nechta yangi kod bloklari bilan shunga o'xshash sahnalarni dasturlash usullarini o'rganadilar.\n\nYangi bloklar o'quvchilar ilgari ko'rganlaridan qanday farq qilishini tushunishingiz uchun o'zingiz oldindan darajalarni o'ynash foydali bo'lishi mumkin."
          ]
        },
        "ac2aa387-d8c9-447d-904c-8efe02f66fc9": {
          "description": "Ushbu sahnada biz bir nechta spritlarni ko'ramiz, ularning har biri foydalanuvchi ularni bosganida aylana boshlaydi. Biz allaqachon spritlarni qanday qilishni va ularga xatti-harakatni berishni bilamiz.\n\nBugun biz qanday qilib mos keladigan kostyumlar bilan spritlar guruhini yaratishni va har bir sprit bilan alohida o'zaro aloqa qilishni o'rganamiz. Bu bizga yanada gavjum animatsiyalar va qiziqarli o'yinlar yaratish imkonini beradi."
        },
        "56262489-b084-4a55-a4e2-b45138492e6c": {
          "description": "#### Bashorat (3 daqiqa)\n\n**Displey**: “1-daraja – bashorat qilish” slaydni ko‘rsatish\n\n**Buni bajaring**: Talabalarga taqdim etilgan kodni o'qib chiqing va nima sodir bo'lishini bashorat qiling. “Ishga tushirish” tugmasini bosgandan so‘ng, o‘quvchilarga o‘zlari qiziq bo‘lgan yoki ularni hayratda qoldirgan narsa haqida mulohaza yuritishlari uchun vaqt bering.",
          "progression_name": "Oldindan ko'rish"
        },
        "9a30234f-6c15-4525-aa78-4b8905d29133": {
          "description": "**Display**: “Lots of Sprites” videosini ko‘rsatish"
        },
        "e2e2e67f-7883-47c0-b018-118af90abc79": {
          "description": "#### Ko'nikmalarni shakllantirish va amaliyot (17 daqiqa)\n\n**Displey**: “3-8-darajali – malaka oshirish” slaydni ko‘rsating\n\n**O'tish**: Talabalarga kompyuterlariga o'tishlarini va tizimga kirishlarini so'rang.\n\nUshbu mashg'ulotlar mustaqil o'rganish yoki juftlik bilan dasturlash uchun javob beradi.\n\nTalabalar malaka oshirish darajalarini to'ldirishlari va keyin qolgan vaqtlarini turli Amaliy mashg'ulotlardan tanlashga sarflashlari kerak.",
          "progression_name": "Malaka orttirish"
        },
        "b1b312f7-6502-4335-907d-9663f892dc6f": {
          "progression_name": "Amaliyot"
        },
        "6962360d-5a78-47ae-8686-4038e83ebfbf": {
          "description": "#### Bepul o'yin (10 daqiqa)\n\n**Displey**: “10-daraja – Bepul o‘ynash” slaydni ko‘rsatish\n\n**O'tish**: Talabalar endi o'zlarining loyihalarini yaratishlari mumkin bo'lgan darsning yakuniy bosqichiga o'tishlari kerak. Bu yerdagi har bir tanlov o‘quvchilarga turli xil sprayt kostyumlar to‘plamini taqdim etadi. Talabalar boshlash uchun birini tanlashlari kerak."
        },
        "95e83631-dfdc-4398-bde7-941a56206de6": {
          "name": "O‘ylamoq",
          "description": "**Displey**: “Reflect” slaydni ko‘rsatish\n\n**Reflect**: _Dasturingizni murakkabroq qilish uchun qanday qilib spritlar va hodisalardan foydalanishingiz mumkin?_\n\n**Muhokama maqsadi**: Talabalar tushunishlari kerakki, hodisa bloklarini ochish (+ belgisi yordamida) va ichidagi sprite blokini sudrab chiqarish dasturga foydalanuvchi tomonidan bosilgan holda alohida spritlarni birma-bir o‘zgartirish imkonini beradi."
        },
        "7d525905-cfd3-47a7-b70a-2d2a28c13fac": {
          "name": "Kirish",
          "description": "**Display**: Keyingi slaydni ko‘rsatish\n\n**Muhokama qiling**: _Quyidagi ma'lumotlarning qaysi turlari vaqt o'tishi bilan o'zgaradi?_\n\n-   _Ismingiz_\n-   _Tug'ilgan kuningiz_\n-   _Sizning bo'yingiz_\n-   _Yoshingiz_\n-   _Tashqi havo harorati_\n-   _2+2 ga javob_\n-   _Mamlakatimiz poytaxti_\n-   _Bugungi sana_\n-   _O'yindagi hisob_\n\n**Buni bajaring**: Talabalarga vaqt o'tishi bilan qaysi ma'lumotlar o'zgarishi va qaysi biri o'zgarmasligini muhokama qiling. Ba'zi elementlar kengroq muhokamani keltirib chiqarishi mumkin. Masalan, ismingizni o'zgartirish yoki taxallusni ishlatish mumkin. Bundan tashqari, vaqt o'tishi bilan sizning bo'yingiz o'zgarishini to'xtatadi.\n\n**Displey**: “Reflect” slaydni ko‘rsatish\n\n**Reflect**: _O‘zgaruvchida saqlangan narsani qachon o‘zgartirish foydali bo‘ladi?_\n\n**Muhokama maqsadi**: Talabalar o'zgarmas yoki vaqt o'tishi bilan o'zgarib turadigan ma'lumotlarni saqlaydigan o'zgaruvchi yaratishi mumkinligini tushunishlari kerak. Ochkolar bilan o'yinda o'zgaruvchi o'yin davomida foydalanuvchining hisobini kuzatib borish uchun javobgardir. Odatda, bu o'zgaruvchi 0 ga o'rnatila boshlaydi va foydalanuvchi to'plagan har bir ball uchun 1 ga ortadi. Yakuniy ball oxirida o'zgaruvchini chop etish orqali xabar qilinadi."
        },
        "44ade190-d83f-4460-87ae-c1e4dcaef911": {
          "tips": [
            "Ushbu munozara faoliyatining maqsadi talabalarni o'zgaruvchidan foydalangan holda ma'lumotni saqlash va o'zgartirish haqida fikr yuritishdir. Talabalar oldingi darslarda ma'lumotni, masalan, so'rovga kiritish orqali saqlashlarini eslashlari mumkin. Keyingi mashg'ulotlarda talabalar ma'lumotni saqlashning yangi usulini, shuningdek, dastur ishlayotganida ushbu ma'lumotni qanday o'zgartirishni o'rganadilar. Ular vaqt o'tishi bilan o'zgaruvchini qachon o'zgartirish yoki yangilash kerakligini muhokama qilishlari kerak.\n\nMuhokama uchun sinfingiz uchun qaysi strategiya eng mos kelishini oldindan hal qiling. Ba'zi fikrlarga quyidagilar kiradi: T-diagrammasidan foydalanish, juftlikda yoki sinfda muhokama qilish."
          ]
        },
        "d5583d6b-9097-4abc-9bd9-f246a3e3c7dc": {
          "description": "O'zgaruvchida saqlangan qiymat vaqt o'tishi bilan o'zgarishi mumkin.\n\nBiz boshlaganimizda, bizning count o'zgaruvchimiz 0 ga o'rnatiladi. Bir necha soniyadan so'ng u 1 ga ortadi."
        },
        "8477c71b-b998-4915-9ed2-96f5adefe860": {
          "name": "Sharh",
          "description": "**Display**: Keyingi slaydni ko‘rsatish\n\n**Buni bajaring**: Ushbu dars uchun lug'atni ko'rib chiqish uchun dars slaydlaridan foydalaning. Talabalar ushbu tushunchalarning har birini qaerda ko'rganlarini darsdan eslay olishlariga ishonch hosil qiling."
        },
        "37b1afe8-191f-4950-a1a9-3d3ba93ae3a0": {
          "tips": [
            "Talabalar ushbu yangi kontekstda o'zgaruvchilar qanday ishlatilishini darhol bilishlarini kutmasliklari kerak, shuning uchun bu savollarni ular ishlayotganda e'tiborga olish kerak bo'lgan narsalar sifatida belgilash yaxshidir.\n\nTalabalar ushbu darsda darajalar bo'ylab o'tayotganda, ular raqamni saqlash uchun o'zgaruvchini qanday o'rnatishni, keyin vaqt o'tishi bilan bu raqamni o'zgartirishni o'rganadilar. O'zgaruvchining qiymatini qanday o'zgartirishni bilish o'yindagi ball kabi o'zgarishlarni kuzatishning kalitidir."
          ]
        },
        "04c4b8b1-e89f-4593-b843-2c7ef2ed3299": {
          "name": "O'zgaruvchilarni sanash"
        },
        "51946ebc-7151-47c2-88bb-29d89d0338c5": {
          "description": "#### Bashorat (3 daqiqa)\n\n**Displey**: “1-daraja – bashorat qilish” slaydni ko‘rsatish\n\n**Buni bajaring**: Talabalarga taqdim etilgan kodni o‘qib chiqing va nima bo‘lishini bashorat qiling. “Ishga tushirish” tugmasini bosgandan so‘ng, o‘quvchilarga o‘zlari qiziq bo‘lgan yoki ularni hayratda qoldirgan narsa haqida mulohaza yuritishlari uchun vaqt bering.\n\n**Displey**: “2-darajali – bashorat qilish” slaydni ko‘rsatish\n\n**Buni bajaring**: Talabalarga taqdim etilgan kodni o‘qib chiqing va nima bo‘lishini bashorat qiling. “Ishga tushirish” tugmasini bosgandan so‘ng, o‘quvchilarga o‘zlari qiziq bo‘lgan yoki ularni hayratda qoldirgan narsa haqida mulohaza yuritishlari uchun vaqt bering.",
          "progression_name": "Oldindan ko'rish"
        },
        "75a9857e-a926-4c5a-a1ff-2307afce0d11": {
          "tips": [
            "Ushbu dars ikkita bashoratli jumboqni o'z ichiga oladi: biri o'quvchilar o'rganganlarini birlashtirish uchun, ikkinchisi esa darsdagi yangi bloklarni kiritish uchun."
          ]
        },
        "f621cd05-64b4-41d4-8c9a-b310731edecb": {
          "description": "#### Ko'nikmalarni shakllantirish va o'rganish (10 daqiqa)\n\n**Displey**: “3-5-darajali – malaka oshirish” slaydni ko‘rsating\n\n**O'tish**: Talabalarni kompyuterlariga o'tkazing. Talabalarni har bir daraja uchun ko'rsatmalarga rioya qilishni rag'batlantirish.",
          "progression_name": "Malaka orttirish"
        },
        "2203aacd-4e1b-4cb5-ab3e-b0b72011a6f9": {
          "description": "**Displey**: “6-darajali – tadqiqot” slaydni ko‘rsatish"
        },
        "08684dd6-65f9-42b1-877a-05814f08c46c": {
          "description": "#### Mini-loyiha (17 daqiqa)"
        },
        "30357f1e-97b8-43b2-9fa9-edace8299c36": {
          "name": "O‘ylamoq",
          "description": "**Displey**: “Reflect” slaydni ko‘rsatish\n\n**Reflect**: _Siz o‘yiningizda o‘zgaruvchilardan qanday foydalandingiz?_\n\n**Muhokama maqsadi**: Talabalar o'z o'yinidagi o'zgaruvchilar vaqt o'tishi bilan o'zgargan qiymatni saqlashini tushunishlari kerak. O'zgaruvchining qiymati to'g'ridan-to'g'ri kodda o'rnatilishi mumkin, foydalanuvchi ilova bilan o'zaro aloqada bo'lganda o'zgartirilishi yoki so'rov kabi bevosita kiritishi mumkin."
        },
        "37214efe-4044-4968-8924-71472b1d2725": {
          "name": "Kirish",
          "description": "**Displey**: “Reflect” slaydni ko‘rsatish\n\n**Mulohaza yuriting**: _Harakatni nima o'yinga aylantiradi?_\n\n**Muhokama maqsadi**: Talabalar o‘yinlar odatda o‘yinchilar, ochkolar, g‘alaba yoki mag‘lubiyat holati va turli natijalar bilan bog‘liqligini tushunishlari kerak. Har safar foydalanuvchi o'yin orqali o'ynaganida, ular boshqa natija yoki ballga ega bo'lishi mumkin."
        },
        "229b6ed8-f28d-4d6b-98ea-39fe3ac44fab": {
          "description": "#### Tadqiqot (10 daqiqa)\n\n**Displey**: “1-daraja – tadqiqot” slaydni ko‘rsatish\n\n**Maqsad**: Bugun talabalar Sprite Laboratoriyasida o'zlarining interaktiv kollektor o'yinlarini yaratadilar! Ular bir nechta misollarni o'rganish bilan boshlanadi. Keyin, sprite xatti-harakatini sozlash va ballni kuzatish haqida qisqacha ma'lumotdan so'ng, talabalar o'zlarining o'yinlarini loyihalash ustida ishlaydilar."
        },
        "2b9cd09b-da9a-4ee5-a446-b3388f48ef07": {
          "description": "Endi ba'zi loyihalarni o'zingiz o'rganish vaqti keldi. Har bir loyiha uchun o'ylab ko'ring:\n\n-   Bu loyihalarning barchasida qanday umumiylik bor?\n-   Ular bir-biridan qanday farq qiladi?\n-   Har bir loyihadagi kod haqida nimalarni sezasiz?\n\nTadqiqotni tugatgandan so'ng, \"Finish\" tugmasini bosing va keyingi bosqichga o'ting."
        },
        "22b7037c-93fc-4723-a172-22f1501dbf3b": {
          "description": "**O'tish**: Talabalarni kompyuterlariga o'tkazing.\n\n**Buni bajaring**: Talabalar mini-loyihani boshlashdan oldin, 1-darajadagi namunaviy loyihalar bilan tanishib chiqing. Ular o'z dasturini rejalashtirishga tayyor bo'lgach, \"Finish\" tugmasini bosib, davom etishlari mumkin."
        },
        "61043979-dfcc-47f4-b882-94ea107cd123": {
          "description": "#### Mini-loyiha (20 daqiqa)\n\n**Displey**: “2-8-darajalar - Mini-loyiha: Kollektor o‘yini” slaydni ko‘rsatish\n\n**Buni bajaring**: Talabalarni har bir daraja uchun ko'rsatmalarga rioya qilishga undash. Oxirgi bosqichda ular o'z kodlariga xohlagan narsani qo'shishlari mumkin. Misol uchun, ular o'yin oxirida fonni o'zgartirishi yoki tovushlarni qo'shishi mumkin."
        },
        "0e088be7-4df3-4826-842b-2c6655bc02e9": {
          "description": "**Display**: “Showcase” slaydni ko‘rsatish\n\n**Buni bajaring**: Talabalarning ishlarini nishonlash uchun so‘nggi 10 daqiqa yoki undan ko‘proq vaqtni ularga o‘z loyihalarini namoyish qilishlariga imkon bering. Buni ko'p jihatdan qilish mumkin, ammo bu erda bir nechtasi:\n\n-   **Ommaviy demo**: Sinf oldida loyihalarini qisqacha namoyish qilish uchun bir nechta namunali ko‘ngillilarni tanlang. Ular shunday qilganda, rejalashtirishdan kodlash tajribasi ular uchun qanday bo'lganini, shu jumladan ular hali ham amalga oshirmoqchi bo'lgan g'oyalarni aytib bering.\n\n-   **Pair Playtesting**: Talabalar yoki guruhlar juftlashib, bir-birlarining loyihalarini sinab ko'ring. Ular shunday qilganda, bir-birlariga ijobiy va konstruktiv fikr bildirishlarini so'rang. Bu erdagi afzallik shundaki, talabalar kichikroq muhitda fikr-mulohazalarni taqdim etish va ularga javob berish imkoniyatiga ega bo'ladilar.\n\n-   **Galereya yurishi**: Barcha talabalar o'z loyihalarini sinovdan o'tkazishga tayyor bo'lishiga ishonch hosil qiling. Talabalar \"musiqiy stullar\" uslubidagi boshqa kompyuterga o'tkazing va ular sizdan boshqa kompyuterga o'tish uchun signal olguncha u erda bir necha daqiqa davomida loyihani o'ynang / sinab ko'ring. Buni har bir necha daqiqada takrorlang. Bu yerda tuzilgan muloqot uchun kamroq imkoniyat mavjud bo'lsa-da, bu o'quvchilarga imkon qadar ko'proq tengdoshlarining loyihalarini namoyish qilishlarini ta'minlaydi."
        },
        "08a15ab5-ba6f-4d69-b493-cae09147c210": {
          "name": "O‘ylamoq",
          "description": "**Displey**: “Reflect” slaydni ko‘rsatish\n**Mulohaza yuriting**: Sinfdoshlaringiz yaratgan o‘yinlar sizga nima yoqdi? Sizni nima ajablantirdi?\\_"
        },
        "280458d7-1de1-46dc-b42c-2be014890b38": {
          "name": "Kirish",
          "description": "**Display:** “Reflect” slaydni ko‘rsatish\n\n**Mulohaza yuriting**: _Agar siz olim bo'lganingizda, qachon tajribani real hayotda emas, balki kompyuterda taqlid qilishni xohlaysiz?_\n\nTalabalarni xavfli yoki haqiqiy hayotda takrorlash qiyin bo'lishi mumkin bo'lgan tajribalarni ko'rib chiqishga undash.\n\n**Ayting**: _Bugun biz ham xuddi olimlar singari tajriba haqida maʼlumot yigʻish uchun simulyatsiya oʻtkazamiz._"
        },
        "7ba3f55f-5511-4e5f-ad3e-3e8dcf141f85": {
          "description": "#### Lug'at\n\n**Display:** “Lug‘at” slaydni ko‘rsatish\n\n-   **Modellar va simulyatsiyalar** - real hayotda tajriba o'tkazish uchun xarajatlar, vaqt yoki xavf-xatarsiz uning xatti-harakatlarini o'rganish uchun real dunyo hodisasining asosiy xususiyatlarini takrorlaydigan yoki taqlid qiluvchi dastur."
        },
        "c5ce3765-d4c5-4159-8e5c-39035697517e": {
          "description": "**Distribute**: Pass out the lesson **\\*worksheet** along with pencils and coloring instruments of some kind. Direct students to Code Studio or project the level on the board.\n\n#### Running Simulations\n\n**Displey:** “1-qadam – Ma’lumotlarni yig‘ish” slaydni ko‘rsating\n\n**1-qadam Ma'lumotlarni yig'ish**: Birinchi pufak fil va begemot olma yig'ishning oddiy simulyatsiyasi. Talabalar simulyatsiyani kamida 5 marta o'tkazadilar, har bir hayvon tomonidan yig'ilgan olma sonini va simulyatsiyani bajarish uchun ketgan umumiy vaqtni qayd etadilar.\n\n**Display:** “2-qadam – Chiziqli grafik” slaydni ko‘rsating\n\n**2-bosqich chiziqli grafik**: Oldingi bosqichda to‘plangan ma’lumotlardan foydalanib, o‘quvchilar qo‘sh chiziqli grafik tuzadilar. Talabalarni o'z grafiklarini qo'shnilar bilan baham ko'rishga va quyidagi savollarni muhokama qilishga taklif qiling:\n\n-   _Grafiklar bir xilmi yoki boshqachami? Nima deb o'ylaysiz?_\n-   _Shu simulyatsiyani yana 5 marta bajarsangiz, nima ko'rasiz deb o'ylaysiz?_\n\n**Display:** “3-qadam – O‘zgartirish va bashorat qilish” slaydni ko‘rsating\n\n**3-qadam O'zgartirish va bashorat qilish**: Ikkinchi pufakda talabalar ushbu simulyatsiyani boshqaruvchi ba'zi o'zgaruvchilarni o'zgartirishlari mumkin bo'ladi. Har bir talaba o'zgartirish uchun o'zgaruvchini tanlaydi, bu o'zgarish simulyatsiyaga qanday ta'sir qilishini taxmin qiladi. O'zgartirish uchun potentsial o'zgaruvchilarga quyidagilar kiradi:\n\n-   Fillar soni\n-   Begemotlar soni\n-   Olma soni\n-   Fillarning tezligi\n-   Gipposlarning tezligi\n\n_E'tibor bering, talabalar o'zlarining simulyatsiyasidagi spritlarni, agar xohlasalar, boshqa hayvonlar va oziq-ovqatlarga o'zgartirishlari mumkin._\n\n**Displey:** “4-qadam – Qo‘shimcha ma’lumotlarni to‘plash” slaydni ko‘rsating\n\n**4-qadam Qo‘shimcha ma’lumotlarni to‘plash**: Talabalar oxirgi bosqichda qaror qilgan o‘zgartirishlar bilan ular simulyatsiyani yana besh marta o‘tkazadilar va ma’lumotlarni yig‘adilar.\n\n**Displey:** “5-qadam – Ma’lumotlaringizni vizualizatsiya qiling” slaydni ko‘rsating\n\n**5-qadam Maʼlumotlaringizni vizualizatsiya qiling**: Bu bosqich talabalarga oʻz maʼlumotlarining istalgan vizual tasvirini oʻrganishlariga imkon berish uchun maqsadli ravishda ochiq qoldiriladi. Ushbu vizualning maqsadi ularning bashoratini isbotlash yoki rad etish bo'lishi kerak.\n\n**Ulashish**: Tugatgandan so'ng, talabalar o'z natijalarini qo'shnilariga baham ko'rishlari mumkin. Butun sinf tayyor bo'lgach, hammani bir joyga to'plang.",
          "progression_name": "Simulyatorni ishga tushurish"
        },
        "a30085db-0943-45a2-87c4-6a1ef63df09c": {
          "progression_name": "Simulyatsiya o'zgaruvchilarini sozlash"
        },
        "65a5c77d-65a0-4744-b99b-26f05b60ebf2": {
          "name": "Reflection",
          "description": "**Display:** “Muhokama” slaydni ko‘rsatish\n\n**Muhokama qiling**:\n\n-   _O'zgartirishingiz va bashoratingiz qanday chiqdi?_\n-   _Qanday o'zgartirishlar kiritdingiz va nima uchun ularni tanladingiz?_\n-   _Bu o'zgarish sizning bashoratlaringiz bilan qanday bog'landi?_\n\n**Muhokama maqsadi:** Ushbu darsda foydalanilgan simulyatsiya maqsadli ravishda keng va bema'nidir. Ushbu munozara orqali talabalar bashorat va o'zgaruvchan o'zgarishlarni haqiqiy ilmiy farazlar bilan bog'lashni boshlashlari kerak. U yerdan siz talabalarni hisoblash modellari yoki ko'proq haqiqiy stsenariylar yoki tajribalar haqida o'ylashga undashingiz mumkin."
        },
        "ae71388d-5583-4615-b7c8-89929ab5e3f5": {
          "description": "**Display:** “Reflect” slaydni ko‘rsatish\n\n**Mulohaza yuriting**:\n\n-   _Kompyuter yordamida qanday taqlid qilishingiz mumkin bo'lgan qiziqarli narsa bor?_\n-   _Ushbu tajribada qanday turdagi o'zgaruvchilarni nazorat qilishni xohlaysiz?_"
        },
        "cbd047b0-88f2-4fdd-8307-afe5ade83470": {
          "description": "**Displey:** “Kengaytma - moslashtirish” slaydni ko‘rsating\n\nUshbu darsning asosiy faoliyati davomida talabalar o'zlari noldan dasturlashmagan simulyatsiyani ishlatadilar va o'zgartiradilar. Talabalar avvalgi darslarda ko'rgan kod bloklari bilan simulyatsiyani dasturlashlari mumkin.\n\nDarsning oxirgi bosqichida talabalar ushbu kodni o'rganishlari va o'zlari simulyatsiyani qanday dasturlash haqida o'ylashlari mumkin."
        },
        "966897db-4aa7-4d18-81a8-27b4ef5100fe": {
          "name": "Kirish",
          "description": "**Display:** “Reflect” slaydni ko‘rsatish\n\n**Mulohaza yuriting**:\n\n-   _Virusning shahar bo'ylab tezroq tarqalishiga nima sabab bo'lishi mumkin?_\n-   _Virus tarqalishini sekinlashtirishga nima yordam beradi?_\n\nUshbu munozaraning maqsadi talabalarga oldingi bilimlarni faollashtirish va o'z fikrlarini doskada ko'rish imkoniyatiga ega bo'lishdir. Bu, shuningdek, viruslar qanday tarqalishi haqidagi ba'zi noto'g'ri tushunchalarni tekshirish uchun imkoniyatdir."
        },
        "046b3604-3fda-417e-bbc3-348118922e96": {
          "description": "#### Lug'at\n\n**Display:** “Lug‘at” slaydni ko‘rsatish\n\n-   **Hodisa** - Nimadir sodir bo'lishiga sabab bo'ladigan harakat.\n\n-   **Modellar va simulyatsiyalar** - real hayotda tajriba o'tkazish uchun xarajatlar, vaqt yoki xavf-xatarsiz uning xatti-harakatlarini o'rganish uchun real dunyo hodisasining asosiy xususiyatlarini takrorlaydigan yoki taqlid qiluvchi dastur.\n\n**Buni bajaring: \\*\\* O‘tgan darsdan kelib chiqib, o‘quvchilar bilan lug‘at, \\*\\*modellar va simulyatsiyalar**ni ko‘rib chiqing. Simulyatsiya - bu jarayon yoki tizimning kompyuter modeli."
        },
        "49647f1f-bc9a-402c-85c0-6338ea7c9541": {
          "name": "Avj olish",
          "description": "**Display:** “1-daraja – Monster Townga xush kelibsiz” slaydni ko‘rsating"
        },
        "f43a5b4e-6e2d-4f24-b566-f942dc8ce78b": {
          "description": "_Bugungi darsda siz virus tarqalishi kutilayotgan “Monster Town”ga borasiz. Doktor Monster virus tarqalishini sekinlashtirish uchun sizning yordamingizga muhtoj._\n\n_Sprite Laboratoriyasida epidemiya simulyatorini yaratasiz va undan virus qanday tarqalishini tushunish uchun foydalanasiz. Shuningdek, siz barcha yirtqich hayvonlarning sog'lom bo'lishiga yordam berasiz!_",
          "progression_name": "Avj olish"
        },
        "8cbb7cae-6857-4d95-8401-9d1198ee0aec": {
          "description": "**Buni bajaring:** Sinf sifatida Monster Townga xush kelibsiz ni o‘qing."
        },
        "5de63381-b255-4ec6-8657-53710a36096e": {
          "description": "**Displey:** “Monster Townga xush kelibsiz” slaydni ko‘rsating"
        },
        "105e3699-cd4a-43eb-bcb9-bcba118e7289": {
          "description": "_Monster Town odatda baxtli va sog'lom joy edi. Monster shaharchasidagi yirtqich hayvonlar do'stlarini ziyorat qilish uchun aylanib yurishni yaxshi ko'rishardi._\n\n_Bir kuni yirtqich hayvonlardan biri kasal bo'lib qoldi. Yirtqich hayvon virusni yuqtirib olgan edi! Virus - bu sizni kasal qilishi mumkin bo'lgan kichik mikrob. Boshqa yirtqich hayvonlar unchalik tashvishlanmadi. Ular do'stlarini ziyorat qilishda davom etishdi._"
        },
        "b25dae58-5772-41ec-9f12-d8dcc1c7cc01": {
          "description": "**Displey:** Keyingi “Monster Townga xush kelibsiz” slaydni ko‘rsating"
        },
        "33a8bb8e-0361-424e-8889-e7ddcbed4182": {
          "description": "\\_ Tez orada yana ikkita yirtqich hayvon kasal bo'lib qoldi. Xuddi shu virus edi! Ular virusni do'stlaridan yuqtirganga o'xshaydi.\\_\n\n_Virus asta-sekin yaqin atrofdagi boshqa hayvonlarga tarqaldi. Sog'lom hayvonlar hamma kasal bo'lib qolishidan xavotirlana boshladilar. Kasal yirtqich hayvonlar virusni boshqalarga yuqtirishdan xavotirlana boshladilar._"
        },
        "eac8b27a-32d1-4448-8e03-e20074c0b1b3": {
          "description": "**Displey:** “Spreadni to‘xtatish” slaydni ko‘rsating"
        },
        "37f98c34-c80e-4418-b3b2-52aa63097d2a": {
          "description": "_Yaxshiyamki, virusni o'rgangach, Monster Townning qo'shnilari muhim kashfiyot qilishdi. Ular og'ziga niqob taqib yurishsa, virusni yuqtirish ehtimoli kamroq ekanini tushunishdi. Yuz niqoblari bilan kasal hayvonlar sog'lom hayvonlarga virus yuqtirish ehtimoli kamroq edi._"
        },
        "de9111be-dd1b-4d51-97af-4873c905c493": {
          "description": "**Displey:** “Keyingi nima bo‘ladi?” ko‘rsatish slayd"
        },
        "a1648cd3-0168-4b3a-b062-0b5ba6f48630": {
          "description": "_Bugun siz Monster Town-da virus tarqalishining o'z simulyatsiyasini yaratish va ishga tushirish uchun kod yozmoqchisiz. Simulyatsiya - bu jarayon yoki tizimning kompyuter modeli. Monster Town qoʻshnilari bilan nima sodir boʻlishini kodlashni va bashorat qilishni oʻrganing._\n\n-   _Virus qanchalik tez tarqaladi?_\n-   _Hamma kasal bo'ladimi?_\n-   _Niqoblar qanday yordam beradi?_"
        },
        "8261fa3f-30b2-4a35-8301-d4505f24026f": {
          "description": "**Display:** Keyingisini ko‘rsatish “Keyingi nima bo‘ladi?” slayd"
        },
        "470c21a2-eeda-41c9-9e2e-f1bd0d5319d8": {
          "description": "Ishingiz tugagach, simulyatsiyangizni boshqalar bilan baham ko'ring. Shaharga virus kelganda boshqalarning sog‘lig‘ini saqlashga yordam berish uchun nima qilishimiz mumkinligi haqida xabaringizni baham ko‘ring.\\_"
        },
        "7fb7bd27-6ada-4f30-9422-37c9ea683969": {
          "progression_name": "Monster Town-ga xush kelibsiz!"
        },
        "5f45c495-ac96-4203-8eb1-92fe77e81b68": {
          "description": "**Buni bajaring: \\*\\* O‘tgan darsdan kelib chiqib, talabalar bilan lug‘at, \\*\\*modellar va simulyatsiyalar**ni ko‘rib chiqing. Simulyatsiya - bu jarayon yoki tizimning kompyuter modeli."
        },
        "0c3814f9-66cf-41d1-b809-35840b9be2d8": {
          "description": "_Bugun biz kod yozish orqali Monster Town kabi joyni jonlantiramiz._\n\n_Ushbu simulyatsiyada siz turli xil hayvonlarni tasvirlash uchun spritlardan foydalanasiz. Spritelar kasal yoki sog'lom ekanligini aytib berish uchun turli xil liboslarga ega bo'ladi. Shuningdek, yirtqich hayvonlarni harakatga keltirish uchun xatti-harakatlardan foydalanasiz._\n\n_Nihoyat, bu ekranga ikkita sprit tegib ketganda, siz hodisalardan sprite kostyumini oʻzgartirish uchun foydalanasiz. Bu virusni boshqasiga o'tkazadigan bir yirtqich hayvonni anglatadi. Siz Monster Town qo'shnilari bilan nima bo'lishini bashorat qilasiz va ularning yana sog'lom bo'lishiga yordam berasiz!_"
        },
        "12dc3a29-9b6a-448a-91d7-c795731e097b": {
          "description": "**Displey:** “Ajralish simulyatori: Kirish” videosini ko‘rsating",
          "tips": [
            "Ushbu darsdagi voqea bloklari talabalar hozirgacha kursda ishlatgan narsalarga qaraganda ancha rivojlangan. Talabalar yashil hodisa bloklarini + tugmasini bosib kengaytira olishlarini bilishlariga ishonch hosil qiling. Talabalar bugun ko'plab spritlar bilan ishlashmoqda. Odatda, Sprite Lab-dagi buyruqlar bir xil kostyumli barcha spritlarga ta'sir qiladi. Voqealar blokidagi bloklar uni shunday qiladiki, har bir biriktirilgan harakat faqat ushbu hodisada ishtirok etgan spritlarga ta'sir qiladi."
          ],
          "progression_name": "Video: Epidemiya simulyatori: Kirish"
        },
        "fc407406-3b2b-46cd-be85-000640f4f949": {
          "description": "**Displey:** “3-darajali – Simulyatsiya yaratish” slaydni ko‘rsating\n\n**Buni bajaring:** Talabalarni kompyuterlariga o‘tkazing va ularga malaka oshirish bo‘limidagi har bir daraja uchun ko‘rsatmalarga amal qilishni boshlang. Agar talabalar ushbu bo'limni erta tugatsalar, sinf o'tishga tayyor bo'lgunga qadar 7-darajada o'z kodlari bilan tajriba qilishni davom ettirishlari mumkin.",
          "progression_name": "Malaka orttirish"
        },
        "43ec708f-4fc2-467d-b096-303d4f897b68": {
          "progression_name": "Video: epidemiya simulyatori: voqealar"
        },
        "21348baa-81f3-473d-a4d8-bfdef00cc99e": {
          "progression_name": "Malaka orttirish"
        },
        "29a7a268-d78c-4217-9c8e-42bd781dee2a": {
          "progression_name": "Video: epidemiya simulyatori: olim kabi fikrlash"
        },
        "9456da46-d269-42c3-ab51-42e617b07542": {
          "progression_name": "Simulyatsiya yordamida o'rganish"
        },
        "7e9c17d4-3d1e-4a6c-a9ef-e1d09bfedee1": {
          "progression_name": "Mini-loyiha: avj olish simulyatori"
        },
        "50845627-ac76-4f69-b95d-2e3718a6ed49": {
          "progression_name": "Video: Epidemiya simulyatori: Bepul o'yin"
        },
        "40fc31a6-1dc5-41dd-88d1-80206579453f": {
          "progression_name": "Mini-loyiha: avj olish simulyatori"
        },
        "c154010a-b763-41df-9fcf-67e0ba44fdd7": {
          "description": "_Simulyatsiyalar haqiqiy dunyoda kuzatish qiyin bo'lgan narsalarni o'rganishning ajoyib usuli. Ular olimlarga muammolarni hal qilishda, muammoni qanday hal qilishni bashorat qilishda va yangi g'oyalarni xavfsiz va samarali sinab ko'rishda yordam beradi. Sizning simulyatsiyangiz Monster Townda virus tarqalishi qanday ko'rinishini ko'rsatishning bir usuli._"
        },
        "63fcf28c-54ae-4953-acfd-397dff2ce9d3": {
          "name": "Reflection"
        },
        "bcf8a087-827a-435a-9ea1-1b5708a800c2": {
          "name": "Hayajon hosil qiling!"
        },
        "9630adaa-f7c1-4efa-8f7e-5d3ceb155b0b": {
          "name": "AI for Oceans",
          "tips": [
            "Bu dars o'quvchilarga darajani to'g'ri bajarganliklarini aytmaydi. Faoliyatning turli qismlarini tezda o'tkazib yuborish mumkin. Talabalarni videolarni tomosha qilishga, ko'rsatmalarni o'qishga va yo'lda turli narsalarni sinab ko'rishga undash. Talabalar istalgan vaqtda o‘z xulosalarini siz yoki sinfdoshingiz bilan baham ko‘rishlari mumkin."
          ],
          "progression_name": "Video: AI: Machine Learning nima?"
        },
        "138f82fc-c0fe-4836-a4f8-a38e874680b5": {
          "tips": [
            "Darsning bu qismidagi har bir tasvir [ImageNet](http://www.image-net.org/) deb nomlangan katta maʼlumotlar toʻplamida oldindan oʻrgatilgan neyron tarmoqqa beriladi. Ma'lumotlar bazasida 14 milliondan ortiq qo'lda izohlangan rasmlar mavjud. ImageNet bir necha yuz tasvirdan iborat \"balon\" yoki \"qulupnay\" kabi odatiy toifaga ega 20 000 dan ortiq toifalarni o'z ichiga oladi. Qachon A.I. yangi tasvirlarni skanerdan o'tkazmoqda va darsda o'z bashoratlarini qilmoqda, u aslida yangi tasvir uchun mumkin bo'lgan toifalarni o'quv ma'lumotlar to'plamida topilgan naqshlar bilan taqqoslaydi."
          ],
          "progression_name": "Okeanni tozalash uchun sun'iy intellektni o'rgating"
        },
        "d1a3c948-ad03-4d96-81c4-6588163a3015": {
          "progression_name": "Video: Trening ma'lumotlari va tarafkashlik"
        },
        "97505f9d-3e88-4a48-8fb1-66a0dcb61e9e": {
          "tips": [
            "Ushbu qo'llanmadagi baliqlar tasodifiy tanlangan tana rangi, shakli va o'lchami bilan oldindan belgilangan ba'zi komponentlar, jumladan og'izlar, dumlar, ko'zlar, tarozilar va qanotlar asosida tasodifiy tarzda yaratilgan. Haqiqiy tasvir ma'lumotlariga qarash o'rniga, A.I. endi talaba har bir baliqni qanday tasniflashiga asoslanib, ushbu komponentlardagi naqshlarni qidirmoqda. Agar baliqning o'ziga xos belgilari bo'lsa, xuddi o'quvchiga o'xshab yorliq qo'yish ehtimoli ko'proq bo'ladi."
          ],
          "progression_name": "Trening ma'lumotlaridan foydalanish"
        },
        "febd53d5-1b5e-4e73-a843-482a6a9a0781": {
          "progression_name": "Video: Jamiyatga ta'siri"
        },
        "4cbe4554-d9fd-4e24-9f7c-572f2874fee9": {
          "progression_name": "O'rgating A.I. yangi so'z"
        },
        "f3a8670b-9954-45f9-af08-1689c799a427": {
          "tips": [
            "AI kelajakka qanday ta'sir qilishini ko'rishga yordam berish uchun siz ushbu hikoyalarni sinfingiz bilan baham ko'rishingiz mumkin.\n\n-   [Oziq-ovqat chiqindilari - jiddiy muammo. AI buni hal qilishga harakat qilmoqda](https://singularityhub.com/2019/11/03/food-waste-is-a-serious-problem-ai-is-trying-to-solve-it/)\n-   [AI texnologiyasi odamning yuzidan genetik kasalliklarni aniqlay oladi](https://mashable.com/video/ai-identify-genetic-disorders-photo/?)\n-   [Qanday qilib sun'iy intellekt startapi 46 kun ichida giyohvandlikka nomzodni ishlab chiqdi](https://singularityhub.com/2019/09/09/how-an-ai-startup-designed-a-drug-candidate-in-just-46-days/)\n-   [MIT AI vositasi ko'krak saratonini 5 yilgacha erta bashorat qila oladi](https://techcrunch.com/2019/06/26/mit-ai-tool-can-predict-breast-cancer-up-to-5-years-early-works-equally-well-for-white-and-black-patients/)\n-   [Armiya o'z-o'zini boshqaradigan mashinalar tezligini oshirdi](https://www.axios.com/us-army-military-casualties-autonomous-vehicles-1ff51e01-3b16-4a1c-9587-ce55dee74788.html?)\n-   [San-Fransisko odamlarni jinoyatda ayblashda tarafkashlikni kamaytirish uchun AIdan foydalanishini aytadi](https://www.theverge.com/2019/6/12/18663093/ai-sf-district-attorney-police-bias-race-charge-crime)\n-   [AI olimlarga tosh lavhalardagi qadimgi yunoncha matnlarni tiklashda yordam bermoqda](https://techcrunch.com/2019/10/18/ai-is-helping-scholars-restore-ancient-greek-texts-on-stone-tablets/)"
          ]
        },
        "676b1021-0b14-463c-85eb-beca19002ac2": {
          "description": "**Muhokama:** Kichik guruhlardan boshlab, keyin butun sinfga o'tadi, talabalar o'z javoblarini baham ko'radilar.\n\n**Maqsad:** Talabalarni sun'iy intellekt olami bilan tanishtirish."
        },
        "56809556-ceb9-4fbb-b3c7-e5345d64ffe8": {
          "description": "**Ayting:** _**Mashinani o‘rganish** ma’lumotlar asosida naqshlarni taniy oladigan va mustaqil ravishda qaror qabul qila oladigan kompyuterni nazarda tutadi. Ushbu faoliyatda siz uni o'rgatish uchun kompyuter ma'lumotlarini berasiz. Baliq kabi mavjudotlarni o'z ichiga olgan, ammo odamlar tomonidan tashlab ketilgan axlatlarni o'z ichiga olgan okeanni tasavvur qiling. Agar kompyuterni farqni aytishga o‘rgatib, okeanni tozalashda ushbu texnologiyadan foydalansak-chi?_"
        },
        "5f554a52-41ac-4982-bfd0-e3deb97bc410": {
          "name": "Reflection"
        },
        "04f13b6a-1f5c-4c1f-8c9e-cbb4dca0273b": {
          "name": "A.I. Joriy voqealarda",
          "description": "AI kelajakka qanday ta'sir qilishini ko'rishga yordam berish uchun siz ushbu hikoyalarni sinfingiz bilan baham ko'rishingiz mumkin.\n\n-   [Oziq-ovqat chiqindilari - jiddiy muammo. AI buni hal qilishga harakat qilmoqda](https://singularityhub.com/2019/11/03/food-waste-is-a-serious-problem-ai-is-trying-to-solve-it/)\n-   [AI texnologiyasi odamning yuzidan genetik kasalliklarni aniqlay oladi](https://mashable.com/video/ai-identify-genetic-disorders-photo/?)\n-   [Qanday qilib sun'iy intellekt startapi 46 kun ichida giyohvandlikka nomzodni ishlab chiqdi](https://singularityhub.com/2019/09/09/how-an-ai-startup-designed-a-drug-candidate-in-just-46-days/)\n-   [MIT AI vositasi ko'krak saratonini 5 yilgacha erta bashorat qila oladi](https://techcrunch.com/2019/06/26/mit-ai-tool-can-predict-breast-cancer-up-to-5-years-early-works-equally-well-for-white-and-black-patients/)\n-   [Armiya o'z-o'zini boshqaradigan mashinalar tezligini oshirdi](https://www.axios.com/us-army-military-casualties-autonomous-vehicles-1ff51e01-3b16-4a1c-9587-ce55dee74788.html?)\n-   [San-Fransisko odamlarni jinoyatda ayblashda tarafkashlikni kamaytirish uchun AIdan foydalanishini aytadi](https://www.theverge.com/2019/6/12/18663093/ai-sf-district-attorney-police-bias-race-charge-crime)\n-   [AI olimlarga tosh lavhalardagi qadimgi yunoncha matnlarni tiklashda yordam bermoqda](https://techcrunch.com/2019/10/18/ai-is-helping-scholars-restore-ancient-greek-texts-on-stone-tablets/)"
        },
        "768fdc30-25c8-40ae-846a-6de108de3a9f": {
          "name": "Kirish"
        },
        "f7e2b7b8-84ff-442f-bd6a-831da855966f": {
          "tips": [
            null
          ]
        },
        "1b0d023d-bf54-4703-af7e-5d9fd45d755d": {
          "tips": [
            "Ushbu mavzu bo'yicha ba'zi ajoyib YouTube videolari mavjud bo'lib, bu darsni tushunishni biroz osonlashtiradi. Siz ularni sinfga oldindan ko'rsatishingiz yoki o'zingiz tomosha qilishingiz mumkin. \\[Mana, Code.org video seriyasidagi “Internet qanday ishlaydi” mavzusidagi videolardan biri [0].\n(Iloji bo'lsa, 1:44 - 5:13 gacha tomosha qilishni tavsiya etamiz.) Qolgan pleylist [bu yerda](https://www.youtube.com/watch?v=Dxcc6ycZ73M&list=PLzdnOPI1iJNfMRZm5DDxco3UdsFegvuB7)."
          ]
        },
        "07e83a27-5530-4af9-bc71-88838f668e86": {
          "tips": [
            "Agar siz bu juda ko'p matn deb o'ylayotgan bo'lsangiz va buni boshlang'ich maktab o'quvchilari bilan to'la sinfga o'qish juda zerikarli bo'lardi, siz mutlaqo haqsiz!\nAgar sinfda YouTube videosini ko‘rsata olmasangiz, bularning barchasini tushuntirishga yordam bersangiz, yuqoridagi har bir fikrni tushuntirish uchun rasm chizishni yoki siz tushuntirayotganingizda tasvirlagan narsalarni ko‘rsatish uchun talabalarni ko‘ngilli sifatida tanlashni tavsiya qilaman. Ular hozircha har bir tafsilot va ta'rifni olishlari kutilmaydi, faqat ta'sir qilish uchun."
          ]
        },
        "0965b5bc-06b2-458d-b6c5-9c6f9f2f6340": {
          "name": "Internet",
          "progression_name": "Internet - O'chirilgan faoliyat"
        },
        "3b419e1c-6cbf-4940-b2a0-c12606b359e1": {
          "tips": [
            "To'g'ridan-to'g'ri tushuntirish uchun juda ko'p qoidalar bordek tuyulsa, ularni doskaga joylashtiring va o'yinni shunchaki tushuntiring. Sinf haqiqatan ham tushunmaguncha bir nechta tur o'ynashingiz mumkin."
          ]
        },
        "fc104032-9a2d-443a-96d0-e7f4c6de6782": {
          "name": "Reflection",
          "tips": [
            null
          ]
        },
        "f26ccabe-2b34-481f-b142-b6227421df3e": {
          "name": "O'rganing"
        },
        "f8419af8-d199-4cb6-b4dc-ea619a1ea802": {
          "progression_name": "Namunaviy loyihalar"
        },
        "ad3b60a9-c96d-4e0b-b124-5f6f34d1c85c": {
          "progression_name": "Loyihangizni yarating"
        },
        "de7ab6f7-a853-4f00-b05d-a9db0bb2da2d": {
          "tips": [
            null
          ]
        },
        "3591fc28-830a-4a32-94e4-3468853cea32": {
          "name": "Urinish (Try)"
        },
        "bad6c34f-b32e-4116-908c-7eb4fc2ca6a4": {
          "tips": [
            null
          ]
        },
        "38c0b06f-e0b8-4739-b359-6513f419fd11": {
          "tips": [
            null
          ]
        },
        "4b48da8b-113d-4b9b-94ff-c776a0cab3b9": {
          "tips": [
            null
          ]
        },
        "1b707283-b28d-4147-921e-691c3e5325fe": {
          "tips": [
            null
          ]
        },
        "e5a4600f-c0cb-4f61-82bc-b1fdff9ad731": {
          "name": "Mulohaza yuritish"
        },
        "c3102dcc-a35a-489f-8461-06e0aa3d5125": {
          "description": "Agar sizning o‘quvchilaringiz kodlash tushunchalarini yaxshi bilsalar, ularga,  [Scratch](https://scratch.mit.edu/) yoki [Alice](http://www.alice.org/index.php) kabi loyihalarini boshqa platformada yaratishga harakat qilishni ayting."
        },
        "1c38d573-e689-4c3a-84b6-f6c5deb4cd55": {
          "name": "Kirish",
          "description": "-   [Labirint №1da dasturlash](https://studio.code.org/levels/8730)\n-   [Maze №2 da dasturlash](https://studio.code.org/levels/8729)\n\n**O‘tish:** Endi talabalar onlayn boshqotirmani amalda ko‘rganlari uchun ular o‘zlari boshqotirma yechishga tayyor bo‘lishlari kerak. Laboratoriyaga boring yoki sinf kompyuterlarini olib chiqing.",
          "tips": [
            "Ba'zi o'quvchilar qushni to'g'ri yo'nalishda burishda qiynalishi mumkin, ayniqsa qush yuqoriga qaramaganda. O'quvchilarga eslatib o'tingki, biz chapga yoki o'ngga burilishni aytganda, biz qush nuqtai nazaridan yo'nalish beramiz."
          ]
        },
        "4124a6f9-58cd-4211-be8a-9930d9884d43": {
          "name": "Jahldor qushlar bilan dasturlash",
          "tips": [
            "Talabalarga sinfdoshlariga yordam berishning to'g'ri yo'lini ko'rsating:\nUlarning kursiga o'tirmang\nUlarning klaviaturasidan foydalanmang\nUlarning sichqonchasiga tegmang\nSiz ketishdan oldin sinfdoshingiz yechimni tasvirlab berishiga ishonch hosil qiling"
          ],
          "progression_name": "Video: Maze Intro - Bloklar bilan dasturlash"
        },
        "49b2f670-c867-4f10-9a00-69e36e656858": {
          "progression_name": "Malaka orttirish"
        },
        "47ed26cb-f342-486a-9123-166717aab595": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "113a8302-96b2-4aff-b859-036ff9b540c7": {
          "progression_name": "Amaliyot"
        },
        "cbda0c5a-4809-45ee-ad7e-2b55f1b1ddd5": {
          "progression_name": "Oldindan ko'rish"
        },
        "d02dbffd-eaec-4155-ad4f-54f3787b6264": {
          "progression_name": "Amaliyot"
        },
        "17df522f-cbb2-4be1-af08-37c105e9b134": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "a21e543c-5c49-4527-be96-53656ea82f52": {
          "description": "**Tivilizatsiya:** O'qituvchilar informatika bo'yicha ta'lim berishda va birgalikdagi va jonli sinf muhitini qo'llab-quvvatlashda muhim rol o'ynaydi. Onlayn faoliyat davomida o'qituvchining roli birinchi navbatda rag'batlantirish va qo'llab-quvvatlashdir. Onlayn darslar talabalarga yo'naltirilgan bo'lishi uchun mo'ljallangan, shuning uchun o'qituvchilar talabalar tiqilib qolganda qadam qo'ymasliklari kerak. Buni qanday qilish haqida ba'zi fikrlar:\n\n-   Faoliyat davomida iloji boricha juftlik dasturlashdan foydalaning.\n-   Talabalarni savollar/qiyinchiliklar bilan sherigidan so'rashdan boshlashga undash.\n-   Javobsiz savollar yaqin atrofdagi guruhga yuborilishi mumkin, ular yechimni allaqachon bilishi mumkin.\n-   Talabalardan o'zlari ko'rayotgan muammoni tasvirlab bering. Bu nima qilishi kerak? Bu nima qiladi? Bu sizga nima deyapti?\n-   Hafsalasi pir bo‘lgan o‘quvchilarga umidsizlik o‘rganish yo‘lidagi qadam ekanligini va qat’iyatlilik o‘z samarasini berishini eslating.\n-   Agar talaba bularning barchasidan keyin ham tiqilib qolgan bo'lsa, talaba xatoni o'zi aniqlashi uchun etakchi savollarni bering.\n\n**Muhokama:** Talabalarga dars tugashi haqida ogohlantirish bergandan so'ng, barchaning e'tiborini torting va ularni o'zlari boshidan kechirgan tajribalari haqida fikr yuritishga undash.\n\n-   Boshqotirmalarning birortasi paytida kimdir hafsalasi pir bo'lganmi?\n-   Kimdir qat'iyatli bo'lish kerakligini sezdimi?\n\n**O‘tish:** Talabalarga o‘zlarining **\\*Thinkspot Journals**larini qo‘lga kiriting va tajriba haqida o‘zlari mulohaza yuritishlariga vaqt ajrating."
        },
        "932d0cc0-5664-4aab-8653-df211e76c26f": {
          "name": "Reflection",
          "description": "Talabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi. Tugallangach, undan kelajakda ko'rib chiqishlari uchun ko'rib chiqish varag'i sifatida foydalanish mumkin.\n\n**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsda o'zingizni qanday his qildingiz?\n-   O'zingiz yoqtirgan, birinchi marta qiynalgan mashg'ulotingizni chizing. Qanday qilib yaxshilanganingizni tasvirlang yoki tasvirlang."
        },
        "0ac901c2-6ae6-46cd-aff2-75c82424476d": {
          "description": "Ushbu mashg‘ulotlardan o‘quvchilar bilimini oshirish uchun foydalaning. Ular sinfdan tashqarida ishlatilishi mumkin.\n\n\\*\\* O‘zingizni yarating \\*\\* \n\n Kichik guruhlarda talabalarga o‘zlarining labirintlarini loyihalashtirishlariga  va ularni yechish uchun dasturlar yozish uchun bir-birlariga murojaat qilishlariga ruxsat bering. Qo‘shimcha ko‘ngil ochish uchun talabalar bilan cho‘chqa va qush kabi hayotiy labirintlarni yarating."
        },
        "c0b79f05-1c04-43f9-988d-c2946be555b0": {
          "description": "### Xatolar, xatolar va boshqa xatolar (45-60 daqiqa)\n\n![](https://curriculum.code.org/media/uploads/elaSmall.png) ![](https://curriculum.code.org/media/uploads/mathSmall.png) **Kompyuter fanlari + ingliz tili san'ati + matematika**\n\n[Bugs, Bugs & More Bugs](https://docs.google.com/document/d/1TdvVXM9Tf8lv9L3rgDqMJFTe-iG0PjTpMtBb2f4pXDo/edit#) oʻqituvchilar hamjamiyatimiz tomonidan yozilgan Common Core ELA va Math standartlariga moslashtirilgan ixtiyoriy faoliyatdir. Talabalar kodni tuzatish, matematik muammoni tuzatish va yozish namunalarini tuzatishda disk raskadrovkani mashq qiladilar.\n\n_Manzil qilingan standartlar_:\n\n-   **CCSS.ELA-LITERACY.L.2.1.B:** Tez-tez uchraydigan tartibsiz ko‘plik otlarini hosil qiling va ishlating (masalan, oyoqlar, bolalar, tishlar, sichqonlar, baliqlar).\n\n-   **CCSS.ELA-LITERACY.L.2.2.A:** Bayramlar, mahsulot nomlari va geografik nomlarni bosh harf bilan yozing.\n\n-   **CCSS.ELA-LITERACY.L.2.2.C:** Kasılmalar va tez-tez uchraydigan egalarni hosil qilish uchun apostrofdan foydalaning.\n\n-   **CCSS.MATH.CONTENT.2.OA.B.2:** Aqliy strategiyalardan foydalangan holda 20 tagacha qo'shing va ayirang.\n\n-   **CCSS.MATH.CONTENT.2.NBT.A.4:** >, = va \\< belgilaridan foydalanib, yuzlik, oʻnlik va birlik raqamlarining maʼnosiga asoslangan holda ikkita uch xonali sonni solishtiring. taqqoslash natijalari."
        },
        "50c37f50-7e2b-4c9c-9443-013742231b0e": {
          "name": "Kirish",
          "description": "Talabalardan kundalik hayotda hal qilishlari kerak bo'lgan muammolar haqida o'ylashni so'rang.\n\n-   Ishlamayotgan narsani qanday tuzatasiz?\n-   Muayyan bosqichlarni bajarasizmi?\n-   Bu bo'limdagi jumboqlar siz uchun allaqachon echilgan (hay!), lekin ular ishlamayapti shekilli (boo!)\n-   Biz bu dasturlardagi muammolarni \"xatolar\" deb ataymiz va ularni \"nosozliklarni tuzatish\" sizning vazifangiz bo'ladi."
        },
        "5b0bad48-bd8f-4217-aef6-6bd8250e1186": {
          "name": "Lug‘at",
          "description": "Ushbu darsda uchta yangi va muhim lug'at so'zlari mavjud:\n\n-   **Bug** - _Men bilan ayting - Buhh-g._\n\nNimadir noto‘g‘ri ketmoqda. Xato.\n\n-   **Nosozliklarni tuzatish** - _Men bilan ayting: Dee-bug-ing._\n\nXatolarni topish va tuzatish uchun.\n\n-   **Qaydamlik** - _Men bilan ayting: Purr-siss-tense._\n\nTaslim bo'lmaslik. Qat'iylik har xil yo'llar bilan, har xil vaqtlarda sinab ko'rsangiz yaxshi ishlaydi.\n\n\\*\\* Ayting:\\*\\* _**Nosozliklarni tuzatish** bu jarayon. Birinchidan, dasturingizda xatolik borligini tan olishingiz kerak. Keyin xatoni topish uchun dasturni bosqichma-bosqich ishlaysiz. Birinchi qadamni sinab ko'ring, u ishladimi? Keyin ikkinchisi, hozir-chi? Agar siz hamma narsa satr bo'yicha ishlayotganiga ishonch hosil qilsangiz, kodingiz kerakli narsani qilmayotgan joyga etib borganingizda, siz xatolik topilganingizni bilasiz. Xatongizni aniqlaganingizdan so'ng, uni tuzatish (yoki \"nosozliklarni tuzatish\") ustida ishlashingiz mumkin!_\n\nAgar bu darsda hayajon uyg'otadi deb o'ylasangiz, bugungi jumboqlarning xarakterini, *Muzlik davridagi \\_Skrat* bilan tanishtirishingiz mumkin. Agar o'quvchilar _Scrat_ bilan tanish bo'lmasa, muammoga duch kelayotgan g'alati sincapning ba'zi kliplarini ko'rsating."
        },
        "5c133834-038c-48e4-819a-cef93780856b": {
          "name": "Skrat bilan debug qilish",
          "description": "Talabalarga kompyuterda ishlashga ruxsat berishdan oldin, ularga **\\*Pair-Dasturlash**-videoning afzalliklarini eslatib, tengdoshlaridan yordam so'rang. Talabalarni juft bo'lib o'tiring va o'qituvchiga kelishdan oldin kamida ikkita tengdoshidan yordam so'rashni tavsiya eting.\n\nUshbu darsning maqsadida aytib o'tilganidek, o'quvchilar xafa bo'lgan jumboqlarga duch kelishlarini bilishlariga ishonch hosil qiling. Ularga xafa bo'lish yaxshi ekanini ayting, lekin muammoni hal qilish va yordam so'rash muhim. Talabalar boshqotirmalar ustida ishlayotganda, hech bir o‘quvchi o‘zini shu qadar tiqilib qolgandek his qilmasligiga ishonch hosil qilish uchun aylanib yuring."
        },
        "08d61c39-60d0-47ef-8ad5-919c6d4693a1": {
          "progression_name": "Video: Scrat yordamida nosozliklarni tuzatish"
        },
        "2e366d04-1f25-4c62-8345-e74a5e81799d": {
          "progression_name": "Malaka orttirish"
        },
        "5b2a71e6-47a2-4f33-bf7c-9e701f60f4a4": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "48a18e44-f31f-48ff-b7e4-95a786df2982": {
          "progression_name": "Oldindan ko'rish"
        },
        "2dd6b911-9612-4d41-836e-faeaf7cc3e77": {
          "progression_name": "Amaliyot"
        },
        "27675226-8c0f-4955-ac5f-f9bfa4c7c475": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "54b676c0-ba39-450f-9828-5bba0ce6daf6": {
          "name": "Reflection",
          "description": "Talabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsda o'zingizni qanday his qildingiz?\n-   Bugun qanday xatolarni topdingiz?\n-   Bugun boshqotirmalardan birida duch kelgan xatoni chizing. Dasturni \"debug\" qilish uchun nima qildingiz?"
        },
        "3d6e0217-7da3-4ef3-a6fd-e684151c482a": {
          "description": "Ushbu mashg‘ulotlardan o‘quvchilar bilimini oshirish uchun foydalaning. Ular sinfdan tashqarida ishlatilishi mumkin.\n\n\\*\\* Xatolar qoldirish\\*\\* \n\nO‘quvchilar oldingi darajalardan o‘tib, ularning echimlariga maqsadli ravishda xatolar qo‘shadilar. Keyin ular boshqa talabalardan o‘zlarining ishlarini debug qilishni so‘rashlari mumkin. Buni qog‘ozli jumboqlar bilan ham qilish mumkin. \n\n Boshqa talabalar debug paytida, tanqidlar konstruktiv ekanligiga ishonch hosil qiling. Agar bu sizning sinfingizga muammo tug‘dirsa, boshqa talaba bilan rol o‘ynab, ushbu mashg‘ulotdan oldin hurmat bilan debug qilishni ko‘rsating."
        },
        "0ce0c382-a11b-4c74-ad59-41f02403b46b": {
          "name": "Kirish",
          "description": "Ushbu darsda oldingi darslardagi bir xil bloklarning ko'p qismi qo'llaniladi va \"to'plash\" qobiliyatini qo'shadi. Talabalarga ushbu blok sarguzashtchi Laurelga o'zi turgan xazinani olishga imkon berishini ayting. Ushbu yangi blok ko'prik faoliyatida ko'proq muhokama qilinadi."
        },
        "eb1b0c3e-6a9a-4a09-9420-3d8e7dd8a84c": {
          "name": "Onlayn boshqotirmalarni sinf bilan ko‘rib chiqish",
          "description": "Tegishli onlayn bosqichdan jumboqni torting. Biz 7 boshqotirmani tavsiya qilamiz. Talabalarga barcha xazinani yig'ish uchun sarguzashtchi Laurelni olishi mumkin bo'lgan naqshni muhokama qiling. Talabalardan baham ko'rishlarini so'rang. Qarang, yana qancha talabalar bir xil javobga ega edilar!"
        },
        "8c9b5729-021b-4d95-b232-e523b7956513": {
          "name": "Laurel bilan xazina yig‘ish",
          "description": "_Laurel the Sarguzasht_ imkon qadar ko'proq xazina to'plamoqchi. Talabalarga jumboq bo'ylab topilgan narsalarni to'plashni buyuring. Ba'zi darajalar sizdan faqat bitta xazinani olishingizni talab qiladi, boshqalari esa har bir xazina bo'lagini olishingizni talab qiladi. Nima qilish kerakligini bilish uchun ko'rsatmalarga e'tibor bering!"
        },
        "ea0d0c84-a0d7-41d0-80cc-efe792db04e8": {
          "progression_name": "Video: Kollektor"
        },
        "f2310ede-7d4f-478c-aa07-906ae23fe170": {
          "progression_name": "Malaka orttirish"
        },
        "fd0ab898-850a-45a0-be4f-1e223b482dce": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "a44da8b7-1127-4f1c-9634-6387876dc604": {
          "progression_name": "Amaliyot"
        },
        "ebc8dbcd-12ed-41f3-b957-3d5ce803e014": {
          "progression_name": "Oldindan ko'rish"
        },
        "36b378b8-6af7-43ac-bc36-81a2758775fd": {
          "progression_name": "Amaliyot"
        },
        "76775349-6666-411c-adea-ee7c7277587c": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "be73dc86-a16b-4ab3-8ac7-c1206d4b3c60": {
          "name": "Reflection",
          "description": "Talabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsda o'zingizni qanday his qildingiz?\n-   Bugun foydalangan bloklaringiz bilan hal qilishingiz mumkin bo'lgan labirint chizing."
        },
        "73186d8b-412c-447c-b31d-ba6efced8854": {
          "name": "Kirish",
          "description": "Talabalarga burchaklarga kirish sifatida quyidagi videolardan birini yoki ikkalasini ko'rsating:\n\n**\\*Rassom bilan tanishtirish** (1,5 daqiqa)\n\n**\\*Burilishlar va burchaklar** (2 daqiqa davom etadi)\n\n**\\*Talaba uchun tarqatma qog‘oz** yordamida o‘quvchilarning ichki va tashqi burchaklarini turli shakllar uchun ko‘rsating. Ushbu hujjatdan qo'llanma sifatida foydalanish mumkin yoki siz uni talabalar murojaat qilishlari uchun afisha sifatida chop etishni tanlashingiz mumkin.\n\n**Hujjatdagi kvadrat va uchburchak shakllarini muhokama qiling**.\n\n-   _Bu shaklni chizish uchun kompyuterni qanday kodlagan bo'lardingiz?_\n-   _Ko'rsatmalar qanday tartibda bo'lishi kerak?_\n\nTalabalarga aytingki, bu jumboqlarda ular hamma joyda chiziq qoldiradigan qahramonni harakatga keltiradilar. Talabalar xarakterga turli shakllarni, shu jumladan kvadratni chizish uchun kod yozadilar."
        },
        "a87f5d31-b7cb-48e5-b7c7-06f8a43e329f": {
          "name": "Kod bilan san’at yaratish",
          "description": "Ushbu jumboqlar to'plamida rassom endi 90 daraja burchak bilan cheklanmaydi. Jismoniy transport vositalarining mavjudligi talabalarga kerakli burchaklarni yaxshiroq tasavvur qilishlariga yordam beradi. Aks holda, sahna burchaklarning tasvirlarini beradi, chunki talaba qaysi burchakdan foydalanishni tanlaydi. (Iltimos, diqqat qiling: ochiladigan menyuda burchak tanlovi ikkitasi bilan cheklangan, bu esa talabalar ishlashi kerak bo'lgan variantlar sonini kamaytiradi.)\n\nTalabalarni boshqotirmalar ustida ishlash uchun kompyuterga yuborishdan oldin, ushbu darajadagi vositalardan qanday foydalanish haqida qisqacha ma'lumot berish foydali bo'lishi mumkin. O'tkazgichdan onlayn qanday foydalanishni ko'rsatish uchun yaxshi jumboq sifatida 5-jumboqni tavsiya qilamiz."
        },
        "c2639856-d143-4f85-ae32-262da1af5808": {
          "progression_name": "Video: JR Xildebrand bilan rassom introsi"
        },
        "9d3c0460-5365-4117-811d-9728a5a3f9d9": {
          "progression_name": "Malaka orttirish"
        },
        "3c6953b2-ead1-488b-b460-2735304f527f": {
          "tips": [
            "Sakkizinchi boshqotirma o‘quvchilardan 6 qirrali ko‘pburchak chizishni so‘raydi. Bu ba'zi talabalar uchun qiyin bo'lishi mumkin. Talabalarni bir necha marta sinab ko'rishlarini tavsiya qilamiz, tengdoshlaridan so'rang, keyin o'qituvchidan yordam so'rang. Quyida talabalar uchun foydali bo'lishi mumkin bo'lgan rasm mavjud."
          ],
          "progression_name": "Chaqiriq (Challenge)"
        },
        "b3505cdb-0f28-4265-a017-d4d3d77d6b72": {
          "progression_name": "Amaliyot"
        },
        "738565b6-64b7-435b-92ea-42efb0b3fa2f": {
          "progression_name": "Oldindan ko'rish"
        },
        "2a1be9e0-a252-42dc-a548-fb62c1c19e91": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "958d98ef-b327-40df-bffe-70bd71ac92bf": {
          "name": "Reflection",
          "description": "Talabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsda o'zingizni qanday his qildingiz?\n-   Kvadratni qanday ichki burchaklar tashkil qiladi. Uchburchak haqida nima deyish mumkin?\n-   Qog'ozingizga oddiy shaklni chizing va uni chizish uchun ishlatiladigan kodni tasavvur qiling. Ushbu kodni shakl yoniga yoza olasizmi?"
        },
        "7277b426-be25-4bf1-9570-62b89b282cec": {
          "description": "Talabalarning bilimini oshirish uchun ushbu faoliyatdan foydalaning. U sinfdan tashqari faoliyat yoki boshqa boyitish sifatida ishlatilishi mumkin.\n\n\\*\\* Nusxa ko'chirish mashinasi\\*\\*\n\n-   Talabalarga ikkita qog'oz bering\n-   Bir varaqda faqat tekis chiziqlardan foydalangan holda oddiy tasvirni chizish.\n-   Ikkinchi varaqda to'g'ridan-to'g'ri harakat qilish va turli burchaklarda burilish buyrug'ini qayta yaratish bo'yicha ko'rsatmalarni chizing.\n-   Ko'rsatmalar varaqlarini soting va faqat taqdim etilgan ko'rsatmalardan foydalanib tasvirni qayta yaratishga harakat qiling."
        },
        "47d2f537-0503-45a9-98bc-1e9d3bb1a665": {
          "description": "### Shakllar va landshaftlar (45-60 daqiqa)\n\n![](https://images.code.org/5066103b929a2811e50d5bd54fbb114e-elaSmall.png)\n![](https://images.code.org/6a1508aeb443e243f595f88ecfa9ed7a-mathSmall.png)\n![](https://images.code.org/54b84cd74790e8e37daeff6cd826c185-scienceSmall.png) **Kompyuter fanlari + ingliz tili san'ati + matematika + fan**\n\n[Shakllar va landshaftlar](https://docs.google.com/document/d/1cPejd3i4v1A6iTMDtyOvlOfTVU9nlMg21bovwFThvvc/edit#) oʻqituvchilar hamjamiyatimiz tomonidan yozilgan Common Core ELA, Common Core Math va Next Generation Science standartlariga moslashtirilgan ixtiyoriy faoliyatdir. Talabalardan kelajakda suv toshqini oldini olish uchun to'g'on loyihalash so'raladi. Koddan foydalanib, siz mahalliy shahar kengashiga sizning to'g'oningiz qanday ko'rinishini ko'rsatish uchun reja tuzasiz.\n\n_Manzil qilingan standartlar:_\n\n-   **CCSS.ELA-LITERACY.W.2.8:** Tajribalardan olingan ma'lumotlarni eslang yoki savolga javob berish uchun taqdim etilgan manbalardan ma'lumot to'plang.\n\n-   **CCSS.MATH.CONTENT.2.MD.A.3:** Dyuym, fut, santimetr va metr birliklari yordamida uzunliklarni hisoblang.\n\n-   **NGSS.2-ESS2-1:** Shamol yoki suvning er shaklini o'zgartirishini sekinlashtirish yoki oldini olish uchun mo'ljallangan bir nechta echimlarni solishtiring."
        },
        "a9b4ed74-2780-4aa1-988a-c0fac2ae97f5": {
          "name": "Kirish",
          "description": "Bugun talabalar Sprite laboratoriyasida spritlar bilan ishlashni o'rganadilar.\n\n**Displey:** Code.org saytidan oldingi jumboqni toping, idealida *Muzlik davridagi \\_Scrat* yoki *Angry Birds \\_ kabi \"bosh qahramon\" mavjud.*\n\n**Muhokama qiling:** Talabalarga ekrandagi bu belgi sprayt ekanligini bildiring. Bu dastur tomonidan boshqariladigan grafik. Ushbu darsda talabalar nazorat qilish uchun o'zlarining spraytlarini tanlash imkoniyatiga ega bo'ladilar.\n\nUshbu namoyish va muhokama talabalarga Sprite Lab muhitiga o'tishga yordam beradi.\n\n#### [Suzuvchi baliq o'qituvchisi uchun sandbox](https://studio.code.org/levels/18623)\n\nProyektordan foydalanib, o'quvchilaringizga sandbox darajasini ko'rsating. Maqsad ularga Sprite Lab ishlashining o'ziga xos usullarini ko'rsatishdir. Bir nechta dasturlarni yozing va o'quvchilardan kuzatishlarini baham ko'rishlarini so'rang.\n\n-   _O'tni aylantirish uchun qanday bloklarni ulashimiz kerak?_\n-   _Agar biz spraytga bir vaqtning o'zida ikkita harakatni boshlashni aytsak nima bo'lar edi?_\n-   _Sprite hech qachon bu xatti-harakatlarni o'zi to'xtatadimi?_\n-   _Agar biz uni bosganimizda sprayt harakatni toʻxtatishini istasak, buni qanday qilishimiz mumkin?_\n\nAsosiy mashg'ulotga kirishdan oldin, bugungi dars lug'ati bilan tanishing yoki ko'rib chiqing.",
          "tips": [
            null
          ]
        },
        "68fc4cb4-cf83-491b-a896-0465d95d09a7": {
          "name": "Swimming Fish with Sprite Lab",
          "description": "**Maqsad:** Bugun talabalar o'zlarining baliq tanklarini dasturlashtiradilar. Ular ekranga qandaydir spritlarni qo'yishni o'rganishni boshlaydilar, keyin ularni harakatga keltiradilar. Nihoyat, ular o'zlarining baliq tanklarini o'zlari xohlagan mavjudot va narsalarni qo'shish uchun moslashtiradilar."
        },
        "0e4c9d5d-95f3-4156-ad18-fbd153d4a7df": {
          "description": "**O'tish:** Talabalarni kompyuterlariga o'tkazing. Talabalarni har bir jumboq bo'yicha ko'rsatmalarga rioya qilishga undash. Ularga bu Sprite laboratoriyasini o‘rganishga yordam beradigan ijodiy faoliyat ekanligini tushunishlariga yordam bering. Bu har qanday baholash faoliyati emas.",
          "tips": [
            "Talabalarni savollar/qiyinchiliklar bilan sherigidan so'rashdan boshlashga undash. Javobsiz savollar yaqin atrofdagi guruhga yuborilishi mumkin, ular yechimni allaqachon bilishi mumkin. Talabalardan o'zlari ko'rayotgan muammoni tasvirlab berishlarini so'rang:\n\n-   Nima qilish kerak?\n-   Nima qiladi?\n-   Bu sizga nima deyapti?"
          ]
        },
        "1f719c75-2b20-4f3a-87b7-54e1df07ab6b": {
          "progression_name": "Video: Sprite laboratoriyasi bilan tanishish"
        },
        "a266c420-212a-4352-9dab-0ebb021418cc": {
          "progression_name": "Oldindan ko'rish"
        },
        "2a075c6b-296c-42fb-931a-7f035332357c": {
          "progression_name": "Malaka orttirish"
        },
        "c9efe236-2792-4980-9431-e1bbff631f86": {
          "progression_name": "Video: Spriteni qanday qilish kerak"
        },
        "3f6279d2-20fb-41da-aa6f-80a97efbe8ac": {
          "progression_name": "Amaliyot"
        },
        "048bc86f-ea26-419c-9d73-452f86ff0000": {
          "progression_name": "Bepul o'yin"
        },
        "c5b1c51f-e863-4951-9163-1777993f687b": {
          "name": "Reflection",
          "description": "Talabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsga qanday munosabatdasiz?\n-   Ijodiyroq sahna yaratish qanday taassurot qoldirdi?\n-   Aniq \"to'g'ri\" va \"noto'g'ri\" bo'lmagan darsni tugatish qiyin bo'lganmi?"
        },
        "3c242de5-2944-4439-a772-10f0e2bfd48a": {
          "name": "Exploring Apps",
          "description": "**Buni bajaring:** Talabalarga taqdim etilgan kodni o‘qib chiqing va nima bo‘lishini oldindan ayting. “Ishga tushirish” tugmasini bosgandan so‘ng, o‘quvchilarga o‘zlari qiziq bo‘lgan yoki ularni hayratda qoldirgan narsa haqida mulohaza yuritishlari uchun vaqt bering.",
          "progression_name": "Tadqiqot: namunaviy ilovalar"
        },
        "3d069458-2202-468d-8728-9bfafa300eb7": {
          "description": "\\*Muhokama qiling:\\*\\* Ushbu ilovalar yordamida siz qanday eng qiziqarli tanlovlarni amalga oshirgansiz? Ilovada biror narsani o'zgartirishni hohlagan, lekin tanlash huquqi berilmagan paytingiz bo'lganmi?\n\n**Ilova:** Foydalanilgan ilova haqida o‘ylab ko‘ring va foydalanuvchiga ko‘proq tanlash imkoniyatini berish orqali uni yaxshilash yo‘lini o‘ylab ko‘ring.\n\nVaqt imkon bersa, talabalardan quyidagi usullardan biri yoki bir nechtasi orqali yuqoridagi taklifni ko'rib chiqishlarini so'rang:\n\n-   Ko'ngillilar butun guruh muhokamasida g'oyalarni taklif qilishlari kerak.\n-   Juftlik yoki kichik guruhlar bilan kichik munozarada qatnashing"
        },
        "25d0dd9f-5a89-4a91-a3de-aba0e507aac8": {
          "description": "#### Ko'nikmalarni shakllantirish va amaliyot (20 daqiqa)\n\nUshbu mashg'ulotlar mustaqil o'rganish yoki juftlik bilan dasturlash uchun javob beradi.\n\nTalabalar malaka oshirish darajalarini to'ldirishlari va keyin qolgan vaqtlarini turli Amaliy mashg'ulotlardan tanlashga sarflashlari kerak.",
          "progression_name": "Malaka orttirish"
        },
        "64fbbaf2-d24b-46f6-8f7c-d31e4c26abc6": {
          "progression_name": "Amaliyot"
        },
        "727a30c1-2256-4e3c-aeff-c9a9cf427974": {
          "description": "#### Bepul o'yin (10 daqiqa)\n\nDarsning yakuniy bosqichida o'quvchilar o'z loyihasini tuzishlari mumkin.",
          "progression_name": "Bepul oʻyin: Sahna yarating"
        },
        "84be2102-875d-40ee-af17-903a1eb15736": {
          "name": "Reflection",
          "description": "Bugun siz Sprite Lab-da dasturlar yaratish uchun kod yozishni o'rgandingiz.\n\n**Dastur** - Mashina tomonidan boshqarilishi mumkin bo'lgan narsaga kodlangan algoritm.\n\n**Algoritm** - vazifani bajarish uchun qadamlar ro'yxati."
        },
        "0f4f4f33-0ca3-40e6-8a4a-5841f81794b9": {
          "description": "#### Jurnal\n\nTalabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Ko'rsatmalar:**\nSprite Lab-da o'z dasturlarini yaratishga qiziqqan do'stingizga qanday maslahat berasiz?"
        },
        "39447f20-7ada-42ae-a746-d4d9cb9793c2": {
          "description": "**Buni bajaring:** **algoritm** so‘zini ko‘rib chiqing yoki kiriting: _topshiriqni bajarish uchun qadamlar ro‘yxati._"
        },
        "c4709ef3-6dff-44f9-ab00-7c8d4ceb84de": {
          "name": "Algoritmga rioya qiling",
          "description": "Bugun biz tezkor o'yin bilan boshlaymiz. Ushbu o'yinda men sizga barcha buyruqlarni beraman va sizning vazifangiz algoritmga rioya qilishdir. Buyruqlar har doim \"boshlash\" yoki \"to'xtatish\" bilan boshlanadi. Agar men sizga biror narsa qilishni boshlashingizni aytsam, siz bu xatti-harakatni boshlashingiz va men to'xtatishingizni aytmagunimcha davom etishingiz kerak. Men sizga \"hamma narsani to'xtating\" deyishim mumkin, ya'ni siz hozirgacha sizga bergan barcha xatti-harakatlarimni tugatishingiz mumkin. Biz 3 raund o'ynaymiz va har bir turdan keyin barchangizga bir nechta savol beraman",
          "tips": [
            "Buyruqlar orasida biroz bo'sh joy qoldirishni unutmang. Ushbu bo'limlarning har biri uchun hech qanday muhokamasiz butun ketma-ketlikni ko'rib chiqing va keyin har bir chalkashliklarni tahlil qilish va qayta ishlash imkoniyatiga ega bo'lgandan keyin uni yana takrorlang."
          ]
        },
        "c0b20172-b83c-4b63-a2d5-3283ee1d8ce5": {
          "description": "#### 1-tur (asosiy):\n\n-   Joyda yurishni boshlang.\n-   O'z joyida yurishni to'xtating.\n-   Qarsak chalishni boshlang.\n-   Qarsak chalishni bas qiling.\n-   Joyda yurishni boshlang.\n-   Qarsak chalishni boshlang.\n-   Hammasini to'xtat.\n\n**Muhokama:** _Sizga qarsak chalish aytilganda nima bo'ldi, lekin siz allaqachon o'rningizda yurgan edingiz? Agar sizga birdaniga ikki xil xatti-harakatni boshlash aytilsa nima bo'ladi?_\n\nTalabalar bir vaqtning o'zida bir nechta xatti-harakatlar sodir bo'lishi mumkinligini tushunishlari kerak.\n\n#### 2-tur (O'rta):\n\n-   Qo'llaringizni havoda silkitishni boshlang.\n-   Boshingizni chayqashni boshlang.\n-   Qo'llaringizni havoda silkitishni to'xtating.\n-   Boshingizni chayqashni bas qiling.\n-   Tizlaringizni silkitishni boshlang.\n-   Qush kabi qo'llaringizni silkitishni boshlang.\n-   Tizlaringizni silkitishni to'xtating.\n-   Boshingizni chayqashni boshlang.\n-   Joyda yurishni boshlang.\n-   Qo'llaringizni qushdek chayqashni bas qiling.\n-   Hammasini to'xtat.\n\n**Muhokama:**\n\n_Qanday ko'rsatmalar odamlarni xato qilishga majbur qildi?\nKo'rsatmalarga to'g'ri amal qilishingizga ishonch hosil qilish uchun qanday strategiyalar foydali deb o'ylaysiz?\nNima uchun har bir xatti-harakatni alohida kuzatib borish muhim?_\n\nTalabalar har bir xatti-harakatni alohida to'xtatish kerakligini tushunishlari kerak. Ular har birini alohida kuzatib borishlari kerak.\n\n#### Mashaqqatli\n\n-   Cho'kishni boshlang.\n-   Boshingizni urishni boshlang.\n-   Cho'kishni bas qiling.\n-   Boshingizni urishni bas qiling.\n-   Yuqoriga va pastga sakrashni boshlang.\n-   Boshingizni urishni boshlang.\n-   Hammasini to'xtat.\n-   Qarsak chalishni boshlang.\n-   Qush kabi qo'llaringizni silkitishni boshlang.\n-   Hammasini to'xtat.\n-   Cho'kishni boshlang.\n-   Yuqoriga va pastga sakrashni boshlang.\n-   Hammasini to'xtat.\n-   Tizzalaringizni urishni boshlang.\n-   Boshingizni urishni boshlang.\n-   Hammasini to'xtat.\n-   Chapga aylanishni boshlang.\n-   O'ngga aylanishni boshlang.\n-   Chapga aylanishni to'xtating.\n-   O'ngga aylanishni to'xtating.\n\n**Muhokama:** _Agar ikkita xatti-harakatlar bir-biriga zid bo'lib tuyulsa nima bo'ladi?_\n\n_Bir vaqtning o'zida qo'llaringizni urish va qo'llaringizni urish deyishganda nima qilish kerak?_\n\n_Qanday qilib cho'kkalab tepaga va pastga sakrash mumkin?_\n\n_Bir vaqtning o'zida tizzalaringizni va boshingizni urish kerak bo'lsa nima bo'ladi?_\n\n_Sizga qarama-qarshi tomonga aylanishni aytishganda, odamlarning nima qilayotganini ko'rdingiz?_\n\n_Agar sizga bir vaqtning o'zida chapga va o'ngga aylanishni aytishsa nima bo'lar edi?_\n\nTalabalar ba'zi xatti-harakatlar bir-biriga zid bo'lib, kutilmagan natijalarga olib kelishi mumkinligini tushunishlari kerak. Ikki qarama-qarshi xatti-harakat bir-birini samarali ravishda bekor qilishi mumkin."
        },
        "fcfb7745-6451-4f94-a9c1-23d681360aac": {
          "name": "Spraytlar amalda",
          "progression_name": "Oldindan ko'rish"
        },
        "5ee02837-9f63-4306-84d8-ded40216114f": {
          "progression_name": "Malaka orttirish"
        },
        "a04d7a73-d970-45f1-8c68-6553af32892f": {
          "progression_name": "Amaliyot"
        },
        "41f0b9b2-fd16-427b-808e-d70e4cc5b4f6": {
          "name": "Reflection"
        },
        "9e411d33-77b5-4582-b8e8-dedb36230af5": {
          "name": "Kirish"
        },
        "c1903a35-66ca-4702-8dea-17cea274e921": {
          "name": "Virtual Pet with Sprite Lab"
        },
        "e6d62a4b-b381-4ce6-9301-da64d2be269a": {
          "tips": [
            "Talabalarni savollar/qiyinchiliklar bilan sherigidan so'rashdan boshlashga undash. Javobsiz savollar yaqin atrofdagi guruhga yuborilishi mumkin, ular yechimni allaqachon bilishi mumkin. Talabalardan o'zlari ko'rayotgan muammoni tasvirlab berishlarini so'rang:\n\n-   Nima qilish kerak?\n-   Nima qiladi?\n-   Bu sizga nima deyapti?"
          ]
        },
        "c49517dc-a5ee-45a2-b96c-7396df4fc6ce": {
          "description": "**Eslatma:** Agar boshqotirmalarni baham ko‘rish mumkin bo‘lsa, talabalarga o‘z ishlarini faqat yaqin do‘stlari yoki oila a’zolari bilan baham ko‘rishlarini eslating. Qo'shimcha ma'lumot olish uchun sinfni tomosha qiling yoki ko'rsating **\\*To'xtatib turing va onlayn videoni o'ylab ko'ring**."
        },
        "3633b09a-0215-4fac-b23e-ce1f97c04948": {
          "progression_name": "O‘rganish"
        },
        "922ff562-376a-4669-a127-3e51f785aad8": {
          "progression_name": "Mini-loyiha: Virtual uy hayvonini yaratish"
        },
        "116adfa6-d62e-421c-aeff-c0d7a60cb4f0": {
          "progression_name": "Bepul o'yin"
        },
        "fe969166-bb8d-4f28-b0a6-44222f2743bd": {
          "name": "Reflection",
          "description": "Talabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsga qanday munosabatdasiz?\n-   Uy hayvoningizga yana qanday imkoniyatlarni berishni xohlaysiz?"
        },
        "fc6d358f-d03d-4b63-aefe-bd9c6a8e77a8": {
          "description": "### Virtual uy hayvoningizni energiya bilan ta'minlash (60-90 daqiqa)\n\n![](https://images.code.org/5066103b929a2811e50d5bd54fbb114e-elaSmall.png)\n![](https://images.code.org/6a1508aeb443e243f595f88ecfa9ed7a-mathSmall.png)\n![](https://images.code.org/54b84cd74790e8e37daeff6cd826c185-scienceSmall.png)**Kompyuter fanlari + ingliz tili san'ati + fan**\n\n[Virtual uy hayvoningizni energiya bilan taʼminlash](https://docs.google.com/document/d/1ZwHXzgPKSyO5F-QnYT9cvy2WWKMvZ19-GY6-2FxUCf0/edit?usp=sharing) - bu oʻqituvchilar hamjamiyatimiz tomonidan yozilgan Common Core ELA va Next Generation Science standartlariga muvofiqlashtirilgan ixtiyoriy faoliyatdir. Talabalar virtual uy hayvonlari omon qolish uchun zarur energiyani qanday olishini ko'rsatadigan ilmiy model yaratadilar.\n\n_Manzil qilingan standartlar:_\n\n-   **CCSS.ELA.RI.5.7:** Savolga javobni tezda topish yoki muammoni samarali hal qilish qobiliyatini namoyish qilib, bir nechta bosma yoki raqamli manbalardan olingan ma'lumotlarga asoslang.\n\n-   **CCSS.ELA.RI.5.9:** Mavzu haqida bilimli yozish yoki gapirish uchun bir xil mavzudagi bir nechta matndagi ma'lumotlarni birlashtiring.\n\n-   **5- PS3-1:** Hayvonlarning oziq-ovqatlaridagi energiya (tanani tiklash, o'sish, harakat qilish va tana haroratini saqlash uchun ishlatilgan) bir vaqtlar quyosh energiyasi ekanligini tasvirlash uchun modellardan foydalaning.\n\n-   **5-LS2-1:** O'simliklar, hayvonlar, parchalanuvchilar va atrof-muhit o'rtasidagi materiyaning harakatini tasvirlash uchun model ishlab chiqish\n\n-   **SL.5.5:** Asosiy g‘oyalar yoki mavzularni rivojlantirish uchun kerak bo‘lganda taqdimotlarga multimedia komponentlarini (masalan, grafika, tovush) va vizual displeylarni qo‘shing."
        },
        "76c17257-496f-4d15-a3a8-55d4cde71f32": {
          "description": "Talabalarni sinfga xush kelibsiz va kunning faoliyati bilan qisqacha tanishtiring."
        },
        "d7c09666-3349-4d9b-9c00-0755d08d3165": {
          "description": "Bugun biz chindan ham ijodiy ish qilmoqchimiz. Ijodkor bo'lishning eng sevimli usuli nima?"
        },
        "0934834c-fc69-4996-9ae5-e68654026ddb": {
          "description": "Talabalarni san'at, raqs, musiqa, yozuv kabi ijodkorlikni ifodalash usullarini baham ko'rishga undash.\n\nBugun biz o'z kodimiz bilan ijodiy bo'lishimiz kerakligini tushuntiring. Qaysi turdagi bo'yoqlardan foydalanishni tanlash yoki qanday so'zlar bilan yozishingiz ijodkorlikni ifodalashi mumkin bo'lgani kabi, siz yozgan kod va odamlarning u bilan qanday munosabatda bo'lishini tanlash ham ijodingizni namoyon qilish imkoniyati bo'lishi mumkin!\n\n**Tur va raqsga tushing:** Sinfga e'lon qiling, bugun biz kodlashni raqs bilan ijodiy tarzda qanday uyg'unlashtirishni ko'rib chiqamiz. Farzandlaringizdan 10 soniya davomida tish iplarini silkitishlarini, chayqashlarini yoki ijodiy raqs harakatlarini bajarishlarini so'rang. Ishni boshlashga yordam berish uchun ushbu **\\*Spotify pleylist** dan qo‘shiq ijro etishingiz mumkin. Sinfingizning harakatlarini videoga yozib oling."
        },
        "2188df86-38a9-43c6-ba37-681b3bf62859": {
          "name": "O'zingizning raqs partiyangizni kodlang",
          "description": "#### Musiqa filtrlash\n\nUshbu qo'llanmada mashhur san'atkorlarning qo'shiqlari mavjud. Ushbu qoʻllanmada qoʻshiqlar roʻyxatini oldindan koʻrish uchun ushbu **\\*Spotify pleylistini koʻring.** Biz barcha qoʻshiqlarning radio uchun xavfsiz versiyalaridan foydalanmoqdamiz. 13 yoshgacha bo'lgan talabalar uchun biz musiqani ushbu filtrlangan ro'yxat bilan cheklaymiz. Filtrlangan roʻyxatni yoshi kattaroq oʻquvchilar bilan ishlatmoqchi boʻlsangiz, **\\*Spotify pleylist**ni sinfingiz bilan baham koʻrishingiz mumkin."
        },
        "9a3fff4a-420a-45fd-9409-ec6cecaf15b9": {
          "name": "Daraja bo'yicha qo'llab-quvvatlash",
          "description": "#### Qizdirish; isitish",
          "progression_name": "Video: isinish raqs partiyasi"
        },
        "5398d472-ce7e-4f6b-9a6c-ccfa31ebde30": {
          "description": "-   Chap tarafdagi asboblar qutisidan o'ng tarafdagi ish maydoniga qizil rangni torting, yangi blok yarating. Uni o'rnatish blokiga ulang.\n-   Hozir birinchi dasturingizni yozdingiz. Nima bo'lishini ko'rish uchun Run tugmasini bosganingizga ishonch hosil qiling. Musiqani eshitishingiz va displey hududida belgi harakatlana boshlaganini ko'rishingiz kerak.",
          "progression_name": "Amaliyot"
        },
        "0bb34d8e-12a2-4cb4-935d-0c7b247777ff": {
          "description": "#### Voqealar",
          "progression_name": "Video: Raqs partiyasi tadbirlari"
        },
        "537232f4-4f8e-4dd4-9b51-122c0d012e9a": {
          "description": "#### Voqealar 4-daraja\n\n-   4-5 darajalar raqsni interaktiv qilish haqida.\n-   Yashil bloklar voqea bloklari. Ushbu bloklar yangi kodlar ketma-ketligini boshlaydi va sozlash blokiga ulanishi shart emas.\n-   Yashil hodisalar bloki ostidagi binafsha blokni ulash klaviaturangizdagi to'q sariq rangli o'q tugmachalarini yoki tugmachalarini bosish orqali qahramonni raqsga tushirishga imkon beradi.\n-   Run tugmasini bosgandan so'ng o'q tugmalarini bosganingizga ishonch hosil qiling, aks holda raqqosa(lar) qimirlamaydi.\n\n#### Voqealar 5-daraja\n\n-   Ikkinchi binafsha do bir marta blokni chiqarganingizga ishonch hosil qiling. Sizning ish joyingizda ayiqlar bir marta, mushuklar esa bir marta blokirovka qilishlari kerak. Hodisa bloki bosilganda ikkalasi ham yashil rangga ulanishi kerak.\n-   Run tugmasini bosgandan so'ng strelka tugmachalarini bosganingizga ishonch hosil qiling, aks holda raqqosalar harakat qilmaydi.",
          "progression_name": "Hodisalar"
        },
        "6672d026-0039-4df8-b54f-f0fc92790588": {
          "description": "#### Chora-tadbirlar",
          "progression_name": "Video: Raqs partiyasi tadbirlari"
        },
        "06cef1c1-0946-4a77-acac-e9dec70a1573": {
          "description": "#### 7-darajali o'lchovlar\n\n-   7-8 darajalar raqsni musiqa bilan sinxronlashtirishga qaratilgan.\n-   O'lchovdan keyingi hodisalar bloklari ham kodning yangi ketma-ketligini boshlaydi va sozlash blokiga ulanmasligi kerak.\n-   Yashil rang ostidagi binafsharang do forever blokini ulashdan so'ng hodisa bloki belgini siz ko'rsatgan o'lchovlar sonidan keyin raqs harakatini amalga oshirishi kerak.\n-   Do forever bloki avvalgi darajalarda ko'rilgan do once bloklaridan farq qiladi.\n\n#### 8-darajali o'lchovlar\n\n-   Ikkinchi yashil hodisa blokini chiqarganingizga ishonch hosil qiling. Sizning ish joyingizda 4 o'lchovdan keyin blok va 6 o'lchovdan keyin blok bo'lishi kerak. Ikkalasi ham ostida ulangan binafsha blok bo'lishi kerak.\n\n#### 9-darajali o'lchovlar\n\n-   9-darajali raqqosalar guruhlarini tezda yaratish haqida.\n-   Kichikroq raqqosalar to'plamini yaratish uchun asboblar qutisiga kiritilgan yangi blokdan foydalaning.\n    \\*Yuqorroq “bosh” raqqosa yaratish uchun oddiy make new blokidan ham foydalanish kerak.\n-   Ko'pchilik o'quvchilarga biror narsani kichikroq o'lchamda chizish orqali uzoqroqdek ko'rsatish mumkin degan fikr tanish bo'ladi. Keyingi bosqichda siz ushbu effektni aniq sozlashingiz mumkin.",
          "progression_name": "O'lchovlar"
        },
        "cdbe0374-d0ce-426f-b3b3-def9a99df94a": {
          "description": "#### Xususiyatlar",
          "progression_name": "Video: Dance Party xususiyatlari"
        },
        "22d25455-4f87-44cb-aa36-b5adc00e1ba1": {
          "description": "#### Xususiyatlar 11-daraja\n\n-   11-13 darajalar raqqosalarning xususiyatlarini (masalan, hajmi, rangi) sozlash haqida.\n-   Teal to'plam bloki raqqosalar yaratilgandan keyin dasturning biron bir joyida joylashtirilganligiga ishonch hosil qilish muhimdir. Ushbu jumboqni hal qilish uchun dasturingizning istalgan joyiga belgilangan o'lchamdagi blokni joylashtiring va undan ba'zi raqqosalaringizning o'lchamini o'zgartirish uchun foydalaning.\n-   Guruh sifatida yaratilgan raqqosalarning standart oʻlchami 30. Boshqa raqqosalarning standart oʻlchami 100.\n\n#### Xususiyatlar 12-daraja\n\n-   Oldingi darajada bo'lgani kabi, dasturingizda raqqosalarni yaratganingizdan keyingina o'rnatilgan rangni blokirovka qilish uchun (rang) foydalaning. Misol uchun, uni dasturingizning sozlash maydoniga birinchi qadam sifatida qo'yish hech qanday ta'sir qilmaydi.\n\n#### Xususiyatlar 13-daraja\n\n-   To'g'ri kod bilan siz turli xil ranglar, o'lchamlar yoki raqs harakatlari orqali raqqosa aylanishini ko'rishingiz kerak.\n-   Har 2 o'lchov blokida yashil rang o'zgarishi, ko'k rangli tasodifiy blok yoki binafsha rang bloklari ulanganligiga ishonch hosil qiling.\n-   Forever bloklari (Keyingi), (Oldingi) yoki (Tasodifiy) ga o'rnatilganligiga ishonch hosil qiling. Aks holda, raqqosa belgilangan harakatni qayta-qayta bajaradi.\n-   E'tibor bering, talabalar ushbu darajadagi yozgan kodlarning to'g'riligi tekshirilmaydi. Bu shuni anglatadiki, ular dasturni o'zgartirmasa ham, har doim darajadan o'tadilar. Talabalar o'zlarining kodlari bilan o'zlari uchun qiziqarli bo'lgan usullarda tajriba o'tkazishlari kerak. Davom etish uchun \"Finish\" tugmasini bosing.\n-   Har 2 o'lchov blokida yangi raqqosalarni yaratish sizning dasturingiz bir joyda(lar)da bir nechta bir xil raqqosalarni yaratishiga olib keladi va kutilmagan oqibatlarga olib kelishi mumkin!",
          "tips": [
            "Darsning shu nuqtasida siz ko'rsatmalar kamroq ko'rsatmalarga ega ekanligini sezishingiz mumkin. Talabalarni ijodiy bo'lishga va kiritilgan yangi bloklarni o'rganishga undash. Shu nuqtadan boshlab, talaba kodi **to'g'riligi tekshirilmaydi** muayyan vazifani hal qilish o'rniga tajribani rag'batlantirish uchun."
          ],
          "progression_name": "Xususiyatlar"
        },
        "0b074fdf-834b-4d06-a5da-6c7e0c670b05": {
          "description": "#### Bayram!",
          "progression_name": "Video: Dance Party Party yoqildi!"
        },
        "24c3bf60-f0f7-4395-ae4c-12b4b0746c9f": {
          "description": "#### Bayram! 15-daraja\n\n-   Bu oxirgi daraja juda ochiq. O'quv qo'llanmaning o'zi talabalarga o'z raqslari ustida ishlashda davom etishlari uchun ko'p vaqt berish uchun mo'ljallangan.\n-   **Ulashishni rag'batlantiring:** Agar talabalarda ma'lumotlar rejasiga ega mobil telefonlari bo'lsa, ular tezda o'z loyihalariga havolani o'z telefonlariga yoki do'stlariga SMS yuborishlari mumkin. Agar sizning maktab siyosatingiz ruxsat bersa, ularni shu yerda qilishga undang.\n-   **Ijodkorlikni rag'batlantiring:** Bu dars davomida ijodkorlik muhim, ammo bu boshqa joylardan ko'ra bu erda to'g'ri!",
          "progression_name": "Bepul o'yin"
        },
        "1d794759-7ad3-4ae6-9ca6-2d16a8c492eb": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "99f1d214-501d-425f-87a6-b66407b328aa": {
          "name": "Reflection",
          "description": "Talabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Ko'rsatmalar:**\n\n-   Bugungi mashg'ulot sizga nima yoqdi?\n\n-   Ijodkorlik va informatika o'rtasida qanday bog'liqlik bor?\n\n-   CS nima va bu nima uchun muhim."
        },
        "76eb3380-57fb-4dd4-b693-39bccce3a1b5": {
          "name": "Kursikulyar imkoniyatlar",
          "description": "### Raqqosalarning omon qolishi (45-60 daqiqa)\n\n![](https://images.code.org/f3f1ac23b2159ea18328486c61a7cf24-scienceSmall.png)\n**Informatika + fan**\n\n[Raqqosalarning omon qolishi](https://docs.google.com/document/d/1F1E-qPyfnh7HV1euIjsRX01PZMhbOAA0q447FqRdefo/edit?usp=sharing) oʻqituvchilar hamjamiyatimiz tomonidan yozilgan Keyingi avlod fan standartlariga mos ixtiyoriy faoliyatdir. Dance Party-dan foydalanib, talabalar o'zlari yaratgan muhitga (dunyoga) juda mos keladigan kamida bitta organizmni (raqqosa) tanlaydilar. Talabalarga har bir organizmning (raqqosa) xususiyatlarini sozlash uchun kodning \"xususiyatlari\" bloklaridan foydalanish tavsiya etiladi.\n\n_Manzil qilingan standartlar:_\n\n-   **NGSS.3-LS4-2:** Bir turga mansub shaxslar o'rtasidagi xususiyatlarning o'zgarishi omon qolish, juftlarni topish va ko'payishda qanday afzalliklarga ega bo'lishi mumkinligini tushuntirish uchun dalillardan foydalaning.\n\n-   **NGSS.3-LS4-3:** Muayyan yashash muhitida ba'zi organizmlar yaxshi yashashi, ba'zilari yomon yashashi va ba'zilari umuman yashay olmasligini isbotlovchi dalil tuzing.\n\n-   **IPTITIONAL KENGAYTI: NGSS.3-LS4-4:** Atrof-muhit o'zgarganda va u erda yashovchi o'simliklar va hayvonlarning turlari o'zgarishi mumkin bo'lgan muammoni hal qilishning ahamiyati haqida da'vo qiling."
        },
        "0681ba72-f4b3-4587-ad2b-c4343ee5d7af": {
          "name": "Kirish",
          "description": "Agar sizga qulay bo'lsa, _Yulduzli urushlar_ dan _BB-8_ haqida ma'lumot bering. Ko'p bolalar yoqimli robot bilan tanish bo'lishi mumkin, ammo tanishtirish, albatta, hayajonni oshiradi.\n\nOnlayn boshqotirmalarni torting va sinf oldida qilish uchun jumboqni tanlang. Biz zinapoya naqshlari uchun 10-jumboqni tavsiya qilamiz. Talabalardan qog'ozga jumboqni yechish dasturini yozishni so'rang. Talabalardan takrorlangan bo'laklarni aylanaga aylantiring va takrorlar soni bilan belgilang."
        },
        "109dc08b-1106-4a0d-bc01-7dba9d3a40b2": {
          "name": "Loops with Rey and BB-8",
          "progression_name": "Agar sizga qulay bo'lsa, _Yulduzli urushlar_ dan _BB-8_ haqida ma'lumot bering. Ko'p bolalar yoqimli robot bilan tanish bo'lishi mumkin, ammo tanishtirish, albatta, hayajonni oshiradi.\n\nOnlayn boshqotirmalarni torting va sinf oldida qilish uchun jumboqni tanlang. Biz zinapoya naqshlari uchun 10-jumboqni tavsiya qilamiz. Talabalardan qog'ozga jumboqni yechish dasturini yozishni so'rang. Talabalardan takrorlangan bo'laklarni aylanaga aylantiring va takrorlar soni bilan belgilang."
        },
        "a9ede4c3-8f00-479e-9a63-7d2c45e36469": {
          "progression_name": "Amaliyot"
        },
        "e40c7888-610e-4876-9780-9f426355af66": {
          "progression_name": "Oldindan ko'rish"
        },
        "abb57063-4095-45d3-8ea6-f6a1b59b62e4": {
          "progression_name": "Video: BB-8 bilan bloklarni takrorlang"
        },
        "398815f4-e1bb-4d7c-b2be-2c9380704b3e": {
          "progression_name": "Malaka orttirish"
        },
        "f935eb4e-5cce-4727-b128-12e08a0da6f5": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "573324e5-a391-4e63-8b78-3af1d37a8250": {
          "progression_name": "Amaliyot"
        },
        "1ee50550-1160-4e84-b3d8-72c9260f8c27": {
          "progression_name": "Oldindan ko'rish"
        },
        "4e7de8b3-0096-40ec-8fc1-796fe0a50f36": {
          "progression_name": "Amaliyot"
        },
        "34e6b039-ccae-45fe-9ab7-b690257c8f6c": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "e11dba21-83fa-49a4-9d4f-d30ab72efe16": {
          "name": "Reflection"
        },
        "ac0e42f0-eb1e-4e86-ac7f-9a4a36a9c806": {
          "description": "Ushbu mashg‘ulotlardan o‘quvchilar bilimini oshirish uchun foydalaning. Ular sinfdan tashqarida ishlatilishi mumkin.\n\n### Juda harakatlantiruvchi!\n\n-   Talabalarga ular qila oladigan harakatlar yoki raqs rasmlarini bering.\n-   Talabalar o‘zlarining raqslarini xoreografiya qilish uchun harakatlarni tashkil qilishlari va sikl qo‘shishlari kerak.\n-   Raqslarni qolgan sinfdoshlar bilan ulashishsin.\n\n\\*\\* Qayta ulang \\*\\*\n\n-   Takrorlanuvshi mashhur raqslarning YouTube videolarini toping.\n-   Sizning sinfingiz sikllarni topa oladimi?\n-   Xuddi shu narsani qo‘shiqlar bilan sinab ko‘ring!"
        },
        "5e8e6fbf-ad94-47ff-935e-155e7a92c73f": {
          "name": "Kirish"
        },
        "ca09b8e6-6cc8-4fc5-a47e-3126629b1002": {
          "name": "Sticker Art with Loops",
          "tips": [
            null
          ]
        },
        "95e84aa8-80ce-430c-b12c-92d51483644e": {
          "progression_name": "Mini-loyiha: Sticker Design"
        },
        "6fc84d3c-2f86-40ab-b9bd-cd54d3700fe6": {
          "name": "Reflection"
        },
        "2f0beffd-547f-4c39-aad4-3f475ea744fe": {
          "name": "Kirish"
        },
        "744f5dec-6181-4973-bb05-c46564144240": {
          "name": "Nested Loops in Maze"
        },
        "12894c2b-8f8d-49f7-b339-f1e8f150bfd4": {
          "progression_name": "Amaliyot"
        },
        "fb1eaf7d-a8d3-47c5-9dfd-44aa4d8910b2": {
          "progression_name": "Oldindan ko'rish"
        },
        "b8c7db7b-7f3b-4b89-bde2-705562944f5b": {
          "progression_name": "Amaliyot"
        },
        "f7e03887-22e1-4e97-b1e1-143776678547": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "05284324-e602-4f6c-a656-44ebba6a41c4": {
          "progression_name": "Amaliyot"
        },
        "3080e687-1e30-47e4-bf9a-25346c9486eb": {
          "progression_name": "Oldindan ko'rish"
        },
        "504c0708-e9cc-41e8-86b6-fcdcfc8c93e2": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "4a4f0910-32a3-4438-bcf6-e0206fbb3f32": {
          "name": "Reflection"
        },
        "012a07d9-4401-4f1b-9b2f-0ef2befba91e": {
          "name": "Kirish"
        },
        "071fbf5c-0fc0-4738-a7d1-558290f78934": {
          "name": "Snowflakes with Anna and Elsa",
          "progression_name": "Malaka orttirish"
        },
        "784f33c3-e511-43ab-93b1-8ebb29c48883": {
          "progression_name": "Amaliyot"
        },
        "70819138-46a2-4cab-ae61-d4ed5995e49a": {
          "name": "Reflection"
        },
        "4df80825-7300-4e21-b3ec-5b1ecc62d490": {
          "name": "Kirish"
        },
        "83daad31-f1c9-4d21-897b-a291d39f55df": {
          "name": "Minecraft bilan oldinga qarab",
          "progression_name": "Malaka orttirish"
        },
        "47b5c27a-db1c-4abd-a3c9-4d90561d7d79": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "57cf4b4c-bc9c-480c-8645-715b23cedd68": {
          "name": "Reflection"
        },
        "414b0efd-1356-4677-9c30-303d3c0afb41": {
          "name": "Kirish"
        },
        "13e970f9-2c63-49d0-9995-322afdd7f201": {
          "name": "Asalari bilan If/Else"
        },
        "8504a81d-7f72-44e2-ac40-5fe386544817": {
          "progression_name": "Oldindan ko'rish"
        },
        "99b05859-1e56-404c-ab65-0eabd5009dc8": {
          "progression_name": "Malaka orttirish"
        },
        "2ba5a718-c776-4973-b81b-46c01ee3a611": {
          "progression_name": "Malaka orttirish"
        },
        "ed0aa04b-e740-415f-b009-82f8373ece90": {
          "progression_name": "Oldindan ko'rish"
        },
        "acb76386-861e-420e-affd-2f61655a5423": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "480f26bc-03a7-4014-84de-e4a60e3caf83": {
          "progression_name": "Amaliyot"
        },
        "9419a044-4ad7-4a3f-8718-fc5606ed7958": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "f8ca4dfb-527e-420d-b6ff-5e528347a1f9": {
          "name": "Reflection"
        },
        "6907fcc1-20b3-4705-93f9-dcd271fe873b": {
          "description": "Ushbu mashg‘ulotlardan o‘quvchilar bilimini oshirish uchun foydalaning. Ular sinfdan tashqari mashg‘ulotlar yoki boshqa boyitish sifatida ishlatilishi mumkin.\n\n**To‘g‘ri / Noto‘g‘ri Teg**\n\n-   O‘quvchilarni o‘ynash uchun safga qo‘ying. [Qizil Chiroq / Yashil Chiroq](http://www.gameskidsplay.net/games/sensing_games/rl_gl.htm).\n-   Chaqiruvchi sifatida oldida turish uchun bitta kishini tanlang.\n-   Chaqiruvchi shartni tanlaydi va ushbu shartga javob beradigan har kimdan bir qadam oldinga o‘tishini so‘raydi.\n    -   Agar sizda qizil kamar bo‘lsa, oldinga qadam qo‘ying.\n    -   Agar siz sandal kiysangiz, oldinga bir qadam tashlang.\n-   Quyidagilar kabi jumlalar ishlatib, shartlarni almashtiring \"Agar siz sariq sochli bo‘lmasangiz, oldinga qadam qo‘ying.\"\n\n**Guruhlash**\n\n-   O‘quvchilarni juftlarga yoki kichik guruhlarga ajrating.\n-   Ularga, karta o‘ynash uchun shartlarni qog‘ozda yozishlarini ayting. Masalan:\n    -   Agar karta donasi yuraklar bo‘lsa\n    -   Agar rang qizil bo‘lsa\n-   O‘quvchilarga natijalar uchun shu kabi shartli qog‘ozlar yaratishlarini ayting.\n    -   Bir ball qo‘shing\n    -   Bir ball oling\n-   Shundan so‘ng, o‘quvchilarga, har bir shartli qog‘ozdan uchtasini va uchta o‘yin kartasini tanlashni ayting. Tanlangan tartibga e‘tibor bering.\n-   Uchta qog‘ozdan foydalanib, o‘quvchilarga faqat tanlagan chiziqlar to‘plamidan foydalanib, har xil tartibda uchta turli dasturlar yaratishni ayting.\n    -   O‘quvchilarga, bir nechta shartlarni, ikkinchisibir shartning ichiga qo‘yishlarini tavsiya eting.\n-   Endi o‘quvchilar har uchala dastur uchun bir xil tartibda, o‘zlari chizgan kartochkalar yordamida uchta dasturni bajarishlari ayting.\n    -   Biror ikkata dastur bir xil javobni berdimi?\n    -   Biror bir dastur boshqacha narsani qaytardimi?"
        },
        "137d4f7b-efec-4607-97b0-e4838274a5c9": {
          "name": "Kirish",
          "description": "Talabalar oldida gapda \"while\" dan foydalaning. Talabalardan “hozirda” so‘zi nimani anglatishini so‘rang. Agar _\"teshik bor ekan, uni tuproq bilan to'ldiring\"_ desangiz, ular nima qilishadi? Qachongacha ular buni qilishadi?\n\n\"While\" kabi so'zni ishlatganda, siz kompyuterga tsikl qancha vaqt ishlashini aytish shartiga tayanasiz. Shart - bu sinovdan o'tgan va haqiqat yoki noto'g'ri ekanligi aniqlangan bayonot. Yuqoridagi holatda, agar teshik bo'lsa, shart. Faqat teshik bo'lishi yoki bo'lmasligi mumkin, shuning uchun bu bayonot faqat to'g'ri yoki yolg'on bo'ladi.\n\nTalabalarga yangi turdagi halqa haqida bilib olishlarini ayting. Ilgari talabalar buyruqni ma'lum bir necha marta takrorlash uchun faqat tsikllardan foydalanganlar. Bu erda ular har doim ham buyruqni necha marta takrorlashni bilishmaydi, ammo ular qachon to'xtash yoki qachon davom etishni bilishadi. While tsikllari dasturchiga shart to'g'ri bo'lsa, buyruqni takrorlash imkonini beradi. Oldingi misolda, shart - teshikning mavjudligi.\n\nAgar vaqt bo'lsa, talabalarga while tsiklidan foydalangan holda boshqa vaqtlarni muhokama qilish foydali bo'ladi. Bunga misollar kiradi:\n\n-   To'p oldingizda turgan holda unga qarab yugurish.\n-   Ko'proq suyuqlik uchun bo'sh joy bo'lgan stakanni to'ldirish.\n-   Oldinda yo'l bor ekan, oldinga yuring.\n\n### Onlayn boshqotirmalarni oldindan ko'rish\n\nBugungi onlayn Code Studio jumboqlaridan boshqotirma toping. Biz Puzzle 6 ni tavsiya qilamiz.\n\n-   Sinfdan fermer tuproq uyumiga yetib kelganida nima qilishi kerakligini so'rang.\n    -   U kirni tozalashni boshlash uchun bir oz vaqt oralig'idan foydalanishi kerak.\n-   Qoziq / do bloki mavjud bo'lganda foydalaning. Sinfdan fermerning while tsikli ichida nima qilishi kerakligini so'rang.\n    -   Fermer olib tashlashi kerak 1. Dehqon axloqsizlik bor ekan, \"1 kirni olib tashlashda\" davom etadi. Boshqacha qilib aytganda, axloqsizlik bo'lmasa, 1-ni olib tashlash endi bajarilmaydi!\n\nKodning qolgan qismini to'ldiring va Run tugmasini bosing. Bu nima uchun ishlaganligini sinf bilan muhokama qiling."
        },
        "eb47f00e-2104-4a6e-b415-3457a740405f": {
          "name": "While Loops in Farmer"
        },
        "599f0ab4-6410-4002-9b4a-540e75d4f815": {
          "progression_name": "Malaka orttirish"
        },
        "2590c04c-01f0-4e10-99af-2bf8d06922ca": {
          "progression_name": "Oldindan ko'rish"
        },
        "9ab1ae71-66af-4623-b62a-f064c3c1f6eb": {
          "progression_name": "Malaka orttirish"
        },
        "0a95b61c-de3a-4cb9-a151-c562c5326c89": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "208367ed-d0e5-4b54-98bd-c2925f220711": {
          "progression_name": "Amaliyot"
        },
        "a169da19-bf83-4912-a7b3-3751242c7f9e": {
          "progression_name": "Oldindan ko'rish"
        },
        "8e573a8a-22a7-4169-b45d-5901ba99c8df": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "aeb654df-63a6-4b86-913a-5041ccd70d0a": {
          "name": "Reflection"
        },
        "eababef0-4852-4c6f-b5db-2021e532c24d": {
          "name": "Kirish",
          "description": "Sinfni bir joyga to'plang va ikkita ko'ngillidan sinfda qandaydir yo'nalishda to'g'ri yurishlarini so'rang. Agar ular joyida stulga duch kelsalar, ular o'tishlari kerak. Agar ular devorga etib borishsa, ular o'tirishlari kerak.\n\nBarcha o'quvchilar o'tirgandan so'ng, robotni devorga yoki stulga qanday javob berishini so'rang. Talabalarga eslatib qo'yingki, agar siz stul borligini bilmaguningizcha oddiygina \"Kresloga qadam qo'ying\" deb ayta olmaysiz va har doim ham stul borligini bilmaysiz. Vazifani quyidagi ko'rsatmalarga tarjima qilish foydali bo'lishi mumkin:\n\n-   oldinda yo'l bor ekan\n    -   oldinga yuring\n    -   agar stul bo'lsa, uning ustiga qadam qo'ying\n-   O'tir\n\nTalabalarga ushbu dars davomida shart qo'llashlarini ayting. Ta'rifini bering:\n\n-   **Shart**: Dastur rost yoki noto'g'riligini tekshiradigan bayonot. Agar rost bo'lsa, chora ko'riladi. Aks holda, harakat e'tiborga olinmaydi.\n-   **Shartlar**: Faqat ma'lum shartlar ostida ishlaydigan bayonotlar.\n\nKodingizda shartni qachon ishlatishingiz mumkinligini muhokama qiling"
        },
        "78faf9ff-f8c9-4623-8b19-ebb00866ef62": {
          "name": "Minecraftda shartli bayonotlar: Suv sayohati",
          "description": "Talabalar ushbu darsdan haqiqiy zavq olishadi. Talabalaringizning aksariyati _Minecraft_ haqida eshitgan bo'lishi mumkin, ammo bilmaganlar uchun qisqacha ma'lumot bering.\n\n_Minecraft_ bu kublar o'yini. Siz labirintlar orqali _Aleks_ yoki _Stiv_ sifatida oʻynashingiz mumkin. Siz buyumlarni olishingiz va kubiklardan iborat dunyoni kashf qilishingiz kerak bo'ladi.\n\nBoshqotirmalardan birini sinfga ko'rsating. Barcha savollarga javob berilgandan so'ng, talabalarni kompyuterga o'tkazing va ularga juft dasturlashni boshlashga ruxsat bering.",
          "progression_name": "Video: Minecraft: Voyage Aquatic Introduction"
        },
        "ae2702dd-1b90-4eac-a21e-8cb4a84b6cd1": {
          "progression_name": "Malaka orttirish"
        },
        "11a2db83-caba-4a29-8359-3367bfff4548": {
          "progression_name": "Video: Minecraft: Voyage Aquatic Repeat Until"
        },
        "1604d928-c94d-4496-a973-156b5ce382a9": {
          "progression_name": "Malaka orttirish"
        },
        "de80d136-6c30-4f33-8f97-9cc4800b3ff0": {
          "progression_name": "Video: Minecraft: Voyage Aquatic Conditions"
        },
        "6ebeff6b-35ce-4b04-8570-ea1ef77e68cc": {
          "progression_name": "Malaka orttirish"
        },
        "67444cba-ef3d-49b1-8e8a-d8ee10bafdc6": {
          "progression_name": "Video: Minecraft: Voyage Aquatic tabriklari"
        },
        "828088e0-ab60-429b-ac4b-4317696c271c": {
          "progression_name": "Bepul o'yin"
        },
        "1b800ef1-9bc4-4366-8510-0539d35b80a1": {
          "name": "Reflection",
          "description": "**Ko'rsatmalar:**\n\n-   Bugungi darsda o'zingizni qanday his qilganingizni ko'rsatish uchun tuyg'u yuzini chizing.\n-   Ushbu Minecraft dunyosida qurishingiz mumkin bo'lgan boshqa narsani chizing.\n-   Kimdir shart qo'llagan sahnani chiza olasizmi?"
        },
        "b271b3ef-be85-4b58-9f43-c39fa5026bb9": {
          "description": "Talabalarning bilimini oshirish uchun ushbu tadbirlardan foydalaning. Ular sinfdan tashqari mashg'ulotlar yoki boshqa boyitish sifatida ishlatilishi mumkin.\n\n#### Yana Minecraft\n\nAgar sinfingiz _Minecraft_ muhitini chindan ham yoqtirishini ko'rsangiz, [bu yerda ular onlayn o'ynashi mumkin bo'lgan boshqa \\_Minecraft\\_ o'yinlariga havolalar mavjud](https://code.org/minecraft). Ushbu o'yinlar asosiy kodlash ko'nikmalarini ham o'rgatadi."
        },
        "d5f6ef42-7dc3-4862-a568-590c2a26c7fa": {
          "name": "Kirish",
          "description": "Ushbu darsda talabalar faqat shart to'g'ri bo'lgunga qadar ishlaydigan tsikllar yaratadilar. Talabalarga bu qanday ishlashini tushunishga yordam bering, ularni guruh faoliyatida boshqaring va ba'zi shartlar bajarilgunga qadar harakatni bajaring. Misol uchun: To'xtashni aytmaguningizcha o'quvchilarga burunlariga tegizing."
        },
        "2d3dee9d-1850-4a97-9601-1d869ccccbe7": {
          "description": "#### Onlayn boshqotirmalarni oldindan ko'rish\n\nBugungi Code Studio jumboqlaridan boshqotirma toping. Biz Puzzle 4 ni tavsiya qilamiz.\n\n-   Sinfdan qush cho'chqaga borish uchun nimani takrorlashi kerakligini so'rang.\n    -   Qush oldinga, o'ngga, oldinga, keyin chapga burilishni takrorlashi kerak.\n-   Sinfdan ushbu kodni takrorlash uchun nimadan foydalanishi mumkinligini so'rang.\n    -   Qush bu naqshni \\_cho'chqaga etib borguncha takrorlashi kerak.\n\nKodning qolgan qismini pastadirgacha takrorlash orqali to'ldiring va Run tugmasini bosing. Bu nima uchun ishlaganligini sinf bilan muhokama qiling."
        },
        "db031fa5-7047-46ee-8ccf-49a1f15c696a": {
          "name": "Until Loops in Maze",
          "description": "Kontseptsiyalarni birlashtirish oson emas, lekin bu darajalar to'plami talabalarga shartlardan foydalanishda kodlashning cheksiz imkoniyatlarini ko'rishga yordam berish uchun mo'ljallangan. Agar o'quvchilar while va qadar tsikllari o'rtasidagi o'xshashlik yoki farqlarni tushunishda qiynalsalar, ularga o'xshash iboralarni haqiqiy hayotlarida qanday ishlatishlari haqida o'ylashga harakat qiling.",
          "progression_name": "Malaka orttirish"
        },
        "c7e62f55-0604-4487-8b4f-2b788e45cac6": {
          "progression_name": "Video: Bayonotlargacha takrorlang"
        },
        "02a06c86-4808-4c05-93b2-45ed61a1eb29": {
          "progression_name": "Oldindan ko'rish"
        },
        "b19a320c-8372-4505-90c0-a44255e0ae50": {
          "progression_name": "Malaka orttirish"
        },
        "04c4d948-2e60-4a38-8c5b-9bf7280d029f": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "e695d0b5-156d-4dd7-9785-47d3e834cb16": {
          "progression_name": "Amaliyot"
        },
        "1aae2f0c-e768-4e5b-a26e-cb17235f4d65": {
          "progression_name": "Oldindan ko'rish"
        },
        "2ec4116a-6ea6-453e-8c52-ffc4b55077c0": {
          "name": "Reflection",
          "description": "Talabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsga qanday munosabatdasiz?\n-   To davri va while sikli o'rtasidagi farq nima?"
        },
        "d89fd667-2100-4ea0-ac33-c25c317c1138": {
          "name": "Kirish",
          "description": "Talabalar bugungi kunda tushunchalar bilan tanishtirishga muhtoj bo'lmasligi kerak, chunki ular oldingi darsda ular bilan mashq qilishgan. Buning o'rniga siz kombaynning hikoyasini baham ko'rishingiz mumkin.\n\nO‘rim-yig‘imchi qovoq, salat, makkajo‘xori kabi ekinlarni terib olishga harakat qilmoqda. Biroq, fermer bu ekinlarni qaerga ekkanini unutib qo'ygan, shuning uchun hosilni yig'ishdan oldin har bir o'simlikni tekshirishi kerak."
        },
        "88047116-9c78-4003-99fe-cd24ceb91b93": {
          "name": "Harvesting with Conditionals",
          "description": "Talabalar if / else iboralari, while tsikllari va qadar tsikllari bilan ishlashda davom etadilar. Bu jumboqlar biroz qiyinroq, shuning uchun talabalarni har bir dastur uchun nima bo'lishi kerakligini tasvirlab bermaguncha ular bilan birga qolishga undash.",
          "progression_name": "Video: shartlar bilan yig'ish"
        },
        "f93f7ead-cfbc-494a-bfa3-03ed6ed8e7a4": {
          "progression_name": "Malaka orttirish"
        },
        "d5c88852-7de9-47ce-82d8-f93f6c33b2c0": {
          "progression_name": "Amaliyot"
        },
        "7d64d5dc-765d-4bb4-8664-5d6b8a3ddc1f": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "d21f6b6c-7d91-4877-8e6d-d2c291eaa930": {
          "progression_name": "Amaliyot"
        },
        "e477ffba-5d09-425e-ab4c-c84cbeb23378": {
          "progression_name": "Oldindan ko'rish"
        },
        "b0e26070-0ca9-4033-9497-dcaaf64de124": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "a96ae178-a2f2-4d14-a5e6-622e33ead4ea": {
          "name": "Reflection",
          "description": "Talabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsga qanday munosabatdasiz?\n-   Dasturlarda shart qo'shimchalarning foydali ekanligini qanday ko'rish mumkin?\n-   Agar odamlar faqat if/else iboralarida gapirsa nima bo'ladi? Buning qanday afzalliklari va kamchiliklari bo'lishi mumkin?"
        },
        "fbf95927-5c0c-4980-bbb6-7a4bc75da827": {
          "name": "Kirish",
          "description": "Sinfga funktsiyalar shunchaki nomga ega bo'lgan kodlar bo'lagi ekanligini tushunishga yordam bering. Belgilanganidan so'ng, siz ushbu nomni dasturingizda qayta-qayta ishlatishingiz va kompyuterga o'zingiz tayinlagan kod qismini ishga tushirishni aytishingiz mumkin.\n\nDarsdan boshqotirma toping. Biz 9-jumboqni tavsiya qilamiz. Sinf sifatida, funksiyalardan foydalanmasdan boshqotirma ustida ishlang. Yechimni olganingizdan so'ng, uni oq doskada yoki tepada ko'rsating.\n\n**So'rang:** _Nega shunchaki halqadan foydalana olmaysiz?_\n\nOq doskada yoki tepada dasturni takroriy kodsiz, lekin bir qator bo'sh joy qoldirmasdan qayta yozing. O'sha/o'sha satr bo'shliqlarida funksiyani chaqiring. Yon tomonga qarab, dars maslahatidagi chap misol bloki kabi funktsiyani e'lon qiling. Sinfdan kod hozir nima qiladi deb o'ylashlarini so'rang.\n\nFunktsiyalar dasturlashda nima uchun foydali bo'lishi mumkinligi haqida sinf bilan suhbatni oching. Talabalarni funktsiyalar va tsikllar o'rtasidagi farqni muhokama qilishga taklif qiling.",
          "tips": [
            "Funktsiya bloklari:\n\n![](https://images.code.org/88901576439e1a7b660a87952d4bf7de-E.7-lesson-hint.png)\n\nChapdagi blok funksiya deklaratsiyasi bo‘lib, o‘quvchilar uni nomlaydilar va funksiyani to‘ldirish uchun foydalanadilar. O'ngdagi blok - bu funktsiya chaqiruvi, funktsiya kodini ishga tushiradigan blok. Talabalarga bir nechta funktsiya chaqiruv bloklari kerak bo'ladi."
          ]
        },
        "22f29e56-1a7c-402b-aaf8-bd5bae9e6546": {
          "name": "Minecraftdagi funksiyalar",
          "tips": [
            "Talabalarga g'oyalarni yozish (yoki chizish) uchun qog'oz va qalamlarni berishni tavsiya qilamiz. Bundan tashqari, agar o'quvchilar naqshlarni tan olishda qiynalayotgan bo'lsa, ularni sheriklari bilan qiyinroq jumboqlarda ishlashlarini so'rang."
          ],
          "progression_name": "Video: Minecraft - Agent"
        },
        "2d570216-8519-47e7-bc42-58b9e876dd9e": {
          "progression_name": "Malaka orttirish"
        },
        "b14bedab-3098-4e91-843d-1aad4d569bf4": {
          "progression_name": "Video: Minecraft - Looplarni takrorlash"
        },
        "4da6304f-c60e-4701-b04e-38b38ddf008f": {
          "progression_name": "Malaka orttirish"
        },
        "fb770a14-6507-48bf-96f0-cdd9270ab48b": {
          "progression_name": "Video: Minecraft - Funktsiyalar"
        },
        "94e730d2-235a-408d-8a51-b9ca83fe59e0": {
          "progression_name": "Malaka orttirish"
        },
        "49dffb5b-710d-4480-90b9-da7b93963699": {
          "progression_name": "Video: Minecraft - Tabriklaymiz"
        },
        "0cb275f3-0f5c-4b45-a456-c3acd5a7b82d": {
          "progression_name": "Bepul o'yin"
        },
        "5284ee61-2ef7-4772-8473-6d25d45dbb65": {
          "name": "Reflection",
          "description": "**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsga qanday munosabatdasiz?\n-   Bugun yozgan dasturlaringizda funksiyalaringiz nima qildi? Bu sizga qanday yordam berdi?\n-   Qachon tsikl o'rniga funktsiyadan foydalanish kerak?"
        },
        "d2c0374f-fce3-4290-9058-8a47a9b14357": {
          "name": "Kirish",
          "description": "Shu nuqtada, talabalaringiz allaqachon funktsiyalar bilan tanishishlari kerak. Bu vaqtni ular dasturda funksiyalardan foydalanishning afzalliklari va kamchiliklarini muhokama qilishlari uchun ajrating. Yoki ularni juftlashtiring yoki sinf sifatida muhokama qiling. Artist yoki Bee-da qiyin yoki oson boshqotirma misollaridan foydalanishga harakat qiling.\n\nSinfdan so'rang:\n\n-   _Qachon funksiyadan foydalanasiz?_\n-   _Nima uchun funksiya dasturingizni soddalashtirishga yordam beradi?_\n-   _Sizningcha, funksiyalar dasturlashni osonlashtiradimi yoki qiyinlashtiradimi? Nega?_"
        },
        "e0582255-a83c-4278-8b18-9ce09ac1118d": {
          "name": "Terimchi bilan funksiyalar",
          "description": "#### Onlayn boshqotirmalar\n\nBa'zi boshqotirmalarda o'quvchilar to'ldirishlari uchun oldindan e'lon qilingan funksiya bo'ladi. Talabalar birinchi navbatda butun dasturni funksiyasiz yozishlari, keyin esa dasturda qaysi funksiya foydali bo'lishini aniqlashlari foydali bo'lishi mumkin.\n\nHar bir o‘quvchi har bir boshqotirmani to‘q yashil nuqta bilan yakunlayotganiga ishonch hosil qilish muhim. Agar o‘quvchilaringizdan ba’zilari kodni soddalashtirish va funksiyalardan foydalanishda qiynalayotgan bo‘lsa, sinfingiz ichida tajribali talabalardan iborat guruhlarni aylanib, savollarga javob berish uchun tuzing.\n\nTalabalarga mumkin bo'lgan echimlarni chizishga yordam berish uchun qalam va qog'oz berishni unutmang.",
          "progression_name": "Terimchi (Harvester)"
        },
        "3fe01e47-b3a6-4c39-be65-7bc8a1ca840f": {
          "progression_name": "Amaliyot"
        },
        "a2bdcd68-5873-4a71-82a9-049b343d1e33": {
          "progression_name": "Video: Oddiy funktsiyani qanday yaratish kerak"
        },
        "fe27d175-b9e3-4dfe-9949-bdd2966b2dd4": {
          "progression_name": "Amaliyot"
        },
        "480098ab-4bb6-4713-bf04-3404e93c9fe3": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "ff540d41-6f94-4e4e-affd-0d167ab24093": {
          "progression_name": "Amaliyot"
        },
        "ba634679-9f17-4493-878d-b657dad934a2": {
          "progression_name": "Oldindan ko'rish"
        },
        "bf38bf0f-7ad7-4a0a-af66-0b71c6213644": {
          "name": "Reflection",
          "description": "Talabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsni qanday his qildingiz?\n-   Funktsiya dasturingizga yordam berishi mumkinligiga nima sabab bo'ladi?\n-   “While” tsikllari va “if/else” iboralari dasturingizga qanday yordam beradi?"
        },
        "5f8d119b-736b-416c-b460-0cf8c13f4d49": {
          "name": "Kirish",
          "description": "Sinfga funksiyalardan foydalanishning ikkita asosiy komponenti borligini ayting.\n\n1.  _Deklaratsiya:_ Funksiya deklaratsiyasi funksiyani yaratadi. Funktsiya deklaratsiyasida siz funktsiyani kod bilan to'ldirasiz va funksiyaga nom berasiz. Funktsiyani ishlatishdan oldin uni e'lon qilishingiz kerak.\n\n2.  _The Call:_ Function chaqiruvlari dasturni funksiyadagi kodni ishga tushiradigan narsadir. Funksiyani chaqirish uchun siz dasturga funksiya nomini joylashtirasiz. Funktsiyani dasturda chaqirishdan oldin uning to'g'ri aniqlanganligiga ishonch hosil qiling.\n\nTalabalar funksiyalarsiz kod yozishdan, keyin takrorlangan koddan funksiyalar yaratishdan foyda olishlari mumkin. Agar o‘quvchilar Code.org ish maydonida buni qilishni yoqtirmasalar, o‘quvchilarga o‘z fikrlarini yozish (yoki chizish) uchun qog‘oz va qalamlarni taqdim etishni tavsiya qilamiz."
        },
        "7e8dd7a8-74bd-4ae5-b88c-3656e16328a2": {
          "name": "Rassom bilan funksiyalar",
          "progression_name": "Oldindan ko'rish"
        },
        "1c5351ca-eb12-4915-9840-7740a6492981": {
          "progression_name": "Amaliyot"
        },
        "9e8a729a-c0b8-4d57-ad98-fd2132ad1ec2": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "6f138e96-5674-4760-b888-e6020afed570": {
          "progression_name": "Amaliyot"
        },
        "a4b3a551-7660-45ad-95a6-a404eaef795d": {
          "progression_name": "Oldindan ko'rish"
        },
        "556d480c-8833-4dc1-b5ea-fcbd1ed85890": {
          "progression_name": "Bepul o'yin"
        },
        "bc303f43-1995-42e4-887d-02233e2a5905": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "64524054-11ee-4769-ab63-83921f0fa6d3": {
          "name": "Reflection",
          "description": "Talabalarga o'zlari o'rganganlari, nima uchun foydali ekanligi va bunga qanday munosabatda bo'lishlari haqida yozishlari bugungi kunda olgan bilimlarini mustahkamlashga yordam beradi va kelajakda ular uchun ko'rib chiqish varaqasi tuzadi.\n\n**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsga qanday munosabatdasiz?\n-   Funksiyalar va tsikllar o'rtasida qanday farqlar bor?\n-   Bugun chizgan rasmingizni chizing. Buni yaratish uchun kerakli kodni yoza olasizmi?\n-   Kod yordamida yaratmoqchi bo'lgan rasmingizni chizing. Ushbu rasmni yaratadigan kodni yozish yoki chizishga harakat qiling."
        },
        "95df7387-7459-4b08-a71f-076a99b92bb9": {
          "description": "Talabalarning bilimini oshirish uchun ushbu tadbirlardan foydalaning. Ular sinfdan tashqari mashg'ulotlar yoki boshqa boyitish sifatida ishlatilishi mumkin.\n\n#### Funksiyalar bo'yicha chizish\n\nSinfni 2-3 o'quvchidan iborat guruhlarga bo'ling. Har bir guruhdan qandaydir shakl chizadigan funksiya va shu funksiyadan foydalanadigan dastur yozing. Ijodkorlik yoki guruhlarning diqqat markaziga qarab, talabalarga yaratish uchun shakl berilishi kerak bo'lishi mumkin. Har bir guruh bajarilgandan so'ng, guruhlar dasturlarni o'zgartirsin. Alohida qog'ozda har bir guruh dastur yaratgan narsalarni chizishlari kerak. Keyin guruhlar dasturlar va chizmalarni asl guruhga qaytarishlari kerak.\n\nHar bir guruh o'zlari kutgan rasmni oldimi? Agar yo'q bo'lsa, nima noto'g'ri bo'ldi? Sinfni disk raskadrovka jarayonidan o‘tkazing va qayta urinib ko‘ring."
        },
        "71d834a2-aedf-4d4c-95d4-4961964ad2f9": {
          "name": "Sharh"
        },
        "c69862bf-8fe7-4a68-bb37-ff81924f4bf5": {
          "progression_name": "Oldindan ko'rish"
        },
        "30ab0425-1627-48c1-96fe-419887aa0ae7": {
          "tips": [
            null
          ]
        },
        "515ecad5-bd7d-46e5-b210-53f7e7a3d43b": {
          "tips": [
            null
          ],
          "progression_name": "Malaka orttirish"
        },
        "2a0713a5-ac91-4352-9d68-df19d415fd97": {
          "progression_name": "Amaliyot"
        },
        "045bb481-c045-49d5-874c-41f39b32980b": {
          "name": "Sharh"
        },
        "36962720-1371-45ca-a0b0-f2c29c0aee51": {
          "name": "Reflection"
        },
        "aa72fe0f-492d-4c13-827d-43918664378e": {
          "name": "Kirish",
          "description": "**Muhokama qiling**: _Quyidagi ma'lumotlarning qaysi turlari vaqt o'tishi bilan o'zgaradi?_\n\n-   _Ismingiz_\n-   _Tug'ilgan kuningiz_\n-   _Sizning bo'yingiz_\n-   _Yoshingiz_\n-   _Tashqi havo harorati_\n-   _2+2 ga javob_\n-   _Mamlakatimiz poytaxti_\n-   _Bugungi sana_\n-   _O'yindagi hisob_\n\n**Buni bajaring**: Talabalarga vaqt o'tishi bilan qaysi ma'lumotlar o'zgarishini va qaysi biri o'zgarmasligini muhokama qiling. Ba'zi elementlar kengroq muhokamani keltirib chiqarishi mumkin. Masalan, ismingizni o'zgartirish yoki taxallusni ishlatish mumkin. Bundan tashqari, vaqt o'tishi bilan sizning bo'yingiz o'zgarishini yakunlaydi.\n\n**Reflect**: _O‘zgaruvchida saqlangan narsani qachon o‘zgartirish foydali bo‘ladi?_\n\n**Muhokama maqsadi**: Talabalar o'zgarmas yoki vaqt o'tishi bilan o'zgarib turadigan ma'lumotlarni saqlaydigan o'zgaruvchi yaratishi mumkinligini tushunishlari kerak. Ochkolar bilan o'yinda o'zgaruvchi o'yin davomida foydalanuvchining hisobini kuzatib borish uchun javobgardir. Odatda, bu o'zgaruvchi 0 ga o'rnatila boshlaydi va foydalanuvchi to'plagan har bir ball uchun 1 ga ortadi. Yakuniy ball oxirida o'zgaruvchini chop etish orqali xabar qilinadi."
        },
        "bb115604-d0c7-4483-98c0-2d59d04351bb": {
          "tips": [
            "Ushbu munozara faoliyatining maqsadi talabalarni o'zgaruvchidan foydalangan holda ma'lumotni saqlash va o'zgartirish haqida fikr yuritishdir. Talabalar oldingi darslarda ma'lumotni, masalan, so'rovga kiritish orqali saqlashlarini eslashlari mumkin. Keyingi mashg'ulotlarda talabalar ma'lumotni saqlashning yangi usulini, shuningdek, dastur ishlayotganida ushbu ma'lumotni qanday o'zgartirishni o'rganadilar. Ular vaqt o'tishi bilan o'zgaruvchini qachon o'zgartirish yoki yangilash kerakligini muhokama qilishlari kerak.\n\nMuhokama uchun sinfingiz uchun qaysi strategiya eng mos kelishini oldindan hal qiling. Ba'zi fikrlarga quyidagilar kiradi: T-diagrammasidan foydalanish, juftlikda yoki sinfda muhokama qilish."
          ]
        },
        "19ee68f8-7ad7-4cc9-bcff-866ac6ed254b": {
          "description": "O'zgaruvchida saqlangan qiymat vaqt o'tishi bilan o'zgarishi mumkin.\n\nBiz boshlaganimizda, bizning count o'zgaruvchimiz 0 ga o'rnatiladi. Bir necha soniyadan so'ng u 1 ga ortadi."
        },
        "d51c423f-e3c0-482f-be51-85c0ea2fac87": {
          "name": "Sharh",
          "description": "**Buni bajaring**: Ushbu dars uchun lug'atni ko'rib chiqish uchun dars slaydlaridan foydalaning. Talabalar ushbu tushunchalarning har birini qaerda ko'rganlarini darsdan eslay olishlariga ishonch hosil qiling."
        },
        "be0c1c94-6eec-4c10-b90f-59da0ebb1a63": {
          "tips": [
            "Talabalar ushbu yangi kontekstda o'zgaruvchilar qanday ishlatilishini darhol bilishlarini kutmasliklari kerak, shuning uchun bu savollarni ular ishlayotganda e'tiborga olish kerak bo'lgan narsalar sifatida belgilash yaxshidir.\n\nTalabalar ushbu darsda darajalar bo'ylab o'tayotganda, ular raqamni saqlash uchun o'zgaruvchini qanday o'rnatishni, keyin vaqt o'tishi bilan bu raqamni o'zgartirishni o'rganadilar. O'zgaruvchining qiymatini qanday o'zgartirishni bilish o'yindagi ball kabi o'zgarishlarni kuzatishning kalitidir."
          ]
        },
        "78a9627d-1365-414a-b492-8e2e6fe8892c": {
          "name": "O'zgaruvchilarni sanash"
        },
        "b2d87065-8954-443d-a9be-bb206b411b24": {
          "description": "#### Bashorat (3 daqiqa)\n\n**Buni bajaring**: Talabalarga taqdim etilgan kodni o‘qib chiqing va nima bo‘lishini bashorat qiling. “Ishga tushirish” tugmasini bosgandan so‘ng, o‘quvchilarga o‘zlari qiziq bo‘lgan yoki ularni hayratda qoldirgan narsa haqida mulohaza yuritishlari uchun vaqt bering.\n\n**Buni bajaring**: Talabalarga taqdim etilgan kodni o‘qib chiqing va nima bo‘lishini bashorat qiling. “Ishga tushirish” tugmasini bosgandan so‘ng, o‘quvchilarga o‘zlari qiziq bo‘lgan yoki ularni hayratda qoldirgan narsa haqida mulohaza yuritishlari uchun vaqt bering.",
          "progression_name": "Oldindan ko'rish"
        },
        "3448e98d-17c0-47c5-a924-ce769b817cd5": {
          "tips": [
            "Ushbu dars ikkita bashoratli jumboqni o'z ichiga oladi: biri o'quvchilar o'rganganlarini birlashtirish uchun, ikkinchisi esa darsdagi yangi bloklarni kiritish uchun."
          ]
        },
        "93c42114-b7e6-4d21-9e93-0760e125a7b9": {
          "description": "#### Ko'nikmalarni shakllantirish va o'rganish (10 daqiqa)\n\n**O'tish**: Talabalarni kompyuterlariga o'tkazing. Talabalarni har bir daraja uchun ko'rsatmalarga rioya qilishni rag'batlantirish.",
          "progression_name": "Malaka orttirish"
        },
        "92b27a47-c534-4671-afd1-23a3586897c9": {
          "description": "#### Mini-loyiha (17 daqiqa)"
        },
        "b8a87ad4-50ba-433f-8c86-27093af1fafd": {
          "name": "O‘ylamoq",
          "description": "**Reflect**: _Siz o‘yiningizda o‘zgaruvchilardan qanday foydalandingiz?_\n\n**Muhokama maqsadi**: Talabalar o'z o'yinidagi o'zgaruvchilar vaqt o'tishi bilan o'zgargan qiymatni saqlashini tushunishlari kerak. O'zgaruvchining qiymati to'g'ridan-to'g'ri kodda o'rnatilishi mumkin, foydalanuvchi ilova bilan o'zaro aloqada bo'lganda o'zgartirilishi yoki so'rov kabi bevosita kiritishi mumkin."
        },
        "d87717c8-d527-450d-9bdb-e8932caba6a1": {
          "name": "Sharh"
        },
        "c2ecbddf-b99e-4050-903f-fdd7b6660de9": {
          "progression_name": "Oldindan ko'rish"
        },
        "84a9b36a-0025-40e0-a586-3a4b7922202d": {
          "progression_name": "Malaka orttirish"
        },
        "65203df8-9f72-4d3a-9666-25fd7cb97962": {
          "name": "Reflection"
        },
        "25e6419e-5475-4864-a3db-c05f2d873436": {
          "name": "Kirish"
        },
        "aed9e7b5-5f28-4fef-81d9-35d67a89ce96": {
          "name": "Changing Variables with Bee",
          "progression_name": "Malaka orttirish"
        },
        "d2b5d26b-b1db-4e4f-a83f-db69b32fd541": {
          "progression_name": "Amaliyot"
        },
        "a615a593-2c9c-4eaf-af4d-e20ec484ef9c": {
          "name": "Reflection"
        },
        "4c108344-ee78-432c-bec0-21f055aec442": {
          "name": "Kirish"
        },
        "9d7beb7b-eaf8-43ce-ae6a-2340a5b5c3d8": {
          "progression_name": "Sharh"
        },
        "76edcfa5-1645-4da7-935c-1a2e53367409": {
          "progression_name": "Video: For sikli"
        },
        "aa87a0a5-5dde-4769-92d5-94b9d0063d84": {
          "progression_name": "Oldindan ko'rish"
        },
        "09232a7b-7302-4953-bf68-8d92ccc592e4": {
          "progression_name": "Malaka orttirish"
        },
        "8ff9ffd9-2fd1-42d0-90cf-42f595c4c816": {
          "progression_name": "Amaliyot"
        },
        "ea00f202-5974-43d9-831a-37197acb6673": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "84eb44ea-5fc3-46cf-8aa9-df823a4c76c0": {
          "name": "Reflection"
        },
        "bb3c50cd-8d7e-457a-b39d-2fe3172f0e9e": {
          "name": "Kirish"
        },
        "6632ae59-76a8-4f0d-bb29-fc591020ed93": {
          "name": "Rassom bilan Flor Loops",
          "tips": [
            "Bu jumboqlar juda qiziqarli, ammo bu dizaynlar jismoniy shaklda qanday qilinganligini ko'rish uchun o'quvchilarga transportyorlar, qalamlar va tirnalgan qog'ozlar bo'lishi foydali bo'lishi mumkin. Agar sinfingizda bunday imkoniyat bo'lmasa, o'quvchilarni kompyuter ekranida barmoqlari bilan kuzatishga harakat qiling."
          ],
          "progression_name": "Video: For sikli"
        },
        "0ffc4049-22e7-4dab-8199-b55bfc9463bd": {
          "progression_name": "O‘rganish"
        },
        "e0e39e0f-93b9-40b2-abe5-18886551cf49": {
          "progression_name": "Malaka orttirish"
        },
        "f8950515-c428-4508-b465-0930dcbb9d57": {
          "progression_name": "Bepul o'yin"
        },
        "61a1cba1-c9b5-40c9-bbad-e4633be05b85": {
          "progression_name": "Dars qo‘shimchalari"
        },
        "f9e39772-a5dd-4139-aafb-13d5e7ac4da0": {
          "name": "Reflection",
          "description": "**Ko'rsatmalar:**\n\n-   Bugungi dars nima haqida edi?\n-   Bugungi darsda o'zingizni qanday his qildingiz?\n-   Bugun qilgan dizaynlaringizdan birini chizing. Uni yaratish uchun qanday kod kerak edi?\n-   Qanday dizaynlarni yaratmoqchisiz? Sizningcha, for looplar yoki o'zgaruvchilar ularni yaratishda qanday yordam berishi mumkin?"
        },
        "2db3039b-c245-429c-9232-dd4165a45bb6": {
          "name": "Planning",
          "description": "Talabalarni hayajonlantiring va bugungi faoliyatga tayyorlang!"
        },
        "a22895e0-d3f5-40e3-a99f-66805a7c0e26": {
          "description": "Bizda allaqachon turli loyihalarni qurish imkoniyati mavjud edi. Bugungi kunda bu tajriba ancha ochiq bo'ladi, shuning uchun oldindan rejalashtirishni talab qiladi! Rejalashtirish o'yin yoki boshqa turdagi dasturiy ta'minotni kodlashning juda muhim qismidir. Shunday qilib, biz kompyuterlarga o'tishdan oldin, biz qurmoqchi bo'lgan loyihalarni rejalashtirishga biroz vaqt ajratamiz."
        },
        "464b07bf-434b-4b29-8115-fb7ad1d15f56": {
          "description": "**Tarqatish**: Har bir talaba yoki juftlikka bittadan **\\*Kurs yakuni bo‘yicha loyihani rejalashtirish bo‘yicha qo‘llanma** tarqating. Talabalar bilan yo'riqnomada ko'rsatilgan bosqichlarni ko'rib chiqing, so'ngra ularga buni bajarishga ruxsat bering. Agar kerak bo'lsa, ilova qilingan misolga qarang.",
          "tips": [
            "Agar talabalar ushbu topshiriqni juftlik bilan dasturlashayotgan bo'lsa, bu isinish ular uchun boshqalarning g'oyalarini baham ko'rish va hurmat qilishni mashq qilish uchun ajoyib imkoniyatdir. Talabalar sinfingizda allaqachon mavjud bo'lgan guruh ish normalariga rioya qilishlariga ishonch hosil qiling. Aks holda, kutganlaringiz ustidan chiqish uchun qisqa vaqt sarflang."
          ]
        },
        "926aed8f-c241-4aff-9dac-6045708f27d7": {
          "name": "Kodlash",
          "description": "To'liq rejalashtirish bo'yicha qo'llanmalar bilan jihozlangan talabalar endi o'z loyihalarini hayotga tatbiq etishga tayyor. Ushbu darajalar rejalashtirish qo'llanmasining tuzilishiga mos keladi va o'quvchilarga o'z g'oyalarini kodga aylantirish jarayonida harakat qilishda yordam beradi.",
          "tips": [
            "Talabalar kodlash paytida ko'plab sinov va xatolarni boshdan kechiradilar. Ularning loyihalari asl qamrovining qisqartirilgan versiyalariga aylanishi mumkin. Talabalarga shuni eslatib o'tish kerakki, bunday murosa dasturiy ta'minotni loyihalashda keng tarqalgan. Agar ular rejalashtirgan har bir xususiyatni yarata olmasalar, yaxshi!"
          ]
        },
        "3ecaaeb5-144a-49b0-b912-e61446cd31ed": {
          "name": "Misol loyihalar",
          "progression_name": "Misol loyihalar"
        },
        "77e1eae3-37ee-4b59-8014-30279b618562": {
          "name": "Loyihangizni yarating",
          "progression_name": "Loyihangizni yarating"
        },
        "87e3ea72-c651-4ee5-a33d-17612269cbe3": {
          "name": "Vitrina",
          "description": "Talabalarning ishlarini nishonlash uchun so'nggi 10 daqiqa yoki undan ko'proq vaqtni ularga o'z loyihalarini namoyish qilishlariga imkon bering. Buni ko'p jihatdan qilish mumkin, ammo bu erda bir nechtasi:\n\n-   **Ommaviy demo**: Sinf oldida loyihalarini qisqacha namoyish qilish uchun bir nechta namunali ko‘ngillilarni tanlang. Ular shunday qilganda, rejalashtirishdan kodlash tajribasi ular uchun qanday bo'lganini, shu jumladan ular hali ham amalga oshirmoqchi bo'lgan g'oyalarni aytib bering.\n-   **Pair Playtesting**: Talabalar yoki guruhlar juftlashib, bir-birlarining loyihalarini sinab ko'ring. Ular shunday qilganda, bir-birlariga ijobiy va konstruktiv fikr bildirishlarini so'rang. Bu erdagi afzallik shundaki, talabalar kichikroq muhitda fikr-mulohazalarni taqdim etish va ularga javob berish imkoniyatiga ega bo'ladilar.\n-   **Galereya yurishi**: Barcha talabalar o'z loyihalarini sinovdan o'tkazishga tayyor bo'lishiga ishonch hosil qiling. Talabalarga \"musiqiy stullarni\" boshqa kompyuterga o'tkazishni va sizdan boshqa kompyuterga o'tish signalini olguncha bir necha daqiqa davomida loyihani sinab ko'ring. Buni har bir necha daqiqada takrorlang. Bu yerda tuzilgan muloqot uchun kamroq imkoniyat mavjud bo'lsa-da, bu o'quvchilarga imkon qadar ko'proq tengdoshlarining loyihalarini namoyish qilishlarini ta'minlaydi."
        },
        "a4e7ad08-e07b-4d9b-bc75-838ae92df60d": {
          "name": "Asosiy Lug‘at"
        },
        "5fc2cc60-64ea-4c01-8c9e-21280799d17b": {
          "name": "O‘ylamoq",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatma**: Reflektsiya slaydni ko'rsating\n\n**O'ylab ko'ring:** _Qachon bosqichlar ro'yxatini tartibda bajarishingiz kerak?_"
        },
        "9f5921d9-6813-471c-8c16-40e622971021": {
          "name": "Lug‘at",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Lug'at\" slaydni ko'rsating\n\n-   **Algoritm** - topshiriqni yakunlash bosqichlari ro'yxati.\n\n-   **Xato** - dasturning to'g'ri ishlamayotgan qismi.\n\n-   **Debug** - Algoritm yoki dasturdagi muammolarni toping va tuzating.\n\n-   **Dastur** - bu mashina tomonidan boshqarilishi mumkin bo'lgan narsaga kodlangan algoritm"
        },
        "a37ca2d2-fd44-4b34-ad75-d6caf1c8fffa": {
          "name": "Kirish",
          "description": "#### Robotlar bilan suhbat\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: kirish slaydni ko'rsatish\n\nTalabalarga robotlar nima qila olishi haqida tushuncha berish uchun quyidagi videolardan birini tomosha qiling:\n\n-   [Asimo by Honda](https://youtu.be/QdQL11uWWcI) (3:58)\n-   [Tuxum chizuvchi robot](https://youtu.be/slh5vMIc33I) (3:15)\n-   [Raqsga tushayotgan Lego roboti](https://youtu.be/NPIq5qldbio) (1:35)\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i>\n**Show**: Muhokama slaydni ko'rsating.\n\n**Muhokama:** Tanlangan videoga qarang va talabalardan so'rang:\n\n-   _Robot nima qilishni qanday  bildi deb o'ylaysiz?_\n-   _Robot haqiqatan ham siz aytayotgan gaplarni \"tushunadimi\"?_\n    \\-_Aytganini qilmasa, baloga tushib qolishdan qo'rqadimi?_\n\nUshbu qisqacha muhokamaning maqsadi robotlar o'zini odamlar kabi tutishi mumkin bo'lsa-da, ular faqat o'zlarining dasturlariga javob berishlarini ko'rsatishdir. Talabalar ko'proq odamlarga o'xshab ketadigan filmlar va televideniedagi robotlarga murojaat qilishadi. Ularni real hayotda ko'rgan yoki eshitgan robotlar, masalan, _Roombas_ yoki hatto _Amazon Alexa_ kabi raqamli yordamchilar haqida o'ylashga undang"
        },
        "4e9eaee6-773f-429b-b274-d6c22d4c6457": {
          "name": "My Robotic Friends"
        },
        "3a67bae9-a51b-4f5a-a4c6-99da3b5103b6": {
          "tips": [
            null
          ]
        },
        "825e27c2-a198-45fc-9d3b-d262577a3bc7": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: Symbol tugmachasi slaydni ko'rsatish\n\n**Display:** **\\*Belgili tugma** yoki ruxsat etilgan harakatlarni doskaga yozing – ular butun dars jarayonida ko‘rinadigan joyda ekanligiga ishonch hosil qiling. Sinfga , ular ushbu mashg'ulotda foydalanishlari mumkin bo'lgan faqat to'rtta faoliyat bo'lishini tushintiring\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\">. Ushbu qiyinchilik uchun ular o'zlarining robot do'stlariga faqat kalitda ko'rsatilgan buyruqlar yordamida ma'lum bir stakan to'plamini qurishni buyuradilar.\n\n**Model.** Ko'rsatmalar qanday ishlashini tushuntirish uchun oddiy namunani takrorlab algoritmini qanday yaratiib modellashtirirb va unga rioya qilishni sinfga orgating. Oldingizga bir blok  stakan qo'yish bilan boshlang.\n\n**Displey:** Modellashtirmoqchi  bo'lgan naqshni ko'taring. Oddiy uch stakan naqsh - boshlash uchun ajoyib joy.\n\n<img alt=\"\" src=\"https://curriculum.code.org/media/uploads/image_29uZ9YD.png\" style=\"max-width: 300px; hoshiya: 10px;\">\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: \"Qadamlar ro'yxati\" slaydni ko'rish\n\n**Maslahat:** Sinfdan faqat ruxsat etilgan to'rtta ko'rsatmalardan foydalanib, birinchi ko'rsatma qanday bo'lishi kerakligini so'rang. Birinchi qadam \"kubokni ko'tarish\" bo'lishi kerak. Agar talabalar ro'yxatdan boshqa narsani taklif qilsalar, o'sha harakatni bajaring va ularga xatosini ko'rishga imkon bering. Agar ular ro'yxatda bo'lmagan narsani taklif qilsalar, nosozlikka aniq javob bering va buyruq tushunilmaganligini aniqlang.\n\nKubokni qo'lingizda ushlab, sinfdan birinchi stakan qo'yilgunga qadar sizga ko'rsatmalar berishni so'rang. Bu \"oldinga qadam qo'yish\" va \"orqaga qadam qo'yish\" ikkalasi ham stakan kengligining yarmini siljitishni anglatishini tushuntirish uchun ajoyib joy. Malumot uchun quyidagi rasmga qarang.\n\n[3 stakan naqsh] [0]\n\nTo'liq dizaynni tugatmaguningizcha sinfdan ko'rsatmalarni so'rashda davom eting.\n\nTo'plamingiz tugallangandan so'ng, ular sizga vazifani bajarish uchun qadamlar ro'yxatini berganligini ko'rsating. Bu algoritm. Algoritmlar fikr almashish uchun juda yaxshi, lekin ularni so'zma-so'z bayon qilish uzoq vaqt talab qilishi mumkin. Mana nima uchun ramzlar kerak! Agar algoritmni robot (yoki kompyuter) tushunadigan belgilarga aylantirsa, bu dasturlash deb ataladi.\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Javob kaliti” slaydni ko‘rsating\n\n\\*\\* Ayting:\\*\\* _Bitta mumkin bo'lgan yechim quyidagicha ko'rinadi:_\n\n![3 stakan eritma](https://curriculum.code.org/media/uploads/image_xmBkoQZ_0OrQqsy.png)\n\n**Ko‘ngilli:** Sinfingiz  namunaviy dasturni tugatgandan so‘ng, o‘quvchilardan biri kelib, dastur haqiqatda ishlayotganiga ishonch hosil qilish uchun “robot” rolini o‘ynasin. Kodni \"ishlatish\" paytida ularni ko'rsatmalarni baland ovozda aytishga undang."
        },
        "48318e9d-7631-4d07-ae07-155ddeefe482": {
          "description": "#### Robotlaringizni dasturlash\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ekran**: \"Robotlaringizni dasturlash\" slaydni ko'rsatish\n\n**Guruh:** Talabalarni 4 kishilik guruhlarga ajrating. Har bir guruh ikki juftga bo'linishi kerak - har bir juftlik o'z dasturini ishlab chiqsa, boshqa juftlik buni \"bajaradi\"."
        },
        "9f6dd3b2-d6b8-4680-b50e-84188effd916": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Muhokama slaydni ko'rsating\n\n**Muhokama:** Hamma ozini  robot sifatida sinab ko'rgandan so'ng, tajribalarini muhokama qilish uchun sinfni qayta yig'ing. Ushbu munozaraning maqsadi talabalarga robot va dasturchi sifatidagi tajribalari haqida fikr yuritish imkoniyatini berishdir. Savollar qasddan kengdir, lekin ular talabalarni aniq dastur yozish qiyinchiliklari va ko'rsatmalaringizni sharhlashda robot yoki kompyuterning cheklovlari haqida fikirlashi uchun mo'ljallangan. Xususan, sinfda muhokama qiling:"
        },
        "7733f15a-e54b-4bd2-9387-7fa23efccc01": {
          "description": "-   _Ko'rsatmalarni tuzishda eng qiyin qismi qaysiedi?_\n\n-   _Robot bo'lganingizda, sizga berilgan ko'rsatmalarni bajarishda eng qiyin narsa nima edi?_"
        },
        "5d27fc68-b316-43d0-9f5a-31363b5ff264": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Muhokama (davomi) slaydni ko'rsatish\n\n-   _Robotingiz ularga amal qila boshlaganidan keyin kimdir sizning ko'rsatmalaringizda xato topdimi?_\n\n-   _B qanday xato?_\n\n-   _Nima uchun dasturni yozishda buni sezmadingiz deb o'ylaysiz?_"
        },
        "e24379b7-bf97-4179-948d-ea5af39d8089": {
          "name": "Reflection",
          "tips": [
            null
          ]
        },
        "71572e70-b82e-4aca-b685-910711e02c57": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**Ko'zda tuting:**\n_Robot sifatida ko'rmoqchi bo'lgan o'z stakanlaringizni chizing. Ushbu stakanlar to'plami uchun dastur yarata olasizmi?_"
        },
        "3cb8c1e4-0403-4132-8933-b25bfb5c7985": {
          "name": "O‘ylamoq",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Displey**: “Reflect” slaydni ko‘rsatish\n\n**Mulohaza yuriting:** _Nega robotni “dasturlashda” unga aniq ko‘rsatmalar berish muhim?_"
        },
        "f200bbb3-21c5-4805-ae91-c6418a1309b7": {
          "name": "Lug‘at",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Lug'at\" slaydni ko'rsatish\n\n-   **Algoritm** - topshiriqni bajarish bosqichlari ro'yxati.\n-   **Xato** - dasturning to'g'ri ishlamayotgan qismi.\n-   **Debug** - Algoritm yoki dasturdagi muammolarni toping va tuzating.\n-   **Tartib** - Kompyuterlar ularni o'qiy olishi uchun buyruqlarni to'g'ri tartibda joylashtiring."
        },
        "b5199fed-e3e0-4a59-b01f-e9b40b861d5c": {
          "name": "Kirish",
          "description": "Ushbu dars talabalar  birinchi onlayn tadbir oldidan bir necha hafta davomida o'rgangan bir-biriga bog'liq bo'lmagan ko'plab g'oyalarga asoslanadi. Bu tushunchalarni (masalan, qat'iyatlilik, debbuge, algoritmlar va dasturlar) davra bo'ylab qo'llashingiz juda muhim, shunda sinfingiz onlayn ishida ham ulardan foyda olishi mumkin.\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Muhokama slaydni ko'rsating\n\n**Displey** O‘quvchilarga oldingi darslarda qilgan“Robotlar mening  do‘stlarim” mashg‘ulotidagi stakanlarni ko‘rsating.\n\n**Muhokama:** Talabalarga “Robotlar mening do‘stlarim”da qo‘llanilgan belgilarni eslab qolishlarini so‘rang.\n\n-   _Robot turli strelkalarni o'qisa nima bo'ladi?_\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Korsatma**: Slaydni korsatish \"Debbuge boyicha maslahatlar\"\n\nTalabalarga muammolarni bartaraf etish bo'yicha maslahatlar  taklif qiling:\n\n-   _Birinchi bosqichda hammasi to'g'ri bo'lganmi?_\n-   _Ikkinchisi-chi?_\n-   _Qayerdadur notogri ketmadimi?_\n\n**O‘tish.** Talabalaringiz “Robot mening  do‘stlarim”ni eslab qolishlariga ishonch hosil qilsangiz, oraliq mashqqa o‘tishingiz mumkin."
        },
        "a18732fa-a8a6-4b88-9271-ac93e89a6d0f": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: O'tish harakati slaydni ko'rish\n\nUshbu qisqa mashg'ulot talabalarga qat'iyatlilik va nosozliklarni tuzatish , onlayn hal qilmoqchi bo'lgan jumboqlar bilan bog'lashga yordam beradi.\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: Labirint ko‘prigi slaydni ko‘rish\n\n**Displey:** Darsni ko‘rish uchun **\\*labirintga o‘tish sahifasi** nusxasini loyihalash. Quyidagi  konfiguratsiyada **\\*labirint bloklari** yordamida sahnada harakat bloklarini oldindan joylashtirganingizga ishonch hosil qiling (bu slaydda siz uchun allaqachon sozlangan):\n\n![](https://images.code.org/ac052e9d25e77dd800fbf18871bc5fcf-image-1611178828427.47.39.png)\n\n**Model:** Talabalarga sizda Code.org jumboqlarini onlayn yechish uchun  ish maydoni borligini ayting. Oʻqituvchi sifatida ularga siz SHUNDAY AQLLI ekanligingizni bildiring va bu jumboqni yechish uchun kerak boʻladigan barcha kodlarni allaqachon joylab qoʻying, soʻngra barmogʻingizni (yoki boshqa buyum) bilan harakatlantirib, “yugurish”ingizni kuzatishlarini soʻrang. , yoki boshqa  yo'l bilan.\n\nTez orada siz TNT blokiga duch kelasiz. Ko'ngilsizligingizni  ko'rsating.\n\n**Muhokama:**\n\n-   _Sizningcha, men hozir o'zimni qanday his qilyapman?_\n-   _Ketishim kerakmi?_\n-   _Barcha kodni tashlab, qaytadan boshlashim kerakmi?_\n\n**O'ylab ko'ring:** _TNT bilan toqnash kelmaslik  uchun bu dasturni qanday tuzatishim kerak?_\n\nSlaydda berilgan bloklardan foydalaning va talabalar yechimlarini namoyish qilish uchun ularni ish maydoniga torting.\n\n**Juftlik:** Talabalarga qushni TNTni chetlab o'tishni qanday erishish mumkinligi ustida ishlasin. Sinfingizga qarab, siz ulardan har bir xatoni birma-bir tuzatishni so'rashingiz mumkin (yakka holda) yoki  butun dasturni tuzatish uchun birgalikda ishlashni qulay his qilishlari mumkin.\n\n**Ulashish:** Bloklarni kerakli joyga ko‘chiririb otish uchun ko‘ngillilardan so‘rang. Sinf bilan  dasturni qayta-qayta \"ishhga tushiring\", qush undan talab qilinadigan narsani bajarmaguncha xatolarni tuzatingi. Qat'iylik, umidsizlik va nosozliklarni tuzatish tajribalarini ko'rsatishda davom eting.\n\nSinfingiz cho'chqaga etib kelganida, nafaqat ularning yutuqlarini, balki ularning qat'iyatini ham nishonlang!"
        },
        "3fa1b9bd-496c-4731-90d8-c5710952901e": {
          "tips": [
            null
          ]
        },
        "bcf5bd75-4b36-40fd-bbad-25d48ca1ad52": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Onlayn boshqotirmani tahminiy ko‘rib chiqish slayd\n\n**Model:** Sinf oldida bajarish uchun 5-jumboqni torting. Bu ular ko'prik mashqida ko'rgan jumboq bo'ladi. Sinf bilan bu jumboqni yechayotganingizda, o'quvchilarga xato qilish mumkin emasligini va muvaffaqiyatga erishishning yagona yo'li - qat'iyatli bo'lish ekanligini eslatib turing.\n\n**Muhokama:** _Bu jumboqni qanday yechishni kimdir esladimi?_\n\nO‘qituvchi sifatida, sizga o‘quvchilar o‘z o‘rindig‘ida o‘tirganda muammoni qanday yechish kerakligini eslatib qo‘yishadimi yoki  bloklarni birma-bir olib tashlash uchun kompyuter yoniga o‘tishadimi, buni o‘zingiz hal qilasiz.\n\n**O‘tish.** Talabalar onlayn boshqotirmani amalda ko‘rganlari uchun, ular mustaqil boshqotirma yechishga tayyor bo‘lishlari kerak. Laboratoriyaga boring yoki kompyuterlaringizni olib keling."
        },
        "bb92650a-2be6-4f30-b851-611c2401aa32": {
          "name": "Jahldor qushlar bilan dasturlash",
          "tips": [
            null
          ]
        },
        "a0390c7b-253b-4729-bda9-791ef82df43b": {
          "progression_name": "Malaka orttirish"
        },
        "757cf81a-cc11-4113-8734-0888328aba75": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “8-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Chaqiriq (Challenge)"
        },
        "c0d3a625-32cc-4184-bf79-be7f1066ca97": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “9-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Amaliyot"
        },
        "5c62deea-ea90-4eaa-9d64-de185304d795": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “10-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Oldindan ko'rish"
        },
        "3d28912c-9140-40fb-af73-171c9a7e0176": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “11-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Amaliyot"
        },
        "314f4a1b-1e3f-437f-805a-a0ecbfe8fa62": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Dars qo‘shimchalari” slaydni ko‘rsatish",
          "progression_name": "Dars qo‘shimchalari"
        },
        "fe349de8-9eb2-4503-ae43-5a5241cf6786": {
          "description": "**Dispatch:** O'qituvchilar informatika ta'limida muhim rol o'ynaydi va sinfda hamkorlik va jonli muhitni saqlab turadi. Onlayn faoliyat davomida o'qituvchining roli birinchi navbatda rag'batlantirish va qo'llab-quvvatlashdir. Onlayn darslar talabalarga yo'naltirilgan bo'lishi kerak, shuning uchun o'quvchilar adashib qolganda o'qituvchilar aralashmasligi kerak. Buni qanday qilish haqida ba'zi fikrlar:\n\n-   Iloji bo'lsa, dars davomida juft dasturlashdan foydalaning.\n-   Savollari/muammolari bo'lgan talabalarni sherigidan so'rashni boshlashga undang.\n-   Javobsiz savollarni eng yaqin guruhga yuborish mumkin, ular yechimini allaqachon bilishlari kerak.\n-   Talabalarga debbug jarayonidan foydalanishni eslating.\n-   Talabalardan o'zlari ko'rgan muammoni tasvirlab berishlarini so'rang. Uni nima qilishi kerak? Bu nima qiladi? Bu sizga nima deyapti?\n-   Hafsalasi pir bo'lgan o'quvchilarga umidsizlik o'rganish sari qadam ekanligini va qat'iyatlilik o'z samarasini berishini eslating.\n-   Agar talaba bularning barchasidan keyin hamon adashib qolgan bo'lsa,  xatoni o'zi aniqlashi uchun etakchi savollarni bering.\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Muhokama slaydni ko'rsatish\n\n**Muhokama:** Talabalarni dars yakuni haqida ogohlantirgandan so'ng, ularning e'tiborini jalb qiling va ulardan hozirgina boshdan kechirganlari haqida o'ylab korishlarini so'rang.\n\n-   \\_ Jumboq paytida kimdir xafa bo'lganmi?\\_\n-   _Kimdir qat'iyatli bo'lish kerakligini payqaganmi?_\n\n**O‘tish.** Talabalarni o‘zlari uchun dars haqida o‘ylashga taklif qiling."
        },
        "56c77c77-8074-4fec-b1ee-50ad68c2a10d": {
          "name": "Reflection",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**Ko'zda tuting:**\n_Nima uchun bloklarni ma'lum bir tartibda dasturlash muhim?_"
        },
        "1e38b7d2-95ff-48a4-92f2-b34838d662d6": {
          "description": "Ushbu mashg‘ulotlardan o‘quvchilar bilimini oshirish uchun foydalaning. Ular sinfdan tashqarida ishlatilishi mumkin.\n\n\\*\\* O‘zingizni yarating \\*\\* \n\n Kichik guruhlarda talabalarga o‘zlarining labirintlarini loyihalashtirishlariga  va ularni yechish uchun dasturlar yozish uchun bir-birlariga murojaat qilishlariga ruxsat bering. Qo‘shimcha ko‘ngil ochish uchun talabalar bilan cho‘chqa va qush kabi hayotiy labirintlarni yarating."
        },
        "ea522c1a-0f1d-4224-9a6c-25852564554a": {
          "name": "O‘ylamoq",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\nTalabalardan kundalik hayotlarida duch keladigan muammolar haqida o'ylab korishlarini so'rang.\n\n**Ko'zda tuting:**\n\n-   _Kundalik hayotingizda ishlatmaydigan narsalarni qanday togirlaysiz?_\n-   _Muayyan qadamlar ketma-ketligiga amal qilyapsizmi?_"
        },
        "0d59aa71-1a4e-4fd3-8a95-3f0f23933b47": {
          "name": "Lug‘at",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Lug'at\" slaydni ko'rsatish\n\nUshbu darsda uchta yangi va muhim lug'at so'zlari mavjud:\n\n-   **Xato** - dasturning to'g'ri ishlamayotgan qismi.\n\n-   **Debug** - Algoritm yoki dasturdagi muammolarni toping va tuzating.\n\n-   **Sabr-toqat** - Taslim bo'lmang.\n\nQat'iylik narsalarni turli yo'llar bilan va ko'p marta sinab ko'rganingizda gina yaxshi ishlaydi."
        },
        "e681233b-1029-4530-a3ef-4842b8254aa6": {
          "name": "Kirish",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Labirintda debbuging” slaydni ko‘rsatish"
        },
        "aa294a86-24c0-42a5-b28d-b7d81a9a94d5": {
          "description": "Ushbu bo'limdagi jumboqlar siz uchun allaqachon echilgan (ura!), lekin ular ishlamayapti shekilli (voy!)\nBiz ushbu dasturlardagi muammolarni \"xatolar\" deb ataymiz va \"nosozliklarni tuzatish\" sizning vazifangizdir."
        },
        "507d26f6-e0ec-4b5a-9184-967fbc90c3da": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: \"Nosozliklarni tuzatish\" slaydni ko'rsatish\n\n\\*\\* Ayting:\\*\\* _Dasturingizda xatolik bormi?_\n\n-   _Xatoni topish uchun dasturni bosqichma-bosqich tekshiring._\n-   _Birinchi qadamni sinab ko'ring, ishladimi?_\n-   _Keyin ikkinchisi, hozir chi?_"
        },
        "4423598b-200c-40bc-afb9-4bb1065199cc": {
          "description": "Agar siz hamma narsa satr bo'yicha ishlashiga ishonch hosil qilgan bo'lsangiz, kodingiz o'zi bajarishi kerak bo'lgan narsani qilmayotgan nuqtaga kelganingizda, siz xato topganingizni bilib olasiz. Xatoyingizni topganingizdan so'ng, uni tuzatish (yoki \"nosozliklarni tuzatish\") ustida ishlashingiz mumkin!"
        },
        "1a784a55-fe5e-4577-a0a9-103136628be5": {
          "description": "Agar bu sinfda shov-shuvga sabab bo'ladi deb o'ylasangiz, bugungi jumboq qahramoni _\"Muzlik davri\"_ dan _Scrata_ bilan tanishtirishingiz mumkin. Agar o'quvchilar _Scrat_ bilan tanish bo'lmasalar, g'aroyib olmaxon bilan duch kelgan videokliplarini ko'rsating."
        },
        "1df7d894-eea7-4874-8ae7-b88b4503b76b": {
          "name": "Debugging in Maze"
        },
        "c3172960-9aa5-4221-b1ab-2d35fb80653e": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Labirintda debbuging” slaydni ko‘rsatish"
        },
        "2029eb81-02c4-400f-9c31-585c5a3f2118": {
          "progression_name": "Malaka orttirish"
        },
        "c3c4cc5c-8b5b-4f3f-aa71-9c20db1f148c": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “8-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Chaqiriq (Challenge)"
        },
        "840f0979-0841-4874-9b50-dfa816eb4930": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “9-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Oldindan ko'rish"
        },
        "821cc31c-fbe6-4890-bf1f-4e3c3248149c": {
          "progression_name": "Amaliyot"
        },
        "04d056ec-242f-479a-b11e-eee90775ef0f": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Dars qo‘shimchalari” slaydni ko‘rsatish",
          "progression_name": "Dars qo‘shimchalari"
        },
        "b29c4e41-3e9a-45c7-8132-e66d4af738b9": {
          "name": "Reflection",
          "description": "**<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> \\*\\*Show**: Reflektsiya slaydni ko'rsatish\n\n**Mulohaza:** _Bugun  jumboqlardan  topilgan xatolarni  chizing. Dasturni \"debug\" qilish uchun nima qildingiz?_"
        },
        "02b3715d-7036-47da-84c1-c9478fe67b8f": {
          "description": "Ushbu mashg‘ulotlardan o‘quvchilar bilimini oshirish uchun foydalaning. Ular sinfdan tashqarida ishlatilishi mumkin.\n\n\\*\\* Xatolar qoldirish\\*\\* \n\nO‘quvchilar oldingi darajalardan o‘tib, ularning echimlariga maqsadli ravishda xatolar qo‘shadilar. Keyin ular boshqa talabalardan o‘zlarining ishlarini debug qilishni so‘rashlari mumkin. Buni qog‘ozli jumboqlar bilan ham qilish mumkin. \n\n Boshqa talabalar debug paytida, tanqidlar konstruktiv ekanligiga ishonch hosil qiling. Agar bu sizning sinfingizga muammo tug‘dirsa, boshqa talaba bilan rol o‘ynab, ushbu mashg‘ulotdan oldin hurmat bilan debug qilishni ko‘rsating."
        },
        "fb89a68d-3b84-40eb-8670-33a34ad4431b": {
          "name": "O‘ylamoq",
          "description": "**O'ylab ko'ring:** _Kundalik hayotda qat'iyatli bo'lish qanday muhim?_"
        },
        "7e073b00-f336-4d89-a848-f79ee9a8bc23": {
          "name": "Lug‘at",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Lug'at\" slaydni ko'rsatish\n\n-   **Algoritm** - topshiriqni bajarish bosqichlari ro'yxati.\n-   **Dastur** - Mashina tomonidan boshqarilishi mumkin bo'lgan narsaga kodlangan algoritm.\n-   **Dasturlash** - Dastur yaratish san'ati."
        },
        "505c83de-b318-4a7d-9a4b-9da377a5b0d8": {
          "name": "Kirish",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: \"Yangi blok\" slaydni ko'rsatish\n\n\\*\\* Ayting:\\*\\* _Sarguzashtchi Laurel  xazinani olishi kerak. Bizning yangi \"to'plash\" blokimiz buni amalga oshirishga imkon beradi._\n\nUshbu yangi blok ko'prik mashqlarida batafsilroq muhokama qilinadi."
        },
        "f6bf2eb5-a621-45b5-a038-0dbbb36152ee": {
          "name": "Onlayn boshqotirmalarni sinf bilan ko‘rib chiqish",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: O'tish harakati slaydni ko'rsatish\n\n**Ayting:** _Sarguzashtchi Lorelni barcha xazinalarni to'plashga majbur qiladigan algoritmni tasvirlab bering._\n\nTalabalardan baham ko'rishlarini so'rang. Qarang, yana qancha talabalar bir xil javob berdilar!\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: \"Javob namunasi\" slaydni ko'rsatish\n\n![](<https://images.code.org/8e1740662bab87a9e82b3ccd8f44b5ab-code collect.png>)"
        },
        "2780e63f-ba52-459a-9176-4208568b6163": {
          "name": "Laurel bilan xazina yig‘ish"
        },
        "f3c465c8-b7b0-4b73-8afc-5f30c132f35b": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Dars qo‘shimchalari” slaydni ko‘rsatish"
        },
        "581b9960-a83f-4bdd-87d8-7007977e087c": {
          "progression_name": "Malaka orttirish"
        },
        "eddda354-d5be-46f5-96fb-453befa94962": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “8-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Chaqiriq (Challenge)"
        },
        "c6479440-7f5b-4d91-829d-92cc5daff4fc": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “9-11-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Amaliyot"
        },
        "c6a14661-c9e0-4aab-bf9f-5f90e7210276": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “12-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Oldindan ko'rish"
        },
        "c6cca796-344f-48df-a35f-3b1e0613ee0c": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “13-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Amaliyot"
        },
        "520f7482-b58c-4d37-94b7-fa8c4d83314b": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Dars qo‘shimchalari” slaydni ko‘rsatish",
          "progression_name": "Dars qo‘shimchalari"
        },
        "4ab4040a-556d-4dfd-9d56-8730be8041ac": {
          "name": "Reflection",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**O'ylab ko'ring:** _Bugun boshqotirmalarni yechishni davom ettirdingiz mi?_"
        },
        "ea8d0dcc-28b3-440d-b100-c036b74d9499": {
          "name": "O‘ylamoq",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**O'ylab ko'ring:** _Nima uchun debbuging  ko'rib chiqish muhim?_"
        },
        "7e945f73-76d3-4b83-817d-2b9af9789dd7": {
          "name": "Lug‘at",
          "description": "-   **Burchak** - Shaklning ikki tomoni birikadigan joy, darajasi bilan o'lchanadi"
        },
        "9f1508f1-3a4b-42fb-82fb-d31a0aad9576": {
          "name": "Kirish",
          "description": "Talabalarga burchaklarga kirish sifatida quyidagi videoni ko'rsating:\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Aylanma burchaklarni ko‘rsating: Videoni darajalarda chizing\n\n[Burilishlar va burchaklar](https://www.youtube.com/watch?v=sPKXZBL_Yvs) - talabalar videosi (davomiyligi 2 daqiqa)\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Talabalar uchun tarqatma materialni ko'rsating\n\nTalabalarga turli shakllar uchun ichki va tashqi burchaklarni ko'rsatish uchun **\\*Material** dan foydalaning. Ushbu hujjat tarqatma material sifatida ishlatilishi yoki talabalar uchun plakat sifatida chop etilishi mumkin.\n\n**Hujjatdagi shakllarni muhokama qiling**.\n\n-   _Bu rasmni chizish uchun kompyuterni qanday dasturlashtirgan bo'lardingiz?_\n-   _Ko'rsatmalar qanday tartibda bo'lishi kerak?_\n\nTalabalarga bu jumboqlarda ular hamma joyda chiziq qoldiradigan belgini harakatga keltirishlarini ayting. Talabalar xarakterni turli shakllarni chizishga majbur qiladigan kod yozadilar."
        },
        "285edd36-99af-46e6-ba3a-91300c2ef572": {
          "name": "Kod bilan san’at yaratish",
          "description": "Ushbu jumboq to'plamida rassom endi 90 graduslik burchaklar bilan cheklanmaydi. Jismoniy o'tkazgichlarga ega bo'lish o'quvchilarga kerakli burchaklarni yaxshiroq tasavvur qilishlariga yordam beradi. Aks holda, o'quvchi qaysi burchakdan foydalanishni tanlaganida, sahna burchaklarning tasvirlarini beradi. (Yodda tutingki, ochiladigan menyuda burchak tanlash ikkita bilan cheklangan, bu esa oʻquvchilar ishlashlari kerak boʻlgan variantlar sonini kamaytiradi.)\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Protractor onlayn slaydni ko'rsatish\n\nTalabalarni boshqotirma ustida ishlash uchun kompyuterga yuborishdan oldin ushbu darajadagi vositalardan qanday foydalanish haqida qisqacha ma’lumot berish foydali bo‘ladi. Biz sizga o'tkazgichdan onlayn darsdan foydalanishni ko'rsatish uchun yaxshi boshqotirma sifatida 5-jumboqni tavsiya qilamiz."
        },
        "0b1b669c-1acf-42de-9f59-8182f34db782": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Labirintda debbuging” slaydni ko‘rsatish"
        },
        "efbbafe6-1b5a-4084-be1d-a0adf068fe3c": {
          "progression_name": "Malaka orttirish"
        },
        "12b5328f-3f65-46e2-b3e7-9426b47e1f31": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “8-daraja – Challenge” slaydni ko‘rsatish",
          "tips": [
            null
          ],
          "progression_name": "Chaqiriq (Challenge)"
        },
        "7bfffd70-d646-4e36-adc5-21d888afa1f0": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “9-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Amaliyot"
        },
        "05c4267a-d165-4de4-a19c-a86d0ad3639f": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “10-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Oldindan ko'rish"
        },
        "5e09ab58-a2b1-48ad-89fd-47565cfa09e3": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Dars qo‘shimchalari” slaydni ko‘rsatish",
          "progression_name": "Dars qo‘shimchalari"
        },
        "fb85f373-fbf3-4b4c-a7d4-878c77ab3d99": {
          "name": "Reflection",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Reflektsiya slaydni ko'rsatish\n\n**O'ylab ko'ring:** _Qog'ozga oddiy shaklni chizing va  ishlatish uchun kodni tasavvur qiling. Ushbu kodni shakl yoniga yoza olasizmi?_"
        },
        "38f1faf6-557e-4278-8336-2ae0d394cce1": {
          "name": "O‘ylamoq",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**O'ylab ko'ring:** _O'tgan darsda kodning takroriy satrlarini nima hosil qiladi?_\n_Ular kodning qaysi qatorlarini takrorladilar?_"
        },
        "bcf1fc52-7c45-4c27-928d-9535649691dc": {
          "name": "Lug‘at",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Lug'at\" slaydni ko'rsatish\n\n-   **Loop** - biror narsani qayta-qayta bajarganingizdagi harakat.\n\n-   **Takrorlash** - Yana nimadir qiling."
        },
        "129d2408-3ca5-4a8e-90b1-f5ad3d0e6c48": {
          "name": "Kirish",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: \"Buni eslaysizmi?\" slayd\n\n**Maqsad:** Ushbu umumiy ko‘rinish o‘quvchilarga “Mening robot do‘stlarim” sinfi uchun intensiv dasturlar qanchalik tez bo‘lishi mumkinligini tushunishga yordam beradi.\n\n**Displey:** Ko‘rsatish **\\*Belgi tugmasi**, biz Robot Do‘stlarim ilovasida foydalanganmiz. To'rtta belgining har biri uchun o'quvchilardan robot ushbu ko'rsatmalarga qanday  amal qilishini  ko'rsatishlarini so'rang.\n\n<img alt=\"\" src=\"https://curriculum.code.org/media/uploads/Screenshot-2018-03-13-19.49.03.png\" style=\"max-width: 300px;\">\n\n**Model:** Sinf bilan birga **\\*Shisha yig‘ish g‘oyalari** bo‘yicha oddiy boshqotirma tuzing, qoidalar va terminologiyani eslab qolish uchun bir-biringizga  dasturlashda yordam bering.\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: \"Endi sinab ko'ring!\" slayd\n\nKeyin quyida ko'rsatilganidek, biroz qiyinroq, lekin juda ko'p qadamlarni talab qiladigan jumboqni to'plang.\n\n<img alt=\"\" src=\"https://curriculum.code.org/media/uploads/Screenshot-2018-03-14-18.17.12.png\" style=\"max-width: 300px;\">\n\n**Ko‘ngilli:** Ko‘ngillilardan (yoki ko‘ngillilar guruhidan) buni doskada dasturlashda yordam berishini so‘rang. Agar siz ularni \"kalitdagi belgilardan boshqa belgilar yo'q\" qoidasiga qat'iy rioya qilishga majburlasangiz, ehtimol biroz vaqt talab etiladi!\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: \"Yana bir marta!\" slayd\n\n**Display:** Endi ushbu rasmni oching:\n\n<img src=\"https://curriculum.code.org/media/uploads/Screenshot-2018-03-14-17.59.02.png\" style=\"max-width: 300px;\">\n\nSinfning munosabati qanday?\n\n**Maslahat** Talabalarga oʻzlari yaratmoqchi boʻlgan kodni etkazishning qisqaroq usullarini oʻylab koʻring. (Agar o‘quvchilaringiz “6 marta oldinga siljish” kabi so‘zlarni ishlata boshlasa, ushbu parchani o‘tkazib yuborish mumkin. Chunki bu “olti marta”ni belgilar bilan qanday ko‘rsatish haqida munozarani ochadi.)\n\nTalabalar \"takroriy\" kod g'oyasini shakllantirgandan so'ng, ularga u bilan bog'liq lug'atni bering. Ko'pincha \"biror narsani takrorlash\" va \"biror narsani aylantirish\" atamalari bir-birining o'rnida ishlatilishini ular bilan baham ko'ring."
        },
        "3ff8ec4d-fe12-413a-975d-69e143845e37": {
          "name": "Mening sikllashtirilgan Robot Do‘stlarim"
        },
        "a583dcd9-098b-4af8-bde5-e7c9cb199080": {
          "description": "#### Kirish va modellashtirish\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Mening Loopy Robotic Friends\" slaydni ko'rsatish\n\n**Tayyorlash:** Guruhlar uchun stakanchalar yoki qog'oz kesmalarni tayyorlang.\n\n**Display:** Oldingi stakanlaringizdan dasturni oling va uni sinfga ko'rsating yoki quyidagi dasturdan foydalaning.\n\n[3 stakan eritma] [0]\n\n**O'ylab ko'ring:** Talabalardan ushbu dasturda doimiy ravishda takrorlanadigan ko'rsatmalar namunasini qaerdan topishlari mumkinligi haqida jimgina o'ylab ko'rishlarini so'rang (bitta strelka qayta-qayta takrorlanadi).\n\n**Juftlik:** Sherigingizga murojaat qiling va topilgan takrorlanuvchi naqshlardan biri haqida gapirib bering.\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: \"Javob namunasi\" slaydni ko'rsatish\n\n**Model.** Sinf tomonidan topilgan takrorlanuvchi naqshlardan birini ishlatib,  ko'rsatma yoki naqshni qanday qilib aylana olishni modellashtiring, o'sha doira yoniga choklar sonini yozing, so'ngra qolgan o'qlarni kesib tashlang.\n\n![aylanma kodi](https://curriculum.code.org/media/uploads/codeloop_EVpjnMz.png)\n\nBuni butun dastur qisqartirilguncha takrorlang va keyin dasturni qayta yozing, shunda talabalar ko'rsatmalar qanchalik oson ekanligini ko'rishlari mumkin."
        },
        "fcc81bb0-b063-403b-90e0-8206f5a66b9c": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Loop Your Robots\" slaydni ko'rsatish\n\n**Aytib bering:**\n\n-   Guruhingizga kirganingizdan so'ng, sheriklarga bo'ling.\n\n-   Kuboklarni bezash g'oyalariga qarang.\n\n-   Hamkoringiz bilan birgalikda robotingiz uchun bitta dizaynni tanlang.\n\n![](<https://images.code.org/ff04a9994e4d65688eb2833e5e4d04e7-cup stack ideas.png>)"
        },
        "b1974523-e458-4364-aeb2-80f00e6de4bd": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: dastur slaydni ko'rsatish\n\n**Aytib bering:**\n\n-   _Faqat strelkalar yordamida stekni qanday qurish kerakligini muhokama qiling._\n\n-   _Algoritmingizni qog'ozga tushiring._\n\n-   _Har qanday takrorlanadigan amallarni halqa bilan almashtiring._",
          "tips": [
            null
          ]
        },
        "9ed22a0d-5061-4e5d-aa31-20ca315e5c6c": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Robotlaringizni ishga tushirish va debbuging qilish\" slaydni ko'rsatish\n\n**Aytib bering:**\n\n-   _Robot bo'lish vaqti keldi!_\n-   _Guruhingizdagi boshqa hamkorlar bilan algoritmlarni almashing._\n-   _Xatolardan ehtiyot bo'ling. Agar buni kuzatsangiz, robotdan ko'rsatmalarga iloji boricha amal qilishini so'rang._\n-   _Xatoni hamkorlaringiz bilan muhokama qiling va yechim toping._\n-   _Algoritm ishlamaguncha uni sinab ko'ring!_\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Muhokama slaydni ko'rsatish\n\n**Muhokama:** Barcha juftliklar o‘z dasturlarini ishga tushirishga muvaffaq bo‘lgach, bir necha kishidan o‘z yechimlarini sinf bilan baham ko‘rishlarini so‘rang. Guruhlar bir xil jumboqning turli yechimlarini qanday topishganini muhokama qilish uchun ushbu imkoniyatdan foydalaning. Xususan, har bir dasturdan so'rashingiz mumkin:\n\n-   _Siz biron bir loopsni aniqladingizmi?_\n-   _Bu tsikllarni yozishning boshqa usuli bormi? Qanday?_"
        },
        "373c8a50-ff0d-4677-98aa-a2492f33c9f2": {
          "name": "Reflection",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**O'ylab ko'ring:** _Qaysisini tushunish osonroq: loops dasturlarmi yoki qo'lda yozilgan dasturlarmi? Nega?_"
        },
        "6ad48bbf-6b60-4210-99ba-722ef48e2ea4": {
          "name": "O‘ylamoq",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**Ko'zda tuting:**\n\n-   _Looplar nima?_\n-   _Nima uchun biz ulardan foydalanamiz?_"
        },
        "25f3c528-ac14-47ff-b254-cd071d8737ff": {
          "name": "Lug‘at",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Lug'at\" slaydni ko'rsatish\n\n-   **Loop** - biror narsani qayta-qayta bajarganingizdagi harakat.\n\n-   **Takrorlash** - Yana nimadir qiling."
        },
        "be9470c8-795f-4e1d-83f2-069961c852d2": {
          "name": "Kirish",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: sikllarni topish slaydni ko'rsatish\n![](<https://images.code.org/17dc6c40c0b81926fc7ed359c2770b4f-find the loops.png>)\n\nTalabalar bilan “Mening loopy robot do‘stlarim” mashg‘ulotini ko‘rib chiqing:\n\nTalabalarga sinfning qolgan qismi tomonidan bajarilishi kerak bo'lgan dasturni (takroriy qadamlar bilan) tezda ko'rsating. Sinfning qolgan qismidan dasturdagi halqalarni topib, ularga ishora qilishni so‘rang.\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Javoblar kaliti slaydni ko'rsatish\n[][bir]\n\nAgar sizga qulay bo'lsa, menga _Yulduzli urushlar_ filmidagi _BB-8_ haqida gapirib bering. Ko'p bolalar yoqimli robot bilan tanish bo'lishi mumkin, ammo u bilan tanishish qiziqish uyg'otadi."
        },
        "a36ffc45-1507-4d23-b7c0-f095cd7c0550": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: O'tish harakati slaydni ko'rsatish\n\nUshbu faoliyat My Loopy Robotic Friends-dan bog'lanmagan tushunchalarni talabalar o'tayotgan onlayn dunyoga olib kirishga yordam beradi. Sinfingiz bilan bajarish uchun quyidagilardan \\_ birini\\_ tanlang:"
        },
        "6adb6ede-2fc4-47f7-97d8-32cd0c02402f": {
          "name": "Onlayn boshqotirmalarni sinf bilan ko‘rib chiqish"
        },
        "fe682113-6220-4a20-b2a7-009bde3d8e27": {
          "name": "Loops with Rey and BB-8",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Displey**: “Rey va BB-8 bilan dasturlash” videosini ko‘rish"
        },
        "336c18d5-0c32-44c2-b35c-a6f7eec5abff": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “2-daraja – Challenge” slaydni ko‘rish",
          "progression_name": "Malaka orttirish"
        },
        "4faf8753-aee7-43d6-9f6f-0e0033aa315f": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “3-daraja – Challenge” slaydni ko‘rish",
          "progression_name": "Oldindan ko'rish"
        },
        "ac539445-fa4c-45cd-8d04-d794a3041826": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Displey**: “4-daraja – BB-8 bilan bloklarni takrorlash” videosini ko‘rish"
        },
        "78b79d53-246f-40a9-ab3a-557fba2f5c1a": {
          "progression_name": "Malaka orttirish"
        },
        "70017f05-4f16-45ff-9175-91445fd1802d": {
          "progression_name": "Chaqiriq (Challenge)"
        },
        "0c3ea776-e22f-422f-b617-998f13aa2ff5": {
          "progression_name": "Amaliyot"
        },
        "d952a432-408a-4c84-adf2-d3a023cce77c": {
          "progression_name": "Oldindan ko'rish"
        },
        "f26e056f-e9c9-4a0a-95f8-64e3044c86c9": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “14-daraja – Challenge” slaydni ko‘rish",
          "progression_name": "Amaliyot"
        },
        "a9c1c890-7b91-4f1a-a207-155306c84f5e": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Dars qo‘shimchalari” slaydni ko‘rsatish",
          "progression_name": "Dars qo‘shimchalari"
        },
        "58e08b96-df9d-4862-98c6-872f29a5e215": {
          "name": "Reflection",
          "description": "**Ko'zgu:** _Qayta-qayta takrorlanadigan narsa haqida o'ylab ko'ring. Buning uchun dastur qanday ko'rinishi mumkin?_"
        },
        "ab2c8aa4-322c-4ac6-b003-7fbf0dfb807b": {
          "description": "Ushbu mashg‘ulotlardan o‘quvchilar bilimini oshirish uchun foydalaning. Ular sinfdan tashqarida ishlatilishi mumkin.\n\n### Juda harakatlantiruvchi!\n\n-   Talabalarga ular qila oladigan harakatlar yoki raqs rasmlarini bering.\n-   Talabalar o‘zlarining raqslarini xoreografiya qilish uchun harakatlarni tashkil qilishlari va sikl qo‘shishlari kerak.\n-   Raqslarni qolgan sinfdoshlar bilan ulashishsin.\n\n\\*\\* Qayta ulang \\*\\*\n\n-   Takrorlanuvshi mashhur raqslarning YouTube videolarini toping.\n-   Sizning sinfingiz sikllarni topa oladimi?\n-   Xuddi shu narsani qo‘shiqlar bilan sinab ko‘ring!"
        },
        "b57a66a7-3da1-4c20-8d0a-9b5da066c07e": {
          "name": "O‘ylamoq",
          "description": "Hozirgacha o‘quvchilar “Labirint” boshqotirmalarida faqat ilmoqlardan foydalanganlar. Bu jumboqlar takrorlanuvchi harakat ko'rsatmalariga qaratilgan. Ushbu bosqichda bir nechta narsalarni bir joyda to'plash uchun halqalardan foydalaniladi.\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**Mulohaza:** _Bugun biz kod bilan hosilni yig'ib olamiz._\n\n_Harvester jumboqlarida bir joyda ko‘p narsalar bo‘lishi mumkin._\n\n_Qanday qilib biz ilmoqlardan istalgan sonini ikkita blokda to'plashimiz mumkin?_"
        },
        "3c79c590-2f48-4931-b8fa-736281002766": {
          "name": "Lug‘at",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Lug'at\" slaydni ko'rsatish\n\n-   **Loop** - biror narsani qayta-qayta bajarganingizdagi harakat.\n-   **Takrorlash** - Yana nimadir qiling."
        },
        "d9c07104-b142-42fc-abf8-4b34d8429b7a": {
          "name": "Harvesting Crops with Loops",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Displey**: “Harvester” videosini ko‘rsatish"
        },
        "38b1f726-8881-479b-a9e5-7fd354aacf31": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: \"2-8-darajali - Ko'nikmani rivojlantirish\" slaydni ko'rsatish\n\nTalabalar harakatni takrorlash uchun halqalardan foydalanganda (masalan, qovoq terish), ularni harakatdan oldin va keyin harakatlar haqida o'ylab korishlarini taklif qiling. Bu harakatlarni ham halqaga kiritish mumkinmi?",
          "progression_name": "Malaka orttirish"
        },
        "7d2a391e-fb8f-4791-841a-f31ddac790b7": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “9-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Chaqiriq (Challenge)"
        },
        "e68467ed-58ff-45fe-b064-90e8dbca1c3d": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “10-12-daraja – Challenge” slaydni ko‘rsatish",
          "progression_name": "Amaliyot"
        },
        "be50d0ba-53db-4cb0-b970-f8fda6cf3ec1": {
          "progression_name": "Oldindan ko'rish"
        },
        "d83224a8-1d43-4640-9bd6-929d52011c77": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Dars qo‘shimchalari” slaydni ko‘rsatish",
          "progression_name": "Dars qo‘shimchalari"
        },
        "63b4337c-4ae6-43ee-99ae-3f637cd0c29d": {
          "name": "Reflection",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**O'ylab ko'ring:** _Kodingizda tsikllardan foydalanishga ikkita misol keltiring._"
        },
        "97ec11ba-87bb-4b11-9a21-da5ebf94b45b": {
          "description": "Ushbu mashg‘ulotlardan o‘quvchilar bilimini oshirish uchun foydalaning. Ular sinfdan tashqarida ishlatilishi mumkin.\n\n\\*\\* Materiallarni to‘plash \\*\\* \n\n-   O‘quvchilarga ish stollari (qalam, o‘chirish moslamasi va boshqalar) ustida uyumlarni yaratsinlar \n-   Sheriklari har bir guruhni yig‘ib terimchining uyumdan uyumga yurib,  qanday qilib yo‘l bo‘ylab narsalarni terishni aniqlab bersin. \n-   Dasturlarni sinfning qolgan qismi bilan ulashing."
        },
        "9fde8e2d-856f-4b87-924a-15d076522654": {
          "name": "O‘ylamoq",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**Ko'zgu:** _Agar siz faqat stikerlardan foydalangan holda san'at yaratgan bo'lsangiz, dizayningiz qanday ko'rinishga ega bo'lar edi?_"
        },
        "305f3738-2a15-46f7-bef1-c405a63b948d": {
          "name": "Lug‘at",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Lug'at\" slaydni ko'rsatish\n\n-   **Loop** - biror narsani qayta-qayta bajarganingizdagi harakat.\n\n-   **Takrorlash** - Yana nimadir qiling."
        },
        "f4370643-7030-4064-a1a5-5d5385a91c80": {
          "name": "Kirish",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Slaydni umumiy ko'rinishini korish\" \n\n-   Shu nuqtaga kelib, talabalar allaqachon tsikllar haqida etarli ma'lumotga ega bo'lishlari kerak. Sinifingizga foyda keltirishi uchun, biz quyidagilarni tavsiya qilamiz:\n    \"Loopga kirish\" da bo'lgani kabi, ilmoqlar bilan yangi raqs yarating.\n-   Sinf bilan birga \"Rey va BB-8 bilan halqalar\" jumboqini yeching.\n-   \"Artist dan\" jumboqini o'ynab, undan qanday foydalanishni o'rganing.\n-   Ushbu darsdagi boshqotirmani oldindan ko'ra biling.\n\nBu variantlarning barchasi halqalarni yoki rassomni oldindan ko'rib chiqadi, va sizning sinfingizni onlayn jumboqlar bilan qiziqarli o'yinga tayyorlashga yordam beradi!"
        },
        "f5af8f45-b9fa-46f2-8006-05af25fe0b04": {
          "name": "Sticker Art with Loops",
          "tips": [
            null
          ]
        },
        "5bee125c-0e5e-46a8-b72b-fdc8a71f5161": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “1-8-daraja – Challenge” slaydni ko‘rsatish"
        },
        "c5f36648-ac0d-405f-af7a-3020ebdce7f3": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"9-darajali - Bepul o'yin\" slaydni ko'rsatish.\n\n**Aytib bering:**\n\n-   _O'z stiker san'atingizni yarating._\n-   _Dizayningizni rejalashtiring._\n-   _Dizayningizni dasturlang._\n-   _Dizayningizni dars oxirida baham ko'ring._"
        },
        "5ef885b2-0000-4e19-b7be-39fe06f3b7e7": {
          "name": "Reflection",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Displey**: “Reflect” slaydni ko‘rsatish\n\n**Reflect:** _Siz qaysi shakl yoki figurani dasturlashni xohlaysiz? Uni yaratish uchun kodni topa olasizmi?_"
        },
        "1d2e55e1-c5d3-4689-a7ab-824bdc250f02": {
          "name": "O‘ylamoq",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**O'ylab ko'ring:** _Qachon qilgan harakatingiz tufayli biror narsaga erishtingiz?_\n_Masalan, siz kalitni aylantirdingiz, chiroq yondi._"
        },
        "438866ae-0223-4f9f-badd-3457a85f7c7a": {
          "name": "Kirish",
          "description": "#### Bir qator tadbirlar\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: Slaydni ko'rsatish \"Keling, bu erda naqsh topamizmi yoki yo'qmi\"\n\n**Ayting:** _Keling, bu yerda naqsh topa olamizmi:_\n\n-   _Qurilmani bosganingizda ilova ishga tushadi._\n-   _Budilnik chalganda, siz yotoqdan turasiz._\n-   _Qachon (voqea)_, _(harakat)_.\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Keyingi\" slaydni ko'rsatish\n\n**Ayting:** _Odatda biz \"hodisa\" so'zini eshitganimizda quyidagini o'ylaymiz:_\n\n-   _Ekskursiya_\n-   _Musobaqa_\n-   _Tug'ilgan kun bazmi_\n\n_Bugun biz \"voqea\" so'zining yangi ma'nosini o'rganmoqdamiz._"
        },
        "b5d0ecce-50d3-4d8f-8143-eb3bcd6a52b0": {
          "name": "Lug‘at",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Lug'at\" slaydni ko'rsatish\n\nUshbu darsda bitta yangi va muhim lug'at so'zi mavjud:\n\n**Hodisa**. Hodisa - bu biror narsa sodir bo'lishiga olib keladigan harakat."
        },
        "8816065c-5d3c-4cc9-95a3-f96c88edbb62": {
          "name": "Katta hodisa"
        },
        "81ac2e94-8470-41a8-a506-505bf1bd3fac": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: \"Buni eslaysizmi?\" slayd\n\n\\*\\* Ayting:\\*\\* *Labirintdagi jumboqlarda Angry Birds-dan _Red_-ni cho'chqaga olib borganingizni eslaysizmi? Siz boshidan oxirigacha hech qanday uzilishlarsiz Reddan foydalangan dastur yozdingiz.*\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ekran**: \"Foydalanuvchiga variantlarni berish\" slaydni ko'rsatish\n\n**Ayting:** _Ko'pgina dasturlarda bizga ko'proq funksiyalar kerak._\n_Faqat barmog‘im telefon ekranida turgandagina qahramonim harakatlanishini xohlasam-chi?_\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: O'yinni boshqarish slaydni ko'rsatish\n\n**Ayting:** _Barmog‘im telefonim ekranida bo‘lgandagina mening qahramonim  belgini dasturlashi kerak._\n_Ekranda barmog‘imga turganida, mening qahramonimni harakatga keltiradigan voqea bo‘lishini bilishi kerak._\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: \"Biz voqealardan foydalanganda\" slaydni ko'rsatish\n\n**Ayting:** _Oldingi darslarda biz bir vaqtning o'zida bir necha bosqichda do'st bilan yoki boshqa belgini boshqarish imkonini beruvchi algoritmlarni yaratgan edik._\n\n_Bu qiziqarli va foydali bo'ldi, lekin do'stingizdan nima qilishini xohlayotganingizni oldindan bilmasangiz nima bo'ladi?_\n\n_Hodisalar shu yerdan boshlanadi!_",
          "tips": [
            null
          ]
        },
        "48b46425-96d8-47ab-940e-3b81fe50c6ac": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Voqealar boshqaruvchisi slaydni ko'rsatish\n\n**U erga qanday borish mumkin:**\n\n-   Sinf ekraningizga **\\*Voqealar boshqaruvchisi**ni loyihalashtiring.\n\n![](https://code.org/curriculum/docs/csf/c2_TheBigEvent1.png)\n\n-   Har bir tugma nima bajarishiii sinfingiz bilan hal qiling. Bizning taklifimiz:\n    -   Yashil yulduz -> Qarsak chalish\n    -   To'q sariq uchburchak -> Qo'llar havoda\n    -   Moviy olti burchakli -> Qo'llar sonda\n    -   Binafsharang doira -> Aylantirish\n    -   Pushti to'rtburchak -> Stomp\n\n-   Sinfingiz reaksiyaga kbildirishi uchun ekrandagi tugmalarni bosishni mashq qiling.\n\n-   Aralashmaga ba'zi tugmalar ketma-ketligini qo'shing va o'quvchilardan ularning harakatlarini kuzatishni so'rang.\n\n-   Sinfingizga aytingki, har safar tugmani bosganingizda, bu ularga keyin nima qilish kerakligini bilish imkonini beruvchi voqea.\n\n-   Buni qiyinlashtirish uchun sinfni alohida topshiriq bilan boshlang, so'ngra tugmalar bilan yana to'xtatib qo'ying. Bizning taklifimiz\n    -   10 gacha sanang\n    -   \"Old MacDonald\" ni kuylash\n\n-   Talabalar har bir tugmani bosish ularni biror amalni bajarishga majburlashi haqidagi fikrni o'zlashtirmaguncha mashq qiling."
        },
        "0d3df68e-6189-4deb-81c2-3ec1f4a43b63": {
          "name": "Ixtiyoriy baholash (5 daqiqa)",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Baho slaydni ko'rsatish\n\n-   **\\*Baholash** tarqating va ko‘rsatmalar yaxshi tushuntirilgandan so‘ng o‘quvchilarga topshiriqni mustaqil bajarishlariga ruxsat bering.\n-   Oldingi qadamlar tufayli bu tanish tuyulishi kerak."
        },
        "072ac15c-51ea-444a-ba24-2d1da32a8b2d": {
          "name": "Reflection",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Reflect” slaydni ko‘rsatish\n\n**Mulohaza yuriting:** _Hodisalarga qanday misollar bor?_",
          "tips": [
            null
          ]
        },
        "c14e31a9-2968-4510-926a-0227df66db89": {
          "tips": [
            null
          ]
        },
        "02b80534-5007-46a8-9992-3e0323c49a92": {
          "name": "O‘ylamoq",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ko'rsatish**: Reflektsiya slaydni ko'rsatish\n\n**Ko‘zgu:** _Qachon o‘yin ichidagi hodisa sifatida qahramon boshqa narsaga otib ketganini ko‘rgansiz?_\n\n_Masalan: sizning qahramoningiz asbob bilan biror narsaga uriladi va u buziladi._"
        },
        "4184cd8d-7e62-44ac-91e2-fa4c825a3aa7": {
          "name": "Lug‘at",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Lug‘at” slaydni ko‘rsatish\n\n-   **Hodisa** - Voqea nimadir sodir bo‘lishiga sabab bo‘ladigan harakatdir."
        },
        "49e86e55-b607-4af6-bdb6-b912549b69ea": {
          "name": "Kirish",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Show**: Tez ko‘rish slaydni ko‘rsatish\n\n**Ayting:** _Biz tugmani bosish voqealarini nima uchun \"dasturladik\"?_\n\n<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Ekran**: \"kodlash uchun voqealar qo'shish\" slaydni ko'rsatish\n\n\\*\\* Ayting:\\*\\* _Endi biz kodimizga voqealar qo'shamiz. Biz sichqonchani bosish uchun hodisa va qushning yerga yoki to'siq kabi ob'ektga urishi uchun bitta hodisa yaratamiz._"
        },
        "c18dfa97-b98e-4a9b-99e1-59c56b29905b": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: O'tish harakati slaydni ko'rsatish\n\nDarsni mos keladigan onlayn bosqichdan tortib oling, biz 4-jumboqni tavsiya qilamiz.\n\n**Ayting:** _Flappy Bird erga yoki to'siqqa o'xshash narsaga urilsa nima bo'ladi?_\n\nUshbu o'yinda Flappy bir marta bosish bilan oldinga siljishi va Flappy biror narsaga tegsa, o'yin tugashini tushuntiring.\n\nSinf bilan jumboqni yeching  nima bo'lgan va nima bo'lmagani haqida tez muhokama qilish uchun vaqt ajrating. Har bir voqea uchun o'quvchilardan ushbu hodisaga qanday harakat mos kelishini so'rang."
        },
        "afa7c923-ac99-4097-b70d-c27072b62bcc": {
          "name": "Build a Flappy Game"
        },
        "70706f4c-ac33-422e-86fd-6f20f63e4438": {
          "progression_name": "Malaka orttirish"
        },
        "665856d7-1e75-4dcb-bb62-7926daecbcb3": {
          "progression_name": "Mini-loyiha: Flappy Game"
        },
        "ddee86f6-7f1f-41b8-bd96-f891312addb0": {
          "tips": [
            null
          ]
        },
        "d0ea24ff-eed4-4232-af00-1aebf8a9c264": {
          "name": "Reflection"
        },
        "a1420040-a891-4dd5-8aa7-127bac142431": {
          "name": "O‘ylamoq"
        },
        "8f34487c-1c94-4472-80bd-7e53befee5f6": {
          "name": "Lug‘at",
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Lug‘at” slaydni ko‘rsatish\n\n-   **Hodisa** - Voqea nimadir sodir bo‘lishiga sabab bo‘ladigan harakatdir."
        },
        "e0573e5e-1308-46de-b4aa-d856b692817d": {
          "name": "Kirish"
        },
        "6728fc70-4eea-4c9e-8b55-b5643cb406f1": {
          "name": "Chase Game with Events",
          "tips": [
            null
          ]
        },
        "1b396a72-6c8e-4667-a4a5-8ef61ac9687f": {
          "progression_name": "Mini-loyiha: Chase Game"
        },
        "f0b5eef7-fc2b-430a-84d1-0db90863beac": {
          "description": "<i class=\"fa fa-list-alt\" aria-hidden=\"true\"></i> **Display**: “Dars qo‘shimchalari” slaydni ko‘rsatish",
          "progression_name": "Dars qo‘shimchalari"
        },
        "6449b59e-03df-41af-9bea-a74772120074": {
          "name": "Reflection"
        },
        "950a6b1c-582f-4078-a44f-b28902a797e0": {
          "description": "Ushbu mashg‘ulotlardan o‘quvchilar bilimini oshirish uchun foydalaning. Ular sinfdan tashqarida ishlatilishi mumkin.\n\n**Kapyushon ostiga qarang**\n\nO‘zingizning hikoyangizga havolani ulashganingizda, siz uning orqasida turgan barcha kodlarni ulashasiz. Bu o‘quvchilar uchun bir-biridan o‘rganish uchun ajoyib usuldir.\n\n-   Tugallangan hikoyalarga havolalarni Internetda joylashtiring.\n    -   O‘zingizning hikoyangizni ham ulashing!\n-   Talabalar havolani yuklaganlarida, hikoyaning orqasidagi kodni ko‘rish uchun ularga \"Qanday ishlaydi \" tugmasini bosishini ayting.\n-   Sinfdoshlaringiz bilan o‘zlarining hikoyalarini kodlash usullarini guruh sifatida muhokama qiling.\n    -   Sizni nima ajablantirdi?\n    -   Siz nimani sinab ko‘rishni xohlaysiz?\n-   Birovning hikoyasini tanlang va uning asosida yasash uchun `Remix` tugmasini bosing. (Xavotir olmang, asl hikoya xavfsiz bo‘ladi.)"
        },
        "0dd3008c-14b5-47c3-9913-65bd3bf87655": {
          "name": "O‘ylamoq"
        },
        "565fdda1-dbbe-4521-aacf-966c4aa204e3": {
          "name": "Lug‘at"
        },
        "d7a9e0cd-a7e6-46de-910f-3f0e1216f055": {
          "name": "Kirish"
        },
        "7416084b-fb76-4855-aabe-eeaf20181d79": {
          "name": "Ma'lumotlarni tasvirlash",
          "progression_name": "Ma'lumotlarni tasvirlash"
        },
        "4a782ed3-3443-4139-a1bd-88f562c4386e": {
          "tips": [
            null
          ]
        },
        "f1f2356e-8e7b-400a-9635-bb31159e2a0f": {
          "name": "Reflection"
        },
        "a3f5e809-2960-4f58-92e2-42b5ddf0d058": {
          "name": "O‘ylamoq"
        },
        "ac8248ed-61d0-4366-876a-0c145094fa03": {
          "name": "Lug‘at"
        },
        "04091b34-9c0a-44fa-bce4-dd57c3c8f2b2": {
          "name": "Kirish"
        },
        "fee740e0-f88d-4032-b68e-a6e113d2195d": {
          "name": "Ikkilik bilakuzuklar"
        },
        "c4611983-43d6-441a-9663-bda13932452c": {
          "tips": [
            null
          ]
        },
        "55aaddae-3714-4289-8bdc-04796645b397": {
          "tips": [
            null
          ]
        },
        "9c825c56-c35d-4a06-93e4-6dd4159ac7a7": {
          "name": "Ixtiyoriy baholash (15 daqiqa)"
        },
        "3568529d-36f9-48e4-8075-63bf63a1b309": {
          "name": "Reflection"
        },
        "640bd9a2-11c5-4489-a1df-454c930054de": {
          "description": "Ushbu mashg‘ulotlardan o‘quvchilar bilimini oshirish uchun foydalaning. Ular sinfdan tashqarida ishlatilishi mumkin.\n\n\\*\\* Ikkilik rasmlar \\*\\* \n\n-   Internetda ushbu mashg‘ulotni keyingi bosqichga ko‘tarish uchun bir nechta ajoyib manbalar mavjud. \n-   Agar o‘quvchilaringiz rasmlarni (yoki hattoki musiqani) qanday qilib ikkilik shaklida namoyish etishni bilishni xohlasalar, batafsil ma’lumotni Thinkersmithning  [Binary Baubles](http://code.org/files/CSEDbinary.pdf) da topishingiz mumkin."
        },
        "a373c46d-9bd4-493e-8f40-27654f2c0c62": {
          "name": "O‘ylamoq"
        },
        "eb8e74ca-2768-4a33-9c4d-0493db0c6aaa": {
          "name": "Planning"
        },
        "02b5b8f3-446d-44c5-a594-570e2ff87324": {
          "tips": [
            null
          ]
        },
        "e1b47918-ca9e-4c5f-ad78-4fe271e12f47": {
          "tips": [
            null
          ]
        },
        "b8275a09-3de2-42a9-844f-0ac27f7ee3ea": {
          "progression_name": "Loyiha"
        },
        "5f1c9827-a478-4cf6-98b2-8834ef534cff": {
          "name": "Reflection"
        }
      }
    }
  }
}