{
  "th-TH": {
    "data": {
      "category": {
        "ccela/RL": {
          "description": "วรรณกรรมการอ่าน"
        },
        "csta/AP": {
          "description": "อัลกอริทึมและการเขียนโปรแกรม"
        },
        "ccela/SL": {
          "description": "การพูดและการฟัง"
        },
        "ccmath/MP": {
          "description": "การฝึกด้านคณิตศาสตร์"
        },
        "csta2011/CPP": {
          "description": "การฝึกการคำนวณด้วยคอมพิวเตอร์และการเขียนโปรแกรม"
        },
        "csta2011/CT": {
          "description": "คิดคำนวณ"
        },
        "iste/1": {
          "description": "นักเรียนสาธิตความคิดสร้างสรรค์ สร้างความรู้ และพัฒนาผลิตภัณฑ์และกระบวนการที่เป็นนวัตกรรมโดยใช้เทคโนโลยี"
        },
        "iste/4": {
          "description": "นักเรียนใช้ทักษะการคิดอย่างมีวิจารณญาณในการวางแผนและดำเนินการค้นคว้าวิจัย จัดการโครงการ แก้ปัญหา และตัดสินใจอย่างมีข้อมูลโดยใช้เครื่องมือและทรัพยากรดิจิทัลที่เหมาะสม"
        },
        "iste/6": {
          "description": "นักเรียนแสดงความเข้าใจที่ถูกต้องเกี่ยวกับแนวคิด ระบบ และการดำเนินงานของเทคโนโลยี"
        },
        "ccela/L": {
          "description": "ภาษา"
        },
        "ccela/RI": {
          "description": "ข้อมูลการอ่าน"
        },
        "ccmath/OA": {
          "description": "การดำเนินการและการคิดในเชิงพีชคณิต"
        },
        "csta2011/CD": {
          "description": "คอมพิวเตอร์และอุปกรณ์สื่อสาร"
        },
        "csta2011/CI": {
          "description": "ผลกระทบต่อชุมชน ทั่วโลก และจริยธรรม"
        },
        "ccmath/MD": {
          "description": "ใช้ความน่าจะเป็นในการตัดสินใจ"
        },
        "ccmath/NBT": {
          "description": "จำนวนและการดำเนินงานในเลขฐานสิบ"
        },
        "ccmath/G": {
          "description": "เรขาคณิต"
        },
        "ccela/W": {
          "description": "การเขียน"
        },
        "csta2011/CL": {
          "description": "การทำงานร่วมกัน"
        },
        "iste/2": {
          "description": "นักเรียนใช้สื่อดิจิทัลและสภาพแวดล้อมในการสื่อสารและทำงานร่วมกัน รวมทั้งจากระยะไกล เพื่อสนับสนุนการเรียนรู้ส่วนบุคคลและมีส่วนร่วมในการเรียนรู้ของผู้อื่น"
        },
        "csta/IC": {
          "description": "ผลกระทบจากการใช้คอมพิวเตอร์"
        },
        "csp2021/IOC-2.B": {
          "description": "อธิบายว่าทรัพยากรการคำนวณสามารถป้องกันและนำไปใช้ในทางที่ผิดได้อย่างไร"
        },
        "csta/NI": {
          "description": "เครือข่ายและอินเทอร์เน็ต"
        },
        "csp2021/DAT-1.D": {
          "description": "เปรียบเทียบอัลกอริธึมการบีบอัดข้อมูลเพื่อพิจารณาว่าวิธีใดดีที่สุดในบริบทเฉพาะ"
        },
        "csta/DA": {
          "description": "การวิเคราะห์ข้อมูล"
        },
        "csta/CS": {
          "description": "ระบบคอมพิวเตอร์"
        }
      }
    }
  }
}