{
  "fa-IR": {
    "data": {
      "failure_message_override": {
        "MC HOC 2016 Level 2-2": "از دستورهای «حرکت به جلو» و «چرخش» استفاده کنید تا مرغ خود را به حرکت درآورید.",
        "MC HOC 2016 Level 3": "از یک بلوک «اعمال همیشگی» و دستورهای «حرکت به جلو» و «چرخش» استفاده کنید تا مرغ خود را در حال حرکت بی‌هدف نگه دارید.",
        "MC HOC 2016 Level 4": "اگر همه مرغ‌ها در جهت یکسانی در حال حرکت بودند، از «چرخش تصادفی» استفاده کنید تا مرغ‌ها به طور تصادفی به چپ یا راست بچرخند.",
        "MC HOC 2016 Level 5": "ترکیب «اعمال همیشگی» و «یک قدم به سمت بازیکن» را امتحان کنید.",
        "MC HOC 2016 Level 6": "از دستور «تکثیر زامبی» در قسمت «هنگام شب» استفاده کنید تا حداقل سه زامبی ایجاد شود. سپس، «یک قدم به سمت بازیکن» را به رویداد «هنگام تکثیر» به همراه یک حلقه اضافه کنید تا بتوانند شما را دنبال کنند. اگر سرعتشان زیاد است، یک دستور «درنگ» اضافه کنید تا سرعتشان کمتر شود.",
        "MC HOC 2016 Level 8": "شما باید از کریپر در حال انفجار برای منفجر کردن دیوار استفاده کنید تا بتوانید به گوسفندتان برسید.",
        "MC HOC 2016 New Drop": "از کلیدهای جهت دار برای راه رفتن به سمت گوسفند استفاده کنید و برای استفاده از گوسفند، دکمه فاصله را فشار داده یا روی صفحه بازی کلیک کنید. همچنین یادتان باشد که بلوک «انداختن» را به کد خود اضافه کنید.",
        "MC HOC 2016 New Spawn": "«تکثیر گوسفند» را زیر «هنگام اجرا» قرار دهید.",
        "MC HOC 2016 New Walk": "برای باز کردن در، دکمه فاصله را فشار دهید یا صفحه بازی را در حالی که رو به آن هستید لمس کنید. برای ادامه وارد شوید.",
        "MC HOC 2016 SCORE LEVEL": "اگر لمس کردن 5 غول برایتان سخت است، سعی کنید در ازای لمس هر غول امتیاز را به 2 تغییر دهید.",
        "MC HOC 2016 Village Test": "برای پیروزی باید کاری کنید که غول آهنی زامبی‌ها را دنبال کرده و به آن‌ها حمله کند.",
        "courseC19_playLab_EOC3": "شما باید دو یا چند بازیگر جدید را به بازی خود اضافه کرده و آنها را برای حرکت برنامه‌ریزی کنید.",
        "courseC19_playLab_EOC32022": "شما باید دو یا چند بازیگر جدید را به بازی خود اضافه کرده و آنها را برای حرکت برنامه‌ریزی کنید.",
        "courseC19_playLab_EOC3_2020": "شما باید دو یا چند بازیگر جدید را به بازی خود اضافه کرده و آنها را برای حرکت برنامه‌ریزی کنید.",
        "courseC19_playLab_EOC3_2021": "شما باید دو یا چند بازیگر جدید را به بازی خود اضافه کرده و آنها را برای حرکت برنامه‌ریزی کنید.",
        "courseC19_playLab_EOC3_2023": "شما باید دو یا چند بازیگر جدید را به بازی خود اضافه کرده و آنها را برای حرکت برنامه‌ریزی کنید.",
        "courseE_playLab_scaffold3": "شما باید دو یا چند بازیگر جدید را به بازی خود اضافه کرده و آنها را برای حرکت برنامه‌ریزی کنید."
      }
    }
  }
}