{
  "uz-UZ": {
    "data": {
      "lessons": {
        "dance-extras/Dance Party - Go Further": {
          "purpose": "Ushbu dars Infomatikadagi asosiy tushunchalar, kodlash va hodisaviy dasturlash (bloklardan foydalangan holda) bilan tanishtiradi."
        },
        "artist/Artist": {
          "overview": "Bu darsda talabalar ekrandagi chizmalarni tugatish uchun Rassomni boshqarishadi. Bu Rassom bosqichi talabalarga yangi bo‘limlar, masalan, `move forward by 100 pixels` va `turn right by 90 degrees` kabilardan foydalangan holda yuqori mukammallikdagi rasmlar yaratish imkonini beradi.",
          "student_overview": "Rassomni dasturlash orqali chiroyli rasmlar yarating."
        },
        "dance/Dance Party": {
          "purpose": "Ushbu dars Infomatikadagi asosiy tushunchalar, kodlash va hodisaviy dasturlash (bloklardan foydalangan holda) bilan tanishtiradi."
        },
        "sports/Sports": {
          "overview": "Bu onlayn mashg‘ulotda, talabalar hodisalar nima ekanligi va komputerlar ularni video o‘yinlar kabi dasturlarda qanday ishlatishi haqida o‘rganishadi. Talabalar hodisalarga (masalan, yo‘nalishli tugmalar bosilganda) javob qaytaradigan qilish uchun boshqotirmalar ustida ishlashadi. Boshqotirmaning oxirida, talabalarda o‘yinlarini turli xil tezlik va tovushlar bilan moslashtirish imkoniyati tug‘iladi.",
          "student_overview": "Maktabda biron marta video o‘ynashni orzu qilganmisiz? Bu darsda, siz shaxsan o‘zingiznikini yaratasiz!"
        },
        "basketball/Bounce": {
          "overview": "Bu onlayn mashg‘ulotda, talabalar hodisalar nima ekanligi va komputerlar ularni video o‘yinlar kabi dasturlarda qanday ishlatishi haqida o‘rganishadi. Talabalar hodisalarga (masalan, yo‘nalishli tugmalar bosilganda) javob qaytaradigan qilish uchun boshqotirmalar ustida ishlashadi. Boshqotirmaning oxirida, talabalarda o‘yinlarini turli xil tezlik va tovushlar bilan moslashtirish imkoniyati tug‘iladi.",
          "student_overview": "Maktabda biron marta video o‘ynashni orzu qilganmisiz? Bu darsda, siz shaxsan o‘zingiznikini yaratasiz!"
        },
        "dance-extras-2019/Dance Party - Go Further": {
          "purpose": "Ushbu dars Infomatikadagi asosiy tushunchalar, kodlash va hodisaviy dasturlash (bloklardan foydalangan holda) bilan tanishtiradi."
        },
        "dance-2019/Dance Party": {
          "purpose": "Ushbu dars Infomatikadagi asosiy tushunchalar, kodlash va hodisaviy dasturlash (bloklardan foydalangan holda) bilan tanishtiradi."
        },
        "oceans/Oceans": {
          "student_overview": "O'quv qo'llanmasining qisqacha mazmuni: Dastlab talabalar okeandan chiqindilarni olib tashlash uchun obyektlarni 'baliqlar' yoki 'baliqlar emas' deb tasniflashadi. Keyin talabalar o'zlarining ma'lumot to'plamlarini boshqa dengizni o'z ichiga olgan holda kengaytirishlari kerak bo'ladi. Faoliyatning ikkinchi qismida talabalar tasodifiy hosil bo'lgan baliqlarning rasmlariga murojaat qilish uchun o'zlarining yorliqlarini tanlaydilar. Ushbu ma'lumotlar yangi tasvirlarni belgilashga qodir bo'lgan mashina o'rganish modeli uchun ishlatiladi. "
        },
        "jigsaw/Jigsaw": {
          "overview": "Bu dars o‘quvchilarga ular kompyuter laboratoriyalariga kirganda nima kutishi kerakligi haqida o‘rgatadi. U ularga laboratoriya qonun-qoidalarini tanishtirish kabi qisqacha muhokama bilan boshlanadi, shunda ularda onlayin boshqotirmalarni yechishda kompyuterdan foydalanishda o‘sish kuzatiladi.",
          "student_overview": "Click and drag to finish the puzzles."
        },
        "coursef-2021/Virtual Pet": {
          "overview": "Bu darsda talabalar ular xohlagandek ko‘rinadigan va o‘zini tutadigan interfaol virtual uy hayvonini yaratishadi. Talabalar uy hayvoninig tashqi ko‘rinishini moslashtirish uchun Sprite Labning \"Costumes\" qurilmasidan foydalanishadi. Keyin ular uy hayvonini jonlantirish uchun hodisalar, xatti-harakatlar va ular o‘rgangan boshqa tushunchalardan foydalanishadi!",
          "student_overview": "In this lesson, students will create an interactive Virtual Pet that looks and behaves how they wish. Students will use Sprite Lab's \"Costumes\" tool to customize their pet's appearance. They will then use events, behaviors, and other concepts they have learned to give their pet a life of its own!"
        },
        "coursef-2021/lesson-2": {
          "student_overview": "Bezorilik hech qachon yaxshi bo’lmaydi. Ushbu dars sizga onlaynda nima deyish va nima deyish mumkinligi to’g’risida ma’lumot beradi."
        },
        "coursef-2021/Loops with the Artist": {
          "overview": "Watch student faces light up as they make their own gorgeous designs using a small number of blocks and digital stickers! This lesson builds on the understanding of loops from previous lessons and gives students a chance to be truly creative.  This activity is fantastic for producing artifacts for portfolios or parent/teacher conferences.",
          "student_overview": "In this lesson, loops make it easy to make even cooler images with Artist!"
        },
        "coursef-2021/Variables that Change in Artist": {
          "overview": "Ushbu darsda talabalar Artist  muhitida o'zgaruvchilar yordamida takrorlanadigan dizaynlarni yaratishni o'rganadilar. Talabalar o'zgaruvchilar yordamida qanday qilib kodni yozishni va o'qishni osonlashtirish uchun qanday foydalanish mumkinligini bilib oladilar. Yonaltirilgan jumboqlar tugagandan  so'ng talabalar freeplay darajasida o'zlarining o'rgangan narsalarini namoyish etish va o'z dizaynlarini yaratishni o’rganadilar ",
          "purpose": "O'zgaruvchilar asosan dasturni ishga tushirishda noma'lum bo'lishi mumkin bo'lgan qiymatlarni yoki dasturni bajarish paytida o'zgarishi mumkin bo'lgan qiymatlarni to'ldiruvchidir. Bular dinamik kod yaratish uchun juda muhimdir, chunki ular sizning dasturingizni o'zgartirishga imkon beradi va har qanday potentsial modifikatsiyaga asoslangan holda o'sishi mumkin. Ushbu bosqich o'zgaruvchilarni ishlatishni kuchaytiradi, ularni o'rnatish va ulardan foydalanishning eng oddiy imkoniyatlaridan foydalanadi. ",
          "student_overview": "In this lesson, you'll make drawings using variables that change as the program runs."
        },
        "coursef-2021/Nested Loops in the Maze": {
          "overview": "Bu onlayn mashg‘ulotda, talabalarda o‘zlarining sikllar haqidagi tushunchalarini butun yangi darajaga olib o‘tish imkoni tug‘iladi. Asalari va O‘simliklar vs Zombilar bilan o‘ynab, talabalar boshqa sikl ichida bo‘ladigan boshqa bir siklni qanday dasturlashni o‘rganishadi. Ular yana 'Run' bosilganda sikllardagi kichik o‘zgarishlar ularning dasturiga qanday ta’sir ko‘rsatishini aniqlash uchun ruhlantiriladi.",
          "student_overview": "Sikl ichidagi sikl ichida sikllar. Bu nimani anglatadi? Bu dars sizni biron sikl ichida boshqa siklni joylashtirganingizda nima sodir bo‘lishini o‘rgatadi."
        },
        "coursef-2021/Variables that Change in Bee": {
          "overview": "This lesson will help illustrate how variables can make programs more powerful by allowing values to change while the code is running. ",
          "student_overview": "This bee loves variables!"
        },
        "coursef-2021/For Loop Fun": {
          "overview": "Biz bilamizki, ilmoqlar bizga narsalarni qayta-qayta bajarishga imkon beradi, ammo endi biz qo'shimcha tuzilmalarga ega bo'lgan sikllardan qanday foydalanishni o'rganamiz. Ushbu yangi tuzilmalar talabalarga kodni yanada kuchli va dinamik yaratishga imkon beradi. . ",
          "student_overview": "Siz for sikllari haqida juda ko‘p qiziqarli ma’lumotlarga ega bo‘lasiz!"
        },
        "coursef-2021/For Loops in Bee": {
          "overview": "Featuring Bee, this lesson focuses on `for` loops and using an incrementing variable to solve more complicated puzzles. Students will begin by reviewing loops from previous lessons, then they'll walk through an introduction to `for` loops so they can more effectively solve complicated problems.",
          "student_overview": "Buzz buzz. Ushbu jumboqlarda siz asalarini for sikllari yordamida gul shirasi va asalga yo'naltirasiz."
        },
        "coursef-2021/For Loops in Artist": {
          "overview": "In this lesson, students continue to practice `for` loops, but this time with Artist. Students will complete puzzles combining the ideas of variables, loops, and `for` loops to create complex designs. At the end, they will have a chance to create their own art in a freeplay level.",
          "student_overview": "Keyingi asaringizni yaratishga tayyorlaning. Bu yerda siz 'for' sikllari yordamida hayratlantiruvchi rasmlarni yaratasiz."
        },
        "coursef-2021/Simulating Experiments": {
          "overview": "By running a simple simulation in Sprite Lab, students will experience how computing can be used to collect data that identify trends or patterns. After running the simulation multiple times, students will have an opportunity to make a prediction about how changing a variable in the simulation might impact the outcome, and then test that hypothesis.",
          "student_overview": "Run simulations on the computer and experiment by changing variables."
        },
        "coursef-2021/AI for Oceans": {
          "overview": "\\*\\* O'quv qo'llanmasining qisqacha mazmuni: \\*\\* Dastlabki talabalar okeandan chiqindilarni olib tashlash uchun ob'ektlarni \" baliq yoki 'baliq emas 'deb tasniflashadi. Keyin talabalar o'zlarining o'quv ma'lumotlari to'plamini kengaytirishlari kerak bo'ladi. Suvga kiradigan boshqa dengiz jonivorlarini qo'shish. Faoliyatning ikkinchi qismida talabalar tasodifiy hosil bo'lgan baliqlarning rasmlariga murojaat qilish uchun o'zlarining yorliqlarini tanlaydilar. Bu o'quv ma'lumotlari keyinchalik o'rganish imkoniyatiga ega bo'lishi kerak bo'lgan mashinani o'rganish modeli uchun ishlatiladi. U o'z-o'zidan yangi rasmlarni belgilay oladi.\\\\r\n\\\\r\n\\\\r\n\\*\\* To'g'rilikni tekshirish: \\*\\* Ushbu o'quv qo'llanma talabalarga ularning saviyasini to'g'ri to'ldirgan-qilmaganligini aytmaydi. Faoliyatning turli qismlaridan tezda o'tish mumkin. Talabalarni rasmlarni tomosha qilishga undaydi. Videolar, ko'rsatmalarni o'qing va yo'lda turli xil narsalarni sinab ko'ring. Istalgan vaqtda ular siz yoki sinfdoshingiz bilan o'zlarining topilmalari haqida bo'lishishlari mumkin. \\\\r",
          "student_overview": "O'quv qo'llanmasining qisqacha mazmuni: Dastlab talabalar okeandan chiqindilarni olib tashlash uchun obyektlarni 'baliqlar' yoki 'baliqlar emas' deb tasniflashadi. Keyin talabalar o'zlarining ma'lumot to'plamlarini boshqa dengizni o'z ichiga olgan holda kengaytirishlari kerak bo'ladi. Faoliyatning ikkinchi qismida talabalar tasodifiy hosil bo'lgan baliqlarning rasmlariga murojaat qilish uchun o'zlarining yorliqlarini tanlaydilar. Ushbu ma'lumotlar yangi tasvirlarni belgilashga qodir bo'lgan mashina o'rganish modeli uchun ishlatiladi. "
        },
        "coursef-2021/Internet": {
          "overview": "Ko'pchilik Internetdan har kuni foydalanayotganiga qaramay, ko'pchilik uning qanday ishlashini bilmaydi. Ushbu darsda talabalar ulanishlar, URL manzillari, IP-manzillar va DNS haqida ma'lumot olish davomida o'zlarini Internetda aylanib yurgandek his qilishadi. ",
          "student_overview": "Axborot qanday qilib Internet orqali tarqalishini o'ylab ko'rganmisiz? Bu sehr emas! Bu dars sizga Internet qanday ishlashi asoslarini o'rgatadi."
        },
        "coursef-2021/End of Course Project": {
          "overview": "Ushbu yakunlovchi dars o‘quvchilarni o‘zlarining loyihalarini loyihalashtirish, ishlab chiqish va namoyish etish jarayonidan o‘tadi!",
          "preparation": "-   Artist va Sprite laboratoriyasida o‘zingizning loyihangizni tayyorlashga vaqt ajrating. Har bir uskunaning imkoniyatlari va cheklovlari bilan tanishib chiqing. \n-   Rubrikani sinf maqsadlariga mos ravishda o‘zgartiring va har bir talaba uchun nusxasini chop eting. . \n-   Loyiha dizayni jadvalini sinfingizga mos ravishda o‘zgartiring va har bir talaba uchun bitta paketni chop eting. ",
          "purpose": "Talabalar to‘g‘ridan-to‘g‘ri o‘z loyihalarini yaratish uchun tayyor bo‘lishlari mumkin, ammo bu dars ularning g‘oyalarini rejalarga aylantirishga yordam beradi. Ushbu tuzilma orzu qiluvchi ko‘ngillilarni bir joyda ushlab turgan holda, o’zlarini zulmatda qolgandek  his qiladiganlar uchun yo‘lni yoritib beradi. Qolaversa, talabalarga  o‘z loyihalarini yaratish va qayta ko‘rib chiqish uchun  yetarli vaqt bilan ta’minlaydi. Ushbu darsda ishtirok etgan sinov va xatolar muammolarni hal qilishga va qat’iylikka o‘rgatadi. ",
          "student_overview": "Projects this big take time and plenty of planning. Find your inspiration, develop a plan, and unleash your creativity!"
        },
        "courseb-2021/Digital Trails": {
          "student_overview": "Learn about your digital footprint and how to stay safe when visiting websites. "
        },
        "courseb-2021/Move It, Move It": {
          "overview": "Ushbu dars o'quvchilarni ushbu kurs davomida duch keladigan kodlash mashqlariga ruhiy jihatdan tayyorlash uchun mo'ljallangan. Kichik jamoalarda talabalar jismoniy mashqlar yordamida sinfdoshlarini bir joydan boshqa joyga diqqat bilan qadam qo'yishni dasturlash uchun foydalanadilar ",
          "purpose": "Sinfdoshlarini dasturlash uchun jismoniy harakatni qo'llagan holda, o'quvchilar kompyuterda kodlashni boshlaganlarida his etadigan narsalarga o'xshash masalalar va hissiyotlarga duch kelishadi. Ushbu stresslarga qarshi o'ynoqi va ochiq muhitda uchrashish intensivlikni kamaytirishga yordam beradi va talabalarga o'zlari muammolarga duch kelmasdan oldin zarur ko'nikmalarni mashq qilishlariga imkon beradi ",
          "student_overview": "Program your classmates to step carefully from place to place."
        },
        "courseb-2021/Sequencing in Maze": {
          "overview": "Jahldor qushlar o‘yinidagi obrazlardan foydalanib, talabalar qushni labirintning bir tomonidan boshqa tomonidagi cho‘chqaga qaratib harakatlantirish uchun ketma-ket algoritmlarni tuzib chiqadilar. Buni qilish uchun ular to‘g‘riga, chapga va keyin o‘ngga harakatlanadigan qilib kod bo‘limlarini chiziqli ketma-ketlikda taxlab chiqishadi.",
          "purpose": "Bu darsda, talabalar biron komputer platformasida o‘zlarining debug qilish va dasturlash mahoratlarini oshiradilar. Bu boshqotirmalarning bo‘limlarga asoslangan shakli talabalarga sintaksisni mukammallashtirish haqida o‘ylamasdan ketma-ketlik va tushunchalar haqida o‘rganishga yordam beradi.",
          "student_overview": "Qizil Jahldor Qushga yaramas cho‘chqaga boradigan yo‘ldan yurishiga yordam bering."
        },
        "courseb-2021/Programming in Maze": {
          "overview": "Using characters from the Ice Age, students will develop sequential algorithms to move Scrat from one side of a maze to the acorn at the other side. To do this they will stack code blocks together in a linear sequence, making them move straight, turn left, or turn right.",
          "student_overview": "Create programs to help the Angry Bird move through the maze."
        },
        "courseb-2021/Programming in Harvester": {
          "overview": "Talabalar Terimchi (Harvester) muhitida o‘rgangan dasturlash tushunchalariga murojaat qiladilar. Endi, shunchaki obrazni maqsadiga yetkazish o‘rniga, talabalar biron yangi bo‘limdan foydalanib hosilni yig‘ishi kerak bo‘ladi. Talabalar algoritmlar ketma-ketligi bo‘yicha mahoratlarini oshirishda davom etadilar va debug qilish jarayonidan foydalanishni boshlashadi.",
          "purpose": "Bu darsda, talabalar o‘zlarining debug qilish mahoratlarini oshiradilar va dasturlash mahoratlarini oshirishda davom etadilar.",
          "student_overview": "Terimchiga yo‘lida sabzavotlarni yig‘ib olishiga yordam bering."
        },
        "courseb-2021/Loops: Getting Loopy": {
          "overview": "Bu uzoq va qiziqarli dasturlarni yozishni boshlaganimiz sayin kodimiz ko‘pincha ko‘plab takrorlanishlardan tashkil topadi. Bu darsda, talabalar sikllar qanday qilib biron raqsdagi harakatning takrorlanuvchi ko‘rinishiga qarash orqali ko‘plab takrorlanishlarga ega bo‘lgan ko‘rsatmalar bilan osonroq aloqa qilishi haqida o‘rganishadi.",
          "student_overview": "Bu darsda, takrorlanuvchi sikllardan foydalanib, raqs bazmi tashkillashtiramiz!"
        },
        "courseb-2021/Loops in Harvester": {
          "overview": "Building on the concept of repeating instructions from \"Getting Loopy,\" this stage will have students using loops to pick corn more efficiently on Code.org.",
          "student_overview": "Help the Harvester collect even more, using loops!"
        },
        "courseb-2021/Loops in Collector": {
          "overview": "Bu darsda, talabalar sikllar tushunchasini o‘rganishda davom etishadi. Mana bu yerda, Laurel the Adventurer ochiq g‘ordagi xazinani yig‘ishda sikllardan foydalanadi. Uning sayohati davomida unga yordam berish uchun yangi 'get treasure' bo‘limi tanishtiriladi.",
          "purpose": "Bu dars talabalarga sikllar bilan ko‘proq amalyot qilish imkonini beradi va ularni iloji boricha ko‘proq xazina yig‘ishi uchun ‘takrorlanuvchi’ sikl ichida ko‘plab bo‘limlarni joylashtirishga undaydi. ",
          "student_overview": "Program Laurel the adventurer to collect treasure in an open cave."
        },
        "courseb-2021/Loops in Artist": {
          "overview": "Sikllarga qaytadigan bo‘lsak, talabalar ko‘rsatmalarning oddiy ketma-ketligini takrorlash orqali rasm chizishni o‘rganishadi. Oldingi onlayn darsda, sikllar labirintni kesib o‘tish va xazina to‘plash uchun ishlatilgan. Bu yerda talabalar sikllardan ko‘rinishlar yaratishda foydalanishadi. Bu bosqichning oxirida, talabalarga sikllardan foydalanib o‘zlarining shaxsiy rasmlarini yaratish imkoniyati beriladi.",
          "purpose": "Bu dars dasturlashda sikllar qanday qilib ba’zi narsalarni yarata olishi bo‘yicha turli xil nuqta’i nazar bilan ta’minlaydi. Talabalar berilgan kodni baholash va boshqotirmani yechish uchun qanday qo‘shimchalar qilish keraklini aniqlash orqali o‘zlarining tanqidiy fikrlash mahoratlarini sinab ko‘rishadi. Talabalar bu yerda sikllarsiz dasturlashning samarasizligini ham aks ettishlari mumkin chunki, takrorlanuvchi sikllarsiz ushbu dastur ko‘plab bo‘llimlarni talab qiladi.",
          "student_overview": "Use patterns and loops to finish the images."
        },
        "courseb-2021/The Right App": {
          "overview": "Ushbu dars o‘quvchilarga kompyuter fanlari hayotda odamlarga yordam berishi mumkinligini o‘rgatadi. Birinchidan, o‘quvchilar o‘zlarining ehtiyojlarini qondiradigan \"to‘g‘ri dastur\"ni topishda yordam berish uchun xayolan bir nechta smartfon foydalanuvchilarini tasavvur qilishadi. So‘ngra, o‘quvchilar o‘zlarining smartfon dasturlarini qo‘shimcha ravishda bitta foydalanuvchi ehtiyojlarini qondirish uchun yordam beradilar va ijodkorlikdan foydalanadilar."
        },
        "courseb-2021/Events: The Big Event": {
          "overview": "Hodisalar - oldindan yozilgan algoritmga interfaollik qo‘shishning ajoyib usuli. Ba'zan siz dasturingiz foydalanuvchi xohlagan vaqtda unga aniq javob bera olishini xohlaysiz. Hodisalar aynan shu uchun mo‘ljallangan."
        },
        "courseb-2021/Events in Play Lab": {
          "overview": "Bu onlayn mashg‘ulotda, talabalarda Play Labda hodisalardan qanday foydalanishni o‘rganish va animatsiyalashtirilgan o‘yin yaratish uchun ular o‘rgangan barcha kod yozish mahoratlariga murojaat qilish imkoniyati mavjud. Yaratuvchan bo‘lish vaqti keldi va Play Labda biron o‘yin yarating!",
          "purpose": " Bu onlayn mashg‘ulotda, talabalar Play Labda hodisalardan qanday foydalanishni o‘rganishadi. Ular yo‘nalishli tugma bosilganda otliqni harakatlantirishni mashq qilib ko‘rish orqali boshlashadi va keyin tekinga o‘ynaladigan boshqotirma a’zosi sifatida bu kurs davomida o‘rgangan boshqa mahoratlari, jumladan ketma-ketliklar va sikllarni namoyish qilish imkoniyati bilan tugatishadi.",
          "student_overview": "Use events to create a story or make an interactive game."
        },
        "coursea-2021/Safety in My Online Neighborhood": {
          "overview": "[![Common sense education](https://curriculum.code.org/static/img/common_sense_education.png)](https://www.commonsense.org)\n\nUshbu dars [Common Sense Education](https://www.commonsense.org/education/digital-citizenship/curriculum) tomonidan yaratilgan.\n\nInternetning kuchi o‘quvchilarga shaxsan ko‘rishlari mumkin bo‘lmagan joylarni ko‘rish va aylanish imkoniyatini beradi. Ammo, xuddi real dunyoda sayohat qilish kabi, Internetda sayohat qilishda ham xavfsiz bo‘lish muhim hisoblanadi. Ushbu virtual ekskursiyada bolalar onlayn sarguzashtlarda xavfsizlikni ta'minlash bilan shug‘ullanishlari mumkin.",
          "preparation": "-   Ko'rsatma materiallarni ko'rish.\n-   Har bir o'quvchi uchun tarqatma materiallarni chop etish.\n-   (Ixtiyoriy) Sinfda taqdim etish uchun poster chop etish.",
          "student_overview": "Xavfsiz onlayn aylanishni o'rganing"
        },
        "coursea-2021/Learn to Drag and Drop": {
          "overview": "Bu dars o‘quvchilarga ular kompyuter laboratoriyalariga kirganda nima kutishi kerakligi haqida o‘rgatadi. U ularga laboratoriya qonun-qoidalarini tanishtirish kabi qisqacha muhokama bilan boshlanadi, shunda ularda onlayin boshqotirmalarni yechishda kompyuterdan foydalanishda o‘sish kuzatiladi.",
          "purpose": "Bu darsning asl maqsadi talabalarga komputer bilan ishlash tajribasiga erishishiga yordam berish. Bosish, ko‘chirib olish va ko‘chirib qo‘yish kabi eng asosiy funksiyalarini o‘tish orqali, biz sinfda kelajakdagi boshqotirmalar uchun yana ham tengroq shug‘ullanish maydoni yaratayapmiz. Bu dars yana mos komputer labaratoriyasi xatti-harakatlaini tanishtirish uchun ajoyib imkoniyat bilan ta’minlaydi.",
          "student_overview": "Click and drag to finish the puzzles."
        },
        "coursea-2021/Programming: Happy Maps": {
          "overview": "Bu kompyutersiz o‘tiladigan dars jamoalarga oddiy vazifa yuklaydi: \"flurb\"ni mevaga yetkazing. Talabalar ko‘rsatmalarni taqdim etilgan belgilarga tarjima qilish jarayonida aniq ko‘rsatmalar yozishni mashq qiladilar. Kodda muammolar tug‘ilsa, talabalar xatolikni topish uchun va yechim topish uchun ham birgalikda ishlashlari kerak bo‘ladi.",
          "purpose": "Agar talabalar ketma-ketlikda rejalashtirish va ushbu ketma-ketlikni mos dasturlash tiliga aylantira olish o‘rtasidagi farqni tushuna olsa, algoritmlardan dasturlashgacha bo‘lgan ko‘prik qisqa bo‘lishi mumkin. Bu mashg‘ulot talabalarga qisqa yo‘lda yozilgan kodlarni o‘qish va yozishga erishishda yordam beradi.",
          "student_overview": "Write instructions to get the Flurb to the fruit."
        },
        "coursea-2021/Sequencing with Scrat": {
          "overview": "Using Scrat from the Ice Age franchise, students will develop sequential algorithms to move a squirrel character from one side of a maze to the acorn at the other side. To do this they will stack code blocks together in a linear sequence.",
          "purpose": "Bu darsda, talabalar biron komputer platformasida o‘zlarining debug qilish va dasturlash mahoratlarini oshiradilar. Bu boshqotirmalarning bo‘limlarga asoslangan shakli talabalarga sintaksisni mukammallashtirish haqida o‘ylamasdan ketma-ketlik va tushunchalar haqida o‘rganishga yordam beradi.",
          "student_overview": "Program Scrat to reach the acorn."
        },
        "coursea-2021/Programming in Ice Age": {
          "overview": "Using characters from the Ice Age, students will develop sequential algorithms to move Scrat from one side of a maze to the acorn at the other side. To do this they will stack code blocks together in a linear sequence, making them move straight, turn left, or turn right.",
          "purpose": "Bu darsda, talabalar biron komputer platformasida o‘zlarining debug qilish va dasturlash mahoratlarini oshiradilar. Bu boshqotirmalarning bo‘limlarga asoslangan shakli talabalarga sintaksisni mukammallashtirish haqida o‘ylamasdan ketma-ketlik va tushunchalar haqida o‘rganishga yordam beradi.",
          "student_overview": "Write programs to help Scrat reach the acorn."
        },
        "coursea-2021/Programming with Rey and BB-8": {
          "overview": "Ushbu darsda talabalar o'zlarining yangi dasturlash qobiliyatlaridan yanada murakkab usullarda BB-8 bilan murakkab kursni o'tish uchun foydalanadilar.",
          "student_overview": "Help BB-8 collect the scrap metal."
        },
        "coursea-2021/Loops: Happy Loops": {
          "overview": "Bu mashg‘ulot Xursand Xaritalarga qayta tashrif buyuradi. Bu safar, talabalar ularni uzun kodlarni osonroq yo‘l bilan yozishga imkon beruvchi tuzilmalardan foydalanishni ko‘rishga yetaklaydigan kodlari bilan kattaroq va uzunroq boshqotirmalarni yechishadi.",
          "purpose": " Bu dars sikllar uchun tanishtiruv sifatida xizmat qiladi. Sikllar talabalarga qaytarilishi kerak bo‘lgan buyruqlarni guruhlash orqali ularning kodini osonlashtirish imkonini beradi. Talabalar sinfdoshlarining harakatlaridagi takrorlanishni payqash va buyruqlarni necha marta takrorlash kerakligini aniqlash orqali tanqidiy fikrlash qobiliyatlarini oshiradilar. \"Xursand Xaritalar\"ni yana bir marta ko‘rish orqali, talabalarda tartiblash eski tushunchalarni yangi, takrorlanuvchi sikllar tushunchasiga bog‘lash imkoni paydo bo‘ladi.",
          "student_overview": "Help the Flurb solve bigger problems using loops."
        },
        "coursea-2021/Loops in Ice Age": {
          "overview": "\"Xursand sikllar\"dan takrorlanuvchi ko‘rsatmalar tushunchasini yaratgan holda, bu bosqichda Code.orgdagi yong‘oqni samaraliroq usulda yig‘ish uchun sikllardan foydalanish ko‘rsatiladi.",
          "student_overview": "Help Scrat cover more ground using loops."
        },
        "coursea-2021/Loops in Collector": {
          "overview": "Bu darsda, talabalar sikllar tushunchasini o‘rganishda davom etishadi. Oldingi darsda, talabalar labirint bo‘yicha harkatlanish va hosilni yig‘ish orqali sikllar bilan tanishtirilgan edi. Bu yerda, sikllar ochiq g‘orlardagi xazinalarni yig‘ish uchun ishlatiladi.",
          "purpose": "Bu darsda talabalar sikllar bilan ko‘proq amaliy tajribaga ega bo‘ladilar va yangi bo‘lim 'xazinaga erishish' bilan tanishadilar. Ushbu bo‘lim, xuddi Terimchi loyihasidagi `pick corn`ga o‘xshab ishlaydi. Bu boshqotirmalar yana ham ochiqroq, ular bilan talabalar yakuniy yechimlarini yanada moslashuvchan qila oladi.",
          "student_overview": "Help Laurel the adventurer collect the treasure underground."
        },
        "coursea-2021/Ocean Scene with Loops": {
          "overview": "Sikllar mavzusiga qaytgan holda, talabalar ko‘rsatmalarning oddiy ketma-ketligini takrorlash orqali rasmlar chizishni o‘rganishadi. Kompyuter bilan o‘tilgan oldingi darsda, sikllar labirintdan o‘tish va xazinani yig‘ish uchun foydalanilgan edi. Bu yerda, sikllar yordamida shakllar yaratilyapti. Bu bosqichning oxirida, talabalarga sikllardan foydalanib o‘z rasmlarini yaratish imkoniyati beriladi.",
          "student_overview": "Use loops and patterns to finish the images."
        },
        "coursea-2021/Events: The Big Event": {
          "overview": "Hodisalar - oldindan yozilgan algoritmga interfaollik qo‘shishning ajoyib usuli. Ba'zan siz dasturingiz foydalanuvchi xohlagan vaqtda unga aniq javob bera olishini xohlaysiz. Hodisalar aynan shu uchun mo‘ljallangan.",
          "student_overview": "Move and shout when your teachers presses buttons on a giant remote."
        },
        "coursea-2021/Events in Play Lab": {
          "overview": "Bu onlayn mashg‘ulotda, o‘quvchilar Play Labdagi hodisalardan qanday foydalanishni o‘rganish va ular animatsiyalashtirilgan o‘yinlar yaratishda o‘rgangan kod yozish mahoratlaridan foydalanish imkoniyatiga ega bo‘ladilar. Ijod qilish va Play Labda o‘z hikoyangizni yaratish vaqti keldi!",
          "purpose": "Bugun talabalar Play Labdan foydalanib hodisalar haqidagi tushunchalarini yanada rivojlantiradilar. Ko‘plab komputer daasturlarida hodisalar juda muhim hisoblanishadi. Bu mashg‘ulotda, talabalar hodisalardan biron obrazni ekran bo‘ylab harakatlantirishda, shovqin solishda va foydalanuvchi qanday boshlashiga qarab fonni o‘zgartirishda ishlatishadi.",
          "student_overview": "O'z o'yiningiz yoki hikoyangizni yarating!"
        },
        "coursec-2021/Putting a STOP to Online Meanness": {
          "student_overview": "Ushbu darsda siz ma'nosizlik haqida va agar Internetda duch kelganda nima qilish kerakligi haqida bilib olasiz."
        },
        "coursec-2021/Programming: My Robotic Friends": {
          "overview": "Kod o‘rniga belgilar to‘plamidan foydalangan holda, talabalar chashkalarni turli xil ko‘rinishlarda taxlaydigan \"robot\" yasash uchun algoritmlarni dizaynlashtirishadi. Talabalar faqatgina tengdoshlari tomonidan ta’riflangan algoritmlarga javob bergan holda navbatma-navbat robot sifatida qatnashishadi. Bu bo‘lim talabalarga belgilar va harakatlar o‘rtasidagi bog‘liqlikni, biron algoritm va dastur o‘rtasidagi farqni va qimmatli debug qilish mahoratlarini o‘rgatadi.",
          "purpose": "Bu tarmoqsiz olib boriladigan dars sinfni birgalikda jamoa bo‘lib biron oddiy vazifani bajarishga o‘rgatadi: stakanlarni maxsus dizaynda taxlash uchun biron \"robot\" dan foydalanishadi. Bu mashg‘ulot kurs davomida talabalar dasturlash bo‘yicha algoritmlarning aniqlikda bog‘langanlishlarining ahamiyatini o‘zlashtirish uchun poydevor yaratadi.",
          "student_overview": "In this lesson, you'll pretend your classmates are robots and program them to build patterns of stacked cups."
        },
        "coursec-2021/Programming in Maze": {
          "overview": "Jahldor qushlar o‘yinidagi obrazlardan foydalanib, talabalar qushni labirintning bir tomonidan boshqa tomonidagi cho‘chqaga qaratib harakatlantirish uchun ketma-ket algoritmlarni tuzib chiqadilar. Buni qilish uchun ular to‘g‘riga, chapga va keyin o‘ngga harakatlanadigan qilib kod bo‘limlarini chiziqli ketma-ketlikda taxlab chiqishadi.",
          "purpose": "Bu darsda, talabalar biron komputer platformasida o‘zlarining debug qilish va dasturlash mahoratlarini oshiradilar. Bu boshqotirmalarning bo‘limlarga asoslangan shakli talabalarga sintaksisni mukammallashtirish haqida o‘ylamasdan ketma-ketlik va tushunchalar haqida o‘rganishga yordam beradi.",
          "student_overview": "Angry Birds bilan ketma-ketlik va algoritmlar haqida o‘rganing."
        },
        "coursec-2021/Debugging in Maze": {
          "overview": "Debug qilish dasturlashni o‘rganishning muhim elementidir. Bu darsda, talabalar noto‘g‘ri yechilgan boshqotirmalarga duch kelishadi. Ular xatolikni topish uchun mavjud kodni qatorma-qator tekshirib chiqishadi, jumladan, noto‘g‘ri ishlatilgan sikllar, unutib qoldirilgan bo‘limlar, ortiqcha bo‘limlar va tartibdan tashqaridagi bo‘limlarni.",
          "student_overview": "Boshqotirmalardagi muammolarni toping va debug qilish mahoratingizni amalda sinab ko‘ring."
        },
        "coursec-2021/Programming in Collector": {
          "overview": "Boshqotirmalar to‘plamida, talabalar algoritmlar va debug qilish bo‘yicha o‘zlarining tushunchalarini rivojlantirishda davom etishadi. Yangi obraz, sarguzashtchi Laurel bilan talabalar Laurelni u yo‘lak bo‘ylab harakatlanganda xazinalar cho‘qqisiga olib chiqish uchun algoritmlar ketma-ketligini yaratishadi.",
          "student_overview": "Sarguzashtchi Laurelga ko‘plab marvaridlar yig‘ishda yordam berish uchun algoritm yozing!"
        },
        "coursec-2021/Programming in Artist": {
          "overview": "Bu darsda talabalar ekrandagi chizmalarni tugatish uchun Rassomni boshqarishadi. Bu Rassom bosqichi talabalarga yangi bo‘limlar, masalan, `move forward by 100 pixels` va `turn right by 90 degrees` kabilardan foydalangan holda yuqori mukammallikdagi rasmlar yaratish imkonini beradi.",
          "purpose": "Talabalar oldingi tajribalarini ketma-ketlik bilan boshlagan bo‘lsa, bu dars kod yozishni ko‘proq ijodkorlik bilan ilhomlantirish uchun ishlaydi. Bu darsning maqsadi yangi bo‘limlar va maqsadlarni tanishtirish orqali ketma-ketlik bo‘yicha bilimlarni mustahkamlash uchun. Bu holda, talabalar hamon o‘zlarining ketma-ketlik bo‘yicha ko‘nikmalarini amalda sinash bilan bir vaqtda yangi bo‘limlardan foydalanib, ko‘proq piksellar va burchaklar haqida ham o‘rganishadi. Shuningdek, talabalar yangi maqsadlar, masalan, biron kvadrat chizish uchun ushbu San’atkorni kodini yozishni tasavvur qilishga qodir bo‘ladi.",
          "student_overview": "Rassomni dasturlash orqali chiroyli rasmlar yarating."
        },
        "coursec-2021/Loops: My Loopy Robotic Friends": {
          "overview": "\"Mening Robot Do‘stlarim\" mashg‘ulotiga asoslangan holda, talabalar kattaroq va yanada mukammalroq dizaynlarni ham yecha olishadi. Bu mukammalroq dizaynlarni yaratish jarayonida o‘z robotlarini dasturlash maqsadida talabalar o‘z ko‘rsatmalaridagi biron sikl bilan almashtirsa bo‘ladigan takrorlanuvchi ko‘rinishlarni aniqlashi kerak bo‘ladi.",
          "purpose": "Bu dars hozirda tanish bo'lgan \"robot \" dasturlash ko'rsatmalaridan foydalangan holda sikllar uchun qayta tanishtiruv sifatida xizmat qiladi. Talabalar sinfdoshlarining harakatlaridagi takrorlanuvchi ko‘rinishlarni izlash va sikllardan foydalanib ushbu takroriy ko‘rinishlarni qanday soddalashtirsh orqali tanqidiy fikrlash mahoratlarini rivojlantiradilar.",
          "student_overview": "In this lesson, you'll program your classmates again, but using loops you'll be able to solve bigger and more complicated problems."
        },
        "coursec-2021/Loops with Rey and BB-8": {
          "overview": "\"Getting loopy\"dagi takrorlanuvchi ko‘rsatmalar tushunchalari asosida yaratilib, bu bosqichda talabalar BB-8ga labirintdan oldingiga qaraganda samaraliroq o‘tishiga yordam berish uchun sikllardan foydalanishadi.",
          "student_overview": "Sikllardan foydalanib BB-8 ga labirint bo‘ylab harakatlanishida yordam bering! "
        },
        "coursec-2021/Loops in Harvester": {
          "student_overview": "Keling, dehqonga ba’zi sabzavotlarni yig‘ishda sikllardan foydalanib yordam beramiz!"
        },
        "coursec-2021/Sticker Art with Loops": {
          "purpose": "Bu to‘plamlar sikllarning ahammiyatini yaratuvchan va shaxsiy dizaynlar bilan ta’kidlab ko‘rsatadi.\n\n Loyiha ortidagi ketma-ketlik sifatida taklif qilinib, bu o‘sish talabalarga o‘z ishining ustasi bo‘lishga va ajoyib asarlar yaratishga imkon beradi.",
          "student_overview": "In this lesson, loops make it easy to make even cooler images with Artist!"
        },
        "coursec-2021/Events: The Big Event": {
          "overview": "Talabalar tez orada hodisalar oldindan yozib qo‘yilgan algoritmlarga qulaylik qo‘shishning eng yaxshi yo‘li ekanligini bilib olishadi. Ba’zida siz dasturingiz foydalanuvchi aynan xohlagan paytda unga javob qaytarishini xohlaysiz. Hodisalar dasturingizni yanada qiziqarli va interfaol qiladi.",
          "student_overview": "Hodisalar haqida o‘rganish uchun biron qiziqarli o‘yin o‘ynang."
        },
        "coursec-2021/Build a Flappy Game": {
          "overview": "Bu maxsus bosqichda, talabalar obyektlar to‘qnashuvi va sichqoncha bosilishini taniy oladigan hodisa tinglovchilaridan foydalangan holda o‘zlarining Flappy Bird o‘yinini yaratishadi. Bu bosqichning oxirida talabalar tasvirlar yoki qoidalarni o‘zgartirgan holda o‘z o‘yinlarini yarata oladilar.",
          "student_overview": "O‘zingizning Flappy Bird o‘yiningizni yarating, agar xohlasangiz keyin uni do‘stlaringiz bilan ulashishingiz mumkin!"
        },
        "coursec-2021/Events in Play Lab": {
          "overview": "Bu onlayn mashg‘ulotda, talabalalarda Play Labda hodisalardan qanday foydalanishni o‘rganishga va biron animatsiyalashtirilgan o‘yin yaratish uchun ular o‘rgangan barcha ko‘nikmalarini qo‘llab ko‘rishga imkoniyat bo‘ladi. Yaratuvchan bo‘lishning vaqti keldi! Play Labda o‘yin yarating!",
          "purpose": "Mana bu yerda, talabalar Play Labdan foydalangan holda o‘zlarining hodisalar haqidagi tushunchalarini rivojlantiradilar. Talabalar obrazlarni ekran bo‘ylab harakatlantirishda, shovqin solishda va foydalanuvchining kiritgan ma’lumotiga asoslanib orqa fonni o‘zgartirishda hodisalardan foydalanishadi. ",
          "student_overview": "Yaratuvchan bo‘lishning ayni vaqti va Play Labda biron o‘yin yarating!"
        },
        "coursec-2021/Picturing Data": {
          "overview": "Ushbu ma'lumotlardan o‘quvchilarga o‘z dunyolarini tushunishda va qiziqarli savollarga javob berishda foydalanish mumkin. Ushbu darsda o‘quvchilar Play Lab loyihasidan ma'lumotlarni olishadi va ularni turli xil grafik ko‘rinishlarda vizuallashtirishadi.",
          "student_overview": "Ushbu ma'lumotlardan o‘quvchilarga o‘z dunyolarini tushunishda va qiziqarli savollarga javob berishda foydalanish mumkin. Ushbu darsda o‘quvchilar Play Lab loyihasidan ma'lumotlarni olishadi va ularni turli xil grafik ko‘rinishlarda vizuallashtirishadi."
        },
        "coursec-2021/Binary Bracelets": {
          "overview": "Ikkilik sanoq tizimi komputerlar dunyosida juda muhim ahamiyatga ega. Bugungi kunda, komputerlarning ko‘pchiligi barcha turdagi ma’lumotni ikkilik ko‘rinishida saqlaydi. Bu dars haqiqiy hayotdan nimadirni olib uni birlar va nollar to‘plamiga tarjima qilishni ko‘rsatishga yordam beradi.",
          "student_overview": "O‘zingizning ikkilik bilakuzugingizni yarating va komputerlar qanday qilib ma’lumotni eslab qolishini o‘rganing!"
        },
        "coursec-2021/End of Course Project: Create a Play Lab Game": {
          "overview": "Ushbu yakunlovchi dars o‘quvchilarni o‘z Play Lab loyihalarini loyihalashtirish, ishlab chiqish va namoyish etish jarayonidan o‘tadi! Ushbu jarayon muammosiz o‘tishini ta'minlash uchun biz o‘quvchilarga qog‘ozda rejalashtirishdan boshlab veb-saytimizdagi kodlashgacha bosqichma-bosqich o‘tish tuzilmasini ta'minladik. Bundan tashqari, biz o'qituvchilarga taqdimotli finalni engillashtirishda yordam beradigan g'oyalarni taklif etamiz! ",
          "student_overview": "Ushbu qo‘llarni bir dunyo kod yozish uchun tayyorlang! Loyihangizni yaratishni boshlashning vaqti keldi."
        },
        "coursed-2021/lesson-5": {
          "student_overview": "Ushbu darsda siz parollar sizning ma'lumotlaringizni qanday himoya qilishi va yaxshi parolni tanlash haqida bilib olasiz."
        },
        "coursed-2021/Algorithms: Graph Paper Programming": {
          "overview": "By \"programming\" one another to draw pictures, students get an opportunity to experience some of the core concepts of programming in a fun and accessible way. The class will start by having students use symbols to instruct each other to color squares on graph paper in an effort to reproduce an existing picture. If there’s time, the lesson can conclude with images that the students create themselves.  ",
          "purpose": "Bu mashg‘ulotning maqsadi kurs davomida ishlatiladigan ba’zi bir asosiy dasturlash tushunchalarini tanishtirish bilan birga tanqidiy fikrlash mahoratini va kurs uchun qiziqishni oshirish. Tarmoqsiz darsda sinfga ketma-ketlik va algoritmlar kabi asosiy tushunchalarni tanishtirish orqali, komputer bilan ishlashga qo‘rqadigan talabalar bu mavzular bo‘yicha hanuzgacha asos yaratish imkoniyatiga ega bo‘lishadi. Bu darsda, talabalar biron algoritmni qanday qilib shakllantirishni va uni dasturga o‘girishni o‘rganishadi. ",
          "student_overview": "In this lesson, you will program your classmate to draw pictures!"
        },
        "coursed-2021/Introduction to Online Puzzles": {
          "overview": "Boshqotirmalarning bu to‘plamini talabalar Code.orgning onlayn ish joyi bilan tanishtiruvdan (yoki sinfingizning tajribasiga bog‘liq holda ko‘rib chiqish) boshlashadi. U yerda ish joyining asosiy vazifalariga ishora qiluvchi videolar bo‘ladi, jumladan, `Run`, `Reset`, va `Step` tugmalari. Shuningdek, mana bu videolarda ham muhokama qilinadi: Blockly bo‘limlarini ko‘chirib olish, Blockly bo‘limlarini o‘chirish, va Blockly bo‘limlarini bog‘lash. Keyingisi, talabalar labirintda o‘zlarining ketma-ketlik va debug qilish bo‘yicha mahoratlarini amalda qo‘llab ko‘rishadi. Bu yerda talabalar sikllar asoslarini o‘rganish davomida boshqotirmalarning yangi turlari, Yig‘uvchi, San’atkor va Hosil yig‘uvchi kabi turlarini ko‘rishadi.",
          "purpose": "Biz bilamizki, har bir sinfning har bir fan uchun o‘zining tushunish ko‘lami bo‘ladi. Sinfingizdagi ba’zilar komputer afsungarlari bo‘lishi mumkin, lekin boshqalari ko‘p tajribaga ega bo‘lmasligi mumkin. Hamma birdek o‘rganishi uchun biz Kurs D uchun  mana bu \"Ramp Up Stage\" ni yaratdik. Bu Code.org dan qanday foydalanish va asosiy Informatika tushunchalari bo‘yicha tanishtiruv yoki tahlil sifatida ishlatilishi mumkin. Bu bosqich Kurs D ni boshlash uchun talab qilinadigan barcha shartlarni qamrab oladi.",
          "student_overview": "Bu dars ushbu kurs uchun sizga kerak bo‘ladigan ko‘nikmalarni amalda bajarib ko‘rishingizga imkon beradi."
        },
        "coursed-2021/Relay Programming": {
          "purpose": "Informatika fanida jamoaviy ish juda muhimdir. Jamoalar birma-bir ishlash o'rniga, bir-birlari bilan kod yozishadi va disk sozlama  qilishadi. Ushbu darsda talabalar iloji boricha samarali bo'lishlari bilan birgalikda ishlashni o'rganadilar.\\\n Bu mashg'ulot talabalarni o'z vaqtlarini ehtiyotkorlik bilan saqlashga va xatolardan qochishga yo'l qo'ymaslik uchun o'rgatadigan shoshilinchlikni ta'minlaydi. Ushbu tajriba stressni keltirib chiqarishi mumkin (bu kutilmoqda!) Talabalarni mumkin bo'lgan ko'ngilsizliklarni  yengish uchun vositalar bilan ta'minlaganingizga ishonch hosil qiling. ",
          "student_overview": "Kursni boshida kod bilan chizmalar chizganingizni eslaysizmi? Bu darsda, xuddi shunga o‘xshash narsa qiish uchun biron jamoa bilan ishlaysiz!"
        },
        "coursed-2021/Debugging in Collector": {
          "overview": "Bu onlayn mashg‘ulotda talabalar \"yig‘uvchi\" muhitida debug qilishni mashq qilishadi. Talabalar boshqotirmalarni oddiy algoritmlar, sikllar va ichma-ich sikllar bilan to‘g‘rilash uchun kodni o‘qish va o‘zgartirishni mashq qilib ko‘rishadi.",
          "student_overview": "Siz hech kod yozish davomida muammolarga duch kelganmisiz? Bu darsda siz debug qilish sirlari haqida o‘rganasiz. Debug qilish bu kodingizdagi muammolarni topish va to‘g‘rilash jarayonidir."
        },
        "coursed-2021/Events in Bounce": {
          "overview": "Bu onlayn mashg‘ulotda, talabalar hodisalar nima ekanligi va komputerlar ularni video o‘yinlar kabi dasturlarda qanday ishlatishi haqida o‘rganishadi. Talabalar hodisalarga (masalan, yo‘nalishli tugmalar bosilganda) javob qaytaradigan qilish uchun boshqotirmalar ustida ishlashadi. Boshqotirmaning oxirida, talabalarda o‘yinlarini turli xil tezlik va tovushlar bilan moslashtirish imkoniyati tug‘iladi.",
          "purpose": "Hodisalar komputer dasturlarida keng qo‘llaniladi, ayniqsa, video o‘yinlarda.  \n\nBu darsda, talabalar sportga taaluqli o‘yin yasash orqali o‘zlarining hodisalar haqidagi tushunchalarini rivojlantirishadi. Talabalar ularning eshkaklarini yo‘nalishli tugmalarga asosan harakatlanadigan qiladi va ob’ektlar to‘qnashib ketganda shovqin soladigan qilishni o‘rgashadi. Eng oxirida, ular o‘yinini boshqalaridan ajralib turadigan qilish uchun uni moslashtiradi!",
          "student_overview": "Maktabda biron marta video o‘ynashni orzu qilganmisiz? Bu darsda, siz shaxsan o‘zingiznikini yaratasiz!"
        },
        "coursed-2021/Build a Star Wars Game": {
          "overview": "Bu darsda, talabalar onlayn tarzda tarqata oladigan o‘yinni yaratish uchun hodisalardan foydalanishni amalda sinab ko‘rishadi. R2-D2 va boshqa \"Star Wars\" belgilarini namoyish etgan holda, talabalar hodisalarni boshqaradilar, so'ngra o'zlarining o'yinlarini yaratish uchun joy ajratadilar.",
          "student_overview": "Bu darsda o‘z Star Wars o‘yiningizni yarata olish kuchini jis qiling."
        },
        "coursed-2021/Dance Party": {
          "overview": "Bu darsda, talabalar o‘zlarining interaktiv raqs bazmini dasturlashtiradilar. Qurilma musiqaga javob qaytarish uchun yaratilganligi sababli bu mashg‘ulot tovushni talab qiladi.",
          "purpose": "Ushbu dars Infomatikadagi asosiy tushunchalar, kodlash va hodisaviy dasturlash (bloklardan foydalangan holda) bilan tanishtiradi.",
          "student_overview": "Bayram qilish vaqti keldi! Ushbu darsda siz o‘z interaktiv raqs bazmingizni dasturlashtirasiz."
        },
        "coursed-2021/Loops in Ice Age": {
          "overview": "As a quick update (or introduction) to using loops, this stage will have students using the `repeat` block to get Scrat to the acorn more efficiently.",
          "student_overview": "In this lesson you'll use the repeat block to help Scrat reach the acorn as efficiently as possible."
        },
        "coursed-2021/Loops in Artist": {
          "overview": "This lesson builds on the understanding of loops from previous lessons and gives students a chance to be truly creative.  This activity doubles as a debugging exercise for extra problem-solving practice.",
          "purpose": "Ushbu ketma-ketlik boshqotirmalar to‘plami yordamida o‘quvchilarga nima uchun takrorlanuvchi sikllar qo‘lda yozilganidan ko‘ra ustunligini ko‘rsatish orqali sikllarning qudratini ta’kidlab ko‘rsatadi.",
          "student_overview": "In this lesson, loops make it easy to make cool images with the Artist!"
        },
        "coursed-2021/Nested Loops in Bee": {
          "overview": "Bu onlayn mashg‘ulotda, talabalarda o‘zlarining sikllar haqidagi tushunchalarini butun yangi darajaga olib o‘tish imkoni tug‘iladi. Asalari va O‘simliklar vs Zombilar bilan o‘ynab, talabalar boshqa sikl ichida bo‘ladigan boshqa bir siklni qanday dasturlashni o‘rganishadi. Ular yana 'Run' bosilganda sikllardagi kichik o‘zgarishlar ularning dasturiga qanday ta’sir ko‘rsatishini aniqlash uchun ruhlantiriladi.",
          "student_overview": "Loops inside loops inside loops. What does this mean? This lesson will teach you what happens when you create a nested loop."
        },
        "coursed-2021/Conditionals with Cards": {
          "student_overview": "Ma’lum bir shartlar bajarilgandagina bal yig‘ishingiz mumkin bo‘lgan o‘yin o‘ynashning vaqti!"
        },
        "coursed-2021/lesson-6": {
          "overview": "Bu dars aslida, Minecraft jamoasi bilan birgalikda Hour of Code uchun yaratilgan. Talabalar shu paytgacha o‘rgangan g‘oyalarini amalda sinab ko‘rish, shuningdek, shartli bayonotlarning yashirin jihatlarini ko‘rib chiqish imkoniyatiga ham ega bo‘ladilar!",
          "purpose": "Boshqotirmalarning bu to‘plami sikllar bo‘yicha bilimga ega bo‘lish va uni kengaytirish uchun juda foydali va shartli bayonotlar bilan tanishtiradi. Bu tushunchalarni birga ishlatgan holda, talabalar yangi va hayajonli muhitda qiziqarli va zamonaviy dastur yaratish salohiyatiga ega bo‘ladilar.",
          "student_overview": "Lavadan saqlaning! Bu yerda siz Minecraft dunyosidagi shartli bayonotlar haqida o‘rgana boshlaysiz."
        },
        "coursed-2021/Conditionals in Bee": {
          "overview": "Shu paytgacha talabalar har safar ishlatib ko‘rilganda aynan bir xil tarzda ijro etiladigan -ishonchli, ammo moslashuvchan bo‘lmagan kod yozib kelishayotgan edi. Bu darsda, sinfingiz dasturingiz turli xil maxsus holatlarga duch kelishiga qarab turli xil vazifalarni bajaradigan funksiyalarni yozishga imkon beradigan shartli boyonotlar bilan kod yozishni boshlashadi.",
          "student_overview": "Siz hozir shartli boyonotlarni tushunib oldingiz, endi asal va gul shirasini yig‘adigan Asalari dasturini tuzishda ulardan foydalansak bo‘ladi. "
        },
        "coursed-2021/While Loops in Farmer": {
          "student_overview": "Sikllar kod yozishda juda foydali. Bu dars sizga siklning yangi turini o‘rgatadi: while sikllari!"
        },
        "coursed-2021/Until Loops in Maze": {
          "overview": "Bu darsda, talabalar `until` sikllari haqida o‘rganishadi. Talabalar o‘zlari xohlagan nuqtagacha qaytarilaveradigan harakatlarni ijro etuvchi obrazga ega bo‘lgan dastur yaratishadi.",
          "purpose": "Boshqotirmalarning bu to‘plami `until` shartini qo‘shish orqali o‘quvchilarga sikllar haqida bilishga va bilimlarini mustahkamlashga yordam beradi. Bu ikki tushunchani birgalikda ishlatish orqali, talabalar murakkab va yangi dasturlar yaratish uchun salohiyatni tadqiq qila oladilar.",
          "student_overview": "`Until` sikli bilan siz ba’zi bir ajoyib narsalarni amalga oshira olasiz!"
        },
        "coursed-2021/End of Course Project": {
          "overview": "Ushbu yakunlovchi dars o‘quvchilarni o‘zlarining loyihalarini loyihalashtirish, ishlab chiqish va namoyish etish jarayonidan o‘tadi!",
          "student_overview": "Ushbu qo‘llarni bir dunyo kod yozish uchun tayyorlang! Loyihangizni yaratishni boshlashning vaqti keldi."
        },
        "express-2021/Programming with Angry Birds": {
          "overview": "Jahldor qushlar o‘yinidagi obrazlardan foydalanib, talabalar qushni labirintning bir tomonidan boshqa tomonidagi cho‘chqaga qaratib harakatlantirish uchun ketma-ket algoritmlarni tuzib chiqadilar. Buni qilish uchun ular to‘g‘riga, chapga va keyin o‘ngga harakatlanadigan qilib kod bo‘limlarini chiziqli ketma-ketlikda taxlab chiqishadi.",
          "student_overview": "Angry Birds bilan ketma-ketlik va algoritmlar haqida o‘rganing."
        },
        "express-2021/Debugging with Scrat": {
          "overview": "Debug qilish dasturlashni o‘rganishning muhim elementidir. Bu darsda, talabalar noto‘g‘ri yechilgan boshqotirmalarga duch kelishadi. Ular xatolikni topish uchun mavjud kodni qatorma-qator tekshirib chiqishadi, jumladan, noto‘g‘ri ishlatilgan sikllar, unutib qoldirilgan bo‘limlar, ortiqcha bo‘limlar va tartibdan tashqaridagi bo‘limlarni.",
          "student_overview": "Boshqotirmalardagi muammolarni toping va debug qilish mahoratingizni amalda sinab ko‘ring."
        },
        "express-2021/Collecting Treasure with Laurel": {
          "overview": "Boshqotirmalar to‘plamida, talabalar algoritmlar va debug qilish bo‘yicha o‘zlarining tushunchalarini rivojlantirishda davom etishadi. Yangi obraz, sarguzashtchi Laurel bilan talabalar Laurelni u yo‘lak bo‘ylab harakatlanganda xazinalar cho‘qqisiga olib chiqish uchun algoritmlar ketma-ketligini yaratishadi."
        },
        "express-2021/Creating Art with Code": {
          "overview": "Bu darsda talabalar ekrandagi chizmalarni tugatish uchun Rassomni boshqarishadi. Bu Rassom bosqichi talabalarga yangi bo‘limlar, masalan, `move forward by 100 pixels` va `turn right by 90 degrees` kabilardan foydalangan holda yuqori mukammallikdagi rasmlar yaratish imkonini beradi.",
          "purpose": "Talabalar oldingi tajribalarini ketma-ketlik bilan boshlagan bo‘lsa, bu dars kod yozishni ko‘proq ijodkorlik bilan ilhomlantirish uchun ishlaydi. Bu darsning maqsadi yangi bo‘limlar va maqsadlarni tanishtirish orqali ketma-ketlik bo‘yicha bilimlarni mustahkamlash uchun. Bu holda, talabalar hamon o‘zlarining ketma-ketlik bo‘yicha ko‘nikmalarini amalda sinash bilan bir vaqtda yangi bo‘limlardan foydalanib, ko‘proq piksellar va burchaklar haqida ham o‘rganishadi. Shuningdek, talabalar yangi maqsadlar, masalan, biron kvadrat chizish uchun ushbu San’atkorni kodini yozishni tasavvur qilishga qodir bo‘ladi.",
          "student_overview": "Rassomni dasturlash orqali chiroyli rasmlar yarating."
        },
        "express-2021/Swimming Fish in Sprite Lab": {
          "overview": "In this lesson, students will learn about the two concepts at the heart of Sprite Lab: sprites and behaviors. Sprites are characters or objects on the screen that students can move, change, and manipulate. Behaviors are actions that sprites will take continuously until they are stopped.",
          "student_overview": "Learn how to create and edit sprites."
        },
        "express-2021/Virtual Pet with Sprite Lab": {
          "overview": "Bu darsda talabalar ular xohlagandek ko‘rinadigan va o‘zini tutadigan interfaol virtual uy hayvonini yaratishadi. Talabalar uy hayvoninig tashqi ko‘rinishini moslashtirish uchun Sprite Labning \"Costumes\" qurilmasidan foydalanishadi. Keyin ular uy hayvonini jonlantirish uchun hodisalar, xatti-harakatlar va ular o‘rgangan boshqa tushunchalardan foydalanishadi!",
          "student_overview": "In this lesson, students will create an interactive Virtual Pet that looks and behaves how they wish. Students will use Sprite Lab's \"Costumes\" tool to customize their pet's appearance. They will then use events, behaviors, and other concepts they have learned to give their pet a life of its own!"
        },
        "express-2021/lesson-1": {
          "overview": "Bu darsda, talabalar o‘zlarining interaktiv raqs bazmini dasturlashtiradilar. Qurilma musiqaga javob qaytarish uchun yaratilganligi sababli bu mashg‘ulot tovushni talab qiladi.",
          "purpose": "Ushbu dars Infomatikadagi asosiy tushunchalar, kodlash va hodisaviy dasturlash (bloklardan foydalangan holda) bilan tanishtiradi.",
          "student_overview": "Bayram qilish vaqti keldi! Ushbu darsda siz o‘z interaktiv raqs bazmingizni dasturlashtirasiz."
        },
        "express-2021/Loops with Rey and BB-8": {
          "student_overview": "Sikllardan foydalanib BB-8 ga labirint bo‘ylab harakatlanishida yordam bering! "
        },
        "express-2021/Sticker Art with Loops": {
          "overview": "Watch student faces light up as they make their own gorgeous designs using a small number of blocks and digital stickers! This lesson builds on the understanding of loops from previous lessons and gives students a chance to be truly creative.  This activity is fantastic for producing artifacts for portfolios or parent/teacher conferences.",
          "purpose": "Bu to‘plamlar sikllarning ahammiyatini yaratuvchan va shaxsiy dizaynlar bilan ta’kidlab ko‘rsatadi.\n\n Loyiha ortidagi ketma-ketlik sifatida taklif qilinib, bu o‘sish talabalarga o‘z ishining ustasi bo‘lishga va ajoyib asarlar yaratishga imkon beradi.",
          "student_overview": "In this lesson, loops make it easy to make even cooler images with Artist!"
        },
        "express-2021/Nested Loops in Maze": {
          "overview": "Bu onlayn mashg‘ulotda, talabalarda o‘zlarining sikllar haqidagi tushunchalarini butun yangi darajaga olib o‘tish imkoni tug‘iladi. Asalari va O‘simliklar vs Zombilar bilan o‘ynab, talabalar boshqa sikl ichida bo‘ladigan boshqa bir siklni qanday dasturlashni o‘rganishadi. Ular yana 'Run' bosilganda sikllardagi kichik o‘zgarishlar ularning dasturiga qanday ta’sir ko‘rsatishini aniqlash uchun ruhlantiriladi.",
          "student_overview": "Loops inside loops inside loops. What does this mean? This lesson will teach you what happens when you create a nested loop."
        },
        "express-2021/Snowflakes with Anna and Elsa": {
          "overview": "Endi talabalar o‘z siklarini qatlamlarga ajratishni bilib olishadi, ular ko‘plab chiroyli narsalar yarata olishadi.  Ushbu dars talabalarni Anna va Elzaning muzda uchish bo'yicha mukammal qobiliyatlaridan foydalangan holda o'zlarining portfoliosi uchun tayyor tasvirlarini yaratishda yordam beradigan bir qator mashqlarni bajaradi!",
          "purpose": "Bu ketma-ketlikda, talabalar tarqatish uchun ajoyib bo‘lgan rasmlar yasab ko‘rish orqali ichma-ich sikllarni amalda ishlatib ko‘rishadi. \n\nQo‘lbola ko‘rsatmalar boshlab, takrorlashlar uchun dizayn yaratishga kelganda talabalar o‘zlari qaror qabul qiladilar.   Keyin ular chindan ham noyob san'at asarini yaratish uchun turli xil usullarni qo‘llashadi.",
          "student_overview": "Anna va Elsaning ajoyib muzda uchish qobiliyati bor, ammo muzda shakllar yaratish uchun ularga yordamingiz kerak. AJOYIB nimadir yaratish uchun ichma-ich sikllardan foydalaning. "
        },
        "express-2021/Looking Ahead with Minecraft ": {
          "overview": "Bu dars aslida, Minecraft jamoasi bilan birgalikda Hour of Code uchun yaratilgan. Talabalar shu paytgacha o‘rgangan g‘oyalarini amalda sinab ko‘rish, shuningdek, shartli bayonotlarning yashirin jihatlarini ko‘rib chiqish imkoniyatiga ham ega bo‘ladilar!",
          "purpose": "Boshqotirmalarning bu to‘plami sikllar bo‘yicha bilimga ega bo‘lish va uni kengaytirish uchun juda foydali va shartli bayonotlar bilan tanishtiradi. Bu tushunchalarni birga ishlatgan holda, talabalar yangi va hayajonli muhitda qiziqarli va zamonaviy dastur yaratish salohiyatiga ega bo‘ladilar.",
          "student_overview": "Lavadan saqlaning! Bu yerda siz Minecraft dunyosidagi shartli bayonotlar haqida o‘rgana boshlaysiz."
        },
        "express-2021/If/Else with Bee": {
          "overview": "Shu paytgacha talabalar har safar ishlatib ko‘rilganda aynan bir xil tarzda ijro etiladigan -ishonchli, ammo moslashuvchan bo‘lmagan kod yozib kelishayotgan edi. Bu darsda, sinfingiz dasturingiz turli xil maxsus holatlarga duch kelishiga qarab turli xil vazifalarni bajaradigan funksiyalarni yozishga imkon beradigan shartli boyonotlar bilan kod yozishni boshlashadi.",
          "student_overview": "Siz hozir shartli boyonotlarni tushunib oldingiz, endi asal va gul shirasini yig‘adigan Asalari dasturini tuzishda ulardan foydalansak bo‘ladi. "
        },
        "express-2021/While Loops with the Farmer": {
          "student_overview": "Sikllar kod yozishda juda foydali. Bu dars sizga siklning yangi turini o‘rgatadi: while sikllari!"
        },
        "express-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "Bu dars aslida, Minecraft jamoasi bilan birgalikda Hour of Code uchun yaratilgan. Talabalar shu paytgacha o‘rgangan g‘oyalarini amalda sinab ko‘rish, shuningdek, shartli bayonotlarning yashirin jihatlarini ko‘rib chiqish imkoniyatiga ham ega bo‘ladilar!",
          "student_overview": "Bu yerda siz Minecreaft dunyosidagi shartli bayonotlar haqida o‘rganasiz."
        },
        "express-2021/Until Loops in Maze": {
          "overview": "Bu darsda, talabalar `until` sikllari haqida o‘rganishadi. Talabalar o‘zlari xohlagan nuqtagacha qaytarilaveradigan harakatlarni ijro etuvchi obrazga ega bo‘lgan dastur yaratishadi.",
          "student_overview": "`Until` sikli bilan siz ba’zi bir ajoyib narsalarni amalga oshira olasiz!"
        },
        "express-2021/Harvesting with Conditionals": {
          "overview": "Talabalar `while` sikllarini, `until` sikllarini va `if / else` bayonotlarini amalda ishlatib ko‘rishadi. Bu bo‘limlarning barchasi shartli bayonotlardan foydalanishadi. Bu uchchalasini ham amalda bajarib ko‘rish orqali, talabalar mukammal va moslashuvchan kod yozishni o‘rganishadi.",
          "purpose": "Shartli boyonotlardan foydalanishni turli xil ssenariylarda bajarib ko‘rish talabalarning shartli boyonotlar nima qila olishi haqidagi tushunchalarini rivojlantirishga yordam beradi. Oldingi darsda, talabalar shartli boyonotlardan faqatgina labirint bo‘ylab harakatlanish uchun foydalanishgan. Bu darsda, talabalar fermer hosilni qachon yig‘ib olinishi kerakligini bilishiga yordam berish uchun sharrtli boyonotlardan foydalanishadi. Yangi ko‘rinishlar paydo bo‘ladi va talabalar kod qayerda ishlatilishi va takrorlanishi kerakligini aniqlash uchun ijodiy va mantiqiy fikrlashdan foydalanishadi.",
          "student_overview": "Har bir shartli bayonotni qachon ishlatish kerakligini har doim ham aniq bilib bo‘lmaydi. Bu dars sizga nima qilish kerakligini hal qilishingizga yordam beradi."
        },
        "express-2021/Functions in Minecraft": {
          "overview": "Students will begin to understand how functions can be helpful in this fun and interactive Minecraft adventure!",
          "purpose": "Talabalar turli xil muhitda funksiyalarni bajarish orqali dasturlashning ko'p qirraliligini kashf etadilar. Bu yerda talabalar qayta ishlatilishi mumkin bo'lgan naqshlarni tanib oladilar va oldindan belgilangan funksiyalarni chaqirish uchun nomlangan bloklarni birlashtira oladilar.",
          "student_overview": "Can you figure out how to use functions for the most efficient code?"
        },
        "express-2021/Functions with Artist": {
          "overview": "Talabalar Rassom bilan funksiyalarni ishlatishga kirishadi. Jozibali rasmlar yaratiladi va o‘zgartiriladi. Yanada murakkabroq ko‘rinishlar uchun, talabalar biron funksiya ichida boshqa birini chaqirish orqali ichma-ich funksiyalar haqida o‘rganishadi.",
          "student_overview": "Funksiyalar bilan murakkab chizmalarni osonlashtiring!"
        },
        "express-2021/Functions with Harvester": {
          "overview": "Talabalar Rassom loyihasida ta’sirchan dizaynlar yaratishni va Asalarini labirintda yo‘naltirishni mashq qilib ko‘rishgan, ammo bugun ular funksiyalardan dehqondagi hosilni yig‘ish uchun ishlatadilar. Bu dars talabalarni funksiyalardan 'while' sikli va 'if/else' bayononotlari bilan birlashtirgan holda foydalanishga undaydi.",
          "student_overview": "Fermerga yordam berayotganingizda, funksiyalar sizni ko‘p ishlar qilishdan saqlab qoladi!"
        },
        "express-2021/Variables with Artist": {
          "overview": "Ushbu darsda talabalar Artist  muhitida o'zgaruvchilar yordamida takrorlanadigan dizaynlarni yaratishni o'rganadilar. Talabalar o'zgaruvchilar yordamida qanday qilib kodni yozishni va o'qishni osonlashtirish uchun qanday foydalanish mumkinligini bilib oladilar. Yonaltirilgan jumboqlar tugagandan  so'ng talabalar freeplay darajasida o'zlarining o'rgangan narsalarini namoyish etish va o'z dizaynlarini yaratishni o’rganadilar ",
          "purpose": "O'zgaruvchilar asosan dasturni ishga tushirishda noma'lum bo'lishi mumkin bo'lgan qiymatlarni yoki dasturni bajarish paytida o'zgarishi mumkin bo'lgan qiymatlarni to'ldiruvchidir. Bular dinamik kod yaratish uchun juda muhimdir, chunki ular sizning dasturingizni o'zgartirishga imkon beradi va har qanday potentsial modifikatsiyaga asoslangan holda o'sishi mumkin. Ushbu bosqich o'zgaruvchilarni ishlatishni kuchaytiradi, ularni o'rnatish va ulardan foydalanishning eng oddiy imkoniyatlaridan foydalanadi. ",
          "student_overview": "In this lesson, you'll make drawings using variables that change as the program runs."
        },
        "express-2021/Changing Variables with Bee": {
          "overview": "This lesson will help illustrate how variables can make programs more powerful by allowing values to change while the code is running. ",
          "student_overview": "This bee loves variables!"
        },
        "express-2021/For Loops with Bee": {
          "overview": "Featuring Bee, this lesson focuses on `for` loops and using an incrementing variable to solve more complicated puzzles. Students will begin by reviewing loops from previous lessons, then they'll walk through an introduction to `for` loops so they can more effectively solve complicated problems.",
          "student_overview": "Buzz buzz. Ushbu jumboqlarda siz asalarini for sikllari yordamida gul shirasi va asalga yo'naltirasiz."
        },
        "express-2021/For Loops with Artist": {
          "overview": "In this lesson, students continue to practice `for` loops, but this time with Artist. Students will complete puzzles combining the ideas of variables, loops, and `for` loops to create complex designs. At the end, they will have a chance to create their own art in a freeplay level.",
          "student_overview": "Keyingi asaringizni yaratishga tayyorlaning. Bu yerda siz 'for' sikllari yordamida hayratlantiruvchi rasmlarni yaratasiz."
        },
        "express-2021/End of Course Project": {
          "overview": "Ushbu yakunlovchi dars o‘quvchilarni o‘zlarining loyihalarini loyihalashtirish, ishlab chiqish va namoyish etish jarayonidan o‘tadi!",
          "student_overview": "Ushbu qo‘llarni bir dunyo kod yozish uchun tayyorlang! Loyihangizni yaratishni boshlashning vaqti keldi."
        },
        "pre-express-2021/Learn to Drag and Drop": {
          "overview": "Bu dars o‘quvchilarga ular kompyuter laboratoriyalariga kirganda nima kutishi kerakligi haqida o‘rgatadi. U ularga laboratoriya qonun-qoidalarini tanishtirish kabi qisqacha muhokama bilan boshlanadi, shunda ularda onlayin boshqotirmalarni yechishda kompyuterdan foydalanishda o‘sish kuzatiladi.",
          "purpose": "Bu darsning asl maqsadi talabalarga komputer bilan ishlash tajribasiga erishishiga yordam berish. Bosish, ko‘chirib olish va ko‘chirib qo‘yish kabi eng asosiy funksiyalarini o‘tish orqali, biz sinfda kelajakdagi boshqotirmalar uchun yana ham tengroq shug‘ullanish maydoni yaratayapmiz. Bu dars yana mos komputer labaratoriyasi xatti-harakatlaini tanishtirish uchun ajoyib imkoniyat bilan ta’minlaydi.",
          "student_overview": "Click and drag to finish the puzzles."
        },
        "pre-express-2021/Sequencing with Scrat": {
          "overview": "Using Scrat from the Ice Age franchise, students will develop sequential algorithms to move a squirrel character from one side of a maze to the acorn at the other side. To do this they will stack code blocks together in a linear sequence.",
          "purpose": "Bu darsda, talabalar biron komputer platformasida o‘zlarining debug qilish va dasturlash mahoratlarini oshiradilar. Bu boshqotirmalarning bo‘limlarga asoslangan shakli talabalarga sintaksisni mukammallashtirish haqida o‘ylamasdan ketma-ketlik va tushunchalar haqida o‘rganishga yordam beradi.",
          "student_overview": "Program Scrat to reach the acorn."
        },
        "pre-express-2021/Programming in with Angry Birds": {
          "overview": "Using characters from the Ice Age, students will develop sequential algorithms to move Scrat from one side of a maze to the acorn at the other side. To do this they will stack code blocks together in a linear sequence, making them move straight, turn left, or turn right.",
          "purpose": "Bu darsda, talabalar biron komputer platformasida o‘zlarining debug qilish va dasturlash mahoratlarini oshiradilar. Bu boshqotirmalarning bo‘limlarga asoslangan shakli talabalarga sintaksisni mukammallashtirish haqida o‘ylamasdan ketma-ketlik va tushunchalar haqida o‘rganishga yordam beradi."
        },
        "pre-express-2021/Programming with Rey and BB-8": {
          "overview": "Ushbu darsda talabalar o'zlarining yangi dasturlash qobiliyatlaridan yanada murakkab usullarda BB-8 bilan murakkab kursni o'tish uchun foydalanadilar.",
          "purpose": "Xayoldagi bilimlarni ko‘chirish bilan, bu dars talabalarga o‘zlashtirib kelinayotgan mahoratlarini amalda bajarib ko‘rishi uchun yangi muhit yaratib beradi. Star Warsning ishqibozlari bu boshqotirmalarni ko‘rib, xursandchilikdan osmonga sakraydilar. Bu to‘plamdagi har bir boshqotirma ular kursning qolgan qismida foydalanadigan asosiy tushunchalarning chuqurroq mohiyati bilan ta’minlash uchun qo‘shilgan."
        },
        "pre-express-2021/Programming in Harvester": {
          "overview": "Talabalar Terimchi (Harvester) muhitida o‘rgangan dasturlash tushunchalariga murojaat qiladilar. Endi, shunchaki obrazni maqsadiga yetkazish o‘rniga, talabalar biron yangi bo‘limdan foydalanib hosilni yig‘ishi kerak bo‘ladi. Talabalar algoritmlar ketma-ketligi bo‘yicha mahoratlarini oshirishda davom etadilar va debug qilish jarayonidan foydalanishni boshlashadi.",
          "purpose": "Bu darsda, talabalar o‘zlarining debug qilish mahoratlarini oshiradilar va dasturlash mahoratlarini oshirishda davom etadilar.",
          "student_overview": "Terimchiga yo‘lida sabzavotlarni yig‘ib olishiga yordam bering."
        },
        "pre-express-2021/Loops with Scrat": {
          "purpose": "Bu darsda, talabalar ko‘proq sikllar va bo‘limlar bilan kodlashda ularni qanday qo‘llash haqida o‘rganishadi. Dasturlashda sikllardan foydalanish muhim ko‘nikma hisoblanadi chunki, buyruqlarni taxminiy ravishda takrorlayverish samarasiz va zerikarli. Bu Code.org boshqotirmalari bilan, talabalar mavjud sikllarga ko‘rsatmalar qo‘shishni, sikl ichida takrorlanuvchi kodni jamlashni va takrorlanishi kerak bo‘lgan ko‘rinishlarni tanishni o‘rganishadi.",
          "student_overview": "Help Scrat cover more ground using loops."
        },
        "pre-express-2021/Loops with Laurel": {
          "overview": "Bu darsda, talabalar sikllar tushunchasini o‘rganishda davom etishadi. Mana bu yerda, Laurel the Adventurer ochiq g‘ordagi xazinani yig‘ishda sikllardan foydalanadi. Uning sayohati davomida unga yordam berish uchun yangi 'get treasure' bo‘limi tanishtiriladi.",
          "purpose": "Bu dars talabalarga sikllar bilan ko‘proq amalyot qilish imkonini beradi va ularni iloji boricha ko‘proq xazina yig‘ishi uchun ‘takrorlanuvchi’ sikl ichida ko‘plab bo‘limlarni joylashtirishga undaydi. "
        },
        "pre-express-2021/Ocean Scene with Loops": {
          "overview": "Sikllar mavzusiga qaytgan holda, talabalar ko‘rsatmalarning oddiy ketma-ketligini takrorlash orqali rasmlar chizishni o‘rganishadi. Kompyuter bilan o‘tilgan oldingi darsda, sikllar labirintdan o‘tish va xazinani yig‘ish uchun foydalanilgan edi. Bu yerda, sikllar yordamida shakllar yaratilyapti. Bu bosqichning oxirida, talabalarga sikllardan foydalanib o‘z rasmlarini yaratish imkoniyati beriladi.",
          "purpose": "Bu dars sikllar dasturlashda narsalarni qanday qilib yarata olishi bo‘yicha turli xil nuqta’i nazarni shakllantiradi. Talabalar bu yerda sikllarsiz dasturlashning samarasizligini ham aks ettira olishadi chunki dasturning ko‘plab bo‘limlari 'takrorlanuvchi' sikllar yordamiga muhtoj.",
          "student_overview": "Use loops and patterns to finish the images."
        },
        "pre-express-2021/Drawing Gardens with Loops": {
          "overview": "Sikllarga qaytadigan bo‘lsak, talabalar ko‘rsatmalarning oddiy ketma-ketligini takrorlash orqali rasm chizishni o‘rganishadi. Oldingi onlayn darsda, sikllar labirintni kesib o‘tish va xazina to‘plash uchun ishlatilgan. Bu yerda talabalar sikllardan ko‘rinishlar yaratishda foydalanishadi. Bu bosqichning oxirida, talabalarga sikllardan foydalanib o‘zlarining shaxsiy rasmlarini yaratish imkoniyati beriladi.",
          "purpose": "Bu dars dasturlashda sikllar qanday qilib ba’zi narsalarni yarata olishi bo‘yicha turli xil nuqta’i nazar bilan ta’minlaydi. Talabalar berilgan kodni baholash va boshqotirmani yechish uchun qanday qo‘shimchalar qilish keraklini aniqlash orqali o‘zlarining tanqidiy fikrlash mahoratlarini sinab ko‘rishadi. Talabalar bu yerda sikllarsiz dasturlashning samarasizligini ham aks ettishlari mumkin chunki, takrorlanuvchi sikllarsiz ushbu dastur ko‘plab bo‘llimlarni talab qiladi.",
          "student_overview": "Use patterns and loops to finish the images."
        },
        "pre-express-2021/On the Move with Events": {
          "overview": "Bu onlayn mashg‘ulotda, o‘quvchilar Play Labdagi hodisalardan qanday foydalanishni o‘rganish va ular animatsiyalashtirilgan o‘yinlar yaratishda o‘rgangan kod yozish mahoratlaridan foydalanish imkoniyatiga ega bo‘ladilar. Ijod qilish va Play Labda o‘z hikoyangizni yaratish vaqti keldi!",
          "purpose": "Bugun talabalar Play Labdan foydalanib hodisalar haqidagi tushunchalarini yanada rivojlantiradilar. Ko‘plab komputer daasturlarida hodisalar juda muhim hisoblanishadi. Bu mashg‘ulotda, talabalar hodisalardan biron obrazni ekran bo‘ylab harakatlantirishda, shovqin solishda va foydalanuvchi qanday boshlashiga qarab fonni o‘zgartirishda ishlatishadi.",
          "student_overview": "O'z o'yiningiz yoki hikoyangizni yarating!"
        },
        "pre-express-2021/A Royal Battle with Events": {
          "overview": "Bu onlayn mashg‘ulotda, talabalarda Play Labda hodisalardan qanday foydalanishni o‘rganish va animatsiyalashtirilgan o‘yin yaratish uchun ular o‘rgangan barcha kod yozish mahoratlariga murojaat qilish imkoniyati mavjud. Yaratuvchan bo‘lish vaqti keldi va Play Labda biron o‘yin yarating!",
          "purpose": " Bu onlayn mashg‘ulotda, talabalar Play Labda hodisalardan qanday foydalanishni o‘rganishadi. Ular yo‘nalishli tugma bosilganda otliqni harakatlantirishni mashq qilib ko‘rish orqali boshlashadi va keyin tekinga o‘ynaladigan boshqotirma a’zosi sifatida bu kurs davomida o‘rgangan boshqa mahoratlari, jumladan ketma-ketliklar va sikllarni namoyish qilish imkoniyati bilan tugatishadi.",
          "student_overview": "Use events to create a story or make an interactive game."
        },
        "coursee-2021/Simon Says": {
          "overview": "Ushbu darsda o‘quvchilar to‘g‘ri natija berish uchun qanday buyruqlar berish kerakligi haqida fikr yuritishga mo‘ljallangan o‘yin o‘ynaydilar. Bu ularga kelgusi darslarda Sprite Labga osonroq o‘tishga yordam beradi.",
          "student_overview": "O‘ynang va natijaga erishish uchun qanday buyruqlar kerakligini o‘ylab ko‘ring."
        },
        "coursee-2021/Learning Sprites with Sprite Lab": {
          "overview": "In this lesson, students will learn about the two concepts at the heart of Sprite Lab: sprites and behaviors. Sprites are characters or objects on the screen that students can move, change, and manipulate. Behaviors are actions that sprites will take continuously until they are stopped.",
          "student_overview": "Learn how to create and edit sprites."
        },
        "coursee-2021/Alien Dance Party with Sprite Lab": {
          "overview": "Ushbu darsda o‘quvchilar o‘z interaktiv animatsiyalari va o‘yinlarini yaratishlari mumkin bo‘lgan \"Sprite Lab\" platformasi bilan tanishtiriladi. Xatti-harakatdan tashqari, bugun talabalar \"begonalar raqs partiyasini\" yaratish uchun foydalanuvchi kiritishlarini hodisa sifatida qo‘shadilar.",
          "student_overview": "Create an interactive project that can be shared with classmates."
        },
        "coursee-2021/lesson-4": {
          "student_overview": "Kiberhujumni ko‘rganingizda qanday qilib undan himoyada bo‘lishingizni bilib oling."
        },
        "coursee-2021/Private and Personal Information": {
          "student_overview": "Internet qiziqarli va maroqli, ammo xavfsiz bo‘lish ham muhim. Bu dars sizga tarqatish uchun xavfsiz bo‘lgan axborot va maxfiy qolishi kerak bo‘lgan axborotlar o‘rtasidagi farqni o‘rgatishadi. "
        },
        "coursee-2021/About Me": {
          "student_overview": "SpriteLab bilan interaktiv plakat yaratish orqali talabalar Internetda shaxsiy va maxfiy ma'lumotlarni almashish haqidagi bilimlarini qo‘llaydilar."
        },
        "coursee-2021/Digital Sharing": {
          "purpose": "Talabalar tez orada bir-biriga ulashish uchun loyihalar yaratayotgan bo‘lishadi va bu loyihalarning ko‘pchiligi talabalarning o‘zlari yaratmagan kod yoki tasvirlardan tashkil topadi. Ushbu dars talabalarga o'zlariga tegishli bo'lmagan tarkibdan foydalanishning to'g'ri usullarini ko'rsatish uchun berilgan.",
          "student_overview": "In this lesson, you'll learn about the challenges and benefits of ownership and copyright. "
        },
        "coursee-2021/Programming and Loops with the Artist": {
          "overview": "Watch student faces light up as they make their own gorgeous designs using a small number of blocks and digital stickers! This lesson builds on the understanding of loops from previous lessons and gives students a chance to be truly creative.  This activity is fantastic for producing artifacts for portfolios or parent/teacher conferences.",
          "student_overview": "In this lesson, loops make it easy to make even cooler images with Artist!"
        },
        "coursee-2021/Nested Loops in Artist": {
          "purpose": "Bu onlayn mashg‘ulotda, talabalar o‘zlari sevgan do‘stlari bilan g‘ururlanib ulasha oladigan San’atkor uchun dizaynlar yaratishadi. \n\nBu mashg‘ulotning maqsadi boshqa bir ijodkorona chiqish yo‘li sifatida talabalarni artistona fikrlar bilan kodlashini ko‘rish uchun ruhlantiradigan usulda ichma-ich sikllardan foydalanish. Boshqotirmalarning bu to‘plami tanqidiy fikrlash mahoratlarini, boshlang‘ich geometriya tushunchalarini va yaratuvchanlikni shakllantirish uchun yaratilgan -- barchasi ichma-ich sikllar ko‘lamida o‘rganiladi!",
          "student_overview": "Ko‘proq ichma-ich sikllar! Bu safar biz ichma-ich sikllar bilan AJOYIB chizmalar chizamiz."
        },
        "coursee-2021/Nested Loops in Frozen": {
          "overview": "Endi talabalar o‘z siklarini qatlamlarga ajratishni bilib olishadi, ular ko‘plab chiroyli narsalar yarata olishadi.  Ushbu dars talabalarni Anna va Elzaning muzda uchish bo'yicha mukammal qobiliyatlaridan foydalangan holda o'zlarining portfoliosi uchun tayyor tasvirlarini yaratishda yordam beradigan bir qator mashqlarni bajaradi!",
          "student_overview": "Anna va Elsaning ajoyib muzda uchish qobiliyati bor, ammo muzda shakllar yaratish uchun ularga yordamingiz kerak. AJOYIB nimadir yaratish uchun ichma-ich sikllardan foydalaning. "
        },
        "coursee-2021/Functions: Songwriting": {
          "overview": "Informatika dunyosidagi eng ajoyib tuzilmalardan biri bu funksiya. Funksiyalar (ba'zida protsedura deb ham yuritiladi) - bu kichik dastur bo'lib, undan kattaroq dasturning ichida qayta-qayta foydalanishingiz mumkin. Ushbu dars talabalarga intuitiv ravishda funksiyalar nima uchun ekanligini va kod qismlarini funksiyalarga birlashtirish qanchalik foydali amaliyot bo'lishi mumkinligini tushunishga  yordam beradi. ",
          "purpose": "Funksiyalardan foydalanish kodni soddalashtirishga yordam beradi va talabaning o'z dasturini tartibga solish qobiliyatini rivojlantiradi. Talabalar funksiyalar yozishi uzun dasturlarini o'qishni osonlashtirishi va agar biror narsa noto'g'ri bo'lsa, disk sozlama qilishni osonlashtirishi mumkinligini tezda anglaydilar.",
          "student_overview": "Hatto rok yulduzlari ham dasturlash ko'nikmalariga muhtoj. Ushbu dars sizga qo'shiqlar matnlaridan foydalangan holda funksiyalar haqida ma'lumot beradi."
        },
        "coursee-2021/Functions in Minecraft": {
          "overview": "Students will begin to understand how functions can be helpful in this fun and interactive Minecraft adventure!",
          "purpose": "Talabalar turli xil muhitda funksiyalarni bajarish orqali dasturlashning ko'p qirraliligini kashf etadilar. Bu yerda talabalar qayta ishlatilishi mumkin bo'lgan naqshlarni tanib oladilar va oldindan belgilangan funksiyalarni chaqirish uchun nomlangan bloklarni birlashtira oladilar.",
          "student_overview": "Can you figure out how to use functions for the most efficient code?"
        },
        "coursee-2021/Functions in Artist": {
          "overview": "Talabalar Rassom bilan funksiyalarni ishlatishga kirishadi. Jozibali rasmlar yaratiladi va o‘zgartiriladi. Yanada murakkabroq ko‘rinishlar uchun, talabalar biron funksiya ichida boshqa birini chaqirish orqali ichma-ich funksiyalar haqida o‘rganishadi.",
          "student_overview": "Funksiyalar bilan murakkab chizmalarni osonlashtiring!"
        },
        "coursee-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "Bu dars aslida, Minecraft jamoasi bilan birgalikda Hour of Code uchun yaratilgan. Talabalar shu paytgacha o‘rgangan g‘oyalarini amalda sinab ko‘rish, shuningdek, shartli bayonotlarning yashirin jihatlarini ko‘rib chiqish imkoniyatiga ham ega bo‘ladilar!",
          "purpose": "Boshqotirmalarning bu to‘plami sikllar bo‘yicha bilimga ega bo‘lish va uni kengaytirish uchun juda foydali va shartli bayonotlar bilan tanishtiradi. Bu tushunchalarni birga ishlatgan holda, talabalar yangi va hayajonli muhitda qiziqarli va zamonaviy dastur yaratish salohiyatiga ega bo‘ladilar.",
          "student_overview": "Bu yerda siz Minecreaft dunyosidagi shartli bayonotlar haqida o‘rganasiz."
        },
        "coursee-2021/Conditionals": {
          "overview": "Bu dars talabalarga `while` siklari va `if / else` bayonotlarini tanishtiradi.  _While sikllari_ biron shart bajarilmaguncha davom etaveradigan sikllardir.  While sikllari dasturchi buyruqlarni aynan necha marta takrorlanishini bilmagan holda, ammo dasturchi sikl davom etishi uchun qanaqa shart bajarilishi kerakligini bilgan holda ishlatiladi. `If / Else` bayonotlari agar nimadir to‘g‘ri bo‘lsa, kodning butun bo‘limini ishlatish orqali va aks holda boshqa bir narsani ishlatish orqali dasturlashda qulayliklar taklif qiladi.",
          "student_overview": "Bu qiziqarli va qiyin bosqichda siz komputerga biron narsani ma’lum bir shart ostida bajarishni aytasiz."
        },
        "coursee-2021/Functions in Harvester": {
          "overview": "Talabalar Rassom loyihasida ta’sirchan dizaynlar yaratishni va Asalarini labirintda yo‘naltirishni mashq qilib ko‘rishgan, ammo bugun ular funksiyalardan dehqondagi hosilni yig‘ish uchun ishlatadilar. Bu dars talabalarni funksiyalardan 'while' sikli va 'if/else' bayononotlari bilan birlashtirgan holda foydalanishga undaydi.",
          "student_overview": "Fermerga yordam berayotganingizda, funksiyalar sizni ko‘p ishlar qilishdan saqlab qoladi!"
        },
        "coursee-2021/lesson-1": {
          "overview": "Miya hujumi (brainstorm) va faraziy ilovalar uchun qulay yechimlarni loyihalashtirish orqali kirish imkoniyati va empatiya qiymati haqida bilib oling. "
        },
        "coursee-2021/End of Course Project": {
          "overview": "Keyingi to‘rtta dars talabalarga biron kapston loyihasida kod yozish ko‘nikmalaridan foydalanish imkonini beradi. Bu loyiha yakka holda kod yozish bo‘yicha tajriba orttirishga va tengdoshlar va yaxshi ko‘rgan insonlar bilan ulashish uchun namuna yaratishga yordam beradi. Ko‘p dars  yoki ko‘p haftalik tajribaga ega bo‘lishi kutilgan holda, talabalar aqlli saralash, dizaynlashtirishni o‘rganish, yaratish va o‘zlarining yakuniy loyihalarini namoyish qilishga vaqt sarflashadi. \n\nTadqiq qilish bosqichida,  talabalar Rassom va ilhomlantirish uchun Sprite Labdagi loyihalarning oldindan yaratilgan misollari bilan ishlashadi. Keyingisida, talabalar dizaynlashtirish jarayoni va uni o‘z loyihalarida qanday amalga oshirishni o‘rganishadi. Keyin ularga Rassom, Sprite Lab yoki ular tanishib chiqadigan biron interfeysda o‘zlarining loyihalarini yaratishi uchun joy beriladi (bu loyihaning eng uzun bosqichi bo‘lishi kutiladi). Va nihoyat, talabalar tugatgan ishlarini do‘stlari bilan ulasha oladi.",
          "purpose": "Talabalar to‘g‘ridan-to‘g‘ri o‘z loyihalarini yaratish uchun tayyor bo‘lishlari mumkin, ammo bu dars ularning g‘oyalarini rejalarga aylantirishga yordam beradi. Ushbu tuzilma orzu qiluvchi ko‘ngillilarni bir joyda ushlab turgan holda, o’zlarini zulmatda qolgandek  his qiladiganlar uchun yo‘lni yoritib beradi. Qolaversa, talabalarga  o‘z loyihalarini yaratish va qayta ko‘rib chiqish uchun  yetarli vaqt bilan ta’minlaydi. Ushbu darsda ishtirok etgan sinov va xatolar muammolarni hal qilishga va qat’iylikka o‘rgatadi. ",
          "student_overview": "Projects this big take time and plenty of planning. Find your inspiration, develop a plan, and unleash your creativity!"
        }
      }
    }
  }
}