{
  "sk-SK": {
    "data": {
      "lessons": {
        "coursef-2021/Loops with the Artist": {
          "overview": "Sledujte nadšenie na tvárach vašich študentov ako si vytvoria nádherné obrázky pomocou malého počtu blokov a digitálnych pečiatok. Táto lekcia stavia na pochopení cyklov v predchádzajúcej lekcii a dáva študentom príležitosť naplno prejaviť svoju kreativitu. Táto aktivita tiež predstavuje vynikajúcu príležitosť na tvorbu diel pre portfólio, či ako ukážku pre rodičov. "
        },
        "coursef-2021/Variables that Change in Artist": {
          "overview": "V tejto lekcii študenti objavia tvorbu opakujúcich sa dizajnov s použitím premenných v prostredí Umelca. Študenti sa naučia používať premenné na tvorbu kódu tak aby sa jednoduchšie písal aj chápal. Prejdením riadených úloh, študenti kočia úrovňou volných hier a uvidia čo sa naučili a ako tvoria svoje vlastné dizajny."
        },
        "coursef-2021/For Loops in Artist": {
          "overview": "V tejto lekcii, s pomocou Umelca, študenti pokračujú v precvičovaní cyklov. V úlohách skombinujú premenné, cykly a cykly \"for\" na to, aby vytvorili komplexné kresby. Lekcia končí voľným cvičením na vytvorenie vlastnej kresby.",
          "student_overview": "Priprav sa na tvoje ďalsie majstrovské dielo. Budeš používať \"pre\" cykly. Všetkým z tvojich obrázkov padne sánka."
        },
        "coursef-2021/Simulating Experiments": {
          "overview": "Spustením jednoduchej simulácie v Sprite Lab si študenti vyskúšajú, ako je možné pomocou výpočtov zhromažďovať údaje, ktoré identifikujú trendy alebo vzory. Po opakovanom spustení simulácie budú mať študenti možnosť predpovedať, ako môže zmena premennej v simulácii ovplyvniť výsledok, a potom túto hypotézu otestovať.",
          "student_overview": "Spusti simulácie na počítači a experimentuj zmenou premenných."
        },
        "coursef-2021/Internet": {
          "overview": "I keď mnoho ľudí denne internet používa, veľa z nich nevie, ako funguje. V tejto lekcii budú študenti predstierať, že prechádzajú cez internet a to tak, že sa budú učiť o pripojeniach, URL aj IP adresách a DNS."
        },
        "courseb-2021/Move It, Move It": {
          "overview": "Táto lekcia mentálne pripraví študentov na programovacie cvičenia, s ktorými sa stretnú ďalej v tomto kurze. Študenti budú v malých tímoch používať fyzickú aktivitu, aby naprogramovali svojich spolužiakov tak, aby sa pozorne pohybovali z jedného miesta na druhé, až kým nedosiahnu cieľ."
        },
        "courseb-2021/Sequencing in Maze": {
          "overview": "Táto lekcia poskytne študentom predstavu o tom, čo očakávať, keď prídu do počítačových laboratórií. Začína krátkou diskusiou, ktorá im predstaví základy správania v počítačových laboratóriách, a potom pokročia k používaniu počítača na dokončenie online úloh."
        },
        "courseb-2021/Programming in Harvester": {
          "overview": "Študenti aplikujú naučené koncepty programovania v prostredí Záhradníčky. Tentokrát namiesto toho, aby len dostali charakter do cieľa, budú študenti zbierať kukuricu s pomocou nového bloku. Študenti budú pokračovať v rozvíjaní zručností sekvenčných algoritmov a začnú používať debugovací proces."
        },
        "courseb-2021/Loops: Getting Loopy": {
          "overview": "Ked začneme písať dlhšie a zaujímavejšie programy, tak sa náš kód často bude opakovať. V tejto lekcii sa študenti naučia ako môžu použiť cykly, aby jednoduchšie zapísali často sa opakujúce inštrukcie tak, že sa budú pozerať na opakujúce vzory pohybu v tanci."
        },
        "courseb-2021/Loops in Harvester": {
          "overview": "S využítím konceptu \"zacyklených cyklov\" z predošlej lekcie budú študenti v tejto lekcii používať cykly na efektívnejšie zbieranie kukurice."
        },
        "courseb-2021/Events: The Big Event": {
          "overview": "Udalosti sú skvelým spôsobom, ako nášmu programu pridať trochu flexibililty a spraviť ho viac zaujímavým a interaktívnym. Niekedy chceme, aby náš program reagoval na používateľa presne v tom momente, keď to používateľ chce. Práve na toto používame udalosti."
        },
        "coursea-2021/Safety in My Online Neighborhood": {
          "overview": "[\\[common sense education](https://creativecommons.org/)][1]\n\nTúto lekciu pôvodne vytvorila organizácia Common Sense Education. [Learn more.][2]\n\nSila internetu umožňuje študentom objavovať a navštevovať miesta, kam by sa osobne možno nedostali. Podobne ako pri skutočnom cestovaní po svete je však potrebné dbať na bezpečnosť aj na potulkách internetom. Na tomto virtuálnom školskom výlete si deti môžu vyskúšať, ako absolvovať online dobrodružstvá bezpečne.",
          "preparation": "-   Prezrite si metodické materiály.\n-   Vytlačte pre každéo študenta pracovné listy.\n-   (Doplnkovo) Vytlačte plagát s básňou a vystavte ho v triede.",
          "purpose": "Organizácia Common Sense Education vytvorila túto lekciu, aby študentom ukázala, ako sa bezpečne pohybovať po online svete.",
          "student_overview": "Naučte sa bezpečne pohybovať po online svete."
        },
        "coursea-2021/Learn to Drag and Drop": {
          "overview": "Táto lekcia poskytne študentom predstavu o tom, čo očakávať, keď prídu do počítačových laboratórií. Začína krátkou diskusiou, ktorá im predstaví základy správania v počítačových laboratóriách, a potom pokročia k používaniu počítača na dokončenie online úloh."
        },
        "coursea-2021/Programming: Happy Maps": {
          "overview": "Premostenie od algoritmov ku programovaniu môže byť jednoduché, ak študenti rozumejú rozdielu medzi naplánovaním krokov a ich zakódovaním do určitého jazyka. Táto aktivita pomôže študentom v čítaní a písaní jednoduchého kódu.",
          "purpose": "Premostenie od algoritmov ku programovaniu môže byť jednoduché, ak študenti rozumejú rozdielu medzi naplánovaním krokov a ich zakódovaním do určitého jazyka. Táto aktivita pomôže študentom v čítaní a písaní jednoduchého kódu."
        },
        "coursea-2021/Sequencing with Scrat": {
          "overview": "Táto lekcia poskytne študentom predstavu o tom, čo očakávať, keď prídu do počítačových laboratórií. Začína krátkou diskusiou, ktorá im predstaví základy správania v počítačových laboratóriách, a potom pokročia k používaniu počítača na dokončenie online úloh."
        },
        "coursea-2021/Loops: Happy Loops": {
          "overview": "Cykly sú v programovaní veľmi užitočným a veľmi silným nástrojom. Aby pochopili, ako nám cyklu môžu byť užitočné, žiakov dostaneme do situácie, v ktorej budú sami chcieť nájsť jednoduchšiu cestu ku vyriešeniu problému."
        },
        "coursea-2021/Ocean Scene with Loops": {
          "overview": "V tejto lekcii si ešte raz zopakujeme cykly. Žiaci začnú kreslením obrázkov pomocou opakovania krátkych sekvencií príkazov. V predchádzajúcej lekcii sme cykly použili na prechádzanie bludiskom a zbieranie drahokamov. Tu ich použijeme na kreslenie vzorov. Na konci lekcie dostanú žiaci príležitosť pomozou cyklov nakresliť vlastné obrazy."
        },
        "coursea-2021/Events: The Big Event": {
          "overview": "Udalosti sú skvelým spôsobom, ako nášmu programu pridať trochu flexibililty a spraviť ho viac zaujímavým a interaktívnym. Niekedy chceme, aby náš program reagoval na používateľa presne v tom momente, keď to používateľ chce. Práve na toto používame udalosti."
        },
        "coursea-2021/Events in Play Lab": {
          "overview": "V tejto online aktivite sa študenti naučia, ako v PlayLabe využívať Udalosti. Následne dostanú príležitosť aplikovať všetky doteraz naučené zručnosti a vytvoriť animovanú hru. Je čas na kreativitu! Vytvorme v Play Labe celý príbeh!"
        },
        "coursec-2021/Programming in Maze": {
          "overview": "S postavami z hry Angry Birds, študenti budú vyvíjať sekvenčné algoritmy na presun vtáka z jednej strany bludiska ku prasaťu na druhej strane. Aby to spravili, tak budú v lineárnej postupnosti spájať programovacie bloky, ktoré ich vedia pohnúť dopredu, otočiť doľava alebo otočiť doprava."
        },
        "coursec-2021/Build a Flappy Game": {
          "overview": "V tejto špeciálnej lekcii si žiaci vytvoria svoju vlastnú hru Flappy. Využijú v nej udalosti na detekovanie kliknutia myšou a kolízie medzi postavami. Na konci lekcie si žiaci hru upravia pomocou rôznych pozadí či vytvorením vlastných pravidiel. "
        },
        "coursec-2021/End of Course Project: Create a Play Lab Game": {
          "student_overview": "Priprav sa na veľa kódovania! Je načase vytvoriť tvoj projekt."
        },
        "coursed-2021/Introduction to Online Puzzles": {
          "overview": "V týchto úlohách študenti začnú úvodom (alebo opakovaním - podľa toho, ako pokročilá je vaša trieda) do online pracovného prostredia code.org. Videá vám vysvetlia, ako funguje pracovné prostredie, vrátane tlačidiel `Spustiť`, `Obnoviť` a `Krok`. Videá tiež ukážu, ako presúvať bloky a ako ich vymazať či spájať. Následne si študenti precvičia svoje schopnosti v _postupnostiach_ a _odstraňovaní chýb_. Potom študenti uvidia nové typy úloh, ako napríklad Zberateľka, Umelec a Záhradníčka."
        },
        "coursed-2021/Debugging in Collector": {
          "overview": "\"V rámci tejto aktivity budú študenti trénovať ladenie v prostredí „zberateľov“. Študenti sa naučia čítať a editovať kód a opravovať hádanky jednoduchými algoritmami, slučkami a vnorenými slučkami.\""
        },
        "coursed-2021/Build a Star Wars Game": {
          "overview": "V tejto lekcii si študenti precvičia využitie udalostí na vytvorenie hry, ktorú môžu zdieľať online. R2-D2 a ďalšie postavy zo Star Wars (Hviezdnych vojen) študentov prevedú konceptom udalostí a potom im ponechajú priestor na vytvorenie vlastnej hry.",
          "student_overview": "Nech ťa sila sprevádza pri tvorení tvojej vlastnej hry Star Wars."
        },
        "coursed-2021/Conditionals with Cards": {
          "student_overview": "Je čas na hru, v ktorej budeš zbierať body len za určitých podmienok!"
        },
        "coursed-2021/lesson-6": {
          "overview": "Túto lekciu pôvodne Minecraft tím vytvoril pre Hodinu kódu. Študenti dostanú príležitosť precvičiť si koncepty, ktoré sa naučili doteraz a vyskúšať si využitie podmienok!"
        },
        "coursed-2021/End of Course Project": {
          "student_overview": "Priprav sa na veľa kódovania! Je načase vytvoriť tvoj projekt."
        },
        "express-2021/Programming with Angry Birds": {
          "overview": "S postavami z hry Angry Birds, študenti budú vyvíjať sekvenčné algoritmy na presun vtáka z jednej strany bludiska ku prasaťu na druhej strane. Aby to spravili, tak budú v lineárnej postupnosti spájať programovacie bloky, ktoré ich vedia pohnúť dopredu, otočiť doľava alebo otočiť doprava."
        },
        "express-2021/Swimming Fish in Sprite Lab": {
          "overview": "V tejto lekcii sa študenti oboznámia s dvomi konceptami ležiacimi v srdci Sprite Labu: Sprite a jeho správanie. Objekt \"Sprite\" predstavuje postavy alebo predmety zobrazené na obrazovke. Tieto postavy či predmety môžu študenti meniť, či nimi pohybovať. Správanie je akcia, ktorú \"Sprite\" vykonáva až do momentu,  kedy ju zastavíme. ",
          "student_overview": "Nauč sa ako tvoriť  a upravovať postavy."
        },
        "express-2021/Sticker Art with Loops": {
          "overview": "Sledujte nadšenie na tvárach vašich študentov ako si vytvoria nádherné obrázky pomocou malého počtu blokov a digitálnych pečiatok. Táto lekcia stavia na pochopení cyklov v predchádzajúcej lekcii a dáva študentom príležitosť naplno prejaviť svoju kreativitu. Táto aktivita tiež predstavuje vynikajúcu príležitosť na tvorbu diel pre portfólio, či ako ukážku pre rodičov. "
        },
        "express-2021/Looking Ahead with Minecraft ": {
          "overview": "Túto lekciu pôvodne Minecraft tím vytvoril pre Hodinu kódu. Študenti dostanú príležitosť precvičiť si koncepty, ktoré sa naučili doteraz a vyskúšať si využitie podmienok!"
        },
        "express-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "Túto lekciu pôvodne Minecraft tím vytvoril pre Hodinu kódu. Študenti dostanú príležitosť precvičiť si koncepty, ktoré sa naučili doteraz a vyskúšať si využitie podmienok!"
        },
        "express-2021/Functions with Artist": {
          "overview": "Študenti sa oboznámia s používaním funkcií na stránke Code.org. S Umelcom vytvoríme a upravíme veľkolepé obrázky. Študenti sa tiež naučia o vnorených funkciach používaných na tvorbu komplexnejších vzorov, v ktorých vlastne voláme jednu funkciu z vnútra inej funkcie.",
          "student_overview": "Vytvor zložitejšie kresby s funkciami!"
        },
        "express-2021/Functions with Harvester": {
          "student_overview": "Funkcie vám ušetria veľa práce počas pomáhania farmárke s jej úrodou!"
        },
        "express-2021/Variables with Artist": {
          "overview": "V tejto lekcii študenti objavia tvorbu opakujúcich sa dizajnov s použitím premenných v prostredí Umelca. Študenti sa naučia používať premenné na tvorbu kódu tak aby sa jednoduchšie písal aj chápal. Prejdením riadených úloh, študenti kočia úrovňou volných hier a uvidia čo sa naučili a ako tvoria svoje vlastné dizajny."
        },
        "express-2021/For Loops with Artist": {
          "overview": "V tejto lekcii, s pomocou Umelca, študenti pokračujú v precvičovaní cyklov. V úlohách skombinujú premenné, cykly a cykly \"for\" na to, aby vytvorili komplexné kresby. Lekcia končí voľným cvičením na vytvorenie vlastnej kresby.",
          "student_overview": "Priprav sa na tvoje ďalsie majstrovské dielo. Budeš používať \"pre\" cykly. Všetkým z tvojich obrázkov padne sánka."
        },
        "express-2021/End of Course Project": {
          "student_overview": "Priprav sa na veľa kódovania! Je načase vytvoriť tvoj projekt."
        },
        "pre-express-2021/Learn to Drag and Drop": {
          "overview": "Táto lekcia **na rozvíjanie zručností** poskytne študentom predstavu o tom, čo očakávať, keď prvýkrát prídu do počítačovej učebne. Začína krátkou diskusiou, ktorá im predstaví základy správania v počítačovej učebni, a potom budú obiť on‑line úlohy pomocou počítača.",
          "preparation": "-   Pozrite si video pre učiteľov **\\*Ako na Code.org vytvoriť triednu sekciu**. Vytvorte si na Code.org vlastnú triednu sekciu a uistite sa, že ste každému žiakovi dali kartičku s jeho **prihlasovacím kódom**.\n-   Uistite sa, že žiaci budú mať na svojich zariadeniach prístup k lekcii č. 2. Zamyslite sa nad tým, či budete chcieť ukryť ďalšie lekcie, aby niektorí žiaci nenapredovali v kurze príliš rýchlo.\n-   Požiadajte školského IT pracovníka, aby na pracovnú plochu pridal rýchly odkaz na vašu triednu sekciu.\n-   Prezrite si webové stránky organizácie Common Sense Education, kde nájdete viac obsahu zameraného na on‑line bezpečnosť.",
          "purpose": "Hlavným cieľom tejto lekcie je umožniť žiakom, aby sa zlepšovali v práci s počítačom. Pokrytím najzákladnejších funkcií počítača, ako je klikanie, presúvanie a púšťanie, stierame rozdiely medzi žiakmi a dávame všetkým možnosť zvládnuť budúce úlohy rovnako dobre. Táto lekcia tiež poskytuje skvelú príležitosť predstaviť žiakom základné termíny týkajúce sa počítačového hardvéru, napríklad „myš“, „touchpad“ či „dotyková obrazovka“ (v závislosti od toho, aké zariadenia používate).",
          "student_overview": "Dokonči úlohy presúvaním objektov."
        },
        "pre-express-2021/Sequencing with Scrat": {
          "overview": "V tejto lekcii **na rozvíjanie zručností** budú žiaci vytvárať sekvenčné algoritmy na presúvanie veveričky z jednej strany bludiska k žaluďu na druhej strane bludiska. Na splnenie tejto úlohy budú v lineárnej postupnosti spájať programovacie bloky.",
          "preparation": "-   Uistite sa, že každý žiak má zápisník na poznámky.",
          "purpose": "V tejto lekcii sa budú žiaci rozvíjať v programovaní a ladení (hľadaní chýb) na počítačovej platforme. Formát týchto úloh využíva bloky, ktoré žiakom pomáhajú oboznámiť sa s postupnosťou a ďalšími konceptmi bez toho, aby sa museli trápiť syntaxou.",
          "student_overview": "Naprogramuj Scrata tak, aby sa dostal k žaluďu."
        },
        "pre-express-2021/Programming in with Angry Birds": {
          "overview": "V tejto lekcii **na rozvíjanie zručností** budú žiaci pokračovať vo vytváraní sekvenčných algoritmov.",
          "preparation": "-   Prejdite si celú lekciu, aby ste identifikovali miesta, ktoré by pre vašu triedu mohli byť problematické.\n-   (Voliteľné) Vyberte zopár úloh, ktoré bude celá trieda robiť spoločne.\n-   Uistite sa, že každý žiak má zápisník na poznámky.",
          "purpose": "V tejto lekcii sa budú žiaci rozvíjať v programovaní a ladení (hľadaní chýb) na počítačovej platforme. Formát týchto úloh využíva bloky, ktoré žiakom pomáhajú oboznámiť sa s postupnosťou a ďalšími konceptmi bez toho, aby sa museli trápiť syntaxou."
        },
        "pre-express-2021/Programming with Rey and BB-8": {
          "overview": "Táto lekcia **na rozvíjanie zručností** žiaci využijú svoje novozískané programovacie zručnosti zložitejšími spôsobmi, aby robota BB‑8 znavigovali náročnou dráhou.",
          "preparation": "-   Prejdite si celú lekciu, aby ste identifikovali miesta, ktoré by pre vašu triedu mohli byť problematické.\n-   Uistite sa, že každý študent má zápisník na poznámky.",
          "purpose": "Táto lekcia je zameraná na transfer poznatkov, a preto poskytuje žiakom nové prostredie na precvičenie zručností, ktoré si rozvíjali. Fanúšikovia Hviezdnych vojen budú skákať od šťastia, keď tieto úlohy uvidia. Každá úloha v tejto sérii slúži na to, aby žiakom pomohla hlbšie porozumieť základným konceptom, ktoré budú používať vo zvyšku tohto kurzu."
        },
        "pre-express-2021/Programming in Harvester": {
          "overview": "Študenti aplikujú naučené koncepty programovania v prostredí Záhradníčky. Tentokrát namiesto toho, aby len dostali charakter do cieľa, budú študenti zbierať kukuricu s pomocou nového bloku. Študenti budú pokračovať v rozvíjaní zručností sekvenčných algoritmov a začnú používať debugovací proces.",
          "preparation": "-   Prejdite si celú lekciu, aby ste identifikovali miesta, ktoré by pre vašu triedu mohli byť problematické.\n-   Uistite sa, že každý študent má zápisník na poznámky.",
          "purpose": "V tejto lekcii sa žiaci budú učiť ladiť programy a naďalej si budú rozvíjať svoje programovacie zručnosti.",
          "student_overview": "Pomôž Záhradníčke pozbierať zeleninu, ktorú má po ceste."
        },
        "pre-express-2021/Loops with Scrat": {
          "overview": "V tejto lekcii **na rozvíjanie zručností** si žiaci precvičia koncept cyklov pri programovaní úloh, ktorých cieľom je pomôcť veveričke dostať sa k žaluďu.",
          "preparation": "-   (Voliteľné) Vyberte zopár úloh, ktoré bude celá trieda robiť spoločne.\n-   Uistite sa, že každý žiak má zápisník na poznámky.",
          "purpose": "V tejto lekcii sa žiaci naučia viac o cykloch a o tom, ako ich využiť v programovacom rozhraní Blockly. Používanie _cyklov_ je dôležitá programovacia zručnosť, pretože manuálne opakovanie príkazov je namáhavé a neefektívne. V týchto úlohách od Code.org sa žiaci naučia, ako pridávať príkazy do existujúcich cyklov, ako opakujúci sa kód zjednodušiť pomocou cyklu a ako rozlíšiť, ktorú časť kódu treba opakovať.",
          "student_overview": "Pomôž Scratovi  prejsť väčšiu dráhu pomocou cyklov."
        },
        "pre-express-2021/Loops with Laurel": {
          "overview": "V tejto lekcii budú žiaci pokračovať v oboznamovaní sa s konceptom cyklov. Dobrodružka Laurel v nej využíva cykly na to, aby zbierala poklady v otvorených jaskynných priestranstvách. Žiaci budú mať odteraz k dispozícii blok `získaj poklad`, ktorý jej na jej ceste pomôže.",
          "preparation": "-   Prejdite si všetky úlohy, aby ste identifikovali miesta, ktoré by pre vašu triedu mohli byť problematické.\n-   (Voliteľné) Vyberte zopár úloh, ktoré bude celá trieda robiť spoločne.\n-   Uistite sa, že každý žiak má zápisník na poznámky.",
          "purpose": "Táto lekcia žiakom poskytuje príležitosť precvičiť si používanie cyklov. Motivuje ich k tomu, aby viacero blokov umiestnili do bloku `opakuj`, aby dokázali pozbierať čo najviac kusov pokladu."
        },
        "pre-express-2021/Ocean Scene with Loops": {
          "overview": "V tejto lekcii si ešte raz zopakujeme cykly. Žiaci začnú kreslením obrázkov pomocou opakovania krátkych sekvencií príkazov. V predchádzajúcej lekcii sme cykly použili na prechádzanie bludiskom a zbieranie drahokamov. Tu ich použijeme na kreslenie vzorov. Na konci lekcie dostanú žiaci príležitosť pomozou cyklov nakresliť vlastné obrazy.",
          "preparation": "-   Prejdite si celú lekciu, aby ste identifikovali miesta, ktoré by pre vašu triedu mohli byť problematické.\n-   Uistite sa, že každý študent má zápisník na poznámky.",
          "purpose": "Táto lekcia žiakom poskytne iný pohľad na to, ako sa dajú pri programovaní vytvárať veci pomocou cyklov. Žiaci sa tiež môžu zamyslieť nad tým, že programovanie bez cyklov neefektívne, pretože bez cyklov `opakuj` by si program vyžadoval veľké množstvo blokov. ",
          "student_overview": "Dokonči obrázky pomocou cyklov a vzorov."
        },
        "pre-express-2021/Drawing Gardens with Loops": {
          "overview": "V tejto lekcii **na rozvíjanie zručností** sa žiaci budú učiť, ako kresliť obrázky cyklovaním jednoduchých postupností inštrukcií. Žiaci sa naučia vytvárať vzory pomocou cyklov. Na konci lekcie budú mať príležitosť vytvoriť si vlastné obrázky.",
          "preparation": "-   Prejdite si celú lekciu, aby ste identifikovali miesta, ktoré by pre vašu triedu mohli byť problematické.\n-   Uistite sa, že každý študent má zápisník na poznámky.",
          "purpose": "Táto lekcia žiakom poskytne iný pohľad na to, ako sa dajú pri programovaní vytvárať veci pomocou cyklov. Žiaci si tiež otestujú svoje kritické myslenie, keď budú mať za úlohu vyhodnotiť kód, ktorý dostanú, a určiť, čo k nemu treba doplniť na vyriešenie úlohy. Žiaci sa tiež môžu zamyslieť nad tým, že programovanie bez cyklov neefektívne, pretože bez cyklov `opakuj` by si program vyžadoval veľké množstvo blokov.",
          "student_overview": "Dokonči obrázky pomocou cyklov a vzorov."
        },
        "pre-express-2021/On the Move with Events": {
          "overview": "V tejto online aktivite sa študenti naučia, ako v PlayLabe využívať Udalosti. Následne dostanú príležitosť aplikovať všetky doteraz naučené zručnosti a vytvoriť animovanú hru. Je čas na kreativitu! Vytvorme v Play Labe celý príbeh!",
          "preparation": "-   Prejdite si všetky úlohy, aby ste identifikovali miesta, ktoré by pre vašu triedu mohli byť problematické.\n-   (Voliteľné) Vyberte zopár úloh, ktoré bude celá trieda robiť spoločne.\n-   Uistite sa, že každý žiak má zápisník na poznámky.",
          "purpose": "Žiaci sa dnes v prostredí Play Labu lepšie zoznámia s udalosťami. Udalosti sú veľmi časté vo väčšine počítačových programov. V tejto aktivite budú žiaci využívať udalosti na to, aby pohybovali postavou po obrazovke, aby vydávali zvuky či menili pozadie, to všetko na základe udalostí vyvolaných používateľom.",
          "student_overview": "Vytvor si vlastnú hru alebo príbeh."
        },
        "pre-express-2021/A Royal Battle with Events": {
          "overview": "V tomto **miniprojekte** dostanú žiaci príležitosť naučiť sa, ako používať udalosti v Play Labe, a budú môcť využiť všetky doteraz získané programovacie zručnosti na vytvorenie animovanej hry. ",
          "preparation": "-   Prejdite si všetky úlohy, aby ste identifikovali miesta, ktoré by pre vašu triedu mohli byť problematické.\n-   (Voliteľné) Vyberte zopár úloh, ktoré bude celá trieda robiť spoločne.\n-   Uistite sa, že každý žiak má zápisník na poznámky.",
          "purpose": "V tejto on‑line aktivite sa žiaci naučia, ako sa v Play Labe používajú udalosti. Najprv naprogramujú rytiera tak, aby sa hýbal pri stlačení šípky na klávesnici hýbal, a nakoniec budú mať v rámci záverečnej voľnej úlohy príležitosť ukázať zvyšné zručnosti, ktoré počas kurzu nadobudli, vrátane postupností a cyklov.",
          "student_overview": "Vytvor pomocou udalostí príbeh alebo interaktívnu hru."
        },
        "coursee-2021/Simon Says": {
          "overview": "V tejto lekcii si študenti zahrajú hru, ktorá im pomôže premýšľať nad spôsobmi prideľovania príkazov tak, aby dosiahnuť želaný výsledok. Pomôže im to ľahšie premostiť do prostredia Sprite Labu v nasledujúcej lekcii.",
          "preparation": "-   Prejdite cez hlavolamy a nájdite potenciálne problémové oblasti pre vašu triedu.\n-   Uistite sa, že každý študent má zápisník na poznámky.",
          "purpose": "Cieľom tejto lekcie je pripraviť študentov na zamyslenie nad jedným zo základných konceptov programovania v Sprite Lab, ktorým je správanie.",
          "student_overview": "Zahrajte si hru a zamyslite sa nad tým, ktoré príkazy sú potrebné na dosiahnutie správneho výsledku."
        },
        "coursee-2021/Learning Sprites with Sprite Lab": {
          "overview": "V tejto lekcii sa študenti oboznámia s dvomi konceptami ležiacimi v srdci Sprite Labu: Sprite a jeho správanie. Objekt \"Sprite\" predstavuje postavy alebo predmety zobrazené na obrazovke. Tieto postavy či predmety môžu študenti meniť, či nimi pohybovať. Správanie je akcia, ktorú \"Sprite\" vykonáva až do momentu,  kedy ju zastavíme. ",
          "preparation": "-   Prejdite cez hlavolamy a nájdite potenciálne problémové oblasti pre vašu triedu.\n-   Uistite sa, že každý študent má zápisník na poznámky.",
          "purpose": "Cieľom tejto lekcie je predstaviť študentom základné pojmy zo Sprite Labu a umožniť im využiť koncepty, ktoré si osvojili v iných prostrediach, v tomto nástroji. Vytvorením akvária začnú študenti získavať prehľad o programovacom modeli, ktorý využíva tento nástroj, a preskúmajú spôsoby, ako môžu pomocou neho tvoriť.   ",
          "student_overview": "Nauč sa ako tvoriť  a upravovať postavy."
        },
        "coursee-2021/Alien Dance Party with Sprite Lab": {
          "overview": "V tejto lekcii študenti pracujú v Sprite Labe, v ktorom si vytvoria vlastné interaktívne animácie a hry. Okrem správania svojich \"Spritov\" študenti pridajú vstup od užívateľa ako udalosť, ktorá im pomôže vytvoriť skvelú mimozemskú tanečnú party. ",
          "preparation": "-   Prejdite cez hlavolamy a nájdite potenciálne problémové oblasti pre vašu triedu.\n-   Uistite sa, že každý študent má zápisník na poznámky.",
          "purpose": "Táto lekcia je skvelým úvodom do udalostí v programovaní. Dokonca dáva študentom možnosť preukázať svoju kreativitu! Na konci lekcie budú mať študenti príležitosť predviesť svoje projekty.",
          "student_overview": "Vytvorte interaktívny projekt, ktorý môžete zdieľať so svojimi spolužiakmi."
        },
        "coursee-2021/lesson-4": {
          "overview": " [\\[common sense education](https://creativecommons.org/)][1]\n\nTúto lekciu pôvodne vytvorila organizácia Common Sense Education. [Ďalšie informácie.][2]\n\nOnline nástroje dávajú deťom nové možnosti, ale zároveň sa spájajú aj s veľkou zodpovednosťou. No vedia deti, čo majú robiť, keď sa stretnú s kyberšikanovaním? Ukážte študentom, ako správne zakročiť a riešiť konflikty, aby sa nebáli ozvať a pomôcť iným, ktorí to potrebujú.",
          "preparation": "-   Prečítajte si materiály s pokynmi.\n-   Vytlačte podkladové materiály pre študentov.\n-   Pripravte farebné ceruzky alebo fixky pre študentov.",
          "purpose": "Organizácia Common Sense Education vytvorila túto lekciu, aby študentom ukázala, ako sa majú zachovať, keď sa stretnú s kyberšikanovaním.",
          "student_overview": "Nauč sa zakročiť, keď sa stretneš s kyberšikanovaním."
        },
        "coursee-2021/Private and Personal Information": {
          "overview": " [\\[common sense education](https://creativecommons.org/)][1]\n\nTúto lekciu pôvodne vytvorila organizácia Common Sense Education. [Ďalšie informácie.][2]\n\nPre študentov je prirodzené zdieľať a spájať sa s inými. Ale so zdieľaním sa spájajú aj riziká. Ako môžeme deťom pomôcť budovať silné, pozitívne a bezpečné vzťahy online? Pomôžte študentom zistiť, čo je osobné a čo by malo zostať súkromné.",
          "preparation": "-   Prečítajte si materiály s pokynmi.\n-   Vytlačte podkladové materiály pre študentov.",
          "purpose": "Organizácia Common Sense Education vytvorila túto lekciu, aby študentom ukázala, aké informácie môžu bezpečne zdieľať online.",
          "student_overview": "Na internete zažijeme veľa zábavy, ale je tiež dôležité myslieť na bezpečnosť. V tejto lekcii sa naučíme rozlišovať medzi informáciami, ktoré je bezpečné zdieľať online a a informáciami, ktoré majú zostať súkromné."
        },
        "coursee-2021/About Me": {
          "overview": "V rámci tohto **mini projektu** študenti využijú svoje nadobudnuté vedomosti o zdieľaní osobných a súkromných informácií na webe vytvorením interaktívneho plagátu.",
          "preparation": "-   (Nepovinné) Vytlačte kópie **\\*sprievodcu plánovaním** pre študentov alebo im rozdajte digitálne kópie.\n-   Môžete vytvoriť aj svoj vlastný vzorový projekt, ktorý ukážete triede. \n-   Uistite sa, že každý študent má zápisník na poznámky.",
          "purpose": "Cieľom tejto lekcie je spraviť predchádzajúcu lekciu o osobných a súkromných informáciách osobne relevantnou pre študentov. Študenti si precvičia bezpečné sebavyjadrenie na webe s ohľadom na príklady BEZPEČNÝCH (osobných) a NEBEZPEČNÝCH (súkromných) informácií tak, že si v SpriteLabe navrhnú vlastné kostýmy postavičiek a vygenerujú text.",
          "student_overview": "Prostredníctvom tvorby interaktívneho plagátu v SpriteLabe si študenti overia, čo sa naučili o zdieľaní súkromných a osobných údajov na internete"
        },
        "coursee-2021/Digital Sharing": {
          "overview": "Táto **prieskumná** lekcia pomôže študentom pochopiť výzvy a prínosy rešpektovania vlastníctva a autorských práv, obzvlášť v digitálnom prostredí. ",
          "preparation": "-   Vyhľadajte **\\*video o zdieľaní autorských práv** v časti „Odkazy“ nižšie\n-   Stiahnite a preštudujte si celý **\\*plán lekcie o digitálnom zdieľaní** od organizácie Copyright and Creativity\n-   Ako učiteľ vytvorte nejaké dielo pre lekciu (obrázok, skladbu, prezentáciu atď.) \n-   Uistite sa, že každý študent má zápisník na poznámky.\n-   Budete potrebovať tablet alebo smartfón na simuláciu zdieľania položky.",
          "purpose": "Študenti budú čoskoro vytvárať projekty na zdieľanie, pričom väčšina z týchto projektov bude obsahovať kód alebo obrázky, ktoré študenti nevytvorili sami. Cieľom tejto lekcie je ukázať študentom, ako správne používať obsah, ktorý nepatrí im.",
          "student_overview": "V rámci tejto lekcie sa dozviete o výzvach a prínosoch vlastníctva a autorských práv. "
        },
        "coursee-2021/Programming and Loops with the Artist": {
          "overview": "Sledujte nadšenie na tvárach vašich študentov ako si vytvoria nádherné obrázky pomocou malého počtu blokov a digitálnych pečiatok. Táto lekcia stavia na pochopení cyklov v predchádzajúcej lekcii a dáva študentom príležitosť naplno prejaviť svoju kreativitu. Táto aktivita tiež predstavuje vynikajúcu príležitosť na tvorbu diel pre portfólio, či ako ukážku pre rodičov. "
        },
        "coursee-2021/Nested Loops in Artist": {
          "student_overview": "Viac vnorených cyklov! Tentokrát s vnorenými cyklami vytvoríš ÚŽASNÉ kresby."
        },
        "coursee-2021/Functions: Songwriting": {
          "overview": "Jedným z najkrajších elementov vo svete informatiky je funkcia. Funkcie (niekedy ich voláme procedúry) sú malé programy, ktoré môžeme opakovane používať vo väčšom programe. Táto lekcia pomôže študentom intuitívne pochopiť, prečo je kombinovanie kúskov kódu do funkcií tak užitočné.",
          "student_overview": "Aj rokové hviezdy potrebujú programovanie. V tejto lekcii sa naučíme viac o funkciách pomocou slov z pesničiek."
        },
        "coursee-2021/Functions in Artist": {
          "overview": "Študenti sa oboznámia s používaním funkcií na stránke Code.org. S Umelcom vytvoríme a upravíme veľkolepé obrázky. Študenti sa tiež naučia o vnorených funkciach používaných na tvorbu komplexnejších vzorov, v ktorých vlastne voláme jednu funkciu z vnútra inej funkcie.",
          "student_overview": "Vytvor zložitejšie kresby s funkciami!"
        },
        "coursee-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "Túto lekciu pôvodne Minecraft tím vytvoril pre Hodinu kódu. Študenti dostanú príležitosť precvičiť si koncepty, ktoré sa naučili doteraz a vyskúšať si využitie podmienok!"
        },
        "coursee-2021/Conditionals": {
          "overview": "Táto lekcia študentom predstaví  cykly `pokiaľ` a výroky  `ak / inak`.  _Cykly `pokiaľ`_  sú cykly, ktoré sa opakujú, kým je podmienka pravdivá. Cykly `pokiaľ` sa používajú, keď programátor nevie presný počet opakovaní, koľkokrát sa musí príkaz vykonať, ale vie, aké podmienky musia byť pravdivé, aby cyklus v opakovaní pokračoval .  Výroky `ak / inak` ponúkajú v programovaní väčšiu flexibilitu tak, že  sa spustí celá časť kódu len vtedy, ak je niečo pravdivé, inak sa spustí niečo iné."
        },
        "coursee-2021/Functions in Harvester": {
          "student_overview": "Funkcie vám ušetria veľa práce počas pomáhania farmárke s jej úrodou!"
        }
      }
    }
  }
}