{
  "ru-RU": {
    "data": {
      "lessons": {
        "coursef-2021/lesson-6": {
          "overview": "На этом занятии по **настройке контекста** ученики обсудят роль компьютеров и технологий в их жизни, фокусируясь на том, как приложения и инструменты позволяют пользователям выбирать порядок их использования. Ученики также рассмотрят приложения, аналогичные тем, которые они позднее будут создавать самостоятельно.",
          "preparation": "-   Определите, как студенты будут входить на сайт Code.org. \n-   При необходимости создайте учетные записи Code.org для студентов. \n-   Назначьте студентам Introducing Sprite Lab. \n-   Распечатайте копии рабочей страницы **\\*Exploring Apps** (или опубликуйте цифровую версию в своей системе LMS).",
          "purpose": "Первое занятие посвящено тому, как пробудить у учеников интерес к курсу и привязать их персональные интересы к информатике.",
          "student_overview": "Вы будете обсуждать роль компьютеров и технологий в вашей жизни с акцентом на том, как приложения и инструменты позволяют пользователям выбирать способы их использования."
        },
        "coursef-2021/Nested Loops in the Maze": {
          "student_overview": "Цикл внутри цикла. Что это значит? Этот урок объяснит вам, что происходит, когда вы помещаете цикл внутри другого цикла."
        },
        "coursef-2021/AI for Oceans": {
          "overview": "\\*\\* Краткое содержание урока: \\* \\* сначала ученики классифицируют объекты либо как \"рыбу\", либо как\" не рыбу\", чтобы попытаться удалить мусор из океана. Затем учащиеся должны будут расширить свой набор данных обучения, чтобы включить в него других морских существ, которые живут в воде. Во второй части занятия учащиеся будут выбирать собственные метки для нанесения на изображения случайно сгенерированных рыб. Эти обучающие данные используются для модели машинного обучения, которая затем должна иметь возможность самостоятельно маркировать новые изображения.\\\\р\n\\\\r\n\\\\r\n\\*\\* Проверка правильности: \\* \\* этот учебник не скажет ученикам, правильно ли они прошли уровень. Можно быстро пропустить различные части действия. Поощряйте учащихся смотреть видео, читать инструкции и пробовать разные вещи по пути. В любой момент они могут поделиться своими находками с вами или одноклассником.\\\\р",
          "student_overview": "Краткое содержание урока: сначала ученики классифицируют объекты либо как \"рыбу\", либо как\" не рыбу\", чтобы попытаться удалить мусор из океана. Затем учащиеся должны будут расширить свой набор данных обучения, чтобы включить в него других морских существ, которые живут в воде. Во второй части занятия учащиеся будут выбирать собственные метки для нанесения на изображения случайно сгенерированных рыб. Эти обучающие данные используются для модели машинного обучения, которая затем должна иметь возможность самостоятельно маркировать новые изображения."
        },
        "coursea-2021/Safety in My Online Neighborhood": {
          "student_overview": "Узнайте, как безопасно посещать сайты в Интернете."
        },
        "coursea-2021/Learn to Drag and Drop": {
          "student_overview": "Щелкните и перетащите, чтобы закончить головоломки."
        },
        "coursea-2021/Sequencing with Scrat": {
          "student_overview": "Запрограммируйте Скрета, чтобы добраться до желудя."
        },
        "coursea-2021/Loops: Happy Loops": {
          "overview": "Циклы - это очень полезный и мощный инструмент в программировании. Чтобы понять, насколько полезными могут быть циклы, ученикам нужно будет водить, чтобы найти более простой способ решить повседневные проблемы."
        },
        "pre-express-2021/Learn to Drag and Drop": {
          "student_overview": "Щелкните и перетащите, чтобы закончить головоломки."
        },
        "pre-express-2021/Sequencing with Scrat": {
          "student_overview": "Запрограммируйте Скрета, чтобы добраться до желудя."
        },
        "coursee-2021/Functions: Songwriting": {
          "overview": "Одним из самых великолепных структур в мире компьютерной науки является функция.  Функции (иногда называемые процедурами) - это мини-программы, которые можно использовать снова и снова внутри большой программы. Этот урок поможет учащимся интуитивно понять, почему объединение частей кода в функцию является такой полезной практикой.  "
        },
        "coursee-2021/lesson-1": {
          "student_overview": "Узнай о значении доступности и эмпатии путем коллективного обсуждения и разработки решений в области доступа для гипотетических приложений. "
        }
      }
    }
  }
}