{
  "mr-IN": {
    "data": {
      "lessons": {
        "dance-extras/Dance Party - Go Further": {
          "overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडींग आणि संगणक शास्त्राचा प्रास्ताविक अनुभव मिळतो. हा धडा सर्व वयोगटातील शिकणाऱ्यांसाठी डिझाइन केला गेला आहे परंतु त्याला वाचन आवश्यक आहे. या क्रियाकलापासाठी आवाज आवश्यक आहे कारण हे साधन संगीताला प्रतिसाद देण्यासाठी तयार करण्यात आले होते.",
          "student_overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडींग आणि संगणक शास्त्राचा प्रास्ताविक अनुभव मिळतो. हा धडा सर्व वयोगटातील शिकणाऱ्यांसाठी डिझाइन केला गेला आहे परंतु त्याला वाचन आवश्यक आहे. या क्रियाकलापासाठी आवाज आवश्यक आहे कारण हे साधन संगीताला प्रतिसाद देण्यासाठी तयार करण्यात आले होते."
        },
        "minecraft/Minecraft Hour of Code Designer": {
          "overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडिंग आणि संगणक शास्त्राचा परिचयात्मक अनुभव मिळतो. हा धडा वाचण्यास पुरेसा वय असलेल्या कोणत्याही विद्यार्थ्यासाठी (6+ वयोगटातील) चांगला कार्य करतो. तरुण शिकणारे ट्यूटोरियल कदाचित पूर्ण करणार नाहीत, परंतु त्यांना एक तासासाठी कोडी सोडवण्यात खूप मजा येईल. हायस्कूलचे विद्यार्थी बहुतेक ट्यूटोरियल पूर्ण करतील आणि शेवटी विनामूल्य प्ले स्तरावर खेळण्यासाठी थोडा वेळ मिळेल.",
          "student_overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडिंग आणि संगणक शास्त्राचा परिचयात्मक अनुभव मिळतो. हा धडा वाचण्यास पुरेसा वय असलेल्या कोणत्याही विद्यार्थ्यासाठी (6+ वयोगटातील) चांगला कार्य करतो. तरुण शिकणारे ट्यूटोरियल कदाचित पूर्ण करणार नाहीत, परंतु त्यांना एक तासासाठी कोडी सोडवण्यात खूप मजा येईल. हायस्कूलचे विद्यार्थी बहुतेक ट्यूटोरियल पूर्ण करतील आणि शेवटी विनामूल्य प्ले स्तरावर खेळण्यासाठी थोडा वेळ मिळेल."
        },
        "hero/Minecraft Hour of Code": {
          "overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडिंग आणि संगणक शास्त्राचा परिचयात्मक अनुभव मिळतो. हा धडा वाचण्यास पुरेसा वय असलेल्या कोणत्याही विद्यार्थ्यासाठी (6+ वयोगटातील) चांगला कार्य करतो. तरुण शिकणारे ट्यूटोरियल कदाचित पूर्ण करणार नाहीत, परंतु त्यांना एक तासासाठी कोडी सोडवण्यात खूप मजा येईल. हायस्कूलचे विद्यार्थी बहुतेक ट्यूटोरियल पूर्ण करतील आणि शेवटी विनामूल्य प्ले स्तरावर खेळण्यासाठी थोडा वेळ मिळेल."
        },
        "poem-art-2021/Poem Art": {
          "overview": "या CS आणि ELA एकात्मिक धड्यात, विद्यार्थी कवितेचा मूड स्पष्ट करण्यासाठी कोडसह कविता अॅनिमेट करतील. विद्यार्थी कविता वाचतील आणि त्यातील मूड ओळखतील. नंतर त्यांना कवितेचा मूड स्पष्ट करण्यात मदत करण्यासाठी संबंधित प्रभाव आणि प्रतिमा मिळतील. शेवटी, विद्यार्थी मूडमधील बदल स्पष्ट करण्यासाठी किंवा कवितेतील नवीन प्रतिमांचा परिचय देण्यासाठी इव्हेंट (कोड) वापरतील.\n\nहा धडा 1-तासांचा स्वतंत्र धडा म्हणून पूर्ण केला जाऊ शकतो. हा धडा [कवितेसह कोडिंग](http://studio.code.org/s/poetry-2021) नावाच्या मल्टी-लेसन मॉड्यूलचा पहिला धडा म्हणून वापरण्याचा पर्याय देखील आहे."
        },
        "hourofcode/Maze": {
          "overview": "या धड्यात सर्व वयाचे विद्यार्थी कोडींग आणि संगणक शास्त्राचा एका सुरक्षित, मदत करणाऱ्या वातावरणात परिचयात्मक अनुभव घेऊ शकतात. हा धडा लहान मुलांसाठी, वय वर्षे 4-10 तयार करण्यात आलेला आहे, पण 'बदलाच्या सूचनांचा' वापर करून तो जास्त वयाच्या विद्यार्थ्यांसाठीसुद्धा वापरता येईल. ",
          "student_overview": "या धड्यात सर्व वयाचे विद्यार्थी कोडींग आणि संगणक शास्त्राचा एका सुरक्षित, मदत करणाऱ्या वातावरणात परिचयात्मक अनुभव घेऊ शकतात. हा धडा लहान मुलांसाठी, वय वर्षे 4-10 तयार करण्यात आलेला आहे, पण 'बदलाच्या सूचनांचा' वापर करून तो जास्त वयाच्या विद्यार्थ्यांसाठीसुद्धा वापरता येईल. "
        },
        "frozen/Artist": {
          "overview": "या धड्यात सर्व वयाचे विद्यार्थी कोडींग आणि संगणक शास्त्राचा एका सुरक्षित, मदत करणाऱ्या वातावरणात परिचयात्मक अनुभव घेऊ शकतात. हा धडा  वय वर्षे 10-13 च्या वयोगटा साठी तयार करण्यात आलेला आहे, परंतु प्रदान केलेल्या भिन्नता असलेल्या सूचनांचा वापर करून लहान किंवा मोठ्या विद्यार्थ्यांसाठी सानुकूलित केले जाऊ शकते. विद्यार्थ्यांना साध्या भूमिती आणि रेखाचित्र कोनांची मूलभूत माहिती असणे आवश्यक आहे.",
          "student_overview": "या धड्यात सर्व वयाचे विद्यार्थी कोडींग आणि संगणक शास्त्राचा एका सुरक्षित, मदत करणाऱ्या वातावरणात परिचयात्मक अनुभव घेऊ शकतात. हा धडा  वय वर्षे 10-13 च्या वयोगटा साठी तयार करण्यात आलेला आहे, परंतु प्रदान केलेल्या भिन्नता असलेल्या सूचनांचा वापर करून लहान किंवा मोठ्या विद्यार्थ्यांसाठी सानुकूलित केले जाऊ शकते. विद्यार्थ्यांना साध्या भूमिती आणि रेखाचित्र कोनांची मूलभूत माहिती असणे आवश्यक आहे."
        },
        "iceage/Ice Age Play Lab": {
          "student_overview": "या धड्यात, शिकणाऱ्यांना संगणक विज्ञानाचा परिचयात्मक अनुभव मिळतो आणि मूलभूत ब्लॉक कोड वापरून गेम तयार करतो."
        },
        "artist/Artist": {
          "student_overview": "आर्टीस्टचे प्रोग्रॅमिंग करून सुंदर प्रतिमा तयार करणे"
        },
        "dance/Dance Party": {
          "overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडींग आणि संगणक शास्त्राचा प्रास्ताविक अनुभव मिळतो. हा धडा सर्व वयोगटातील शिकणाऱ्यांसाठी डिझाइन केला गेला आहे परंतु त्याला वाचन आवश्यक आहे. या क्रियाकलापासाठी आवाज आवश्यक आहे कारण हे साधन संगीताला प्रतिसाद देण्यासाठी तयार करण्यात आले होते.",
          "student_overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडींग आणि संगणक शास्त्राचा प्रास्ताविक अनुभव मिळतो. हा धडा सर्व वयोगटातील शिकणाऱ्यांसाठी डिझाइन केला गेला आहे परंतु त्याला वाचन आवश्यक आहे. या क्रियाकलापासाठी आवाज आवश्यक आहे कारण हे साधन संगीताला प्रतिसाद देण्यासाठी तयार करण्यात आले होते."
        },
        "aquatic/Aquatic": {
          "overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडिंग आणि संगणक शास्त्राचा परिचयात्मक अनुभव मिळतो. हा धडा वाचण्यास पुरेसा वय असलेल्या कोणत्याही विद्यार्थ्यासाठी (6+ वयोगटातील) चांगला कार्य करतो. तरुण शिकणारे ट्यूटोरियल कदाचित पूर्ण करणार नाहीत, परंतु त्यांना एक तासासाठी कोडी सोडवण्यात खूप मजा येईल. हायस्कूलचे विद्यार्थी बहुतेक ट्यूटोरियल पूर्ण करतील आणि शेवटी विनामूल्य प्ले स्तरावर खेळण्यासाठी थोडा वेळ मिळेल."
        },
        "hoc-encryption/Simple Encryption": {
          "overview": "या धड्यात, विद्यार्थ्यांना गुप्त संदेश तोडण्यासाठी (किंवा क्रॅक करण्यासाठी) एन्क्रिप्शनची आवश्यकता आणि सोप्या तंत्रांचा परिचय करून दिला जातो. विद्यार्थी क्लासिक सीझर सायफर आणि यादृच्छिक प्रतिस्थापन सायफरसह एन्कोड केलेला संदेश क्रॅक करण्याचा प्रयत्न करतात. शक्तिशाली संगणकीय साधनांच्या युगात, एनक्रिप्शनच्या तंत्रांना अधिक परिष्कृत करणे आवश्यक आहे या कल्पनेशी विद्यार्थ्यांना चांगले परिचित असले पाहिजे. इंटरनेटवरील आपल्या दैनंदिन जीवनात एन्क्रिप्शन कशी आणि का भूमिका बजावते हे समजून घेणे हा या धड्याचा सर्वात महत्त्वाचा पैलू आहे आणि चांगले एन्क्रिप्शन तयार करणे ही काही क्षुल्लक बाब नाही. ते क्रॅक करण्यासाठी वापरल्या जाऊ शकणार्‍या शक्तिशाली संगणकीय साधनांसमोर मजबूत एनक्रिप्शन तयार करण्यासाठी आवश्यक असलेल्या कल्पना समजून घेतल्याने विद्यार्थी त्यांचे पाय ओले होतील. इंटरनेटवरून बिट पाठवताना गोपनीयतेची गरज इंटरनेट वापरणाऱ्या प्रत्येकासाठी महत्त्वाची आहे.",
          "student_overview": "या धड्यात, विद्यार्थ्यांना गुप्त संदेश तोडण्यासाठी (किंवा क्रॅक करण्यासाठी) एन्क्रिप्शनची आवश्यकता आणि सोप्या तंत्रांचा परिचय करून दिला जातो. विद्यार्थी क्लासिक सीझर सायफर आणि यादृच्छिक प्रतिस्थापन सायफरसह एन्कोड केलेला संदेश क्रॅक करण्याचा प्रयत्न करतात. शक्तिशाली संगणकीय साधनांच्या युगात, एनक्रिप्शनच्या तंत्रांना अधिक परिष्कृत करणे आवश्यक आहे या कल्पनेशी विद्यार्थ्यांना चांगले परिचित असले पाहिजे. इंटरनेटवरील आपल्या दैनंदिन जीवनात एन्क्रिप्शन कशी आणि का भूमिका बजावते हे समजून घेणे हा या धड्याचा सर्वात महत्त्वाचा पैलू आहे आणि चांगले एन्क्रिप्शन तयार करणे ही काही क्षुल्लक बाब नाही. ते क्रॅक करण्यासाठी वापरल्या जाऊ शकणार्‍या शक्तिशाली संगणकीय साधनांसमोर मजबूत एनक्रिप्शन तयार करण्यासाठी आवश्यक असलेल्या कल्पना समजून घेतल्याने विद्यार्थी त्यांचे पाय ओले होतील. इंटरनेटवरून बिट पाठवताना गोपनीयतेची गरज इंटरनेट वापरणाऱ्या प्रत्येकासाठी महत्त्वाची आहे."
        },
        "starwars/Hour of Code 2015": {
          "student_overview": "या धड्यात सर्व वयाचे विद्यार्थी कोडींग आणि संगणक शास्त्राचा एका सुरक्षित, मदत करणाऱ्या वातावरणात परिचयात्मक अनुभव घेऊ शकतात. या धड्याच्या दोन आवृत्त्या आहेत."
        },
        "mc/Hour of Code 2015": {
          "overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडिंग आणि संगणक शास्त्राचा परिचयात्मक अनुभव मिळतो. हा धडा वाचण्यास पुरेसा वय असलेल्या कोणत्याही विद्यार्थ्यासाठी (6+ वयोगटातील) चांगला कार्य करतो. तरुण शिकणारे ट्यूटोरियल कदाचित पूर्ण करणार नाहीत, परंतु त्यांना एक तासासाठी कोडी सोडवण्यात खूप मजा येईल. हायस्कूलचे विद्यार्थी बहुतेक ट्यूटोरियल पूर्ण करतील आणि शेवटी विनामूल्य प्ले स्तरावर खेळण्यासाठी थोडा वेळ मिळेल.",
          "student_overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडिंग आणि संगणक शास्त्राचा परिचयात्मक अनुभव मिळतो. हा धडा वाचण्यास पुरेसा वय असलेल्या कोणत्याही विद्यार्थ्यासाठी (6+ वयोगटातील) चांगला कार्य करतो. तरुण शिकणारे ट्यूटोरियल कदाचित पूर्ण करणार नाहीत, परंतु त्यांना एक तासासाठी कोडी सोडवण्यात खूप मजा येईल. हायस्कूलचे विद्यार्थी बहुतेक ट्यूटोरियल पूर्ण करतील आणि शेवटी विनामूल्य प्ले स्तरावर खेळण्यासाठी थोडा वेळ मिळेल."
        },
        "playlab/Play Lab": {
          "student_overview": "या धड्यात, शिकणाऱ्यांना संगणक विज्ञानाचा परिचयात्मक अनुभव मिळतो आणि मूलभूत ब्लॉक कोड वापरून गेम तयार करतो."
        },
        "applab-intro/Intro to App Lab": {
          "student_overview": "ट्युटोरियलच्या शेवटी, तुम्ही \"तुमचे स्वतःचे साहस निवडा\", \"ग्रीटिंग कार्ड\" किंवा \"पर्सनॅलिटी क्विझ\" अॅपमध्ये बनवण्यास सुरुवात केलेल्या प्रकल्पाचा विस्तार करण्यास सक्षम असाल. तुम्ही code.org/applab पृष्‍ठावर वैशिष्‍ट्यीकृत आणखी प्रकल्प तयार करणे देखील सुरू ठेवू शकता.\n\nअॅप लॅबसह अवर ऑफ कोड  पूर्ण करण्यात मजा करा!"
        },
        "starwarsblocks/Hour of Code 2015": {
          "student_overview": "या धड्यात सर्व वयाचे विद्यार्थी कोडींग आणि संगणक शास्त्राचा एका सुरक्षित, मदत करणाऱ्या वातावरणात परिचयात्मक अनुभव घेऊ शकतात. या धड्याच्या दोन आवृत्त्या आहेत."
        },
        "text-compression/Text Compression": {
          "student_overview": "काही क्षणी आपण किती वेगाने बिट पाठवू शकतो याच्या भौतिक मर्यादेपर्यंत पोहोचतो आणि जर आपल्याला मोठ्या प्रमाणात माहिती जलद पाठवायची असेल, तर आपल्याला तीच माहिती कमी बिटसह सादर करण्याचा मार्ग शोधावा लागेल. - आपल्याला डेटा संकुचित करावा लागेल."
        },
        "outbreak/Outbreak": {
          "purpose": "मागच्या धड्यामध्ये, विद्यार्थ्यांनी एका साध्या सिम्युलेशनमधून डेटा गोळा केला आणि त्याचा अर्थ लावला. या धड्यात, विद्यार्थी त्यांचे स्वत:चे सिम्युलेशन मॉडेल तयार करण्यासाठी सूचनांचे पालन करतील. विद्यार्थ्यांचे प्रत्येक जगातील विषाणू उद्रेकाबद्दलचे पूर्वज्ञान काल्पनिक प्रसंगासाठी वापरले जाईल."
        },
        "sports/Sports": {
          "overview": "या ऑनलाईन उपक्रमात, विद्यार्थी इव्हेंट्स म्हणजे काय आणि कॉम्प्युटर्स त्याचा वापर व्हिडीओ गेम्समध्ये प्रोग्रॅम करण्यासाठी कसा करतात, हे शिकतील. प्रोग्रॅमला इव्हेंट्सन प्रतिसाद द्यायला लावून विद्यार्थी कोडी सोडवू शकतील (उदा. ॲरो बटणे दाबली जाणे). कोड्याच्या शेवटी, विद्यार्थ्यांना त्यांचा गेम वेगवेगळ्या गतींना आणि आवाजांना कस्टमाईझ करण्याची संधी मिळेल."
        },
        "infinity/Infinity": {
          "student_overview": "या धड्यात, शिकणाऱ्यांना संगणक विज्ञानाचा परिचयात्मक अनुभव मिळतो आणि मूलभूत ब्लॉक कोड वापरून गेम तयार करतो."
        },
        "basketball/Bounce": {
          "overview": "या ऑनलाईन उपक्रमात, विद्यार्थी इव्हेंट्स म्हणजे काय आणि कॉम्प्युटर्स त्याचा वापर व्हिडीओ गेम्समध्ये प्रोग्रॅम करण्यासाठी कसा करतात, हे शिकतील. प्रोग्रॅमला इव्हेंट्सन प्रतिसाद द्यायला लावून विद्यार्थी कोडी सोडवू शकतील (उदा. ॲरो बटणे दाबली जाणे). कोड्याच्या शेवटी, विद्यार्थ्यांना त्यांचा गेम वेगवेगळ्या गतींना आणि आवाजांना कस्टमाईझ करण्याची संधी मिळेल."
        },
        "dance-2019/Dance Party": {
          "overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडींग आणि संगणक शास्त्राचा प्रास्ताविक अनुभव मिळतो. हा धडा सर्व वयोगटातील शिकणाऱ्यांसाठी डिझाइन केला गेला आहे परंतु त्याला वाचन आवश्यक आहे. या क्रियाकलापासाठी आवाज आवश्यक आहे कारण हे साधन संगीताला प्रतिसाद देण्यासाठी तयार करण्यात आले होते.",
          "student_overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडींग आणि संगणक शास्त्राचा प्रास्ताविक अनुभव मिळतो. हा धडा सर्व वयोगटातील शिकणाऱ्यांसाठी डिझाइन केला गेला आहे परंतु त्याला वाचन आवश्यक आहे. या क्रियाकलापासाठी आवाज आवश्यक आहे कारण हे साधन संगीताला प्रतिसाद देण्यासाठी तयार करण्यात आले होते."
        },
        "oceans/Oceans": {
          "overview": "या धड्यात, सर्व वयोगटातील विद्यार्थ्यांना सुरक्षित, आश्वासक वातावरणात कोडिंग आणि संगणक शास्त्राचा परिचयात्मक अनुभव मिळतो. प्रथम, समुद्रातील कचरा काढून टाकण्याचा प्रयत्न करण्यासाठी विद्यार्थी वस्तूंचे वर्गीकरण \"मासे\" किंवा \"मासे नाही\" असे करतात. त्यानंतर, पाण्यातील इतर समुद्री जीवांचा समावेश करण्यासाठी विद्यार्थ्यांना त्यांचा प्रशिक्षण डेटा संच विस्तारित करणे आवश्यक आहे. क्रियाकलापाच्या दुसऱ्या भागात, विद्यार्थी यादृच्छिकपणे व्युत्पन्न केलेल्या माशांच्या प्रतिमांना लागू करण्यासाठी स्वतःची लेबले निवडतील. हा प्रशिक्षण डेटा मशीन लर्निंग मॉडेलसाठी वापरला जातो जो नंतर स्वतः नवीन प्रतिमांना लेबल करण्यास सक्षम असेल.",
          "student_overview": "ट्युटोरीयल सारांश: आधी विद्यार्थी महासागरातून कचरा काढून टाकण्याचा प्रयत्न करण्यासाठी ऑब्जेक्टचे \"मासा आहे\" किंवा \"मासा नाही\" असे वर्गीकरण करतील. नंतर, विद्यार्थ्यांना पाण्यातील इतर प्राणी समाविष्ट करण्यासाठी त्यांच्या ट्रेनिंग सेटचा विस्तार करावा लागेल. कृतीच्या दुसऱ्या भागात, विद्यार्थी यादृच्छिकपणे तयार केलेल्या माशांच्या इमेजेसना लागू करण्यासाठी त्यांची स्वत:ची लेबल्स निवडतील.हा ट्रेनिंग डेटा मशीन लर्निंग मॉडेलसाठी वापरला जाईल आणि मग ते नवीन इमेजेसना स्वत: लेबल करू शकेल."
        },
        "poem-art/lesson-1": {
          "overview": "या CS आणि ELA एकात्मिक धड्यात, विद्यार्थी कवितेचा मूड स्पष्ट करण्यासाठी कोडसह कविता अॅनिमेट करतील. या प्रास्ताविक कोडींग क्रियाकलापादरम्यान, विद्यार्थी कविता वाचतील आणि त्यातील मूड ओळखतील. त्यानंतर, त्यांना कवितेचा मूड स्पष्ट करण्यात मदत करण्यासाठी संबंधित प्रभाव आणि प्रतिमा सापडतील. शेवटी, विद्यार्थी मूडमधील बदल स्पष्ट करण्यासाठी किंवा कवितेतील नवीन प्रतिमांचा परिचय देण्यासाठी इव्हेंट (कोड) वापरतील.\n\nहा धडा 1-तासांचा स्वतंत्र धडा म्हणून पूर्ण केला जाऊ शकतो. हा धडा [कवितेसह कोडिंग](http://code.org/poetry) नावाच्या 5-धड्याच्या मॉड्यूलचा पहिला धडा म्हणून वापरण्याचा पर्याय देखील आहे. कोडींग विथ पोएट्री मॉड्युल संपेपर्यंत, विद्यार्थी स्वतःच्या कविता लिहितील आणि मित्रांसोबत शेअर करण्यासाठी कविता जनरेटर अॅप तयार करतील.\n\nकविता सह कोडिंग हा Code.org च्या CS Connections अभ्यासक्रमाचा एक भाग आहे, ज्याचा उद्देश CS ला CCSS, NGSS आणि CSTA मानकांशी संरेखित करून गणित, ELA आणि विज्ञान यांसारख्या इतर विषयांमध्ये समाकलित करण्यासाठी आहे."
        },
        "jigsaw/Jigsaw": {
          "overview": "हा धडा विद्यार्थ्यांना ते कॉम्प्युटर प्रयोगशाळेत जातील तेव्हा कशाची अपेक्षा करायची त्याची कल्पना देईल. याची सुरुवात त्यांना कॉम्प्युटर प्रयोगशाळेतील शिष्टाचारांचा परिचय करून देण्यापासून होईल, नंतर ते ऑनलाईन कोडी पूर्ण करण्यासाठी कॉम्प्युटर वापरण्यापर्यंत प्रगती करतील.",
          "student_overview": "कोडी पूर्ण करण्यासाठी क्लिक करा आणि ड्रॅग करा."
        },
        "coursef-2021/lesson-6": {
          "overview": "या **संदर्भ-सेटिंग** धड्यात, विद्यार्थी त्यांच्या जीवनातील संगणक आणि तंत्रज्ञानाच्या भूमिकेवर चर्चा करतील, अॅप्स आणि टूल्स वापरकर्त्यांसाठी  त्यांचा वापर कसा करायचा याच्या निवडी कशा  करायच्या यावर लक्ष केंद्रित करतील. विद्यार्थी ते नंतर स्वतः तयार करतील त्यासारखे अॅप्स देखील शोधतील.",
          "preparation": "-   विद्यार्थी Code.org वर कसे लॉग इन करतील ते निश्चित करा.\n-   आवश्यक असल्यास, विद्यार्थ्यांसाठी Code.org  चे खाते तयार करा.\n-   विद्यार्थ्यांना स्प्राइट लॅबची ओळख करून द्या.\n-   **\\*एक्सप्लोरिंग अॅप्स** वर्कशीटच्या प्रती प्रिंट करा (किंवा तुमच्या LMS वर डिजिटल आवृत्ती पोस्ट करा).",
          "purpose": "पहिला धडा विद्यार्थ्यांना अभ्यासक्रमाबद्दल उत्साही बनवणे आणि त्यांच्या स्वत:च्या वैयक्तिक आवडींना संगणक विज्ञानाशी जोडणे हा आहे."
        },
        "coursef-2021/lesson-7": {
          "preparation": "लेव्हल्स द्वारे खेळा आणि \\***\\* धड्याच्या स्लाइड्सचे पुनरावलोकन करा**.",
          "purpose": "हा धडा विद्यार्थ्यांना स्प्राईट लॅबमधील प्रोग्रामिंगची ओळख करून देण्यासाठी तयार केला आहे. विद्यार्थी या साधनाचे प्रोग्रामिंग मॉडेल समजून घेण्यास सुरुवात करतील आणि ते स्वतःला अभिव्यक्त करण्यासाठी ते कसे वापरू शकतात ते शोधतील."
        },
        "coursef-2021/lesson-8": {
          "preparation": "लेव्हल नुसार खेळा आणि लेसन स्लाइडचे पुनरावलोकन करा.",
          "purpose": "हा धडा मागील धड्यातील कौशल्ये अधिक मजबूत करण्यासाठी आणि विद्यार्थ्यांना कार्यक्रमांसह प्रोग्रामिंगची ओळख करून देण्यासाठी डिझाइन केले आहे. संपूर्ण कोर्समध्ये, इव्हेंट्स हे प्राथमिक मार्ग आहेत जे विद्यार्थी त्यांचे इव्हेंट वेळोवेळी किंवा वापरकर्त्याच्या प्रतिसादानुसार कसे बदलतील हे दाखविण्यासाठी."
        },
        "coursef-2021/Virtual Pet": {
          "purpose": "हा धडा विद्यार्थ्यांना इतर सर्जनशील संदर्भात आधीच्या धड्यांमधून प्रोग्रामिंग संकल्पना लागू करू देतो."
        },
        "coursef-2021/lesson-2": {
          "overview": "![](https://curriculum.code.org/static/img/common_sense_education.png)\n\nहा धडा मुळात कॉमन सेन्स एज्युकेशनने तयार केला. [अधिक जाणून घ्या.](https://www.commonsense.org/education/digital-citizenship/curriculum)\n\nमुले जसजशी मोठी होतील, तसतसे ते नैसर्गिकरित्या अधिक ऑनलाइन संप्रेषण करण्यास सुरवात करतील. पण ते जे पाहतात त्यातून त्यांना दुखापत, दु:खी, राग किंवा अगदी भीती वाटू शकते. तुमच्या विद्यार्थ्यांना इतरांबद्दल सहानुभूती निर्माण करण्यात मदत करा आणि सायबर बुलिंगचा सामना करताना वापरण्यासाठीच्या धोरणे जाणून घ्या.",
          "preparation": "-   शिक्षण सामग्रीचे पुनरावलोकन करा.\n-   प्रत्येक विद्यार्थ्यासाठी हँडआउट प्रिंट करा.\n-   वर्गासाठी एक लांब तार (किंवा दोरी) आणि कागद तयार ठेवा.",
          "purpose": "कॉमन सेन्स एज्युकेशनने हा धडा विद्यार्थ्यांना शिकवण्यासाठी तयार केला आहे जेव्हा कोणी इंटरनेटवर वाईट किंवा दुखावणारी भाषा वापरते तेव्हा त्यांनी काय केले पाहिजे."
        },
        "coursef-2021/lesson-9": {
          "preparation": "6 लिफाफे मिळवा (योग्य: पेपर किंवा इंडेक्स कार्ड, अर्ध्यामध्ये दुमडलेले).\n\n-   प्रत्येक लिफाफ्याच्या समोर मोठ्या अक्षरांनी लेबल करा: ऑब्जेक्ट, द्रव, संख्या, विशेषण, मुख्य भाग, संख्या\n-   विद्यार्थ्याच्या **\\*वर्कशीट** च्या प्रती प्रिंट करा (किंवा तुमच्या LMS वर डिजिटल आवृत्ती पोस्ट करा).",
          "purpose": "हा धडा एक सामायिक संदर्भ प्रदान करतो जो विद्यार्थी प्रोग्रामिंगमध्ये परतल्यावर व्हेरिएबल्स कसे कार्य करतात हे समजून घेण्यासाठी उपयुक्त ठरेल."
        },
        "coursef-2021/lesson-10": {
          "preparation": "लेव्हल नुसार खेळा आणि लेसन स्लाइडचे पुनरावलोकन करा.",
          "purpose": "डेटा संग्रहित करण्यासाठी आणि सुधारित करण्यासाठी या अभ्यासक्रमात व्हेरिएबल्सचा वापर केला जाईल. या टप्प्यावर, विद्यार्थी मूल्ये न बदलता फक्त साठवून ठेवतील आणि पुनर्प्राप्त करतील. नंतरच्या धड्यांमध्ये, विद्यार्थी संख्यात्मक मूल्ये संग्रहित करतील आणि गेममधील खेळाडूच्या स्कोअरसारख्या गोष्टींचा मागोवा ठेवण्यासाठी कालांतराने त्यामध्ये सुधारणा करतील.",
          "student_overview": "या धड्यामध्ये तुम्ही स्प्राईट लॅबमधील व्हेरिएबल्ससह सराव कराल."
        },
        "coursef-2021/lesson-11": {
          "preparation": "-   नियोजन मार्गदर्शक मुद्रित करा किंवा प्रत्येक विद्यार्थ्याला डिजिटल प्रत वितरित करा. तुम्‍हाला तुमच्‍या वर्गात बसण्‍यासाठी कोणतेही बदल करण्‍याचे वाटत असल्‍यास वेळेपूर्वी त्याचे पुनरावलोकन करा.\n\n-   विद्यार्थ्यांना ज्या प्रवाहाचे अनुसरण करावे लागेल त्याच्याशी परिचित होण्यासाठी वेळेपूर्वी स्तर 3 मधील पर्यायांचे पुनरावलोकन करा.\n\n-   या धड्यात अनेक वर्ग कालावधीपर्यंत वाढण्याची क्षमता आहे. वेळेपूर्वी शेड्यूलिंग परिणामांचा विचार करा.",
          "purpose": "हा धडा नवीन कौशल्ये किंवा संकल्पनांचा परिचय देत नाही, परंतु त्याऐवजी विद्यार्थ्यांना ते जे शिकत आहेत ते सर्जनशील पद्धतीने लागू करण्याची संधी देते."
        },
        "coursef-2021/Loops with the Artist": {
          "purpose": "विद्यार्थी लूप वापरून सराव करतील, ही एक संकल्पना आहे ज्याची आगामी धड्यांमध्ये पुनरावृत्ती केली जाईल."
        },
        "coursef-2021/Variables that Change in Artist": {
          "purpose": "व्हेरिएबल्स हे मूलत: व्हॅल्यूजसाठी प्लेसहोल्डर असतात जे तुम्ही तुमचा प्रोग्राम चालवता त्या वेळी अज्ञात असू शकतात किंवा प्रोग्रामच्या अंमलबजावणी दरम्यान बदलू शकणार्‍या मूल्यांसाठी. डायनॅमिक कोड तयार करण्यासाठी हे महत्त्वाचे आहेत कारण ते तुमच्या प्रोग्रामला कितीही संभाव्य बदलांच्या आधारावर बदलण्याची आणि वाढण्याची परवानगी देतात. हा टप्पा व्हेरिएबल्सच्या वापरास अधिक बळकट करतो, सेटिंग आणि वापरण्याच्या सर्वात मूलभूत क्षमतांचा वापर करून."
        },
        "coursef-2021/Nested Loops in the Maze": {
          "purpose": "हा धडा मधमाशी पझल्स कसे कार्य करतात याची ओळख करून देतो (किंवा पुनरावलोकन करतो) आणि विद्यार्थ्यांना \\_नेस्टेड लूपची ओळख करून देतो. पुढील धडा व्हेरिएबल्सकडे परत जाईल."
        },
        "coursef-2021/Variables that Change in Bee": {
          "purpose": "हा धडा स्पष्ट करेल की बदलत्या मूल्यांसह कोड कसा उपयुक्त ठरू शकतो आणि आगामी धड्यांमध्ये \"फॉर\" लूप कसे कार्य करतात हे समजून घेण्यासाठी विद्यार्थ्यांना तयार करेल.",
          "student_overview": "या मधमाशीला व्हेरिएबल्स आवडतात!"
        },
        "coursef-2021/For Loop Fun": {
          "preparation": "-   **\\*व्हिडिओ** पहा.\n-   प्रत्येक गटासाठी एक **\\*वर्कशीट** प्रिंट करा.\n-   प्रत्येक विद्यार्थ्यासाठी एक **\\*मूल्यांकन** प्रिंट करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या टप्प्यावर, विद्यार्थी लूप चे  मास्टर बनले आहेत. आज, ते प्रोग्रामिंगमध्ये सामान्यतः वापरल्या जाणार्‍या दुसर्‍या लूपबद्दल शिकतील. \"फॉर\" लूप ठराविक वेळा आदेशांची पुनरावृत्ती करते, परंतु ते पुनरावृत्ती होत असलेल्या मूल्यांचा देखील मागोवा ठेवते. उदाहरणार्थ, 4 पासून सुरू होणारे, 8 ने समाप्त होणारे आणि 1 चे स्टेप व्हॅल्यू असलेले लूप 4 वेळा रिपीट होईल, परंतु 4, 5, 6, आणि 7 ही मूल्ये इतरत्र वापरण्यासाठी कॅप्चर केली जातील. व्हेरिएबल्ससह ही रचना वापरल्याने काही सुंदर विलक्षण प्रोग्राम तयार होऊ शकतात. आज, विद्यार्थी पुढच्या वेळी त्यांच्यासोबत प्रोग्रॅमिंगमध्ये जाण्यापूर्वी \"फॉर\" लूपची मूलभूत माहिती शिकत असतील!"
        },
        "coursef-2021/For Loops in Bee": {
          "purpose": "आजची संकल्पना, फॉर लूप्स  हा संगणक शास्त्रातील अत्यंत महत्त्वाचा विषय आहे. ते केवळ मोठ्या प्रमाणावर वापरले जात नाहीत, लूपसाठी शिकण्याची प्रक्रिया इतर महत्त्वाच्या संकल्पनांचे शिक्षण वाढवते (जसे की व्हेरिएबल्स आणि पॅरामीटर्स.) लूपसाठी विद्यार्थ्यांना प्रत्येकासाठी प्रारंभिक, समाप्ती आणि चरण मूल्ये निर्धारित करून समस्यांवर गंभीरपणे विचार करण्याचा भरपूर सराव असेल.  ही संकल्पना भरपूर गणिताचा देखील वापर करते, त्यामुळे अधिक सखोल शिकण्याच्या अनुभवासाठी गणिताच्या धड्यासोबत मोकळ्या मनाने त्याची जोडणी करा."
        },
        "coursef-2021/For Loops in Artist": {
          "purpose": "सर्जनशीलता आणि टीकात्मक विचार या धड्यात सुंदरपणे एकत्र आले आहेत. विद्यार्थी लूप आणि व्हेरिएबल्ससह त्यांचा सराव  तो पर्यंत  सुरू ठेवतील जो पर्यंत ते आश्चर्यकारक प्रतिमा तयार करत नाहीत. हा धडा संगणक ज्ञानाच्या मूलभूत संकल्पना शिकवताना सर्जनशील मनाला प्रेरणा देतो."
        },
        "coursef-2021/Simulating Experiments": {
          "preparation": "-   विद्यार्थी त्यांच्या स्वत:च्या संगणकावर सिम्युलेशन चालवतील कि ते तुम्ही संपूर्ण वर्ग म्हणून चालवणार आहात हे आधी ठरवा\n-   आवश्यक असल्यास, या धड्यातील दोन सिम्युलेशन प्रोजेक्ट करण्याची तयारी करा.",
          "purpose": "अनेक शाखांमधील विज्ञाने प्रयोग चालवण्यासाठी, डेटा गोळा करण्यासाठी आणि अंतर्दृष्टीसाठी त्या डेटाचे विश्लेषण करण्यासाठी मॉडेल्स आणि सिम्युलेशन चालवण्यासाठी संगणक विज्ञान वापरतात. जरी या धड्यात सादर केलेले सिम्युलेशन अगदी सोपे असले तरी, गृहितकांची चाचणी घेण्यासाठी अधिक अत्याधुनिक संगणकीय मॉडेल्स कसे वापरता येतील याचा विचार करण्यासाठी विद्यार्थ्यांसाठी जंपिंग ऑफ पॉइंट म्हणून त्याचा वापर केला जाऊ शकतो."
        },
        "coursef-2021/lesson-5": {
          "purpose": "मागच्या धड्यामध्ये, विद्यार्थ्यांनी एका साध्या सिम्युलेशनमधून डेटा गोळा केला आणि त्याचा अर्थ लावला. या धड्यात, विद्यार्थी त्यांचे स्वत:चे सिम्युलेशन मॉडेल तयार करण्यासाठी सूचनांचे पालन करतील. विद्यार्थ्यांचे प्रत्येक जगातील विषाणू उद्रेकाबद्दलचे पूर्वज्ञान काल्पनिक प्रसंगासाठी वापरले जाईल."
        },
        "coursef-2021/AI for Oceans": {
          "purpose": "हा धडा विद्यार्थ्यांना मशीन लर्निंग, कृत्रिम बुद्धिमत्तेचा एक प्रकार, त्वरीत ओळखण्यासाठी डिझाइन केला आहे. नवीन डेटाचे वर्गीकरण करण्यासाठी मशीन लर्निंग मॉडेल सक्षम करण्यासाठी प्रशिक्षण डेटाचा कसा वापर केला जातो हे विद्यार्थी एक्सप्लोर करतील. ट्यूटोरियल दरम्यान विद्यार्थ्यांना सकारात्मक अनुभव मिळाला पाहिजे आणि त्याहूनही महत्त्वाचे म्हणजे संगणक विज्ञान शिकत राहण्यासाठी त्यांना प्रवृत्त केले पाहिजे."
        },
        "coursef-2021/Internet": {
          "preparation": "-   **\\*इंटरनेट** पहा - शिक्षक व्हिडिओ.\n-   **\\*IP पत्ता कार्ड आणि वितरण प्रकार कार्ड** - प्रत्येक गटासाठी  पुरेशी  प्रिंट करा .\n-   प्रत्येक विद्यार्थ्यासाठी एक **\\*इंटरनेट** मूल्यमापन प्रिंट करा.\n-   इंटरनेटवर प्रवेश (जसे की **\\*get-site-ip.com**.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "जर तुम्ही या अभ्यासक्रमातील प्रत्येक धडा करत असाल, तर तुमच्या वर्गातील प्रत्येक विद्यार्थ्याने इंटरनेट वापरला आहे... पण ते कसे कार्य करते हे किती जणांना माहीत आहे? इंटरनेटबद्दल अधिक जाणून घेतल्याने विद्यार्थ्यांना त्याच्या अंतहीन शक्यतांची चांगली समज विकसित करण्यात मदत होईल."
        },
        "coursef-2021/End of Course Project": {
          "preparation": "-   कलाकार आणि स्प्राईट लॅब या दोहोंसोबत तुमचा स्वतःचा प्रोजेक्ट बनवण्यात वेळ घालवा. प्रत्येक साधनाच्या क्षमता आणि मर्यादांशी परिचित व्हा.\n-   तुमच्या वर्गाच्या उद्दिष्टांमध्ये बसण्यासाठी रुब्रिकमध्ये बदल करा आणि प्रत्येक विद्यार्थ्यासाठी एक प्रत छापा.\n-   तुमच्या वर्गात बसण्यासाठी प्रोजेक्ट डिझाइन वर्कशीटमध्ये बदल करा आणि प्रत्येक विद्यार्थ्यासाठी एक पॅकेट प्रिंट करा.",
          "purpose": "विद्यार्थी त्यांचे प्रकल्प तयार करण्यासाठी थेट उडी मारण्यास तयार असू शकतात, परंतु हा धडा त्यांच्या कल्पनांना योजनांमध्ये आकार देण्यास मदत करेल. ही रचना स्वप्न पाहणाऱ्यांना जमीनी वर  ठेवेल आणि अंधारात सोडलेल्या लोकांसाठी एक मार्ग प्रकाशित करेल. विद्यार्थ्यांना त्यांचे प्रकल्प तयार करण्यासाठी आणि सुधारित करण्यासाठी पुरेसा वेळ द्या. या धड्यातील चाचणी आणि त्रुटी अपरिहार्यपणे समस्या सोडवणे आणि चिकाटी शिकवतील."
        },
        "courseb-2021/Digital Trails": {
          "overview": "![](https://curriculum.code.org/static/img/common_sense_education.png)\n\nहा धडा मुळात कॉमन सेन्स एज्युकेशनने तयार केला आहे. [अधिक जाणून घ्या.](https://www.commonsense.org/education/digital-citizenship/curriculum)\n\nतुम्ही जे ऑनलाइन करता ते नेहमी ऑनलाइन राहते का? विद्यार्थी शिकतात की त्यांनी ऑनलाइन शेअर केलेली माहिती डिजिटल फूटप्रिंट किंवा \"ट्रेल\" सोडते. ते कसे व्यवस्थापित करतात यावर अवलंबून, हा मार्ग मोठा किंवा लहान आणि हानिकारक किंवा उपयुक्त असू शकतो. विद्यार्थी वेगवेगळ्या मार्गांची तुलना करतात आणि त्यांना कोणत्या प्रकारची माहिती मागे ठेवायची आहे याचा गंभीरपणे विचार करतात.",
          "preparation": "-   शिक्षण सामग्रीचे पुनरावलोकन करा.\n-   प्रत्येक विद्यार्थ्यासाठी हँडआउट प्रिंट करा.",
          "purpose": "कॉमन सेन्स एज्युकेशनने हा धडा विद्यार्थ्यांना \"डिजिटल फूटप्रिंट्स\" शिकवण्यासाठी तयार केला आणि कोणती माहिती त्यांच्या स्वतःमध्ये असणे योग्य आहे."
        },
        "courseb-2021/Move It, Move It": {
          "preparation": "-   **_\\\\_शिक्षक व्हिडिओ पहा**\n-   प्रिंट करा (किंवा अन्यथा प्रदर्शित करण्यासाठी तयार करा) **\\*वर्कशीट उत्तर की**\n-   प्रत्येक 2-3 विद्यार्थ्यांच्या गटासाठी एक **\\*नकाशा क्रियाकलाप** आणि एक **\\*वर्कशीट** प्रिंट करा\n-   उर्वरित वॉकिंग ग्रिड भरण्यासाठी रिक्त कागदपत्रे तयार करा (प्रत्येक गटात 4-7 आवश्यक)",
          "purpose": "त्यांच्या वर्गमित्रांना प्रोग्राम करण्यासाठी शारीरिक हालचाल वापरून, विद्यार्थी संगणकावर कोडिंग सुरू केल्यावर त्यांना काय वाटेल अशा समस्या आणि भावनांना सामोरे जावे लागेल. खेळकर आणि मोकळ्या वातावरणात या ताणतणावांचा सामना केल्याने त्याची तीव्रता कमी होण्यास मदत होईल आणि विद्यार्थ्यांना स्वतःच समस्या सोडवण्याआधी आवश्यक कौशल्यांचा सराव करता येईल.",
          "student_overview": "तुमच्या वर्गमित्रांना एका ठिकाणाहून काळजीपूर्वक पाऊल ठेवण्यासाठी प्रोग्राम करा."
        },
        "courseb-2021/Sequencing in Maze": {
          "preparation": "-   जर तुमचे विद्यार्थी ड्रॅग आणि ड्रॉप करण्यात अगदी नवीन असतील, तर हा धडा सुरू करण्यापूर्वी त्यांना **\\*ड्रॅग आणि ड्रॉप सराव** नियुक्त करण्याचा विचार करा.\n-   Code.org वर **\\*वर्ग विभाग कसा बनवायचा ते पहा** - शिक्षक व्हिडिओ, Code.org वर तुमचा स्वतःचा वर्ग विभाग तयार करा आणि प्रत्येक विद्यार्थ्याकडे पासकोड असलेले कार्ड असल्याची खात्री करा.\n-   शालेय आयटी व्यक्तीला संगणकाच्या डेस्कटॉपवर तुमच्या वर्ग विभागासाठी एक क्विक लिंक जोडण्यास सांगा.\n-   प्रत्येक विद्यार्थ्याकडे जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, विद्यार्थी संगणक प्लॅटफॉर्मवर प्रोग्रामिंग आणि डीबगिंग कौशल्ये विकसित करतील. या कोड्याचे  ब्लॉक-आधारित स्वरूप विद्यार्थ्यांना वाक्यरचना परिपूर्ण  न करता, अनुक्रम आणि संकल्पना जाणून घेण्यास मदत करते."
        },
        "courseb-2021/Programming in Maze": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडे खेळा.\n-   **\\*Happy Maps** साठी पुरवठा शोधा किंवा पुनर्मुद्रित करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.\n-   प्रत्येक विद्यार्थ्याच्या जोडीला दोन संच देण्यासाठी (आपण ब्रिजिंग पर्याय #1 निवडल्यास) प्रत्येक दिशा (N, S, E, W) पुरेशी **\\*मॅनिप्युलेटिव्ह्ज** कापून घ्या.",
          "purpose": "या धड्यात, विद्यार्थी संगणक प्लॅटफॉर्मवर प्रोग्रामिंग कौशल्ये विकसित करतील. या कोड्याचे  ब्लॉक-आधारित स्वरूप विद्यार्थ्यांना वाक्यरचना परिपूर्ण  न करता, अनुक्रम आणि संकल्पना जाणून घेण्यास मदत करते."
        },
        "courseb-2021/Programming in Harvester": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, विद्यार्थी डीबगिंग कौशल्ये विकसित करतील आणि त्यांचे प्रोग्रामिंग कौशल्य विकसित करणे सुरू ठेवतील.",
          "student_overview": "हार्वेस्टरला एका मार्गावर भाज्या गोळा करण्यात मदत करा."
        },
        "courseb-2021/Loops: Getting Loopy": {
          "preparation": "-   विद्यार्थ्यांना **\\*वर्कशीट** दाखवण्यासाठी तयार करा.\n-   प्रति विद्यार्थ्यासाठी एक **\\*मूल्यांकन** प्रिंट करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "कोर्सच्या या टप्प्यावर, विद्यार्थ्यांनी प्रोग्रामिंगसह एक रेषीय सूचनांचा संच सोईचा विकास केला असावा. वारंवार सूचनांच्या रेषीय संचामध्ये अनेक वेळा पुनरावृत्ती होणारे नमुने समाविष्ट असतात आणि विद्यार्थ्यांना अधिक जटिल आणि मनोरंजक प्रोग्राम लिहायचे असल्याने, त्या कोडची व्यक्तिचलितपणे डुप्लिकेट करणे अवघड आणि अकार्यक्षम बनते. विद्यार्थ्यांना अधिक शक्तिशाली प्रोग्राम लिहिण्यास सक्षम करण्यासाठी, आम्हाला त्या एकल रेखीय सूचीमधून बाहेर पडणार्‍या संरचनांवर अवलंबून राहावे लागेल. लूप विद्यार्थ्यांना त्यांच्या कोडची पुनरावृत्ती होईल अशा प्रकारे रचना करण्यास परवानगी देतात. या धड्यात, आम्ही आमच्या कोडमधील पॅटर्न शोधण्यासाठी संगणकावर परत जाण्यापूर्वी शारीरिक हालचालींमधील नमुने ओळखण्यावर लक्ष केंद्रित करू."
        },
        "courseb-2021/Loops in Harvester": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडी मधून खेळा.\n-   पुनरावलोकन करा **\\*CS मूलभूत मुख्य क्रियाकलाप टिपा - धड्याच्या शिफारशी**.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.\n-   (पर्यायी) तुमच्या वर्गासोबत गट म्हणून काही कोडी निवडा.\n-   (पर्यायी) जर तुम्ही आधीच केले नसेल, तर या धड्यातील ब्रिजिंग अ‍ॅक्टिव्हिटींपैकी एकाची तयारी करण्यासाठी **\\*मॅनिप्युलेटिव्ह्ज** मधील ब्लॉक्स प्रिंट करा आणि कट करा.",
          "purpose": "या धड्यात, विद्यार्थी लूप आणि त्यांना ब्लॉकली कोडमध्ये कसे अंमलात आणायचे याबद्दल अधिक जाणून घेतील. लूप वापरणे हे प्रोग्रामिंगमधील एक महत्त्वाचे कौशल्य आहे कारण मॅन्युअली कमांडची पुनरावृत्ती करणे कंटाळवाणे आणि अकार्यक्षम असते. Code.org पझल्ससह, विद्यार्थी विद्यमान लूपमध्ये सूचना जोडण्यास शिकतील, लूपमध्ये पुनरावृत्ती केलेले कोड एकत्र करतील आणि लूप साठी आवश्यक असलेले पॅटर्न ओळखतील.",
          "student_overview": "हार्वेस्टरला लूप वापरून आणखी गोळा करण्यात मदत करा!"
        },
        "courseb-2021/Loops in Collector": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडे खेळा.\n-   (पर्यायी) तुमच्या वर्गासोबत गट म्हणून काही कोडी निवडा.\n-   पुनरावलोकन करा **\\*CS मूलभूत तत्त्वे मुख्य क्रियाकलाप टिपा - धड्याच्या शिफारशी**\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा विद्यार्थ्यांना लूपसह अधिक सराव देतो आणि शक्य तितका खजिना गोळा करण्याचा प्रयत्न करत असताना त्यांना एका `पुनरावृत्ती`च्या आत अनेक ब्लॉक्स ठेवण्यास प्रोत्साहित करतो.",
          "student_overview": "खुल्या गुहेत खजिना गोळा करण्यासाठी लॉरेल अॅडव्हेंचरर प्रोग्राम करा."
        },
        "courseb-2021/Loops in Artist": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्रे शोधण्यासाठी धड्याच्या आधी कोडी मधून खेळा.\n-   पुनरावलोकन करा **\\*CS मूलभूत मुख्य क्रियाकलाप टिपा - धड्याच्या शिफारशी**.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा प्रोग्रामिंगमध्ये लूप गोष्टी कशा तयार करू शकतात याबद्दल एक वेगळा दृष्टीकोन देतो. विद्यार्थी दिलेल्या कोडचे मूल्यमापन करून आणि कोडे सोडवण्यासाठी काय जोडले जाणे आवश्यक आहे हे निर्धारित करून त्यांच्या गंभीर विचार कौशल्याची चाचणी घेतील. विद्यार्थी लूपशिवाय प्रोग्रामिंगच्या अकार्यक्षमतेवर देखील प्रतिबिंबित करू शकतात कारण `पुनरावृत्ती` लूपच्या मदतीशिवाय प्रोग्रामला किती ब्लॉक्स आवश्यक आहेत.",
          "student_overview": "इमेजेस पूर्ण करण्यासाठी पॅटर्न आणि लूप वापरा."
        },
        "courseb-2021/The Right App": {
          "preparation": "-   **\\*स्लाइड डेक** मध्ये स्पीकर नोट्स वाचा.\n-   सर्व विद्यार्थ्यांसाठी पुरेशी स्केचिंग/ड्रॉईंगची सामग्री तयार करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "आज, कंप्युटिंग पूर्वीपेक्षा अधिक सुलभ आहे. सर्व क्षेत्रातील लोक माहिती, संप्रेषण आणि मनोरंजनासाठी विविध उपकरणांवर, विशेषतः स्मार्टफोनवर सॉफ्टवेअर वापरतात. लोकांचे असे वैविध्यपूर्ण अनुभव आणि गरजा असल्यामुळे, नवोदित संगणक शास्त्रज्ञांनी लोकांशी सहानुभूती दाखवणे आणि त्यांना लक्षात घेऊन उपाय शोधणे महत्त्वाचे आहे.",
          "student_overview": "आपले स्वतःचे स्मार्टफोन अॅप स्केच करा."
        },
        "courseb-2021/Events: The Big Event": {
          "preparation": "-   **\\*कंट्रोलर इमेज** प्रक्षेपित करण्यासाठी तयार करा.\n-   प्रति विद्यार्थी एक **\\*मूल्यांकन** प्रिंट करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "आज विद्यार्थी घटना आणि कृती यात फरक करायला शिकतील. पेपर रिमोटवर \"बटण\" दाबल्याने विद्यार्थ्यांना क्रियाकलापांमध्ये व्यत्यय आलेला दिसेल. हा कार्यक्रम पाहिल्यावर, वर्ग एक अनोखी कृती करून प्रतिक्रिया देईल. प्रोग्रामिंगमध्ये इव्हेंट्सचा मोठ्या प्रमाणावर वापर केला जातो आणि या धड्यानंतर सहज ओळखता येण्याजोगा असला पाहिजे.",
          "student_overview": "जेव्हा तुमचा शिक्षक एका विशाल रिमोटवर बटण दाबतो तेव्हा हलवा किंवा ओरडा."
        },
        "courseb-2021/Events in Play Lab": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडे खेळा.\n-   (पर्यायी) तुमच्या वर्गासोबत गट म्हणून काही कोडी निवडा.\n-   पुनरावलोकन करा **\\*CS मूलभूत तत्त्वे मुख्य क्रियाकलाप टिपा - धड्याच्या शिफारशी**\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या ऑनलाइन अ‍ॅक्टिव्हिटीमध्ये, विद्यार्थी Play Lab मधील इव्हेंट्स कसे वापरायचे ते शिकतील. जेव्हा ॲरो की दाबली जाते तेव्हा ते नाइटला हलवण्याचे प्रशिक्षण देऊन सुरुवात करतील, त्यानंतर अंतिम फ्रीप्ले कोडेचा भाग म्हणून, अनुक्रम (सिक्वेन्स)आणि लूपिंगसह, या संपूर्ण कोर्समध्ये त्यांनी शिकलेली उर्वरित कौशल्ये प्रदर्शित करण्याच्या संधीसह समाप्त होतील.",
          "student_overview": "कथा  किंवा इंटरॲक्टीव्ह गेम  तयार करण्यासाठी इव्हेंटचा वापर करा."
        },
        "courseb-2021/lesson-1": {
          "preparation": "विद्यार्थ्यांना प्रेरित करण्यासाठी तुमचा स्वतःचा प्ले लॅब प्रोजेक्ट आधीच कोड करा!",
          "purpose": "हा धडा विद्यार्थ्यांना त्यांच्या नवीन संगणक विज्ञान कौशल्यांचा सर्जनशीलतेने वापर करण्याची शेवटची संधी देतो.",
          "student_overview": "आपली स्वतःची स्टोरी किंवा गेम तयार करा."
        },
        "coursea-2021/Safety in My Online Neighborhood": {
          "overview": "![](https://curriculum.code.org/static/img/common_sense_education.png)\n\nहा धडा मुळात कॉमन सेन्स एज्युकेशनने तयार केला आहे. [अधिक जाणून घ्या.](https://www.commonsense.org/education/digital-citizenship/curriculum)\n\nइंटरनेटच्या सामर्थ्यामुळे विद्यार्थ्यांना ते वैयक्तिकरित्या पाहण्यास सक्षम नसलेल्या ठिकाणांचा अनुभव घेण्यास आणि त्यांना भेट देण्याची अनुमती देते. परंतु, वास्तविक जगामध्ये प्रवास करण्याप्रमाणेच, ऑनलाइन प्रवास करताना सुरक्षित असणे महत्त्वाचे आहे. या व्हर्च्युअल फील्ड ट्रिपमध्ये, मुले ऑनलाइन साहसांवर सुरक्षित राहण्याचा सराव करू शकतात.",
          "preparation": "-   शिक्षण सामग्रीचे पुनरावलोकन करा.\n-   प्रत्येक विद्यार्थ्यासाठी हँडआउट प्रिंट करा.\n-   (पर्यायी) वर्गात प्रदर्शनासाठी कविता पोस्टर छापा.",
          "purpose": "कॉमन सेन्स एज्युकेशनने विद्यार्थ्यांना ऑनलाइन ठिकाणी सुरक्षितपणे कसे जाता येईल हे शिकवण्यासाठी हा धडा तयार केला आहे.",
          "student_overview": "सुरक्षितपणे ऑनलाईन ठिकाणी कसे जायचे ते शिका."
        },
        "coursea-2021/Learn to Drag and Drop": {
          "preparation": "-   Code.org वर **\\*वर्ग विभाग कसा बनवायचा** पहा - शिक्षक व्हिडिओ. Code.org वर तुमचा स्वतःचा वर्ग विभाग तयार करा आणि प्रत्येक विद्यार्थ्याकडे त्यांचा पासकोड असलेले कार्ड असल्याची खात्री करा.\n-   विद्यार्थी त्यांच्या डिव्हाइसेसवरून धडा 2 ऍक्सेस करू शकतील याची खात्री करा. विद्यार्थ्यांना खूप लवकर पुढे जाण्यापासून रोखण्यासाठी तुम्हाला भविष्यातील धडे लपवायचे आहेत का याचा विचार करा.\n-   शालेय आयटी व्यक्तीला संगणकाच्या डेस्कटॉपवर तुमच्या वर्ग विभागासाठी एक क्विक लिंक जोडण्यास सांगा.\n-   अधिक ऑनलाइन सुरक्षितता सामग्रीसाठी कॉमन सेन्स एज्युकेशन वेबसाइटचे पुनरावलोकन करा.",
          "purpose": "या धड्याचे मुख्य उद्दिष्ट म्हणजे विद्यार्थ्यांचा संगणकासोबतचा अनुभव तयार करणे. क्लिक करणे, ड्रॅग करणे आणि ड्रॉप करणे यासारख्या मूलभूत संगणक कार्यांचा अंतर्भाव करून, आम्ही भविष्यातील कोडी सोडवण्यासाठी वर्गात अधिक समान खेळाचे क्षेत्र तयार करत आहोत. हा धडा तुमच्या उपकरणांवर अवलंबून \"माऊस\", \"ट्रॅकपॅड\" किंवा \"टचस्क्रीन\" चा समावेश करून मूलभूत संगणक हार्डवेअर शब्दावली सादर करण्याची उत्तम संधी देखील प्रदान करतो.",
          "student_overview": "कोडी पूर्ण करण्यासाठी क्लिक करा आणि ड्रॅग करा."
        },
        "coursea-2021/Programming: Happy Maps": {
          "preparation": "-   प्रत्येक 2-3 गटासाठी एक **\\*वर्कशीट** आणि **\\*मॅनिप्युलेटिव्हज** चा एक सेट प्रिंट करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याचे सुनिश्चित करा.",
          "student_overview": "फळाला फ्लर्ब मिळवण्यासाठी सूचना लिहा."
        },
        "coursea-2021/Sequencing with Scrat": {
          "preparation": "-   हॅप्पी मॅप्स ब्रिजिंग अ‍ॅक्टिव्हिटीसह वापरण्यासाठी **\\*मॅनिप्युलेटिव्ह्ज** मधून दिशेचे ब्लॉक कट करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा..",
          "purpose": "या धड्यात, विद्यार्थी संगणक प्लॅटफॉर्मवर प्रोग्रामिंग आणि डीबगिंग कौशल्ये विकसित करतील. या कोड्याचे  ब्लॉक-आधारित स्वरूप विद्यार्थ्यांना वाक्यरचना परिपूर्ण  न करता, अनुक्रम आणि संकल्पना जाणून घेण्यास मदत करते.",
          "student_overview": "अक्रोनपर्यंत पोहोचण्यासाठी प्रोग्राम स्क्रॅट"
        },
        "coursea-2021/Programming in Ice Age": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   (पर्यायी) तुमच्या वर्गासह एक गट म्हणून काही कोडी निवडा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, विद्यार्थी संगणक प्लॅटफॉर्मवर प्रोग्रामिंग आणि डीबगिंग कौशल्ये विकसित करतील. या कोड्याचे  ब्लॉक-आधारित स्वरूप विद्यार्थ्यांना वाक्यरचना परिपूर्ण  न करता, अनुक्रम आणि संकल्पना जाणून घेण्यास मदत करते.",
          "student_overview": "स्क्रॅटला एकोर्नपर्यंत पोहोचण्यास मदत करण्यासाठी प्रोग्राम लिहा."
        },
        "coursea-2021/Programming with Rey and BB-8": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या शोधण्यासाठी या धड्याशी संबंधित कोडी खेळा.\n-   पुनरावलोकन करा **\\*CS मूलभूत मुख्य क्रियाकलाप टिपा - धड्याच्या शिफारशी**.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "ज्ञानाचे हस्तांतरण लक्षात घेऊन, हा धडा विद्यार्थ्यांना ते जोपासत असलेल्या कौशल्यांचा सराव करण्यासाठी एक नवीन वातावरण देते. स्टार वॉर्सचे चाहते हे कोडे पाहिल्यावर आनंदाने उडी मारतील. या मालिकेतील प्रत्येक कोडे या संपूर्ण अभ्यासक्रमात वापरत असलेल्या मूलभूत संकल्पनांची सखोल माहिती देण्यासाठी जोडण्यात आले आहे.",
          "student_overview": "स्क्रॅप मेटलला गोळा करण्यासाठी BB-8 ला मदत करा"
        },
        "coursea-2021/Loops: Happy Loops": {
          "preparation": "-   वर्गासाठी प्रदर्शित करण्यासाठी **\\*वर्कशीट** प्रिंट करा\n-   2-3 च्या प्रत्येक गटासाठी, प्रत्येकी एक प्रिंट करा: **\\*गेमचे तुकडे, \\*XL वर्कशीट आणि \\*बोनस पॅक मॅनिपुलेटिव्हज**.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा लूपची ओळख करून देतो. लूप विद्यार्थ्यांना पुनरावृत्ती करावी लागणार्‍या कमांडचे गट करून त्यांचा कोड सुलभ करण्यास अनुमती देतात. विद्यार्थी त्यांच्या वर्गमित्रांच्या हालचालींची पुनरावृत्ती लक्षात घेऊन आणि किती वेळा आदेशांची पुनरावृत्ती करायची हे ठरवून गंभीर विचार कौशल्य विकसित करतील. \"हॅपी मॅप्स\" पुन्हा पाहिल्यानंतर, विद्यार्थ्यांना जुन्या संकल्पना जसे की रिपीट लूपच्या नवीन संकल्पनेशी क्रमबद्ध करण्याची संधी मिळेल.",
          "student_overview": "लूप वापरून फ्लर्बला मोठ्या समस्या सोडवण्यात मदत करा."
        },
        "coursea-2021/Loops in Ice Age": {
          "preparation": "-   मागील अनप्लग्ड धड्याचे पुनरावलोकन करा आणि लूप का वापरल्या जातात याची आठवण विद्यार्थ्यांना करून देण्यासाठी प्रश्न विकसित करा.\n-   (पर्यायी) तुमच्या वर्गासोबत गट म्हणून काही कोडी निवडा.\n-   वॉर्म अपसाठी पुन्हा वापरण्यासाठी मागील हॅपी लूपमधून पुरवठा गोळा करा\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, विद्यार्थी लूप आणि त्यांना ब्लॉकली कोडमध्ये कसे अंमलात आणायचे याबद्दल अधिक जाणून घेतील. लूप वापरणे हे प्रोग्रामिंगमधील एक महत्त्वाचे कौशल्य आहे कारण मॅन्युअली कमांडची पुनरावृत्ती करणे कंटाळवाणे आणि अकार्यक्षम असते. या Code.org कोडीसह, विद्यार्थी विद्यमान लूपमध्ये सूचना जोडण्यास शिकतील, लूपमध्ये पुनरावृत्ती केलेले कोड गोळा करतील आणि पुनरावृत्ती करणे आवश्यक असलेले नमुने ओळखतील.",
          "student_overview": "लूप वापरून स्क्रॅटला अधिक जमीन कव्हर करण्यास मदत करा."
        },
        "coursea-2021/Loops in Collector": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडे खेळा.\n-   (पर्यायी) तुमच्या वर्गासोबत गट म्हणून काही कोडी निवडा.\n-   **\\*CSF धड्याच्या शिफारशींचे पुनरावलोकन करा**\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा",
          "purpose": "हा धडा विद्यार्थ्यांना लूपसह अधिक सराव देतो आणि 'खजिना मिळवा' या नवीन ब्लॉकची ओळख करून देतो. ब्लॉक हार्वेस्टरमध्ये `पिक कॉर्न` प्रमाणेच काम करतो. ही कोडी अधिक उघड असून, विद्यार्थ्यांना त्यांच्या अंतिम समाधाना साठी अधिक लवचिकता मिळते."
        },
        "coursea-2021/Ocean Scene with Loops": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n    **\\*CSF धड्याच्या शिफारशींचे पुनरावलोकन करा**.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा प्रोग्रामिंगमध्ये लूप गोष्टी कशा तयार करू शकतात याबद्दल एक वेगळा दृष्टीकोन देतो. विद्यार्थी लूपशिवाय प्रोग्रामिंगच्या अकार्यक्षमतेचा देखील विचार करू शकतात कारण 'रिपीट' लूपच्या मदतीशिवाय प्रोग्रामिंग करण्यासाठी किती ब्लॉक्स आवश्यक आहेत.",
          "student_overview": "इमेजेस पूर्ण करण्यासाठी लूप्स आणि पॅटर्न वापरा."
        },
        "coursea-2021/Events: The Big Event": {
          "preparation": "-   **\\*द कंट्रोलर इमेज** प्रॉजेक्ट करण्यासाठी तयार करा.\n-   प्रति विद्यार्थ्यासाठी एक **\\*मूल्यांकन** प्रिंट करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "आज विद्यार्थी घटना आणि कृती यात फरक करायला शिकतील. पेपर रिमोटवर \"बटण\" दाबल्याने विद्यार्थ्यांना क्रियाकलापांमध्ये व्यत्यय आलेला दिसेल. हा कार्यक्रम पाहिल्यावर, वर्ग एक अनोखी कृती करून प्रतिक्रिया देईल. प्रोग्रामिंगमध्ये इव्हेंट्सचा मोठ्या प्रमाणावर वापर केला जातो आणि या धड्यानंतर सहज ओळखता येण्याजोगा असला पाहिजे."
        },
        "coursea-2021/Events in Play Lab": {
          "preparation": "-   तुमच्या वर्गासाठी संभाव्य समस्या क्षेत्रे शोधण्यासाठी कोड्या मधून खेळा.\n-   (पर्यायी) तुमच्या वर्गासोबत गट म्हणून काही कोडी निवडा.\n-   **\\*CSF धड्याच्या शिफारशींचे पुनरावलोकन करा**.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "प्ले लॅबचा वापर करून विद्यार्थी आजच्या घडामोडींबद्दल त्यांची समज विकसित करतील. बहुतेक संगणक प्रोग्राम्समध्ये इव्हेंट्स खूप सामान्य असतात. या गतिविधीमध्ये, विद्यार्थी इव्हेंट्सचा वापर कॅरेक्टर स्क्रीनभोवती फिरण्यासाठी, आवाज काढण्यासाठी आणि वापरकर्त्याने सुरू केलेल्या इव्हेंटच्या आधारावर पार्श्वभूमी बदलण्यासाठी करतील.",
          "student_overview": "आपली स्वतःची गेम किंवा स्टोरी तयार करा."
        },
        "coursea-2021/lesson-1": {
          "preparation": "\\-विद्यार्थ्यांना प्रेरणा देण्यासाठी कलाकारासाठी आधीच स्वतःची कथा लिहा आणि कोड करा!",
          "purpose": "हा धडा विद्यार्थ्यांना त्यांच्या नवीन संगणक विज्ञान कौशल्यांचा सर्जनशीलतेने वापर करण्याची शेवटची संधी देतो.",
          "student_overview": "आर्टीस्ट सोबत एक गोष्ट सांगा!"
        },
        "coursec-2021/Putting a STOP to Online Meanness": {
          "overview": "हा धडा मुळात कॉमन सेन्स एज्युकेशनने तयार केला आहे. [अधिक जाणून घ्या.](https://www.commonsense.org/education/digital-citizenship/curriculum)\n\nइंटरनेट सर्व प्रकारच्या स्वारस्यपूर्ण लोकांनी भरलेले आहे, परंतु काहीवेळा, त्यापैकी काही एकमेकांसाठी वाईट असू शकतात. या भूमिकेसह, तुमच्या विद्यार्थ्यांना हे समजून घेण्यास मदत करा की वैयक्तिकरीत्या ऑनलाइन असण्यापेक्षा ते सहसा सोपे का असते आणि जेव्हा ते पाहतात तेव्हा ते ऑनलाइन असभ्यतेला कसे सामोरे जावे.",
          "preparation": "-   शिक्षण सामग्रीचे पुनरावलोकन करा.\n-   प्रत्येक विद्यार्थ्यासाठी हँडआउट प्रिंट करा.\n-   स्टफ प्राणी किंवा खेळणी वर्गात आणा.",
          "purpose": "कॉमन सेन्स एज्युकेशनने हा धडा विद्यार्थ्यांना नीचपणा (मीननेस) बद्दल आणि त्यांना  ते ऑनलाइन आढळल्यास त्यांनी काय करावे हे शिकवण्यासाठी तयार केला आहे."
        },
        "coursec-2021/Programming: My Robotic Friends": {
          "preparation": "-   2-3 विद्यार्थ्यांच्या प्रत्येक गटासाठी 20 पेपर कप (किंवा पेपर ट्रॅपेझॉइड्स) चे स्टॅक तयार करा.\n-   **\\*सिम्बॉल की** मधील चिन्हे प्रदर्शित करा जिथे विद्यार्थी संपूर्ण धड्यात संदर्भ देऊ शकतात.\n-   (पर्यायी) 2-3 विद्यार्थ्यांच्या प्रत्येक गटात एक **\\*कप स्टॅकिंग कल्पना** प्रिंट करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा अनप्लग्ड धडा वर्गाला एक कार्यसंघ म्हणून एकत्र आणतो आणि पूर्ण करण्यासाठी एक सोपा कार्य करतो: विशिष्ट डिझाइनमध्ये कप स्टॅक करण्यासाठी \"रोबोट\" मिळवा. हा क्रियाकलाप प्रोग्रामिंगचा पाया घालतो जे विद्यार्थी संपूर्ण अभ्यासक्रमात करतील कारण ते स्पष्टपणे संप्रेषित अल्गोरिदम परिभाषित करण्याचे महत्त्व शिकतात."
        },
        "coursec-2021/Programming in Maze": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   (पर्यायी) तुमच्या वर्गासह एक गट म्हणून काही कोडी निवडा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा",
          "purpose": "या धड्यात, विद्यार्थी संगणक प्लॅटफॉर्मवर प्रोग्रामिंग आणि डीबगिंग कौशल्ये विकसित करतील. या कोड्याचे  ब्लॉक-आधारित स्वरूप विद्यार्थ्यांना वाक्यरचना परिपूर्ण  न करता, अनुक्रम आणि संकल्पना जाणून घेण्यास मदत करते.",
          "student_overview": "_अँग्री बर्ड्स_ सह अनुक्रम आणि अल्गोरिदम बद्दल जाणून घ्या."
        },
        "coursec-2021/Debugging in Maze": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडी मधून खेळा.\n-   (पर्यायी) तुमच्या वर्गासोबत गट म्हणून काही कोडी निवडा.\n-   पुनरावलोकन करा **\\*CS मूलभूत मुख्य क्रियाकलाप टिपा - धड्याच्या शिफारशी**.\n-   वर्गासह या  अभ्यासक्रमाच्या ओव्हरव्ह्यू पेज  वरून **\\*डीबगिंग मार्गदर्शक** चे पुनरावलोकन करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "डीबगिंगच्या सारामुळे तुमच्या वर्गातील विद्यार्थी कदाचित या धड्यामुळे निराश होऊ शकतात. डीबगिंग ही एक संकल्पना आहे जी कॉम्प्युटर प्रोग्रामिंगसाठी खूप महत्वाची आहे. संगणक शास्त्रज्ञांना त्यांच्या स्वतःच्या प्रोग्राममधील बग्सचा सामना करण्यासाठी खरोखर चांगले बनले पाहिजे. डीबगिंग विद्यार्थ्यांना गंभीर विचार आणि समस्या सोडवण्याची कौशल्ये विकसित करताना समस्या ओळखण्यास आणि त्यावर मात करण्यास भाग पाडते."
        },
        "coursec-2021/Programming in Collector": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, लॉरेल द अॅडव्हेंचरर या नवीन पात्राचा वापर करून विद्यार्थी त्यांच्या प्रोग्रामिंग कौशल्याचा सराव करतील. जेव्हा एखादी व्यक्ती प्रोग्रामिंग सुरू करते तेव्हा ते मशीन वाचू शकणारे काहीतरी वापरून विशिष्ट क्रमाने सूचना एकत्र करतात. प्रोग्रामिंगच्या वापराद्वारे, संगणक सूचना आणि क्रम कसे नेव्हिगेट करतो हे विद्यार्थ्यांना समजेल. वेगळ्या कोडे उद्देशाने नवीन वर्ण वापरणे विद्यार्थ्यांना प्रोग्रामिंगमधील अनुक्रम आणि अल्गोरिदमसह त्यांच्या अनुभवाची व्याप्ती वाढवण्यास मदत करेल."
        },
        "coursec-2021/Programming in Artist": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडे खेळा.\n-   (पर्यायी) कोडे पूर्ण करण्यासाठी वापरत असलेल्या कोनांची कल्पना करण्यासाठी तुमच्या वर्गासाठी प्रॉटेक्टर्स मिळवा.\n-   प्रत्येक विद्यार्थ्यासाठी एक **_\\\\_विद्यार्थी हँडआउट** प्रिंट करा.",
          "purpose": "विद्यार्थ्‍यांच्‍या मागच्‍या अनुभवाच्‍या अनुकरणातून, हा धडा कोडिंगसह अधिक सर्जनशीलतेला प्रेरित करण्‍यासाठी कार्य करेल. या धड्याचा उद्देश नवीन ब्लॉक्स आणि उद्दिष्टे सादर करून सिक्वेन्सिंगचे ज्ञान मजबूत करणे हा आहे. या प्रकरणात, विद्यार्थी नवीन ब्लॉक्स वापरून पिक्सेल आणि कोन बद्दल अधिक जाणून घेतात, तरीही त्यांच्या अनुक्रम कौशल्याचा सराव करतात. तसेच, विद्यार्थी वर्ग काढण्यासाठी कलाकाराला कोडींग करण्यासारख्या नवीन उद्दिष्टांची कल्पना करू शकतील.",
          "student_overview": "आर्टीस्टचे प्रोग्रॅमिंग करून सुंदर प्रतिमा तयार करणे"
        },
        "coursec-2021/Loops: My Loopy Robotic Friends": {
          "preparation": "-   प्रत्येक विद्यार्थ्याकडे जर्नल असल्याची खात्री करा.\n-   4 विद्यार्थ्यांच्या प्रत्येक गटासाठी 20 पेपर कप (किंवा **\\*पेपर ट्रॅपेझॉइड्स**) चे स्टॅक तयार करा.\n-   **\\*चिन्ह** प्रदर्शित करा जेथे विद्यार्थी संपूर्ण धड्यात संदर्भ देऊ शकतात.\n-   (पर्यायी) प्रत्येक 4 विद्यार्थ्यांच्या गटासाठी एक **\\*कप स्टॅकिंग कल्पना** प्रिंट करा.",
          "purpose": "हा धडा \"रोबोट\" प्रोग्रामिंग सूचनांचा आता परिचित संच वापरून, लूपचा पुन्हा परिचय म्हणून कार्य करतो. वर्गमित्रांच्या हालचालींमधील पुनरावृत्तीचे नमुने शोधून आणि लूप वापरून पुनरावृत्तीचे नमुने कसे सोपे करायचे हे ठरवून विद्यार्थी गंभीर विचार कौशल्ये विकसित करतील."
        },
        "coursec-2021/Loops with Rey and BB-8": {
          "preparation": "-   तुमच्या वर्गासाठी काही समस्या असतील की नाही हे ठरवण्यासाठी कोडे खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, विद्यार्थी लूप आणि त्यांना ब्लॉकली कोडमध्ये कसे अंमलात आणायचे याबद्दल शिकणार आहेत. लूप वापरणे हे प्रोग्रामिंगमधील एक महत्त्वाचे कौशल्य आहे कारण मॅन्युअली कमांडची पुनरावृत्ती करणे कंटाळवाणे आणि अकार्यक्षम असते. Code.org कोडी सह, विद्यार्थी विद्यमान लूपमध्ये सूचना जोडण्यास शिकतील, लूपमध्ये पुनरावृत्ती केलेले कोड एकत्र करतील आणि लूप करणे आवश्यक असलेले नमुने ओळखतील. हे लक्षात घेतले पाहिजे की विद्यार्थ्यांना अनेक वेगवेगळ्या उपायांसह कोडे पडतील. हे प्रत्येक पद्धतीचे फायदे आणि तोटे असलेली कोडी सोडवण्याच्या विविध मार्गांवर चर्चा  सुरु होईल.",
          "student_overview": "लुप्स वापरून मेझेस द्वारे _BB-8_ ला मदत करा!"
        },
        "coursec-2021/Loops in Harvester": {
          "purpose": "या धड्यामध्ये, भोपळे काढणी सारख्या क्रियांची पुनरावृत्ती करण्यासाठी विद्यार्थी लूप वापरतील. नवीन नमुने तयार होतील आणि विद्यार्थी सर्जनशीलता आणि तार्किक विचारांचा वापर करून कोणता कोड आणि किती वेळा पुनरावृत्ती करणे आवश्यक आहे हे ठरवतील."
        },
        "coursec-2021/Sticker Art with Loops": {
          "overview": "हा **मिनी-प्रोजेक्ट** धडा मागील धड्यांमधून लूप समजून घेण्यावर आधारित आहे. विद्यार्थी कलाकारासोबत अनोखी कलाकृती तयार करतील.",
          "preparation": "-   आपले स्वतःचे डिझाइन बनविण्याचा सराव करा. हे लेव्हल्स आधीच्या सर्व गोष्टींपेक्षा कसे वेगळे आहेत याची नोंद घ्या.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "ही मालिका क्रिएटिव्ह आणि वैयक्तिक डिझाईन्ससह लूपची ताकद हायलाइट करते.\n\nप्रकल्प-समर्थित अनुक्रम म्हणून ऑफर केलेली, ही प्रगती विद्यार्थ्यांना त्यांच्या स्वतःच्या कामाच्या शिखरावर तयार करण्यास आणि आश्चर्यकारक कलाकृती तयार करण्यास अनुमती देईल."
        },
        "coursec-2021/Events: The Big Event": {
          "preparation": "-   **\\*इव्हेंट कंट्रोलर** प्रिंट करा किंवा प्रदर्शित करा.\n-   प्रत्येक विद्यार्थ्यासाठी एक **\\*मूल्यांकन** छापा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "आज विद्यार्थी घटना आणि कृती यात फरक करायला शिकतील. पेपर रिमोटवर \"बटण\" दाबल्याने विद्यार्थ्यांना क्रियाकलापांमध्ये व्यत्यय आलेला दिसेल. हा कार्यक्रम पाहिल्यावर, वर्ग एक अनोखी कृती करून प्रतिक्रिया देईल. प्रोग्रामिंगमध्ये इव्हेंट्सचा मोठ्या प्रमाणावर वापर केला जातो आणि या धड्यानंतर सहज ओळखता येण्याजोगा असला पाहिजे.",
          "student_overview": "इव्हेंटबद्दल जाणून घेण्यासाठी एक मजेदार गेम खेळा."
        },
        "coursec-2021/Build a Flappy Game": {
          "purpose": "कॉम्प्युटर प्रोग्राममध्ये इव्हेंट्स खूप सामान्य आहेत. या धड्यामध्ये , विद्यार्थी एक _फ्लॅपी बर्ड_ गेम बनवून इव्हेंट बद्दलची त्यांची समज विकसित करतील. विद्यार्थी त्यांचे पात्र स्क्रीनवर हलवायला शिकतील, आवाज काढतील आणि वापरकर्त्याने सुरू केलेल्या घटनांवर आधारित अडथळ्यांवर प्रतिक्रिया देतील."
        },
        "coursec-2021/Events in Play Lab": {
          "purpose": "येथे, विद्यार्थी प्ले लॅबचा वापर करून इव्हेंटबद्दल त्यांची समज विकसित करतील. अक्षरे स्क्रीनभोवती फिरण्यासाठी, आवाज काढण्यासाठी आणि वापरकर्त्याच्या इनपुटच्या आधारे पार्श्वभूमी बदलण्यासाठी विद्यार्थी इव्हेंट्स वापरतील. कोडे  क्रमाच्या शेवटी, विद्यार्थ्यांना त्यांचे  प्रोजेक्ट  शेअर करण्याची संधी दिली जाईल.",
          "student_overview": "सर्जनशील व्हा आणि प्ले लॅबमध्ये गेम बनवा!"
        },
        "coursec-2021/Picturing Data": {
          "preparation": "-   प्रत्येक विद्यार्थ्यासाठी एक **_\\\\_वर्कशीट** प्रिंट करा.\n-   कोड स्टुडिओवरील आजचा धडा वापरून पहा. हे आजच्या क्रियाकलापांसाठी एक साधन म्हणून वापरायचे आहे. ते वर्गासमोर प्रक्षेपित करण्यासाठी तयार रहा किंवा अन्यथा विद्यार्थ्यांना त्यांच्या स्वत:च्या संगणकावर ते भेट देण्याची परवानगी द्या.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "डेटावर प्रक्रिया करण्यात मदत करण्यासाठी संगणक तयार करण्यात आले. जगात डेटाचे प्रमाण वाढत आहे, त्यामुळे त्याचे वाचन आणि विश्लेषण करण्यात सक्षम असणे महत्त्वाचे आहे. विद्यार्थ्यांना डेटाचा एक साधा संच गोळा करण्याचा, व्हिज्युअलायझेशन करण्याचा आणि विश्लेषण करण्याचा मूलभूत अनुभव असल्याची खात्री करण्यासाठी हा धडा येथे आहे."
        },
        "coursec-2021/Binary Bracelets": {
          "preparation": "-   (पर्यायी) **\\*लेसन इन अॅक्शन** व्हिडिओ पहा.\n-   ब्रेसलेटसाठी मार्कर गोळा करा. इतर सजावट जसे की मणी आणि पाईप क्लीनर वैकल्पिक आहेत.\n-   प्रति विद्यार्थ्यामागे एक **\\*वर्कशीट** आणि एक **\\*मूल्यांकन** प्रिंट करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.\n-   (पर्यायी) बायनरीमध्ये बोर्डवर एक छोटा संदेश लिहा.",
          "purpose": "या धड्यामध्ये विद्यार्थी शिकतील की माहिती अशा प्रकारे कशी दर्शवली जाते की संगणक त्याचा अर्थ लावू शकेल आणि संग्रहित करू शकेल. बायनरी शिकत असताना, विद्यार्थ्यांना कोड लिहिण्याची आणि त्यांना गुप्त संदेश म्हणून समवयस्कांसोबत शेअर करण्याची संधी मिळेल. हे नंतर संगणक प्रोग्राम कसे वाचतात, बायनरीमध्ये कसे भाषांतरित करतात, माहितीचा काही प्रकारे वापर करतात, नंतर मानवांना समजू शकतील अशा प्रकारे परत प्रत्युत्तर दिले जाऊ शकते. उदाहरणार्थ, जेव्हा आपण दस्तऐवजात एखादे वाक्य टाइप करतो तेव्हा सेव्ह दाबा, संगणक वाक्याचे बायनरीमध्ये भाषांतर करतो, माहिती संग्रहित करतो, त्यानंतर दस्तऐवज सेव्ह झाला आहे असे दर्शवणारा संदेश पोस्ट करतो."
        },
        "coursec-2021/End of Course Project: Create a Play Lab Game": {
          "preparation": "-   तुमच्या वर्गासाठी संभाव्य समस्या क्षेत्रे शोधण्यासाठी कोडी मधून खेळा.\n-   प्रत्येक विद्यार्थ्यासाठी (किंवा जोडी) एक **\\*प्रोजेक्ट प्लॅनिंग गाइड** प्रिंट करा.\n-   **\\*प्रोजेक्ट प्लॅनिंग गाइड (उदाहरणार्थ)** दस्तऐवजाचे पुनरावलोकन करा.\n-   (पर्यायी) तुमचे स्वतःचे नियोजन मार्गदर्शक पूर्ण करा आणि विद्यार्थ्यांना दाखवण्यासाठी तुमचा स्वतःचा प्रोजेक्ट\\\n    कोड  द्या!",
          "purpose": "हा धडा विद्यार्थ्यांना त्यांच्या स्वतःच्या डिझाईनचा प्रोजेक्ट  तयार करण्यासाठी जागा प्रदान करतो, चरण-दर-चरण प्रक्रिया वापरून ज्यासाठी नियोजन आवश्यक आहे परंतु व्यापक सर्जनशीलतेसाठी देखील परवानगी देते."
        },
        "coursed-2021/lesson-5": {
          "overview": "![](https://curriculum.code.org/static/img/common_sense_education.png)\n\nहा धडा मूळतः [कॉमन सेन्स एज्युकेशन] [2] द्वारे तयार केला गेला.\n\nमजबूत, अधिक सुरक्षित ऑनलाइन पासवर्ड ही प्रत्येकासाठी चांगली कल्पना आहे. पण आपण मुलांना चांगले पासवर्ड तयार करण्यात आणि ते लक्षात ठेवण्यास मदत कशी करू शकतो? मुलांना सुरक्षित आणि संस्मरणीय अशा दोन्ही प्रकारचे पासवर्ड बनवण्यात मदत करण्यासाठी या धड्यातील टिपांचा वापर करा.",
          "preparation": "-   शिक्षण सामग्रीचे पुनरावलोकन करा.\n-   प्रत्येक विद्यार्थ्यासाठी हँडआउट प्रिंट करा.\n-   विद्यार्थ्यांसाठी लेखन पेपर किंवा नोटबुक तयार करा.",
          "purpose": "कॉमन सेन्स एज्युकेशनने हा धडा विद्यार्थ्यांना शिकवण्यासाठी तयार केला आहे की सशक्त पासवर्ड त्यांच्या गोपनीयतेचे रक्षण करण्यास कसे मदत करू शकतात."
        },
        "coursed-2021/Algorithms: Graph Paper Programming": {
          "preparation": "-   (पर्यायी) **\\*लेसन इन अॅक्शन** व्हिडिओ पहा.\n-   प्रत्येक विद्यार्थ्यासाठी एक **\\*वर्कशीट** आणि **\\*मूल्यांकन** प्रिंट करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "संपूर्ण कोर्समध्ये वापरल्या जाणार्‍या काही मूलभूत प्रोग्रामिंग संकल्पनांचा परिचय करून देतानाच या उपक्रमाचे उद्दिष्ट गंभीर विचार कौशल्ये आणि अभ्यासक्रमासाठी उत्साह निर्माण करणे हे आहे. अनप्लग्ड अ‍ॅक्टिव्हिटीमध्ये वर्गात अनुक्रम आणि अल्गोरिदम यांसारख्या मूलभूत संकल्पनांचा परिचय करून देऊन, ज्या विद्यार्थ्यांना संगणकाची भीती वाटते ते या विषयांवर समजून घेण्याचा पाया तयार करू शकतात. या धड्यात, विद्यार्थी अल्गोरिदम कसा विकसित करायचा आणि तो प्रोग्राममध्ये एन्कोड कसा करायचा हे शिकतील.",
          "student_overview": "या धड्यामध्ये, तुम्ही तुमच्या वर्गमित्रांना चित्र काढण्यासाठी प्रोग्राम कराल!"
        },
        "coursed-2021/Introduction to Online Puzzles": {
          "purpose": "आम्ही ओळखतो की प्रत्येक वर्गामध्ये प्रत्येक विषयाला समजून घेण्याचा एक स्पेक्ट्रम असतो. तुमच्या वर्गातील काही विद्यार्थी कॉम्प्युटर विझार्ड असू शकतात, तर इतरांना फारसा अनुभव नाही. समान खेळण्याचे (आणि शिकण्याचे) क्षेत्र तयार करण्यासाठी, आम्ही हा \"रॅम्प अप स्टेज\" कोर्स D साठी विकसित केला आहे. Code.org आणि मूलभूत संगणक विज्ञान संकल्पनांचा वापर कसा करायचा याचे परिचय किंवा पुनरावलोकन म्हणून याचा वापर केला जाऊ शकतो. या टप्प्यात डी कोर्स सुरू करण्यासाठी आवश्यक असलेल्या सर्व  गोष्टींचा समावेश आहे."
        },
        "coursed-2021/Relay Programming": {
          "preparation": "-   **\\*शिक्षक व्हिडिओ** पहा.\n-   या क्रियाकलापासाठी विस्तृत मोकळी जागा शोधा, जसे की व्यायामशाळा किंवा मैदानी मैदान.\n-   प्रत्येक गटासाठी एक **\\*अॅक्टिव्हिटी पॅकेट** प्रिंट करा.\n-   प्रत्येक गटाला भरपूर कागद आणि पेन/पेन्सिल द्या.\n-   प्रत्येक विद्यार्थ्यासाठी एक **\\*वर्कशीट** प्रिंट करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "कॉम्प्युटर सायन्समध्ये टीमवर्कला खूप महत्त्व आहे. प्रत्येक जन  व्यक्ती म्हणून काम करण्याऐवजी टीम म्हणून एकमेकांसोबत कोड लिहितात आणि डीबग करतात. या धड्यात, विद्यार्थी शक्य तितके कार्यक्षम राहून एकत्रितपणे काम करायला शिकतील.\n\nही क्रिया निकडीची भावना देखील प्रदान करते जी विद्यार्थ्यांना त्यांच्या वेळेचा काळजीपूर्वक संतुलन राखण्यास आणि जास्त मागे न पडता चुका टाळण्यास शिकवेल. हा अनुभव तणावपूर्ण असू शकतो (जे अपेक्षित आहे!) संभाव्य निराशेला सामोरे जाण्यासाठी आपण विद्यार्थ्यांना साधने प्रदान करत असल्याचे सुनिश्चित करा."
        },
        "coursed-2021/Debugging in Collector": {
          "purpose": "या धड्याचा उद्देश विद्यार्थ्यांना हे शिकवणे आहे की नवीन कौशल्य शिकताना अपयश सामान्य आहे. विद्यार्थ्यांना पूर्व-लेखित कार्यक्रम दिले जातील जे काम करत नाहीत. त्यांना या कार्यक्रमांचे निराकरण करण्यास सांगितले जाईल. डीबगिंग नावाची ही प्रक्रिया विद्यार्थ्यांना आवश्यक समस्या सोडवणे आणि गंभीर विचार कौशल्ये शिकवते. विद्यार्थी कठीण आणि कठीण प्रोग्रॅमिंग  प्रोजेक्ट  मध्ये पुढे जात असताना ही कौशल्ये हस्तांतरित होतात."
        },
        "coursed-2021/Events in Bounce": {
          "preparation": "-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.\n-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   **\\*स्लाइड डेक** वाचा (वर्गाच्या शेवटी विद्यार्थ्यांना सादर केले जाईल).",
          "purpose": "कॉम्प्युटर प्रोग्राम्समध्ये, विशेषत: व्हिडिओ गेम्समध्ये इव्हेंट्स खूप सामान्य आहेत.\n\nया धड्यात, विद्यार्थी खेळावर आधारित खेळ बनवून घटनांबद्दलची त्यांची समज विकसित करतील. विद्यार्थी  ॲरो कीज  नुसार त्यांचे पेडल हलवायला शिकतील आणि जेव्हा वस्तू आदळतील तेव्हा आवाज काढतील. अगदी शेवटी, त्यांना त्यांचा गेम अधिक अनोखा बनवण्यासाठी  कस्टमाइस्ड  करायचा आहे!"
        },
        "coursed-2021/Build a Star Wars Game": {
          "preparation": "-   कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "CS फंडामेंटल्स हे केवळ संगणक विज्ञान शिकवण्याबद्दल नाही तर ते संगणक विज्ञान मजेदार आणि रोमांचक बनवण्याबद्दल आहे. या मालिकेत, विद्यार्थी _Star Wars_ मधील लोकप्रिय पात्रांचा वापर करून घटनांबद्दल जाणून घेतील. ही कोडी \"शिकणे\" आणि \"मजा\" मधील रेषा अस्पष्ट करतात. तसेच, विद्यार्थी गेममधील नियमित प्रोग्रामिंग पद्धती ओळखण्यास शिकतील जेणेकरुन जेव्हा ते घरी गेम खेळतात तेव्हा त्यांना संगणक विज्ञानाची सामान्य तत्त्वे वापरली जात असल्याचे दिसून येईल.",
          "student_overview": "या धड्यामध्ये तुम्ही तुमचा स्वतःचा स्टार वॉर्स गेम तयार करता ती शक्ती जाणवा"
        },
        "coursed-2021/Dance Party": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडे खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.\n-   हेडफोनची गरज लक्षात घ्या. हा उपक्रम आवाजावर अवलंबून असतो."
        },
        "coursed-2021/Loops in Ice Age": {
          "preparation": "-   (पर्यायी) गट म्हणून तुमच्या वर्गासाठी काही कोडी निवडा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, विद्यार्थी लूप आणि त्यांना ब्लॉकली कोडमध्ये कसे अंमलात आणायचे याबद्दल अधिक जाणून घेतील. लूप वापरणे हे प्रोग्रामिंगमधील एक महत्त्वाचे कौशल्य आहे कारण मॅन्युअली कमांडची पुनरावृत्ती करणे कंटाळवाणे आणि अकार्यक्षम असते. या Code.org कोडीसह, विद्यार्थी विद्यमान लूपमध्ये सूचना जोडण्यास शिकतील, लूपमध्ये पुनरावृत्ती केलेले कोड गोळा करतील आणि पुनरावृत्ती करणे आवश्यक असलेले नमुने ओळखतील."
        },
        "coursed-2021/Loops in Artist": {
          "purpose": "ही शृंखला लूपची शक्ती अधोरेखित करते ज्यायोगे विद्यार्थ्यांना `पुनरावृत्ती` लूप लाँगहँडपेक्षा श्रेष्ठ का आहेत याचा विचार करायचा असतो."
        },
        "coursed-2021/Nested Loops in Bee": {
          "purpose": "नेस्टेड लूपच्या या परिचयात, विद्यार्थी त्यांच्या कम्फर्ट झोनच्या बाहेर जाऊन कोडी सोडवण्यासाठी अधिक प्रभावी उपाय तयार करतील.\n\nपूर्वीच्या कोडींमध्ये, लूपने विद्यार्थ्यांना पुनरावृत्ती ओळखण्यास प्रवृत्त केले. येथे, विद्यार्थी हे नेस्टेड लूप विकसित करण्यासाठी _windin_ पुनरावृत्ती केलेले नमुने ओळखण्यास शिकतील. हा टप्पा विद्यार्थ्यांना कोडे चीड आणणारे आणि अति  गुंतागुंतीचे कोडे सोडवण्याचा प्रयत्न करण्यासाठी प्रोत्साहन देऊन सुरू होतो. व्हिडिओ नेस्टेड लूपची ओळख करून दिल्यानंतर, विद्यार्थ्यांना एक उदाहरण दाखवले जाते आणि लूप दुसर्‍या लूपच्या आत टाकल्यावर काय होईल याचा अंदाज वर्तवण्यास सांगितले जाते. या प्रगतीमुळे विद्यार्थ्यांना प्रोग्रॅमिंगमधील लूपिंगबद्दलची त्यांची समज दृढ करण्यासाठी आणि तयार करण्यासाठी भरपूर सराव होतो."
        },
        "coursed-2021/Conditionals with Cards": {
          "overview": "या **संदर्भ-सेटिंग** धड्यामध्ये, साध्या कार्ड गेमचे नियम सांगण्यासाठी विद्यार्थी _कंडिशनल (जर/अन्य) विधाने_ लिहतील.",
          "preparation": "-   पत्त्यांचे डेक किंवा तत्सम काहीतरी गोळा करा.\n-   **\\*नमुना प्रोग्राम** प्रिंट किंवा प्रदर्शित करा.\n-   प्रत्येक विद्यार्थ्यासाठी एक **\\*मूल्यांकन** छापा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "अध्यापनाच्या कंडीशनल्सपैकी एक उत्तम भाग म्हणजे विद्यार्थ्यांना त्यांच्या दैनंदिन जीवनातून संकल्पना आधीच समजणे.\n\nहा धडा संगणक विज्ञानाला खऱ्या जगात विलीन करतो आणि एखादी कंडीशन खरी आहे की खोटी आहे हे सांगण्याची त्यांची क्षमता निर्माण करतो. एखादी विशिष्ट कमांड केव्हा चालवावी हे घोषित करण्यासाठी इफ स्टेटमेंट, तसेच कमांड केव्हा चालवावी आणि अन्यथा काय चालवावी हे घोषित करण्यासाठी इफ/एल्स्  स्टटेमेंट्स वापरण्यास विद्यार्थी शिकतील. विद्यार्थी सशर्त शब्द ओळखू शकत नाहीत, परंतु बहुतेक विद्यार्थ्यांना \"जर\" वापरण्याची कल्पना समजेल की काही क्रिया केवळ तेव्हाच घडते जेव्हा ती अपेक्षित असते."
        },
        "coursed-2021/lesson-6": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्रे शोधण्यासाठी या धड्याशी संबंधित कोडे खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "कोड्यांचा हा संच लूपचे ज्ञान घट्ट करण्यासाठी आणि तयार करण्यासाठी आणि   कंडीशनल  सादर करण्यासाठी कार्य करेल. या दोन संकल्पनांना एकत्र जोडून, विद्यार्थी नवीन आणि उत्साहवर्धक वातावरणात मजेदार आणि नाविन्यपूर्ण कार्यक्रम तयार करण्याच्या क्षमतेचा शोध घेण्यास सक्षम असतील."
        },
        "coursed-2021/Conditionals in Bee": {
          "purpose": "\"कार्डांसह कंडीशनल्स\" मधील कंडीशनल्सशी ओळख करून दिल्यानंतर, विद्यार्थी त्यांच्या प्रोग्राम मध्ये  कंडीशनल्स चा वापर  करून सराव करतील. if / else ब्लॉक्स अधिक लवचिक प्रोग्रामसाठी अनुमती देतात.  जर फुल असेल\\_ मधमाशी फक्त पराग कण गोळा करेल किंवा जर मधाचा पोळा असेल\\_मध तयार करेल."
        },
        "coursed-2021/While Loops in Farmer": {
          "purpose": "जसे तुमचे विद्यार्थी त्यांचे लूपचे ज्ञान वाढवत राहतील, त्यांना अशा समस्या येतील जेथे कमांडची पुनरावृत्ती करणे आवश्यक आहे, परंतु ते किती वेळा पुनरावृत्ती करणे आवश्यक आहे हे माहित नाही. येथेच लूप येतात. आजच्या धड्यात, विद्यार्थी कंडिशन-आधारित लूपची नवशिक्याची समज विकसित करतील आणि सामान्यतः लूपबद्दलचे त्यांचे ज्ञान वाढवतील."
        },
        "coursed-2021/Until Loops in Maze": {
          "purpose": "कोड्यांचा हा संच `अंटील` कंडिशनल जोडून लूपचे ज्ञान दृढ करण्यासाठी आणि तयार करण्यासाठी कार्य करेल. या संकल्पनांना एकत्र जोडून, विद्यार्थी जटिल आणि नाविन्यपूर्ण कार्यक्रम तयार करण्याच्या क्षमतेचा शोध घेण्यास सक्षम असतील."
        },
        "coursed-2021/End of Course Project": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडे खेळा.\n-   प्रत्येक विद्यार्थ्यासाठी (किंवा जोडी) एक **\\*प्रोजेक्ट प्लॅनिंग गाइड** प्रिंट करा.\n-   (पर्यायी) तुमचे स्वतःचे प्रोजेक्ट प्लॅनिंग गाइड पूर्ण करा आणि विद्यार्थ्यांना दाखवण्यासाठी तुमचा स्वतःचा  प्रोजेक्ट\\\n    कोड करा!",
          "purpose": "हा धडा विद्यार्थ्यांना त्यांच्या स्वतःच्या डिझाईनचा प्रोजेक्ट  तयार करण्यासाठी जागा प्रदान करतो, चरण-दर-चरण प्रक्रिया वापरून ज्यासाठी नियोजन आवश्यक आहे परंतु व्यापक सर्जनशीलतेसाठी देखील परवानगी देते."
        },
        "express-2021/Programming with Angry Birds": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   (पर्यायी) तुमच्या वर्गासह एक गट म्हणून काही कोडी निवडा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा",
          "purpose": "या धड्यात, विद्यार्थी संगणक प्लॅटफॉर्मवर प्रोग्रामिंग कौशल्ये विकसित करतील. या कोड्याचे  ब्लॉक-आधारित स्वरूप विद्यार्थ्यांना वाक्यरचना परिपूर्ण  न करता, अनुक्रम आणि संकल्पना जाणून घेण्यास मदत करते.",
          "student_overview": "_अँग्री बर्ड्स_ सह अनुक्रम आणि अल्गोरिदम बद्दल जाणून घ्या."
        },
        "express-2021/Debugging with Scrat": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी धड्यातून खेळा.\n-   (पर्यायी) तुमच्या वर्गासोबत गट म्हणून काही कोडी निवडा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "डीबगिंगच्या सारामुळे तुमच्या वर्गातील विद्यार्थी कदाचित या धड्यामुळे निराश होऊ शकतात. डीबगिंग ही एक संकल्पना आहे जी कॉम्प्युटर प्रोग्रामिंगसाठी खूप महत्वाची आहे. संगणक शास्त्रज्ञांना त्यांच्या स्वतःच्या प्रोग्राममधील बग्सचा सामना करण्यासाठी खरोखर चांगले बनले पाहिजे. डीबगिंग विद्यार्थ्यांना गंभीर विचार आणि समस्या सोडवण्याची कौशल्ये विकसित करताना समस्या ओळखण्यास आणि त्यावर मात करण्यास भाग पाडते."
        },
        "express-2021/Collecting Treasure with Laurel": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, _लॉरेल द अॅडव्हेंचरर_ या नवीन पात्राचा वापर करून विद्यार्थी त्यांच्या प्रोग्रामिंग कौशल्याचा सराव करतील. जेव्हा एखादी व्यक्ती प्रोग्रामिंग सुरू करते तेव्हा ते मशीन वाचू शकणारे काहीतरी वापरून विशिष्ट क्रमाने सूचना एकत्र करतात. प्रोग्रामिंगच्या वापराद्वारे, संगणक सूचना आणि क्रम कसे नेव्हिगेट करतो हे विद्यार्थ्यांना समजेल. वेगळ्या कोडे उद्देशाने नवीन वर्ण वापरणे विद्यार्थ्यांना प्रोग्रामिंगमधील अनुक्रम आणि अल्गोरिदमसह त्यांच्या अनुभवाची व्याप्ती वाढवण्यास मदत करेल.",
          "student_overview": "_लॉरेल द अॅडव्हेंचरर_ला  रत्ने गोळा करण्यात मदत करण्यासाठी अल्गोरिदम लिहा!"
        },
        "express-2021/Creating Art with Code": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडे खेळा.\n-   (पर्यायी) कोडे पूर्ण करण्यासाठी वापरत असलेल्या कोनांची कल्पना करण्यासाठी तुमच्या वर्गासाठी प्रॉटेक्टर्स मिळवा.\n-   प्रत्येक विद्यार्थ्यासाठी एक **_\\\\_विद्यार्थी हँडआउट** प्रिंट करा.",
          "purpose": "विद्यार्थ्‍यांच्‍या मागच्‍या अनुभवाच्‍या अनुकरणातून, हा धडा कोडिंगसह अधिक सर्जनशीलतेला प्रेरित करण्‍यासाठी कार्य करेल. या धड्याचा उद्देश नवीन ब्लॉक्स आणि उद्दिष्टे सादर करून सिक्वेन्सिंगचे ज्ञान मजबूत करणे हा आहे. या प्रकरणात, विद्यार्थी नवीन ब्लॉक्स वापरून पिक्सेल आणि कोन बद्दल अधिक जाणून घेतात, तरीही त्यांच्या अनुक्रम कौशल्याचा सराव करतात. तसेच, विद्यार्थी वर्ग काढण्यासाठी कलाकाराला कोडींग करण्यासारख्या नवीन उद्दिष्टांची कल्पना करू शकतील.",
          "student_overview": "आर्टीस्टचे प्रोग्रॅमिंग करून सुंदर प्रतिमा तयार करणे"
        },
        "express-2021/Swimming Fish in Sprite Lab": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा विद्यार्थ्यांना स्प्राईट लॅबच्या मूळ शब्दसंग्रहाची ओळख करून देण्यासाठी आणि त्यांना इतर वातावरणात शिकलेल्या संकल्पना या साधनामध्ये लागू करण्याची अनुमती देण्यासाठी डिझाइन केलेले आहे. फिश टँक तयार करून, विद्यार्थी या टूलच्या प्रोग्रॅमिंग मॉडेलची समज तयार करतील आणि ते स्वतःला अभिव्यक्त करण्यासाठी ते वापरू शकतील अशा मार्गांचा शोध घेतील.",
          "student_overview": "स्प्राइट कसे तयार करावे आणि संपादित करावे ते जाणून घ्या."
        },
        "express-2021/lesson-2": {
          "preparation": "लेव्हल्स द्वारे खेळा आणि \\***\\* धड्याच्या स्लाइड्सचे पुनरावलोकन करा**.",
          "purpose": "हा धडा विद्यार्थ्यांना स्प्राईट लॅबमधील प्रोग्रामिंगची ओळख करून देण्यासाठी तयार केला आहे. विद्यार्थी या साधनाचे प्रोग्रामिंग मॉडेल समजून घेण्यास सुरुवात करतील आणि ते स्वतःला अभिव्यक्त करण्यासाठी ते कसे वापरू शकतात ते शोधतील."
        },
        "express-2021/lesson-3": {
          "preparation": "लेव्हल नुसार खेळा आणि लेसन स्लाइडचे पुनरावलोकन करा.",
          "purpose": "हा धडा विद्यार्थ्यांना इव्हेंटसह प्रोग्रामिंगची ओळख करून देण्यासाठी डिझाइन केला आहे. या संपूर्ण अभ्यासक्रमादरम्यान, विद्यार्थ्यांचे कार्यक्रम कालांतराने किंवा वापरकर्त्याच्या प्रतिसादात कसे चालतात हे बदलण्याचा प्राथमिक मार्ग इव्हेंट असेल."
        },
        "express-2021/Virtual Pet with Sprite Lab": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा विद्यार्थ्यांना इतर सर्जनशील संदर्भात आधीच्या धड्यांमधून प्रोग्रामिंग संकल्पना लागू करू देतो."
        },
        "express-2021/lesson-1": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडे खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.\n-   हेडफोनची गरज लक्षात घ्या. हा उपक्रम आवाजावर अवलंबून असतो."
        },
        "express-2021/Loops with Rey and BB-8": {
          "overview": "या **कौशल्य-निर्मिती** धड्यामध्ये विद्यार्थी _स्टार वॉर्स_ पात्रांना _BB-8_ कार्यक्षमतेने मेझ पार करण्यास मदत करण्यासाठी लूप वापरतात.",
          "preparation": "-   तुमच्या वर्गासाठी काही समस्या असतील की नाही हे ठरवण्यासाठी कोडे खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, विद्यार्थी लूप आणि त्यांना ब्लॉकली कोडमध्ये कसे अंमलात आणायचे याबद्दल शिकणार आहेत. लूप वापरणे हे प्रोग्रामिंगमधील एक महत्त्वाचे कौशल्य आहे कारण मॅन्युअली कमांडची पुनरावृत्ती करणे कंटाळवाणे आणि अकार्यक्षम असते. Code.org कोडी सह, विद्यार्थी विद्यमान लूपमध्ये सूचना जोडण्यास शिकतील, लूपमध्ये पुनरावृत्ती केलेले कोड एकत्र करतील आणि लूप करणे आवश्यक असलेले नमुने ओळखतील. हे लक्षात घेतले पाहिजे की विद्यार्थ्यांना अनेक वेगवेगळ्या उपायांसह कोडे पडतील. हे प्रत्येक पद्धतीचे फायदे आणि तोटे असलेली कोडी सोडवण्याच्या विविध मार्गांवर चर्चा  सुरु होईल.",
          "student_overview": "लुप्स वापरून मेझेस द्वारे _BB-8_ ला मदत करा!"
        },
        "express-2021/Sticker Art with Loops": {
          "preparation": "-   आपले स्वतःचे डिझाइन बनविण्याचा सराव करा. हे लेव्हल्स आधीच्या सर्व गोष्टींपेक्षा कसे वेगळे आहेत याची नोंद घ्या.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "ही मालिका क्रिएटिव्ह आणि वैयक्तिक डिझाईन्ससह लूपची ताकद हायलाइट करते.\n\nप्रकल्प-समर्थित अनुक्रम म्हणून ऑफर केलेली, ही प्रगती विद्यार्थ्यांना त्यांच्या स्वतःच्या कामाच्या शिखरावर तयार करण्यास आणि आश्चर्यकारक कलाकृती तयार करण्यास अनुमती देईल."
        },
        "express-2021/Nested Loops in Maze": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "नेस्टेड लूपच्या या परिचयात, विद्यार्थी त्यांच्या कम्फर्ट झोनच्या बाहेर जाऊन कोडी सोडवण्यासाठी अधिक प्रभावी उपाय तयार करतील.\n\nपूर्वीच्या कोडींमध्ये, लूपने विद्यार्थ्यांना पुनरावृत्ती ओळखण्यास प्रवृत्त केले. येथे, विद्यार्थी हे नेस्टेड लूप विकसित करण्यासाठी _windin_ पुनरावृत्ती केलेले नमुने ओळखण्यास शिकतील. हा टप्पा विद्यार्थ्यांना कोडे चीड आणणारे आणि गुंतागुंतीचे कोडे सोडवण्याचा प्रयत्न करण्यासाठी प्रोत्साहन देऊन सुरू होतो. व्हिडिओ नेस्टेड लूपची ओळख करून दिल्यानंतर, विद्यार्थ्यांना एक उदाहरण दाखवले जाते आणि लूप दुसर्‍या लूपच्या आत टाकल्यावर काय होईल याचा अंदाज वर्तवण्यास सांगितले जाते. या प्रगतीमुळे विद्यार्थ्यांना प्रोग्रॅमिंगमधील लूपिंगबद्दलची त्यांची समज दृढ करण्यासाठी आणि तयार करण्यासाठी भरपूर सराव होतो."
        },
        "express-2021/Snowflakes with Anna and Elsa": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी धड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या मालिकेत, विद्यार्थ्यांना प्रतिमा तयार करताना सराव नेस्टिंग लूप मिळतील ज्या शेअर करण्यास ते उत्सुक असतील.\n\nमूठभर सूचनांपासून सुरुवात करून, पुनरावृत्तीसाठी डिझाइन्स तयार करताना विद्यार्थी स्वतःचे निर्णय घेतील. त्यानंतर ते खरोखर अद्वितीय असलेल्या कलाकृतीसह समाप्त करण्यासाठी विविध मार्गांनी फिरतील."
        },
        "express-2021/Looking Ahead with Minecraft ": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्रे शोधण्यासाठी या धड्याशी संबंधित कोडे खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "कोड्यांचा हा संच लूपचे ज्ञान घट्ट करण्यासाठी आणि तयार करण्यासाठी आणि   कंडीशनल  सादर करण्यासाठी कार्य करेल. या दोन संकल्पनांना एकत्र जोडून, विद्यार्थी नवीन आणि उत्साहवर्धक वातावरणात मजेदार आणि नाविन्यपूर्ण कार्यक्रम तयार करण्याच्या क्षमतेचा शोध घेण्यास सक्षम असतील."
        },
        "express-2021/If/Else with Bee": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "विद्यार्थी त्यांच्या कार्यक्रमांमध्ये कंडीशनल्स वापरून सराव करतील. if / else ब्लॉक्स अधिक लवचिक प्रोग्रामसाठी अनुमती देतात.  जर फुल असेल\\_ मधमाशी फक्त पराग कण गोळा करेल किंवा जर मधाचा पोळा असेल\\_मध तयार करेल."
        },
        "express-2021/While Loops with the Farmer": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "जसे तुमचे विद्यार्थी त्यांचे लूपचे ज्ञान वाढवत राहतील, त्यांना अशा समस्या येतील जेथे कमांडची पुनरावृत्ती करणे आवश्यक आहे, परंतु ते किती वेळा पुनरावृत्ती करणे आवश्यक आहे हे माहित नाही. येथेच लूप येतात. आजच्या धड्यात, विद्यार्थी कंडिशन-आधारित लूपची नवशिक्याची समज विकसित करतील आणि सामान्यतः लूपबद्दलचे त्यांचे ज्ञान वाढवतील."
        },
        "express-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्रे शोधण्यासाठी या धड्याशी संबंधित कोडे खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "कोड्यांचा हा संच लूप आणि कंडिशनल्सचे ज्ञान मजबूत करण्यासाठी आणि तयार करण्यासाठी कार्य करेल. या दोन संकल्पनांना एकत्र जोडून, विद्यार्थी नवीन आणि उत्साहवर्धक वातावरणात मजेदार आणि नाविन्यपूर्ण कार्यक्रम तयार करण्याच्या क्षमतेचा शोध घेण्यास सक्षम असतील."
        },
        "express-2021/Until Loops in Maze": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "कोड्यांचा हा संच अंटील कंडिशनल जोडून लूपचे ज्ञान दृढ करण्यासाठी आणि तयार करण्यासाठी कार्य करेल. या संकल्पनांना एकत्र जोडून, विद्यार्थी जटिल आणि नाविन्यपूर्ण कार्यक्रम तयार करण्याच्या क्षमतेचा शोध घेण्यास सक्षम असतील.",
          "student_overview": "जेव्हा तुम्ही अंटील लूप वापरता तेव्हा तुम्ही काही आश्चर्यकारक गोष्टी करू शकता!"
        },
        "express-2021/Harvesting with Conditionals": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी धड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "वेगवेगळ्या परिस्थितींमध्ये कंडिशनल्सच्या वापराचा सराव केल्याने विद्यार्थ्याला कंडिशनल्स काय करू शकतात हे समजण्यास मदत होते. मागील धड्यात, विद्यार्थ्यांनी मेझ भोवती फिरण्यासाठी फक्त कंडिशनल वापरले. या धड्यामध्ये,  शेतकऱ्याने पिके केव्हा काढायची हे जाणून घेण्यास मदत करण्यासाठी विद्यार्थी कंडिशनल  वापरतील. नवीन नमुने उदयास येतील आणि विद्यार्थी सर्जनशीलता आणि तार्किक विचारांचा वापर करून कोड कोठे चालवायचे आणि पुनरावृत्ती करायचे हे ठरवतील."
        },
        "express-2021/Functions in Minecraft": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "विद्यार्थ्यांना वेगवेगळ्या वातावरणात फंक्शन्सचा सराव करून प्रोग्रामिंगची अष्टपैलुता सापडेल. येथे, विद्यार्थी पुन्हा वापरता येण्याजोगे नमुने ओळखतील आणि पूर्व-परिभाषित फंक्शन्स कॉल करण्यासाठी नामांकित ब्लॉक समाविष्ट करण्यास सक्षम असतील."
        },
        "express-2021/Functions with Artist": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यातील सर्वात महत्त्वाचा घटक म्हणजे विद्यार्थ्यांना अभिमान वाटेल असे काहीतरी तयार करण्यासाठी जागा प्रदान करणे. ही कोडी अधिकाधिक गुंतागुंतीच्या प्रतिमांपर्यंत पोहोचतात, परंतु प्रत्येक नवीन कोडे केवळ पूर्वीचे कोडे तयार करतात. या धड्याच्या शेवटी, विद्यार्थ्यांना त्यांच्या कठोर परिश्रमांचा आत्मविश्वास आणि अभिमान वाटेल.",
          "student_overview": "फंक्शन्ससह जटिल ड्रॉइंग्स अधिक सहज बनवा!"
        },
        "express-2021/Functions with Harvester": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा विद्यार्थ्यांना अधिक सर्जनशील मार्गांनी फंक्शन्सचा वापर करण्यास पुढे ढकलण्यासाठी आहे. विद्यार्थी शिकतील की समस्येकडे जाण्यासाठी अनेक मार्ग आहेत, परंतु काही इतरांपेक्षा अधिक कार्यक्षम आहेत. या कोडींचा उद्देश समस्या सोडवणे आणि गंभीर विचार कौशल्ये वाढवणे आहे."
        },
        "express-2021/lesson-4": {
          "preparation": "लेव्हल नुसार खेळा आणि लेसन स्लाइडचे पुनरावलोकन करा.",
          "purpose": "डेटा संग्रहित करण्यासाठी आणि सुधारित करण्यासाठी या अभ्यासक्रमात व्हेरिएबल्सचा वापर केला जाईल. या टप्प्यावर, विद्यार्थी मूल्ये न बदलता फक्त साठवून ठेवतील आणि पुनर्प्राप्त करतील. नंतरच्या धड्यांमध्ये, विद्यार्थी संख्यात्मक मूल्ये संग्रहित करतील आणि गेममधील खेळाडूच्या स्कोअरसारख्या गोष्टींचा मागोवा ठेवण्यासाठी कालांतराने त्यामध्ये सुधारणा करतील.",
          "student_overview": "या धड्यामध्ये तुम्ही स्प्राईट लॅबमधील व्हेरिएबल्ससह सराव कराल."
        },
        "express-2021/Variables with Artist": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "व्हेरिएबल्स हे मूलत: व्हॅल्यूजसाठी प्लेसहोल्डर असतात जे तुम्ही तुमचा प्रोग्राम चालवता त्या वेळी अज्ञात असू शकतात किंवा प्रोग्रामच्या अंमलबजावणी दरम्यान बदलू शकणार्‍या मूल्यांसाठी. डायनॅमिक कोड तयार करण्यासाठी हे महत्त्वाचे आहेत कारण ते तुमच्या प्रोग्रामला कितीही संभाव्य बदलांच्या आधारावर बदलण्याची आणि वाढण्याची परवानगी देतात. हा टप्पा व्हेरिएबल्सच्या वापरास अधिक बळकट करतो, सेटिंग आणि वापरण्याच्या सर्वात मूलभूत क्षमतांचा वापर करून."
        },
        "express-2021/Changing Variables with Bee": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा स्पष्ट करेल की बदलत्या मूल्यांसह कोड कसा उपयुक्त ठरू शकतो आणि आगामी धड्यांमध्ये \"फॉर लूप\" कसे कार्य करते हे समजून घेण्यास विद्यार्थ्यांना तयार करेल.",
          "student_overview": "या मधमाशीला व्हेरिएबल्स आवडतात!"
        },
        "express-2021/For Loops with Bee": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "आजची संकल्पना, फॉर लूप्स  हा संगणक शास्त्रातील अत्यंत महत्त्वाचा विषय आहे. ते केवळ मोठ्या प्रमाणावर वापरले जात नाहीत, लूपसाठी शिकण्याची प्रक्रिया इतर महत्त्वाच्या संकल्पनांचे शिक्षण वाढवते (जसे की व्हेरिएबल्स आणि पॅरामीटर्स.) लूपसाठी विद्यार्थ्यांना प्रत्येकासाठी प्रारंभिक, समाप्ती आणि चरण मूल्ये निर्धारित करून समस्यांवर गंभीरपणे विचार करण्याचा भरपूर सराव असेल.  ही संकल्पना भरपूर गणिताचा देखील वापर करते, त्यामुळे अधिक सखोल शिकण्याच्या अनुभवासाठी गणिताच्या धड्यासोबत मोकळ्या मनाने त्याची जोडणी करा."
        },
        "express-2021/For Loops with Artist": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी धड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "सर्जनशीलता आणि टीकात्मक विचार या धड्यात सुंदरपणे एकत्र आले आहेत. विद्यार्थी लूप आणि व्हेरिएबल्ससह त्यांचा सराव  तो पर्यंत  सुरू ठेवतील जो पर्यंत ते आश्चर्यकारक प्रतिमा तयार करत नाहीत. हा धडा संगणक ज्ञानाच्या मूलभूत संकल्पना शिकवताना सर्जनशील मनाला प्रेरणा देतो."
        },
        "express-2021/End of Course Project": {
          "preparation": "-   विद्यार्थ्यांसाठी उपलब्ध असलेल्या दोन्ही प्रकल्प साधनांसह तुमचा स्वतःचा प्रकल्प बनवण्यासाठी वेळ घालवा. प्रत्येक साधनाच्या क्षमता आणि मर्यादांशी परिचित व्हा.\n-   तुमच्या वर्गाच्या उद्दिष्टांमध्ये बसण्यासाठी \\***\\*रुब्रिक** सुधारा आणि प्रत्येक विद्यार्थी किंवा गटासाठी एक प्रत प्रिंट करा.\n-   तुमच्या वर्गात बसण्यासाठी **\\*प्रोजेक्ट नियोजन मार्गदर्शक** सुधारा आणि प्रत्येक विद्यार्थी किंवा गटासाठी एक प्रिंट करा",
          "purpose": "हा धडा विद्यार्थ्यांना त्यांच्या स्वतःच्या डिझाईनचा प्रोजेक्ट  तयार करण्यासाठी जागा प्रदान करतो, चरण-दर-चरण प्रक्रिया वापरून ज्यासाठी नियोजन आवश्यक आहे परंतु व्यापक सर्जनशीलतेसाठी देखील परवानगी देते."
        },
        "pre-express-2021/Learn to Drag and Drop": {
          "preparation": "-   Code.org वर **\\*वर्ग विभाग कसा बनवायचा** पहा - शिक्षक व्हिडिओ. Code.org वर तुमचा स्वतःचा वर्ग विभाग तयार करा आणि प्रत्येक विद्यार्थ्याकडे त्यांचा **पासकोड** असलेले कार्ड असल्याची खात्री करा.\n-   विद्यार्थी त्यांच्या डिव्हाइसेसवरून धडा 2 ऍक्सेस करू शकतील याची खात्री करा. विद्यार्थ्यांना खूप लवकर पुढे जाण्यापासून रोखण्यासाठी तुम्हाला भविष्यातील धडे लपवायचे आहेत का याचा विचार करा.\n-   शालेय आयटी व्यक्तीला संगणकाच्या डेस्कटॉपवर तुमच्या वर्ग विभागासाठी एक क्विक लिंक जोडण्यास सांगा.\n-   अधिक ऑनलाइन सुरक्षितता सामग्रीसाठी कॉमन सेन्स एज्युकेशन वेबसाइटचे पुनरावलोकन करा.",
          "purpose": "या धड्याचे मुख्य उद्दिष्ट म्हणजे विद्यार्थ्यांचा संगणकासोबतचा अनुभव तयार करणे. क्लिक करणे, ड्रॅग करणे आणि ड्रॉप करणे यासारख्या मूलभूत संगणक कार्यांचा अंतर्भाव करून, आम्ही भविष्यातील कोडी सोडवण्यासाठी वर्गात अधिक समान खेळाचे क्षेत्र तयार करत आहोत. हा धडा तुमच्या उपकरणांवर अवलंबून \"माऊस\", \"ट्रॅकपॅड\" किंवा \"टचस्क्रीन\" चा समावेश करून मूलभूत संगणक हार्डवेअर शब्दावली सादर करण्याची उत्तम संधी देखील प्रदान करतो.",
          "student_overview": "कोडी पूर्ण करण्यासाठी क्लिक करा आणि ड्रॅग करा."
        },
        "pre-express-2021/Sequencing with Scrat": {
          "preparation": "प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, विद्यार्थी संगणक प्लॅटफॉर्मवर प्रोग्रामिंग आणि डीबगिंग कौशल्ये विकसित करतील. या कोड्याचे  ब्लॉक-आधारित स्वरूप विद्यार्थ्यांना वाक्यरचना परिपूर्ण  न करता, अनुक्रम आणि संकल्पना जाणून घेण्यास मदत करते.",
          "student_overview": "अक्रोनपर्यंत पोहोचण्यासाठी प्रोग्राम स्क्रॅट"
        },
        "pre-express-2021/Programming in with Angry Birds": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी धड्यातून खेळा.\n-   (पर्यायी) तुमच्या वर्गासोबत गट म्हणून काही कोडी निवडा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, विद्यार्थी संगणक प्लॅटफॉर्मवर प्रोग्रामिंग आणि डीबगिंग कौशल्ये विकसित करतील. या कोड्याचे  ब्लॉक-आधारित स्वरूप विद्यार्थ्यांना वाक्यरचना परिपूर्ण  न करता, अनुक्रम आणि संकल्पना जाणून घेण्यास मदत करते."
        },
        "pre-express-2021/Programming with Rey and BB-8": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी धड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "ज्ञानाचे हस्तांतरण लक्षात घेऊन, हा धडा विद्यार्थ्यांना ते जोपासत असलेल्या कौशल्यांचा सराव करण्यासाठी एक नवीन वातावरण देते. स्टार वॉर्सचे चाहते हे कोडे पाहिल्यावर आनंदाने उडी मारतील. या मालिकेतील प्रत्येक कोडे या संपूर्ण अभ्यासक्रमात वापरत असलेल्या मूलभूत संकल्पनांची सखोल माहिती देण्यासाठी जोडण्यात आले आहे."
        },
        "pre-express-2021/Programming in Harvester": {
          "preparation": "-   तुमच्या वर्गासाठी संभाव्य समस्या क्षेत्रे शोधण्यासाठी कोडी द्वारे खेळा\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याचे सुनिश्चित करा.",
          "purpose": "या धड्यात, विद्यार्थी डीबगिंग कौशल्ये विकसित करतील आणि त्यांचे प्रोग्रामिंग कौशल्य विकसित करणे सुरू ठेवतील.",
          "student_overview": "हार्वेस्टरला एका मार्गावर भाज्या गोळा करण्यात मदत करा."
        },
        "pre-express-2021/Loops with Scrat": {
          "preparation": "-   (पर्यायी) गट म्हणून तुमच्या वर्गासाठी काही कोडी निवडा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, विद्यार्थी लूप आणि त्यांना ब्लॉकली कोडमध्ये कसे अंमलात आणायचे याबद्दल अधिक जाणून घेतील. _loops_ वापरणे हे प्रोग्रॅमिंगमधील एक महत्त्वाचे कौशल्य आहे कारण मॅन्युअली कमांड रिपीट करणे कंटाळवाणे आणि अकार्यक्षम आहे. या Code.org कोडीसह, विद्यार्थी विद्यमान लूपमध्ये सूचना जोडण्यास शिकतील, लूपमध्ये पुनरावृत्ती केलेले कोड गोळा करतील आणि पुनरावृत्ती करणे आवश्यक असलेले नमुने ओळखतील.",
          "student_overview": "लूप वापरून स्क्रॅटला अधिक जमीन कव्हर करण्यास मदत करा."
        },
        "pre-express-2021/Loops with Laurel": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   (पर्यायी) तुमच्या वर्गासह एक गट म्हणून काही कोडी निवडा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा विद्यार्थ्यांना लूपसह अधिक सराव देतो आणि शक्य तितका खजिना गोळा करण्याचा प्रयत्न करत असताना त्यांना एका `पुनरावृत्ती`च्या आत अनेक ब्लॉक्स ठेवण्यास प्रोत्साहित करतो."
        },
        "pre-express-2021/Ocean Scene with Loops": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा प्रोग्रामिंगमध्ये लूप गोष्टी कशा तयार करू शकतात याबद्दल एक वेगळा दृष्टीकोन देतो. विद्यार्थी लूपशिवाय प्रोग्रामिंगच्या अकार्यक्षमतेचा देखील विचार करू शकतात कारण 'रिपीट' लूपच्या मदतीशिवाय प्रोग्रामिंग करण्यासाठी किती ब्लॉक्स आवश्यक आहेत.",
          "student_overview": "इमेजेस पूर्ण करण्यासाठी लूप्स आणि पॅटर्न वापरा."
        },
        "pre-express-2021/Drawing Gardens with Loops": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी धड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा प्रोग्रामिंगमध्ये लूप गोष्टी कशा तयार करू शकतात याबद्दल एक वेगळा दृष्टीकोन देतो. विद्यार्थी दिलेल्या कोडचे मूल्यमापन करून आणि कोडे सोडवण्यासाठी काय जोडले जाणे आवश्यक आहे हे निर्धारित करून त्यांच्या गंभीर विचार कौशल्याची चाचणी घेतील. विद्यार्थी लूपशिवाय प्रोग्रामिंगच्या अकार्यक्षमतेवर देखील प्रतिबिंबित करू शकतात कारण `पुनरावृत्ती` लूपच्या मदतीशिवाय प्रोग्रामला किती ब्लॉक्स आवश्यक आहेत.",
          "student_overview": "इमेजेस पूर्ण करण्यासाठी पॅटर्न आणि लूप वापरा."
        },
        "pre-express-2021/On the Move with Events": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   (पर्यायी) तुमच्या वर्गासह एक गट म्हणून काही कोडी निवडा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा",
          "purpose": "प्ले लॅबचा वापर करून विद्यार्थी आजच्या घडामोडींबद्दल त्यांची समज विकसित करतील. बहुतेक संगणक प्रोग्राम्समध्ये इव्हेंट्स खूप सामान्य असतात. या गतिविधीमध्ये, विद्यार्थी इव्हेंट्सचा वापर कॅरेक्टर स्क्रीनभोवती फिरण्यासाठी, आवाज काढण्यासाठी आणि वापरकर्त्याने सुरू केलेल्या इव्हेंटच्या आधारावर पार्श्वभूमी बदलण्यासाठी करतील.",
          "student_overview": "आपली स्वतःची गेम किंवा स्टोरी तयार करा."
        },
        "pre-express-2021/A Royal Battle with Events": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   (पर्यायी) तुमच्या वर्गासह एक गट म्हणून काही कोडी निवडा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा",
          "purpose": "या ऑनलाइन अ‍ॅक्टिव्हिटीमध्ये, विद्यार्थी Play Lab मधील इव्हेंट्स कसे वापरायचे ते शिकतील. जेव्हा ॲरो की दाबली जाते तेव्हा ते नाइटला हलवण्याचे प्रशिक्षण देऊन सुरुवात करतील, त्यानंतर अंतिम फ्रीप्ले कोडेचा भाग म्हणून, अनुक्रम (सिक्वेन्स)आणि लूपिंगसह, या संपूर्ण कोर्समध्ये त्यांनी शिकलेली उर्वरित कौशल्ये प्रदर्शित करण्याच्या संधीसह समाप्त होतील.",
          "student_overview": "कथा  किंवा इंटरॲक्टीव्ह गेम  तयार करण्यासाठी इव्हेंटचा वापर करा."
        },
        "coursee-2021/Simon Says": {
          "purpose": "हा धडा विद्यार्थ्यांना स्प्राईट लॅबमधील मुख्य प्रोग्रामिंग संकल्पनांपैकी एक, वर्तणुकीबद्दल विचार करण्यास तयार करण्यासाठी डिझाइन केलेला आहे."
        },
        "coursee-2021/Learning Sprites with Sprite Lab": {
          "purpose": "हा धडा विद्यार्थ्यांना स्प्राईट लॅबच्या मूळ शब्दसंग्रहाची ओळख करून देण्यासाठी आणि त्यांना इतर वातावरणात शिकलेल्या संकल्पना या साधनामध्ये लागू करण्याची अनुमती देण्यासाठी डिझाइन केलेले आहे. फिश टँक तयार करून, विद्यार्थी या टूलच्या प्रोग्रॅमिंग मॉडेलची समज तयार करतील आणि ते स्वतःला अभिव्यक्त करण्यासाठी ते वापरू शकतील अशा मार्गांचा शोध घेतील.",
          "student_overview": "स्प्राइट कसे तयार करावे आणि संपादित करावे ते जाणून घ्या."
        },
        "coursee-2021/Alien Dance Party with Sprite Lab": {
          "purpose": "हा धडा प्रोग्रामिंगमधील इव्हेंटची उत्तम ओळख करून देतो आणि विद्यार्थ्यांना सर्जनशीलता दाखवण्याची संधी देखील देतो! धड्याच्या शेवटी, विद्यार्थ्यांना त्यांचे प्रोजेक्ट शेअर करण्याची संधी दिली जाईल.",
          "student_overview": "वर्गमित्रांसह शेयर केला जाऊ शकतो असा इंटरॲक्टीव्ह प्रोजेक्ट तयार करा."
        },
        "coursee-2021/lesson-4": {
          "overview": "![](https://curriculum.code.org/static/img/common_sense_education.png)\n\nहा धडा मुळात कॉमन सेन्स एज्युकेशनने तयार केला आहे. [अधिक जाणून घ्या.](https://www.commonsense.org/education/digital-citizenship/curriculum)\n\nऑनलाइन साधने मुलांसाठी सक्षम बनवत आहेत आणि त्यांच्याकडे मोठ्या जबाबदाऱ्या देखील येतात. पण जेव्हा मुलांना सायबर धमकीचा सामना करावा लागतो तेव्हा त्यांना नेहमी काय करावे हे माहित असते का? तुमच्या विद्यार्थ्‍यांना कृती करण्‍याचे आणि संघर्ष सोडवण्‍याचे, अपस्टेंडर असण्‍यापासून ते गरजू इतरांना मदत करण्‍यापर्यंत सर्व उचित मार्ग दाखवा,",
          "preparation": "-   शिक्षण सामग्रीचे पुनरावलोकन करा.\n-   प्रत्येक विद्यार्थ्यासाठी हँडआउट प्रिंट करा.\n-   विद्यार्थ्यांसाठी रंगीत पेन्सिल किंवा मार्कर तयार ठेवा.",
          "purpose": "कॉमन सेन्स एज्युकेशनने हा धडा विद्यार्थ्यांना शिकवण्यासाठी तयार केला आहे, जेव्हा ते सायबर गुंडगिरी पाहतात तेव्हा ते कसे अपस्टेंडर  असू शकतात.",
          "student_overview": "सायबर गुंडगिरी पाहिल्यावर आपण अपस्टेंडर कसे राहू शकता हे शिका "
        },
        "coursee-2021/Private and Personal Information": {
          "overview": "![](https://curriculum.code.org/static/img/common_sense_education.png)\n\nहा धडा मुळात कॉमन सेन्स एज्युकेशनने तयार केला. [अधिक जाणून घ्या.](https://www.commonsense.org/education/digital-citizenship/curriculum)\n\nइतरांशी शेअर करणे आणि त्यांच्याशी जोडणे हा आमच्या विद्यार्थ्यांचा स्वभाव आहे. परंतु ऑनलाइन शेअर करणे काही जोखमींसह येते. मुलांना ऑनलाइन मजबूत, सकारात्मक आणि सुरक्षित नातेसंबंध तयार करण्यात आम्ही कशी मदत करू शकतो? वैयक्तिक काय आहे आणि खाजगी काय सर्वात चांगले आहे यातील फरक जाणून घेण्यासाठी तुमच्या विद्यार्थ्यांना मदत करा.",
          "preparation": "-   शिक्षण सामग्रीचे पुनरावलोकन करा.\n-   प्रत्येक विद्यार्थ्यासाठी हँडआउट प्रिंट करा.",
          "purpose": "कॉमन सेन्स एज्युकेशनने विद्यार्थ्यांना त्यांच्याविषयी कोणती माहिती ऑनलाइन शेअर करणे योग्य आहे हे शिकवण्यासाठी हा धडा तयार केला."
        },
        "coursee-2021/About Me": {
          "overview": "विद्यार्थी या **मिनी-प्रोजेक्ट** मध्ये इंटरॲक्टीव्ह पोस्टर तयार करून वेबवर वैयक्तिक आणि खाजगी माहिती शेअर करण्याची त्यांची समज लागू करतील.",
          "preparation": "-   (पर्यायी) विद्यार्थ्यांसाठी **\\*नियोजन मार्गदर्शक** च्या प्रती छापा किंवा डिजिटल प्रती वितरित करा.\n-   वर्गासोबत शेअर करण्यासाठी स्वतः एक उदाहरण प्रोजेक्ट बनवण्याचा विचार करा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "हा धडा विद्यार्थ्यांसाठी वैयक्तिक आणि खाजगी माहितीवरील मागील धडा वैयक्तिकरित्या संबंधित बनवण्याच्या उद्देशाने आहे. SAFE (वैयक्तिक) आणि UNSAFE (खाजगी) उदाहरणे लक्षात घेऊन, विद्यार्थी वेबवर सुरक्षित स्व-अभिव्यक्तीचा सराव करतात, SpriteLab वापरून त्यांचे स्वतःचे स्प्राईट पोशाख तयार करतात आणि मजकूर तयार करतात."
        },
        "coursee-2021/Digital Sharing": {
          "preparation": "-   खाली दिलेल्या \"लिंक\" मध्ये **\\*कॉपीराइट शेअरिंग व्हिडिओ** शोधा\n-   कॉपीराइट आणि सर्जनशीलता वरून संपूर्ण **\\*डिजिटल शेअरिंग लेसन प्लॅन** डाउनलोड करा आणि त्याचे पुनरावलोकन करा\n-   शिक्षक म्हणून, धड्यासाठी एक कलाकृती तयार करा (चित्र, गाणे, स्लाइडशो इ.)\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.\n-   त्या आयटमच्या शेअरिंगची प्रतिकृती तयार करण्यासाठी तुम्हाला टॅब्लेट किंवा स्मार्ट फोनची आवश्यकता असेल",
          "purpose": "विद्यार्थी लवकरच शेअर  करण्यासाठी प्रोजेक्ट  तयार करतील आणि यापैकी बहुतेक  प्रोजेक्ट मध्ये  एकतर कोड किंवा प्रतिमा असतील ज्या विद्यार्थ्यांनी स्वतः तयार केलेल्या नसतील. हा धडा विद्यार्थ्यांना त्यांच्या स्वत:च्या नसलेल्या सामग्रीचा वापर हाताळण्याचा योग्य मार्ग दाखवण्यासाठी आहे."
        },
        "coursee-2021/Programming and Loops with the Artist": {
          "purpose": "विद्यार्थी लूप वापरून सराव करतील, ही एक संकल्पना आहे ज्याची आगामी धड्यांमध्ये पुनरावृत्ती केली जाईल."
        },
        "coursee-2021/Nested Loops in Artist": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोडे खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.\n-   वळण आणि कोनांसह आपल्या विद्यार्थ्यांना कोणत्या मदतीची आवश्यकता असू शकते याचा विचार करा.",
          "purpose": "या ऑनलाइन उपक्रमा मध्ये, विद्यार्थी आर्टिस्टमध्ये डिझाईन्स तयार करतील ज्या ते त्यांच्या प्रियजनांसोबत अभिमानाने शेअर करू शकतील.\n\nया क्रियाकलापाचा उद्देश हा आहे की नेस्टेड लूपचा उपयोग कलात्मक मन असलेल्या विद्यार्थ्यांना कोडिंगला आणखी एक सर्जनशील आउटलेट म्हणून पाहण्यासाठी प्रेरित करण्याचा एक मार्ग म्हणून केला आहे. कोड्याचा  हा सेट  गंभीर विचार कौशल्ये, प्राथमिक भूमितीची समज आणि सर्जनशीलता विकसित करण्यासाठी तयार करण्यात आला होता -- सर्व काही नेस्टेड लूपच्या कार्यक्षेत्रात आहे!"
        },
        "coursee-2021/Nested Loops in Frozen": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्र शोधण्यासाठी कोड्याच्या माध्यमातून खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "या धड्यात, विद्यार्थी  नेस्टेड लूप लागू करून  व त्यांची कौशल्ये वापरून इमेजेस  तयार करतील ज्या शेअर करण्यास ते उत्सुक असतील."
        },
        "coursee-2021/Functions: Songwriting": {
          "preparation": "-   (पर्यायी) **\\*लेसन इन अॅक्शन** व्हिडिओ पहा.\n-   प्रत्येक गटासाठी अनेक \\***\\*वर्कशीट्स** प्रिंट करा.\n-   प्रत्येक विद्यार्थ्यासाठी एक **\\*मूल्यांकन** छापा.\n-   क्रियाकलापांसाठी गाणी आणि गीतांमध्ये सुरक्षित प्रवेश.\n-   प्रत्येक विद्यार्थ्याकडे जर्नल असल्याची खात्री करा.",
          "purpose": "फंक्शन्सचा वापर कोड सुलभ करण्यास मदत करतो आणि विद्यार्थ्याला त्यांचा कार्यक्रम आयोजित करण्याची क्षमता विकसित करतो. विद्यार्थी त्वरीत ओळखतील की लेखन फंक्शन्स त्यांचे लांब कार्यक्रम वाचण्यास सोपे आणि काही चूक झाल्यास डीबग करणे सोपे करू शकतात."
        },
        "coursee-2021/Functions in Minecraft": {
          "purpose": "विद्यार्थ्यांना वेगवेगळ्या वातावरणात फंक्शन्सचा सराव करून प्रोग्रामिंगची अष्टपैलुता सापडेल. येथे, विद्यार्थी पुन्हा वापरता येण्याजोगे नमुने ओळखतील आणि पूर्व-परिभाषित फंक्शन्स कॉल करण्यासाठी नामांकित ब्लॉक समाविष्ट करण्यास सक्षम असतील."
        },
        "coursee-2021/Functions in Artist": {
          "purpose": "या धड्यातील सर्वात महत्त्वाचा घटक म्हणजे विद्यार्थ्यांना अभिमान वाटेल असे काहीतरी तयार करण्यासाठी जागा प्रदान करणे. ही कोडी अधिकाधिक गुंतागुंतीच्या प्रतिमांपर्यंत पोहोचतात, परंतु प्रत्येक नवीन कोडे केवळ पूर्वीचे कोडे तयार करतात. या धड्याच्या शेवटी, विद्यार्थ्यांना त्यांच्या कठोर परिश्रमांचा आत्मविश्वास आणि अभिमान वाटेल.",
          "student_overview": "फंक्शन्ससह जटिल ड्रॉइंग्स अधिक सहज बनवा!"
        },
        "coursee-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "preparation": "-   तुमच्या वर्गासाठी कोणतीही संभाव्य समस्या क्षेत्रे शोधण्यासाठी या धड्याशी संबंधित कोडे खेळा.\n-   प्रत्येक विद्यार्थ्याकडे रिफ्लेक्शन जर्नल असल्याची खात्री करा.",
          "purpose": "कोड्यांचा हा संच लूपचे ज्ञान घट्ट करण्यासाठी आणि तयार करण्यासाठी आणि   कंडीशनल  सादर करण्यासाठी कार्य करेल. या दोन संकल्पनांना एकत्र जोडून, विद्यार्थी नवीन आणि उत्साहवर्धक वातावरणात मजेदार आणि नाविन्यपूर्ण कार्यक्रम तयार करण्याच्या क्षमतेचा शोध घेण्यास सक्षम असतील.",
          "student_overview": "येथे तुम्ही _माईनक्राफ्ट_ च्या जगातील कंडिशनल्सबद्दल जाणून घ्याल"
        },
        "coursee-2021/Conditionals": {
          "purpose": "हा धडा विद्यार्थ्यांना while loops आणि \"if/else\" विधानांची ओळख करून देतो."
        },
        "coursee-2021/Functions in Harvester": {
          "purpose": "या धड्याचा उद्देश विद्यार्थ्यांना फंक्शन्ससह सशर्त वापरण्यास प्रेरित करणे आहे. या कोडींचा उद्देश समस्या सोडवणे आणि गंभीर विचार कौशल्ये वाढवणे आहे."
        },
        "coursee-2021/lesson-1": {
          "preparation": "-   संदर्भासाठी, **\\*अपंगत्वाचे प्रकार** बद्दल वाचा.\n-   **\\*स्लाइड डेक** मधील स्पीकर नोट्स वाचा.\n-   सर्व विद्यार्थ्यांसाठी पुरेशी स्केचिंग/ड्रॉईंगची सामग्री तयार करा.",
          "purpose": "प्रवेशयोग्यतेबद्दल शिकण्याद्वारे, विद्यार्थी त्यांच्या स्वत:च्या आयुष्याच्या पलीकडे असलेल्या संगणनाचे परिणाम ओळखतात. प्रवेशयोग्यता कदाचित संबंधित CS विषयासारखी वाटणार नाही, परंतु सेवा नसलेल्या वापरकर्त्यांसाठी प्रवेशयोग्य तंत्रज्ञान तयार केल्याने इतर प्रत्येकासाठी तंत्रज्ञान अधिक चांगले बनविण्यात मदत होते."
        },
        "coursee-2021/End of Course Project": {
          "preparation": "-   कलाकार आणि स्प्राईट लॅब या दोहोंसोबत तुमचा स्वतःचा प्रोजेक्ट बनवण्यात वेळ घालवा. प्रत्येक साधनाच्या क्षमता आणि मर्यादांशी परिचित व्हा.\n-   तुमच्या वर्गाच्या उद्दिष्टांमध्ये बसण्यासाठी **\\*रुब्रिक** सुधारा आणि प्रत्येक विद्यार्थ्यासाठी एक प्रत छापा.\n-   तुमच्या वर्गात बसण्यासाठी **\\*प्रोजेक्ट डिझाइन वर्कशीट** सुधारा आणि प्रत्येक विद्यार्थ्यासाठी एक पॅकेट प्रिंट करा.",
          "purpose": "विद्यार्थी त्यांचे प्रकल्प तयार करण्यासाठी थेट उडी मारण्यास तयार असू शकतात, परंतु हा धडा त्यांच्या कल्पनांना योजनांमध्ये आकार देण्यास मदत करेल. ही रचना स्वप्न पाहणाऱ्यांना जमीनी वर  ठेवेल आणि अंधारात सोडलेल्या लोकांसाठी एक मार्ग प्रकाशित करेल. विद्यार्थ्यांना त्यांचे प्रकल्प तयार करण्यासाठी आणि सुधारित करण्यासाठी पुरेसा वेळ द्या. या धड्यातील चाचणी आणि त्रुटी अपरिहार्यपणे समस्या सोडवणे आणि चिकाटी शिकवतील."
        }
      }
    }
  }
}