{
  "te-IN": {
    "data": {
      "lessons": {
        "poem-art-2021/Poem Art": {
          "preparation": "-   సొంతంగా ఆన్‌‌లైన్ ట్యుటోరియల్‌ను సమీక్షించండి మరియు పూర్తి చేయండి: [Poem Art](http://studio.code.org/s/poem-art).\n\n-   యాక్టివిటీలను పూర్తి చేయమని మీ విద్యార్థులను అడగడానికి ముందు మొదట వాటిని మీరు ప్రయత్నించినట్లు సునిశ్చితం చేసుకోండి.\n\n-   మీ టెక్నాలజీని తనిఖీ చేయండి మరియు ముందుగానే ఏదైనా ట్రబుల్‌షూట్ చేయాల్సిన అవసరం మీకు ఉందా అని నిర్ణయించండి.\n\n-   కొన్ని లెవల్స్ ప్లే చేయడానికి సౌండ్ అవసరం. ముందుగానే హెడ్‌ఫోన్లను అందజేయండి.\n\n-   [ఐచ్ఛికం] మదింపు కోసం ఒక్కో విద్యార్థికి 2 స్టికీ నోట్స్."
        },
        "poem-art/lesson-1": {
          "overview": "ఈ CS మరియు ELA సమన్విత పాఠంలో, విద్యార్థులు కోడ్‌తో ఒక కవిత యొక్క మనోభావాన్ని ప్రదర్శించడానికి ఒక కవితను యానిమేట్ చేస్తారు.ఈ పరిచయ కోడింగ్ యాక్టివిటీ సమయంలో, విద్యార్థులు ఒక కవితను చదివి, దాని మూడ్ కనుగొంటారు. తర్వాత ఆ కవిత మూడ్‌ను వివరించడంలో సహాయపడటానికి సరిపోయే ప్రభావాలు మరియు ఇమేజ్‌లను కనుగొంటారు. చివరగా, విద్యార్థులు మూడ్‌లో మార్పును వివరించడానికి లేదా కవితలో కొత్త ఇమేజ్‌ల పరిచయాన్ని యానిమేట్ చేయడానికి ఈవెంట్స్ (కోడ్) ఉపయోగిస్తారు.\n\n ఈ పాఠం ఒక 1-గంట స్వతంత్ర పాఠంగా పూర్తి చేయబడవచ్చు. ఈ పాఠాన్ని [Coding with Poetry](http://code.org/poetry) అని పిలువబడే 5-పాఠాల మాడ్యూల్‌లో మొదటి పాఠంగా కూడా ఉపయోగించే వికల్పం ఉంది. పొయట్రీ మాడ్యూల్‌తో కోడింగ్ ముగింపు సమయానకి, విద్యార్థులు తమ సొంత కవితలు రాస్తారు మరియు తమ స్నేహితులతో పంచుకోవడానికి ఒక పొయమ్ జనరేటర్ యాప్ సృష్టిస్తారు.\n\n కోడింగ్ విత్ పొయట్రీ అనేది Code.org యొక్క CS కనెక్షన్స్ పాఠ్యప్రణాళికలో భాగం, ఇది CCSS, NGSS మరియు CSTA ప్రమాణాల అమరికతో CS ను గణితం ELA మరియు సైన్స్ లాంటి ఇతర సబ్జెక్టులలో సమన్వయం చేయడానికి ఉద్దేశించబడింది. ",
          "preparation": "-   సొంతంగా ఆన్‌‌లైన్ ట్యుటోరియల్‌ను సమీక్షించండి మరియు పూర్తి చేయండి: [Poem Art](http://studio.code.org/s/poem-art).\n\n-   యాక్టివిటీలను పూర్తి చేయమని మీ విద్యార్థులను అడగడానికి ముందు మొదట వాటిని మీరు ప్రయత్నించినట్లు సునిశ్చితం చేసుకోండి.\n\n-   మీ టెక్నాలజీని తనిఖీ చేయండి మరియు ముందుగానే ఏదైనా ట్రబుల్‌షూట్ చేయాల్సిన అవసరం మీకు ఉందా అని నిర్ణయించండి.\n\n-   కొన్ని లెవల్స్ ప్లే చేయడానికి సౌండ్ అవసరం. ముందుగానే హెడ్‌ఫోన్లను అందజేయండి.\n\n-   [ఐచ్ఛికం] మదింపు కోసం ఒక్కో విద్యార్థికి 2 స్టికీ నోట్స్."
        }
      }
    }
  }
}