{
  "it-IT": {
    "data": {
      "lessons": {
        "coursef-2021/lesson-6": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/lesson-7": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/lesson-8": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/Virtual Pet": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/lesson-2": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Il bullismo non va mai bene. In questa lezione imparerai cosa si può dire online e cosa deve essere evitato."
        },
        "coursef-2021/lesson-9": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/lesson-10": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/lesson-11": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/Loops with the Artist": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/Variables that Change in Artist": {
          "overview": "",
          "preparation": "",
          "purpose": "Le variabili sono essenzialmente dei segnaposto per valori che potrebbero essere sconosciuti al momento in cui si esegue il programma o per valori che possono cambiare durante l'esecuzione di un programma. Le variabili sono vitali per creare codice dinamico, perché consentono al programma di cambiare e crescere in base ad un numero qualsiasi di potenziali modifiche. Questa lezione rafforza la conoscenza delle variabili, facendo uso delle funzionalità di base per impostarle ed utilizzarle.",
          "student_overview": "In questa lezione realizzerai dei disegni usando le variabili che modificano il loro valore durante l'esecuzione del programma."
        },
        "coursef-2021/Nested Loops in the Maze": {
          "overview": "In questa attività online, gli studenti avranno l'opportunità di spingere la loro comprensione dei Cicli ad un livello completamente nuovo. Giocando con l'Ape e gli Zombie, gli studenti impareranno a programmare un ciclo all'interno di un altro ciclo. Saranno anche incoraggiati ad indagare come dei piccoli cambiamenti in entrambi i cicli influenzano il programma quando si clicca su \"Esegui\".",
          "preparation": "",
          "purpose": "",
          "student_overview": "Cicli all'interno di altri cicli, all'interno di altri cicli... Cosa significa? In questa lezione imparerai cosa succede quando inserisci un ciclo all'interno di un altro ciclo."
        },
        "coursef-2021/Variables that Change in Bee": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Quest'ape ama le variabili!"
        },
        "coursef-2021/For Loop Fun": {
          "overview": "Sappiamo che i cicli ci permettono di ripetere più e più volte le stesse azioni, ma ora impareremo come usare i cicli con strutture aggiuntive. Queste nuove strutture permetteranno agli studenti di creare un codice più potente e dinamico. ",
          "preparation": "",
          "purpose": "",
          "student_overview": "Ti divertirai moltissimo imparando i cicli con contatore!"
        },
        "coursef-2021/For Loops in Bee": {
          "overview": "Questa lezione con l'Ape è dedicata ai cicli con contatore e l'uso di una variabile incrementale per risolvere esercizi più complicati. Gli studenti inizieranno ripassando i cicli delle lezioni precedenti, poi proseguiranno usando i cicli con contatore per risolvere più efficacemente problemi più complicati.",
          "preparation": "",
          "purpose": "",
          "student_overview": "Zzz Zzz. In questi esercizi guiderai l'ape fino al nettare e al miele usando i cicli con contatore!"
        },
        "coursef-2021/For Loops in Artist": {
          "overview": "In questa lezione, gli studenti continuano ad esercitarsi con i cicli, questa volta con l'Artista. Gli studenti completeranno gli esercizi combinando i concetti di variabili, cicli e cicli con contatore per creare progetti complessi. Alla fine avranno la possibilità di creare il proprio progetto in un esercizio libero.",
          "preparation": "",
          "purpose": "",
          "student_overview": "Preparati a creare il tuo prossimo capolavoro. Qui userai i cicli con contatore per creare immagini sbalorditive."
        },
        "coursef-2021/Simulating Experiments": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/lesson-5": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/AI for Oceans": {
          "overview": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/Internet": {
          "overview": "Anche se molte persone usano Internet ogni giorno, non molti sanno come funziona. In questa lezione, gli studenti faranno finta di navigare in Internet, imparando a conoscere connessioni, URL, indirizzi IP e DNS.",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursef-2021/End of Course Project": {
          "overview": "",
          "preparation": "-   Dedica del tempo alla creazione del tuo progetto con l'Artista e il Laboratorio dei personaggi. Acquisisci familiarità con le capacità e i limiti di ogni strumento.\n-   Modifica la griglia per adattarla agli obiettivi della tua classe e stampane una copia per ogni alunno.\n-   Modifica il foglio di lavoro per la progettazione del progetto per adattarlo alla tua classe e stampa un pacchetto per ogni alunno.",
          "purpose": "Alcuni alunni potrebbero essere impazienti di iniziare subito a costruire i loro progetti, ma questa lezione li aiuterà a trasformare le loro idee in una corretta pianificazione. Questa struttura manterrà i più sognatori coi piedi a terra ed illuminerà la strada a coloro a cui sembrerà di brancolare nel buio. Fornisci agli alunni tutto il tempo per costruire e rivedere i loro progetti. I tentativi e gli errori inevitabilmente coinvolti in questa lezione insegneranno la risoluzione dei problemi e la persistenza.",
          "student_overview": "Progetti così grandi richiedono tempo e molta pianificazione. Trova la tua ispirazione, sviluppa un piano e libera la tua creatività!"
        },
        "courseb-2021/Digital Trails": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "courseb-2021/Move It, Move It": {
          "overview": "",
          "preparation": "",
          "purpose": "Utilizzando il movimento fisico per programmare i loro compagni di classe, gli alunni incontreranno problemi ed emozioni simili a ciò che proveranno quando inizieranno a programmare su un computer. Incontrare questi stress in un ambiente giocoso e aperto aiuterà ad alleviare l'intensità e permetterà agli studenti di mettere in pratica le abilità necessarie prima che incontrino problemi da soli.",
          "student_overview": ""
        },
        "courseb-2021/Sequencing in Maze": {
          "overview": "Questa lezione darà agli studenti un'idea di cosa aspettarsi quando andranno nel laboratorio di informatica. Si comincia con una breve discussione introduttiva sui comportamenti da tenere in laboratorio, poi gli studenti inizieranno ad utilizzare un computer per completare degli esercizi online.",
          "preparation": "",
          "purpose": "In questa lezione, gli alunni svilupperanno abilità di programmazione e debugging su una piattaforma informatica. Il formato di questi esercizi in cui il codice è raffigurato da dei blocchi grafici, aiuta gli alunni ad apprendere i concetti base dell'informatica, senza doversi preoccupare di imparare una specifica sintassi.",
          "student_overview": ""
        },
        "courseb-2021/Programming in Maze": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "courseb-2021/Programming in Harvester": {
          "overview": "",
          "preparation": "",
          "purpose": "In questa lezione, gli alunni svilupperanno abilità nella risoluzione dei problemi e continueranno a sviluppare le loro capacità di programmazione.",
          "student_overview": ""
        },
        "courseb-2021/Loops: Getting Loopy": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "In questa lezione animeremo una festa con dei balli realizzati sfruttando i cicli!"
        },
        "courseb-2021/Loops in Harvester": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "courseb-2021/Loops in Collector": {
          "overview": "",
          "preparation": "",
          "purpose": "Questa lezione offre agli alunni più pratica con i cicli e li incoraggia a inserire più blocchi all'interno di una `ripetizione` mentre cercano di raccogliere più diamanti possibile.",
          "student_overview": ""
        },
        "courseb-2021/Loops in Artist": {
          "overview": "Tornando ai cicli, gli studenti imparano a disegnare immagini ripetendo semplici sequenze di istruzioni. Nella precedente lezione, i cicli sono stati utilizzati per attraversare un labirinto e raccogliere i diamanti. Qui, i cicli stanno creano dei modelli. Alla fine di questa lezione, gli studenti avranno l'opportunità di creare le proprie immagini utilizzando i cicli.",
          "preparation": "",
          "purpose": "Questa lezione offre una diversa prospettiva su come possono essere usati i cicli nella programmazione. Gli alunni metteranno alla prova le loro capacità di pensiero critico, valutando il codice fornito e determinando cosa bisogna aggiungere per risolvere un certo esercizio. Gli alunni qui possono riflettere anche sull'inefficienza della programmazione senza cicli `ripeti`, valutando quanti blocchi richiederebbe il programma senza l'aiuto di questa fondamentale istruzione.",
          "student_overview": ""
        },
        "courseb-2021/The Right App": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "courseb-2021/Events: The Big Event": {
          "overview": "Gli eventi sono un ottimo strumento per aggiungere variazioni ad un algoritmo già scritto. A volte si desidera che il proprio programma risponda all'utente esattamente quando l'utente ne ha bisogno. Gli eventi servono proprio a questo.",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "courseb-2021/Events in Play Lab": {
          "overview": "In questa attività online, gli studenti avranno l'opportunità di imparare a usare gli eventi del Laboratorio e di applicare tutte le competenze di programmazione che hanno imparato per creare un gioco animato. È il momento di essere creativi e costruire un gioco nel Laboratorio!",
          "preparation": "",
          "purpose": "In questa lezione tecnologica, gli alunni impareranno come usare gli eventi nel Laboratorio. Inizieranno addestrando un cavaliere a muoversi quando viene premuto un tasto freccia, per poi terminare con l'opportunità di mostrare nell'ultimo esercizio libero, tutte le competenze apprese durante il corso, tra cui le sequenze di istruzioni ed i cicli.",
          "student_overview": ""
        },
        "courseb-2021/lesson-1": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursea-2021/Safety in My Online Neighborhood": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursea-2021/Learn to Drag and Drop": {
          "overview": "Questa lezione darà agli studenti un'idea di cosa aspettarsi quando andranno nel laboratorio di informatica. Si comincia con una breve discussione introduttiva sui comportamenti da tenere in laboratorio, poi gli studenti inizieranno ad utilizzare un computer per completare degli esercizi online.",
          "preparation": "",
          "purpose": "Il traguardo di questa lezione è di introdurre gli alunni alle funzionalità di base dell'utilizzo dei computer, come fare clic con il mouse e trascinare e rilasciare gli oggetti sullo schermo. In questo modo si cerca di livellare le differenze di esperienza dei vari alunni, in vista degli esercizi futuri. Questa lezione offre anche una grande opportunità per introdurre la terminologia hardware di base del computer, che potenzialmente include \"mouse\", \"trackpad\" o \"touchscreen\", a seconda dei dispositivi.",
          "student_overview": ""
        },
        "coursea-2021/Programming: Happy Maps": {
          "overview": "Il passaggio da algoritmo a programmazione può essere più immediato se gli studenti capiscono la differenza tra pianificare una sequenza e codificare tale sequenza in un linguaggio opportuno. Questa attività aiuterà gli studenti ad acquisire esperienza leggendo e scrivendo del codice costituito da semplici simboli.",
          "preparation": "",
          "purpose": "Il passaggio da algoritmo a programmazione può essere più immediato se gli studenti capiscono la differenza tra pianificare una sequenza e codificare tale sequenza in un linguaggio opportuno. Questa attività aiuterà gli studenti ad acquisire esperienza leggendo e scrivendo del codice costituito da semplici simboli.",
          "student_overview": ""
        },
        "coursea-2021/Sequencing with Scrat": {
          "overview": "Questa lezione darà agli studenti un'idea di cosa aspettarsi quando andranno nel laboratorio di informatica. Si comincia con una breve discussione introduttiva sui comportamenti da tenere in laboratorio, poi gli studenti inizieranno ad utilizzare un computer per completare degli esercizi online.",
          "preparation": "",
          "purpose": "In questa lezione, gli alunni svilupperanno abilità di programmazione e debugging su una piattaforma informatica. Il formato di questi esercizi in cui il codice è raffigurato da dei blocchi grafici, aiuta gli alunni ad apprendere i concetti base dell'informatica, senza doversi preoccupare di imparare una specifica sintassi.",
          "student_overview": ""
        },
        "coursea-2021/Programming in Ice Age": {
          "overview": "",
          "preparation": "",
          "purpose": "In questa lezione, gli alunni svilupperanno abilità di programmazione e debugging su una piattaforma informatica. Il formato di questi esercizi in cui il codice è raffigurato da dei blocchi grafici, aiuta gli alunni ad apprendere i concetti base dell'informatica, senza doversi preoccupare di imparare una specifica sintassi.",
          "student_overview": ""
        },
        "coursea-2021/Programming with Rey and BB-8": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursea-2021/Loops: Happy Loops": {
          "overview": "I cicli sono uno strumento molto utile e potente nella programmazione. Per capire quanto utili possono essere, gli studenti dovranno essere condotti a desiderare un modo più semplice per risolvere problemi banali.",
          "preparation": "",
          "purpose": "Con questa lezione vengono introdotte le istruzioni di ripetizione (cicli). I cicli permettono agli alunni di semplificare i programmi raggruppando le istruzioni che devono essere ripetute. Gli alunni svilupperanno il pensiero critico, notando la ripetizione nei movimenti dei loro compagni di classe e determinando quante volte ripetere le istruzioni. Vedendo di nuovo \"Mappe Felici\", gli alunni avranno la possibilità di mettere in relazione concetti vecchi come le sequenze di istruzioni con il nuovo concetto delle istruzioni di ripetizione.",
          "student_overview": ""
        },
        "coursea-2021/Loops in Ice Age": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursea-2021/Loops in Collector": {
          "overview": "Basandosi sul concetto di istruzioni ripetute appreso in \"Cicli Felici\", in questa lezione gli studenti utilizzeranno i cicli per raccogliere dei diamanti su Code.org in modo più efficiente.",
          "preparation": "",
          "purpose": "Questa lezione offre agli alunni più pratica con i cicli e introduce un nuovo blocco, `prendi il tesoro`. Il blocco funziona esattamente come \"raccogli il mais\" nella Contadina. Questi esercizi sono più aperti e offrono agli alunni maggiore flessibilità per le loro soluzioni finali.",
          "student_overview": ""
        },
        "coursea-2021/Ocean Scene with Loops": {
          "overview": "Tornando ai cicli, gli studenti imparano a disegnare immagini ripetendo semplici sequenze di istruzioni. Nella precedente lezione, i cicli sono stati utilizzati per attraversare un labirinto e raccogliere i diamanti. Qui, i cicli stanno creano dei modelli. Alla fine di questa lezione, gli studenti avranno l'opportunità di creare le proprie immagini utilizzando i cicli.",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursea-2021/Events: The Big Event": {
          "overview": "Gli eventi sono un ottimo strumento per aggiungere variazioni ad un algoritmo già scritto. A volte si desidera che il proprio programma risponda all'utente esattamente quando l'utente ne ha bisogno. Gli eventi servono proprio a questo.",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursea-2021/Events in Play Lab": {
          "overview": "In questa attività online, gli studenti avranno l'opportunità di imparare a utilizzare gli eventi del Laboratorio e di applicare tutte le competenze di programmazione che hanno imparato per creare un gioco animato. È il momento di essere creativi e costruire una storia nel Laboratorio!",
          "preparation": "",
          "purpose": "Oggi gli alunni svilupperanno ulteriormente la loro comprensione della gestione degli eventi utilizzando il Laboratorio. Gli eventi sono molto comuni nella maggior parte dei programmi per computer. In questa attività, gli studenti useranno gli eventi per far muovere un personaggio sullo schermo, fare rumori e cambiare lo sfondo in base agli eventi scatenati dall'utente.",
          "student_overview": ""
        },
        "coursea-2021/lesson-1": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursec-2021/Putting a STOP to Online Meanness": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursec-2021/Programming: My Robotic Friends": {
          "overview": "",
          "preparation": "",
          "purpose": "Questa lezione tradizionale riunisce l'intera classe in un'unica squadra motivata da un semplice compito: condurre un \"robot\" ad accatastare dei bicchieri secondo uno schema predeterminato. Questa attività pone le basi per la programmazione che gli alunni faranno durante il corso, mentre comprendono l'importanza di definire un algoritmo nel modo più dettagliato e comprensibile possibile.",
          "student_overview": ""
        },
        "coursec-2021/Programming in Maze": {
          "overview": "",
          "preparation": "",
          "purpose": "In questa lezione, gli alunni svilupperanno abilità di programmazione e debugging su una piattaforma informatica. Il formato di questi esercizi in cui il codice è raffigurato da dei blocchi grafici, aiuta gli alunni ad apprendere i concetti base dell'informatica, senza doversi preoccupare di imparare una specifica sintassi.",
          "student_overview": ""
        },
        "coursec-2021/Debugging in Maze": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Cerca gli errori negli esercizi mettendo in pratica le tue capacità di debugging."
        },
        "coursec-2021/Programming in Collector": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Scrivi algoritmi per aiutare Laura l'avventuriera a raccogliere tanti diamanti!"
        },
        "coursec-2021/Programming in Artist": {
          "overview": "",
          "preparation": "",
          "purpose": "Basandosi sulle precedenti esperienze degli alunni con le sequenze di istruzioni, questa lezione servirà ad ispirare maggiore creatività nella programmazione. Con questa lezione si ha lo scopo di consolidare le conoscenze sulle sequenze di istruzioni, introducendo nuovi blocchi ed obiettivi. Utilizzando i nuovi blocchi a disposizione in questi esercizi, gli alunni acquisiscono maggiore dimestichezza con i pixel e gli angoli, mentre continuano a far pratica con le loro abilità di programmazione. Inoltre, gli alunni saranno in grado di concepire nuovi obiettivi come la programmazione dell'artista per disegnare un quadrato.",
          "student_overview": "Crea splendide immagini programmando l'artista."
        },
        "coursec-2021/Loops: My Loopy Robotic Friends": {
          "overview": "",
          "preparation": "",
          "purpose": "Questa lezione serve ad introdurre i cicli, usando l'ormai familiare insieme di istruzioni per programmare i \"robot\". Gli alunni sviluppano il pensiero critico cercando schemi di ripetizione nei movimenti dei compagni di classe e determinando come semplificare quegli schemi ripetuti usando i cicli.",
          "student_overview": ""
        },
        "coursec-2021/Loops with Rey and BB-8": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursec-2021/Loops in Harvester": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Usiamo i cicli per aiutare la contadina a raccogliere le sue verdure!"
        },
        "coursec-2021/Sticker Art with Loops": {
          "overview": "",
          "preparation": "",
          "purpose": "Questa serie di esercizi mette in evidenza la potenza il dei cicli in progetti creativi e personali.  \n\nIn questa lezione, da un esercizio al successivo, vengono mantenute le personalizzazioni introdotte nel codice, permettendo così agli alunni di costruire incredibili artefatti totalmente personali.",
          "student_overview": "In questa lezione i cicli permettono all'artista di realizzare immagini ancora più interessanti!"
        },
        "coursec-2021/Events: The Big Event": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Fai un gioco divertente per conoscere gli eventi."
        },
        "coursec-2021/Build a Flappy Game": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Costruisci il tuo personale gioco Flappy Bird e poi condividilo con i tuoi amici!"
        },
        "coursec-2021/Events in Play Lab": {
          "overview": "In questa attività online, gli studenti avranno l'opportunità di imparare a usare gli eventi del Laboratorio e di applicare tutte le competenze di programmazione che hanno imparato per creare un gioco animato. È il momento di essere creativi e costruire un gioco nel Laboratorio!",
          "preparation": "",
          "purpose": "Qui gli alunni svilupperanno ulteriormente la loro comprensione degli eventi utilizzando il Laboratorio. Gli alunni useranno i gestori di eventi per far muovere i personaggi sullo schermo, fare rumori e cambiare lo sfondo in base agli input dell'utente. Alla fine degli esercizi gli alunni avranno l'opportunità di condividere i loro progetti.  ",
          "student_overview": "È il momento di essere creativi e creare un gioco nel Laboratorio!"
        },
        "coursec-2021/Picturing Data": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursec-2021/Binary Bracelets": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Crea il tuo braccialetto binario personale e impara in che modo i computer ricordano le informazioni!"
        },
        "coursec-2021/End of Course Project: Create a Play Lab Game": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Sgranchisciti le dita per programmare alla grande! È ora di iniziare a realizzare il tuo progetto."
        },
        "coursed-2021/lesson-5": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursed-2021/Algorithms: Graph Paper Programming": {
          "overview": "",
          "preparation": "",
          "purpose": "Il traguardo di apprendimento che ci si pone con questa attività è lo sviluppo del pensiero critico e l'avvio del corso con entusiasmo, introducendo alcuni dei concetti fondamentali della programmazione che verranno utilizzati durante il corso. Presentando alla classe alcuni concetti base come la sequenza di istruzioni e gli algoritmi in un'attività tradizionale, anche gli alunni che sono intimoriti dai computer potranno costruirsi una base di comprensione su questi argomenti. In questa lezione, gli alunni impareranno come sviluppare un algoritmo e codificarlo in un programma. ",
          "student_overview": ""
        },
        "coursed-2021/Introduction to Online Puzzles": {
          "overview": "Negli esercizi di questa lezione, gli studenti inizieranno con un'introduzione (o un ripasso a seconda dell'esperienza della classe) dell'ambiente di lavoro online di Code.org. Con alcuni video verranno presentate le funzionalità di base dell'ambiente di lavoro, inclusi i pulsanti \"Esegui\", \"Ripristina\" e \"Fai un passo\". Altre indicazioni presentate in questi video: trascinamento, connessione ed eliminazione dei blocchi (questo tipo di programmazione a blocchi è denominata Blockly). Successivamente, gli studenti potranno esercitarsi nel labirinto con le sequenze di istruzioni e il debugging. Infine, gli studenti vedranno nuovi tipi di esercizi come la Collezionista, l'Artista e la Contadina, in cui impareranno le basi dei Cicli (istruzioni di ripetizione).",
          "preparation": "",
          "purpose": "Il livello ci comprensione di ogni materia è diversamente distribuito in ogni classe, alcuni alunni potrebbero essere maghi del computer, mentre altri potrebbero non avere molta dimestichezza. Questa lezione introduttiva per al Corso D è stata sviluppata proprio al fine di allineare il più possibile queste differenze e può essere usata sia come introduzione che come ripasso dell'ambiente di programmazione di Code.org e dei concetti di informatica trattati nei corsi precedenti. Questa lezione copre infatti tutti i prerequisiti necessari per iniziare il Corso D.",
          "student_overview": "Questa lezione ti permetterà di far pratica con le abilità di cui avrai bisogno in questo corso."
        },
        "coursed-2021/Relay Programming": {
          "overview": "",
          "preparation": "",
          "purpose": "Il lavoro di squadra è molto importante nell'informatica. Le squadre scrivono ed eseguono il debug del codice tra loro, invece di lavorare come individui. In questa lezione, gli alunni impareranno a lavorare insieme per essere il più efficienti possibile. \n\nQuesta attività fornisce anche un senso di urgenza che insegnerà agli alunni a bilanciare attentamente il loro tempo ed evitare errori senza rimanere troppo indietro. Quest'esperienza può essere stressante (cosa prevista!) Assicurati di fornire agli alunni gli strumenti per affrontare potenziali frustrazioni.",
          "student_overview": "Ricordi quando facevi i primi disegni con il coding all'inizio del corso? In questa lezione lavorerai in gruppo per fare qualcosa di molto simile!"
        },
        "coursed-2021/Debugging in Collector": {
          "overview": "In questa attività online, gli studenti si eserciteranno con il debugging nell'ambiente della Collezionista. Gli studenti potranno esercitarsi a leggere e correggere il codice per risolvere gli esercizi con semplici algoritmi contenenti cicli e cicli annidati.",
          "preparation": "",
          "purpose": "",
          "student_overview": "Hai mai avuto problemi durante la programmazione? In questa lezione imparerai i segreti del debugging: il processo di cercare e risolvere i problemi nel codice. "
        },
        "coursed-2021/Events in Bounce": {
          "overview": "In questa attività online, gli studenti impareranno cosa sono gli Eventi e come i computer li usano in programmi come i videogiochi. Gli studenti creeranno dei programmi che reagiscono agli Eventi (come la pressione dei pulsanti freccia). Alla fine della lezione, gli studenti avranno la possibilità di personalizzare il proprio gioco modificando velocità e suoni.",
          "preparation": "",
          "purpose": "Gli eventi sono molto usati nei programmi per computer, specialmente nei videogiochi.  \n\nIn questa lezione, gli alunni svilupperanno la loro comprensione degli eventi realizzando un gioco a tema sportivo. Gli alunni impareranno a far muovere la racchetta in base alla pressione dei tasti freccia ed a riprodurre dei suoni quando gli oggetti si scontrano. Alla fine potranno personalizzare il loro gioco per renderlo unico!",
          "student_overview": "Ti piacerebbe poter giocare con dei videogiochi a scuola? In questa lezione potrai crearne uno tutto tuo!"
        },
        "coursed-2021/Build a Star Wars Game": {
          "overview": "In questa lezione, gli studenti metteranno in pratica l'uso degli eventi per creare un gioco che potranno poi condividere online. Con R2-D2 e altri personaggi di Star Wars, gli studenti saranno guidati attraverso gli eventi, infine avranno un loro spazio per creare il loro gioco.",
          "preparation": "",
          "purpose": "",
          "student_overview": "Senti la Forza mentre costruisci il tuo gioco di Star Wars in questa lezione."
        },
        "coursed-2021/Dance Party": {
          "overview": "",
          "preparation": "",
          "purpose": "Questa lezione introduce i concetti fondamentali CS di codifica e programmazione di eventi (usando i blocchi).",
          "student_overview": ""
        },
        "coursed-2021/Loops in Ice Age": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursed-2021/Loops in Artist": {
          "overview": "",
          "preparation": "",
          "purpose": "Questa serie evidenzia la potenza dei cicli con una serie di esercizi pensati per far riflettere gli alunni sul perché i cicli \"ripeti\" sono superiori a quelli manoscritti.",
          "student_overview": ""
        },
        "coursed-2021/Nested Loops in Bee": {
          "overview": "In questa attività online, gli studenti avranno l'opportunità di spingere la loro comprensione dei Cicli ad un livello completamente nuovo. Giocando con l'Ape e gli Zombie, gli studenti impareranno a programmare un ciclo all'interno di un altro ciclo. Saranno anche incoraggiati ad indagare come dei piccoli cambiamenti in entrambi i cicli influenzano il programma quando si clicca su \"Esegui\".",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursed-2021/Conditionals with Cards": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "È ora di fare un gioco in cui guadagni punti solo a certe condizioni!"
        },
        "coursed-2021/lesson-6": {
          "overview": "",
          "preparation": "",
          "purpose": "Questa serie di esercizi contribuirà a consolidare e costruire l'apprendimento dei cicli e ad introdurre le istruzioni condizionali. Associando questi due concetti insieme, gli alunni saranno in grado di esplorare il potenziale per la creazione di programmi complessi e innovativi in un ambiente nuovo ed entusiasmante.",
          "student_overview": ""
        },
        "coursed-2021/Conditionals in Bee": {
          "overview": "Fino a questo momento gli studenti hanno scritto programmi che vengono eseguiti esattamente nello stesso modo ogni volta che vengono eseguiti - questo dà sicurezza, ma non è molto flessibile. In questa lezione, la classe inizierà a scrivere codice contenente istruzioni condizionali, questo permetterà di scrivere programmi che funzionano in modo diverso a seconda delle specifiche condizioni incontrate.",
          "preparation": "",
          "purpose": "",
          "student_overview": "Ora che hai capito le istruzioni condizionali, è ora di sfruttarle per programmare l'ape a raccogliere il nettare e fare il miele."
        },
        "coursed-2021/While Loops in Farmer": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "I cicli sono molto utili nella programmazione. Grazie a questa lezione imparerai un nuovo tipo di cicli: i cicli \"mentre\"!"
        },
        "coursed-2021/Until Loops in Maze": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursed-2021/End of Course Project": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Sgranchisciti le dita per programmare alla grande! È ora di iniziare a realizzare il tuo progetto."
        },
        "express-2021/Programming with Angry Birds": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "express-2021/Debugging with Scrat": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Cerca gli errori negli esercizi mettendo in pratica le tue capacità di debugging."
        },
        "express-2021/Collecting Treasure with Laurel": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "express-2021/Creating Art with Code": {
          "overview": "",
          "preparation": "",
          "purpose": "Basandosi sulle precedenti esperienze degli alunni con le sequenze di istruzioni, questa lezione servirà ad ispirare maggiore creatività nella programmazione. Con questa lezione si ha lo scopo di consolidare le conoscenze sulle sequenze di istruzioni, introducendo nuovi blocchi ed obiettivi. Utilizzando i nuovi blocchi a disposizione in questi esercizi, gli alunni acquisiscono maggiore dimestichezza con i pixel e gli angoli, mentre continuano a far pratica con le loro abilità di programmazione. Inoltre, gli alunni saranno in grado di concepire nuovi obiettivi come la programmazione dell'artista per disegnare un quadrato.",
          "student_overview": "Crea splendide immagini programmando l'artista."
        },
        "express-2021/Swimming Fish in Sprite Lab": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "express-2021/lesson-2": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "express-2021/lesson-3": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "express-2021/Virtual Pet with Sprite Lab": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "express-2021/lesson-1": {
          "overview": "",
          "preparation": "",
          "purpose": "Questa lezione introduce i concetti fondamentali CS di codifica e programmazione di eventi (usando i blocchi).",
          "student_overview": ""
        },
        "express-2021/Loops with Rey and BB-8": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "express-2021/Sticker Art with Loops": {
          "overview": "",
          "preparation": "",
          "purpose": "Questa serie di esercizi mette in evidenza la potenza il dei cicli in progetti creativi e personali.  \n\nIn questa lezione, da un esercizio al successivo, vengono mantenute le personalizzazioni introdotte nel codice, permettendo così agli alunni di costruire incredibili artefatti totalmente personali.",
          "student_overview": "In questa lezione i cicli permettono all'artista di realizzare immagini ancora più interessanti!"
        },
        "express-2021/Nested Loops in Maze": {
          "overview": "In questa attività online, gli studenti avranno l'opportunità di spingere la loro comprensione dei Cicli ad un livello completamente nuovo. Giocando con l'Ape e gli Zombie, gli studenti impareranno a programmare un ciclo all'interno di un altro ciclo. Saranno anche incoraggiati ad indagare come dei piccoli cambiamenti in entrambi i cicli influenzano il programma quando si clicca su \"Esegui\".",
          "preparation": "",
          "purpose": "",
          "student_overview": "Cicli all'interno di altri cicli, all'interno di altri cicli... Cosa significa? Questa lezione ti insegnerà cosa succede quando crei un ciclo annidato."
        },
        "express-2021/Snowflakes with Anna and Elsa": {
          "overview": "",
          "preparation": "",
          "purpose": "In questa lezione, gli alunni faranno pratica con i cicli annidati mentre creeranno meravigliose immagini da condivideranno con entusiasmo. \n\nUna volta avviati con un nucleo iniziale di istruzioni, gli alunni potranno prendere delle decisioni personali in merito alla creazione degli schemi da ripetere. Dopodiché li ripeteranno ulteriormente in vari modi per ottenere un capolavoro davvero unico.",
          "student_overview": ""
        },
        "express-2021/Looking Ahead with Minecraft ": {
          "overview": "",
          "preparation": "",
          "purpose": "Questa serie di esercizi contribuirà a consolidare e costruire l'apprendimento dei cicli e ad introdurre le istruzioni condizionali. Associando questi due concetti insieme, gli alunni saranno in grado di esplorare il potenziale per la creazione di programmi complessi e innovativi in un ambiente nuovo ed entusiasmante.",
          "student_overview": ""
        },
        "express-2021/If/Else with Bee": {
          "overview": "Fino a questo momento gli studenti hanno scritto programmi che vengono eseguiti esattamente nello stesso modo ogni volta che vengono eseguiti - questo dà sicurezza, ma non è molto flessibile. In questa lezione, la classe inizierà a scrivere codice contenente istruzioni condizionali, questo permetterà di scrivere programmi che funzionano in modo diverso a seconda delle specifiche condizioni incontrate.",
          "preparation": "",
          "purpose": "",
          "student_overview": "Ora che hai capito le istruzioni condizionali, è ora di sfruttarle per programmare l'ape a raccogliere il nettare e fare il miele."
        },
        "express-2021/While Loops with the Farmer": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "I cicli sono molto utili nella programmazione. Grazie a questa lezione imparerai un nuovo tipo di cicli: i cicli \"mentre\"!"
        },
        "express-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "express-2021/Until Loops in Maze": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "express-2021/Harvesting with Conditionals": {
          "overview": "Gli studenti si eserciteranno con i cicli `mentre`, i cicli `ripeti fino a che` e le istruzioni `se / altrimenti`. Tutti questi blocchi utilizzano delle istruzioni condizionali. Esercitandosi su tutti e tre, gli studenti impareranno a scrivere codice complesso e flessibile.",
          "preparation": "",
          "purpose": "Esercitandosi nell'uso delle istruzioni condizionali in diversi contesti, gli alunni sviluppano una comprensione completa di ciò che si può fare con questi strumenti. Nella lezione precedente, gli alunni hanno usato le istruzioni condizionali solo per muoversi in un labirinto. In questa lezione, useranno le istruzioni condizionali per aiutare la contadina a capire quando raccogliere le sue colture. Emergeranno nuovi schemi e gli alunni useranno la loro creatività ed il pensiero logico per determinare le condizioni in cui il codice deve essere eseguito e ripetuto.",
          "student_overview": "Non è sempre facile capire quale istruzione condizionale usare. Questa lezione ti aiuterà a prendere confidenza e imparare a fare le scelte corrette."
        },
        "express-2021/Functions in Minecraft": {
          "overview": "",
          "preparation": "",
          "purpose": "Gli alunni scopriranno la versatilità della programmazione con le funzioni, esercitandosi in vari ambienti. Qui, gli studenti riconosceranno modelli riutilizzabili e saranno in grado di incorporare blocchi con nome per chiamare funzioni predefinite.",
          "student_overview": "Riuscite a capire come utilizzare le funzioni per il codice più efficiente?"
        },
        "express-2021/Functions with Artist": {
          "overview": "Gli studenti saranno introdotti all'uso delle funzioni su Code.org. Nell'ambiente dell'Artista verranno create e modificate figure magnifiche sfruttando la potenza delle funzioni. Per schemi più complessi, gli studenti impareranno ad usare le funzioni annidate, richiamando una funzione dall'interno di un'altra.",
          "preparation": "",
          "purpose": "",
          "student_overview": "Crea disegni complessi più facilmente con le funzioni!"
        },
        "express-2021/Functions with Harvester": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Le funzioni ti faranno risparmiare un sacco di tempo, mentre aiuterai la contadina con il suo raccolto!"
        },
        "express-2021/lesson-4": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "express-2021/Variables with Artist": {
          "overview": "",
          "preparation": "",
          "purpose": "Le variabili sono essenzialmente dei segnaposto per valori che potrebbero essere sconosciuti al momento in cui si esegue il programma o per valori che possono cambiare durante l'esecuzione di un programma. Le variabili sono vitali per creare codice dinamico, perché consentono al programma di cambiare e crescere in base ad un numero qualsiasi di potenziali modifiche. Questa lezione rafforza la conoscenza delle variabili, facendo uso delle funzionalità di base per impostarle ed utilizzarle.",
          "student_overview": "In questa lezione realizzerai dei disegni usando le variabili che modificano il loro valore durante l'esecuzione del programma."
        },
        "express-2021/Changing Variables with Bee": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Quest'ape ama le variabili!"
        },
        "express-2021/For Loops with Bee": {
          "overview": "Questa lezione con l'Ape è dedicata ai cicli con contatore e l'uso di una variabile incrementale per risolvere esercizi più complicati. Gli studenti inizieranno ripassando i cicli delle lezioni precedenti, poi proseguiranno usando i cicli con contatore per risolvere più efficacemente problemi più complicati.",
          "preparation": "",
          "purpose": "",
          "student_overview": "Zzz Zzz. In questi esercizi guiderai l'ape fino al nettare e al miele usando i cicli con contatore!"
        },
        "express-2021/For Loops with Artist": {
          "overview": "In questa lezione, gli studenti continuano ad esercitarsi con i cicli, questa volta con l'Artista. Gli studenti completeranno gli esercizi combinando i concetti di variabili, cicli e cicli con contatore per creare progetti complessi. Alla fine avranno la possibilità di creare il proprio progetto in un esercizio libero.",
          "preparation": "",
          "purpose": "",
          "student_overview": "Preparati a creare il tuo prossimo capolavoro. Qui userai i cicli con contatore per creare immagini sbalorditive."
        },
        "express-2021/End of Course Project": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Sgranchisciti le dita per programmare alla grande! È ora di iniziare a realizzare il tuo progetto."
        },
        "pre-express-2021/Learn to Drag and Drop": {
          "overview": "Questa lezione darà agli studenti un'idea di cosa aspettarsi quando andranno nel laboratorio di informatica. Si comincia con una breve discussione introduttiva sui comportamenti da tenere in laboratorio, poi gli studenti inizieranno ad utilizzare un computer per completare degli esercizi online.",
          "preparation": "",
          "purpose": "Il traguardo di questa lezione è di introdurre gli alunni alle funzionalità di base dell'utilizzo dei computer, come fare clic con il mouse e trascinare e rilasciare gli oggetti sullo schermo. In questo modo si cerca di livellare le differenze di esperienza dei vari alunni, in vista degli esercizi futuri. Questa lezione offre anche una grande opportunità per introdurre la terminologia hardware di base del computer, che potenzialmente include \"mouse\", \"trackpad\" o \"touchscreen\", a seconda dei dispositivi.",
          "student_overview": ""
        },
        "pre-express-2021/Sequencing with Scrat": {
          "overview": "Questa lezione darà agli studenti un'idea di cosa aspettarsi quando andranno nel laboratorio di informatica. Si comincia con una breve discussione introduttiva sui comportamenti da tenere in laboratorio, poi gli studenti inizieranno ad utilizzare un computer per completare degli esercizi online.",
          "preparation": "",
          "purpose": "In questa lezione, gli alunni svilupperanno abilità di programmazione e debugging su una piattaforma informatica. Il formato di questi esercizi in cui il codice è raffigurato da dei blocchi grafici, aiuta gli alunni ad apprendere i concetti base dell'informatica, senza doversi preoccupare di imparare una specifica sintassi.",
          "student_overview": ""
        },
        "pre-express-2021/Programming in with Angry Birds": {
          "overview": "",
          "preparation": "",
          "purpose": "In questa lezione, gli alunni svilupperanno abilità di programmazione e debugging su una piattaforma informatica. Il formato di questi esercizi in cui il codice è raffigurato da dei blocchi grafici, aiuta gli alunni ad apprendere i concetti base dell'informatica, senza doversi preoccupare di imparare una specifica sintassi."
        },
        "pre-express-2021/Programming with Rey and BB-8": {
          "overview": "",
          "preparation": "",
          "purpose": "Sempre allo scopo di trasferire le conoscenze, in questa lezione viene fornito agli alunni un nuovo ambiente per far pratica con le abilità che stanno acquisendo. I fan di Star Wars salteranno di gioia quando vedranno questi esercizi. Ogni esercizio di questa serie è stato aggiunto per approfondire i concetti di base che utilizzeranno per il resto del corso."
        },
        "pre-express-2021/Programming in Harvester": {
          "overview": "",
          "preparation": "",
          "purpose": "In questa lezione, gli alunni svilupperanno abilità nella risoluzione dei problemi e continueranno a sviluppare le loro capacità di programmazione.",
          "student_overview": ""
        },
        "pre-express-2021/Loops with Scrat": {
          "overview": "",
          "preparation": "",
          "purpose": "In questa lezione, gli alunni impareranno altre cose sui cicli e su come implementarli con i blocchi Blockly. L'uso dei _cicli_ è un'abilità importante nella programmazione, perché la ripetizione manuale delle istruzioni è noiosa e inefficiente. Con gli esercizi di Code.org, gli alunni impareranno ad aggiungere istruzioni ai cicli esistenti, a riunire in cicli le sequenze di istruzioni ripetute e a riconoscere gli schemi che si ripetono e che devono essere ricondotti ad un ciclo.",
          "student_overview": ""
        },
        "pre-express-2021/Loops with Laurel": {
          "overview": "In questa lezione, gli alunni continuano ad apprendere il concetto di ciclo. Qui, Laura l'avventuriera usa i cicli per raccogliere diamanti negli spazi aperti delle caverne. Viene introdotto un nuovo blocco \"Prendi diamanti\" per aiutarla nel suo viaggio.",
          "preparation": "",
          "purpose": "Questa lezione offre agli alunni più pratica con i cicli e li incoraggia a inserire più blocchi all'interno di una `ripetizione` mentre cercano di raccogliere più diamanti possibile."
        },
        "pre-express-2021/Ocean Scene with Loops": {
          "overview": "Tornando ai cicli, gli studenti imparano a disegnare immagini ripetendo semplici sequenze di istruzioni. Nella precedente lezione, i cicli sono stati utilizzati per attraversare un labirinto e raccogliere i diamanti. Qui, i cicli stanno creano dei modelli. Alla fine di questa lezione, gli studenti avranno l'opportunità di creare le proprie immagini utilizzando i cicli.",
          "preparation": "",
          "purpose": "Questa lezione offre nuove prospettive di utilizzo creativo dei cicli nella programmazione. Qui gli alunni possono riflettere ulteriormente sull'inefficienza della programmazione senza cicli e rendersi conto di quanti blocchi richiederebbe il programma senza l'aiuto del ciclo `ripeti`.",
          "student_overview": ""
        },
        "pre-express-2021/Drawing Gardens with Loops": {
          "overview": "Tornando ai cicli, gli studenti imparano a disegnare immagini ripetendo semplici sequenze di istruzioni. Nella precedente lezione, i cicli sono stati utilizzati per attraversare un labirinto e raccogliere i diamanti. Qui, i cicli stanno creano dei modelli. Alla fine di questa lezione, gli studenti avranno l'opportunità di creare le proprie immagini utilizzando i cicli.",
          "preparation": "",
          "purpose": "Questa lezione offre una diversa prospettiva su come possono essere usati i cicli nella programmazione. Gli alunni metteranno alla prova le loro capacità di pensiero critico, valutando il codice fornito e determinando cosa bisogna aggiungere per risolvere un certo esercizio. Gli alunni qui possono riflettere anche sull'inefficienza della programmazione senza cicli `ripeti`, valutando quanti blocchi richiederebbe il programma senza l'aiuto di questa fondamentale istruzione.",
          "student_overview": ""
        },
        "pre-express-2021/On the Move with Events": {
          "overview": "In questa attività online, gli studenti avranno l'opportunità di imparare a utilizzare gli eventi del Laboratorio e di applicare tutte le competenze di programmazione che hanno imparato per creare un gioco animato. È il momento di essere creativi e costruire una storia nel Laboratorio!",
          "preparation": "",
          "purpose": "Oggi gli alunni svilupperanno ulteriormente la loro comprensione della gestione degli eventi utilizzando il Laboratorio. Gli eventi sono molto comuni nella maggior parte dei programmi per computer. In questa attività, gli studenti useranno gli eventi per far muovere un personaggio sullo schermo, fare rumori e cambiare lo sfondo in base agli eventi scatenati dall'utente.",
          "student_overview": ""
        },
        "pre-express-2021/A Royal Battle with Events": {
          "overview": "In questa attività online, gli studenti avranno l'opportunità di imparare a usare gli eventi del Laboratorio e di applicare tutte le competenze di programmazione che hanno imparato per creare un gioco animato. È il momento di essere creativi e costruire un gioco nel Laboratorio!",
          "preparation": "",
          "purpose": "In questa lezione tecnologica, gli alunni impareranno come usare gli eventi nel Laboratorio. Inizieranno addestrando un cavaliere a muoversi quando viene premuto un tasto freccia, per poi terminare con l'opportunità di mostrare nell'ultimo esercizio libero, tutte le competenze apprese durante il corso, tra cui le sequenze di istruzioni ed i cicli.",
          "student_overview": ""
        },
        "coursee-2021/Simon Says": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursee-2021/Learning Sprites with Sprite Lab": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursee-2021/Alien Dance Party with Sprite Lab": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursee-2021/lesson-4": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursee-2021/Private and Personal Information": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Internet è divertente ed emozionante, ma è anche importante muoversi in sicurezza. In questa lezione imparerai la differenza tra i dati che si possono condividere ed i dati personali da mantenere privati."
        },
        "coursee-2021/About Me": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursee-2021/Digital Sharing": {
          "overview": "",
          "preparation": "",
          "purpose": "Gli alunni creeranno presto progetti da condividere e la maggior parte di questi progetti conterrà codice o immagini che gli alunni non hanno creato da soli. Questa lezione serve a mostrare agli alunni il ​​modo corretto di gestire l'uso di contenuti che non hanno creato loro.",
          "student_overview": ""
        },
        "coursee-2021/Programming and Loops with the Artist": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursee-2021/Nested Loops in Artist": {
          "overview": "",
          "preparation": "",
          "purpose": "In questa attività online, gli alunni creeranno progetti con l'Artista che potranno orgogliosamente condividere con amici e parenti.  \n\nLo scopo di questa tipologia di attività è di utilizzare i cicli annidati come leva per far breccia nelle menti più artistiche, facendo capire che la programmazione può avere sbocchi molto creativi. Questa serie di esercizi è stata progettata per sviluppare il pensiero critico, la comprensione della geometria elementare e la creatività, tutto nell'ambito dei cicli annidati!",
          "student_overview": "Ancora cicli annidati! Questa volta realizzerai alcuni disegni STRAORDINARI con i cicli annidati."
        },
        "coursee-2021/Nested Loops in Frozen": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursee-2021/Functions: Songwriting": {
          "overview": "Una delle strutture più belle nell'informatica è la funzione. Le funzioni (a volte chiamate procedure) sono dei mini-programmi che è possibile utilizzare più e più volte all'interno di un programma più grande. Questa lezione aiuta gli studenti a comprendere intuitivamente perché raggruppare blocchi di codice all'interno di funzioni possa essere una pratica utile.",
          "preparation": "",
          "purpose": "L'uso delle funzioni aiuta a semplificare il codice e a sviluppare la capacità di organizzare il proprio programma. Gli alunni si renderanno rapidamente conto che la scrittura di funzioni permetterà di ridurre la lunghezza dei loro programmi, li renderà più facili da leggere e, di conseguenza, anche l'eventuale debugging  sarà più semplice.",
          "student_overview": "In un certo senso, anche le rockstar devono saper programmare. In questa lezione scoprirai le funzioni che si utilizzano nei testi delle canzoni."
        },
        "coursee-2021/Functions in Minecraft": {
          "overview": "",
          "preparation": "",
          "purpose": "Gli alunni scopriranno la versatilità della programmazione con le funzioni, esercitandosi in vari ambienti. Qui, gli studenti riconosceranno modelli riutilizzabili e saranno in grado di incorporare blocchi con nome per chiamare funzioni predefinite.",
          "student_overview": "Riuscite a capire come utilizzare le funzioni per il codice più efficiente?"
        },
        "coursee-2021/Functions in Artist": {
          "overview": "Gli studenti saranno introdotti all'uso delle funzioni su Code.org. Nell'ambiente dell'Artista verranno create e modificate figure magnifiche sfruttando la potenza delle funzioni. Per schemi più complessi, gli studenti impareranno ad usare le funzioni annidate, richiamando una funzione dall'interno di un'altra.",
          "preparation": "",
          "purpose": "",
          "student_overview": "Crea disegni complessi più facilmente con le funzioni!"
        },
        "coursee-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "",
          "preparation": "",
          "purpose": "Questa serie di esercizi contribuirà a consolidare e costruire l'apprendimento dei cicli e ad introdurre le istruzioni condizionali. Associando questi due concetti insieme, gli alunni saranno in grado di esplorare il potenziale per la creazione di programmi complessi e innovativi in un ambiente nuovo ed entusiasmante.",
          "student_overview": ""
        },
        "coursee-2021/Conditionals": {
          "overview": "Questa lezione introduce gli studenti allo studio dei cicli `mentre` e delle istruzioni `se / altrimenti`. _I cicli mentre_ sono cicli che continuano a ripetere le istruzioni finché una certa condizione è vera. I cicli mentre sono usati quando il programmatore non conosce a priori il numero esatto di volte che le istruzioni devono essere ripetute, ma conosce quale condizione debba essere vera per consentire al ciclo di continuare. Le istruzioni `se / altrimenti` offrono flessibilità nella programmazione eseguendo intere sezioni di codice solo se una certa condizione è vera, altrimenti viene eseguito un insieme di istruzioni alternativo.",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursee-2021/Functions in Harvester": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": "Le funzioni ti faranno risparmiare un sacco di tempo, mentre aiuterai la contadina con il suo raccolto!"
        },
        "coursee-2021/lesson-1": {
          "overview": "",
          "preparation": "",
          "purpose": "",
          "student_overview": ""
        },
        "coursee-2021/End of Course Project": {
          "overview": "",
          "preparation": "",
          "purpose": "Alcuni alunni potrebbero essere impazienti di iniziare subito a costruire i loro progetti, ma questa lezione li aiuterà a trasformare le loro idee in una corretta pianificazione. Questa struttura manterrà i più sognatori coi piedi a terra ed illuminerà la strada a coloro a cui sembrerà di brancolare nel buio. Fornisci agli alunni tutto il tempo per costruire e rivedere i loro progetti. I tentativi e gli errori inevitabilmente coinvolti in questa lezione insegneranno la risoluzione dei problemi e la persistenza.",
          "student_overview": "Progetti così grandi richiedono tempo e molta pianificazione. Trova la tua ispirazione, sviluppa un piano e libera la tua creatività!"
        }
      }
    }
  }
}