{
  "mn-MN": {
    "data": {
      "lessons": {
        "artist/Artist": {
          "overview": "Энэ хичээл дээр сурагчид зураачийг дэлгэцэн дээрх зургийг бөглөх ажлыг удирдан зохион байгуулна. Энэхүү уран бүтээлийн үе шат нь сурагчдад \"100 пикселээр урагшлах\", \"90 градусаар баруун тийш эргүүлэх\" зэрэг шинэ блокуудыг ашиглан илүү их төвөгтэй байдлыг бий болгох боломжийг олгоно.",
          "student_overview": "Зураачийг програмчлах замаар үзэсгэлэнтэй дүр төрхийг бий болгоно."
        },
        "sports/Sports": {
          "overview": "Энэ онлайн үйл ажиллагаанд сурагчид үйл явдлууд гэж юу болох, компьютерууд видео тоглоом гэх мэт програмуудад хэрхэн ашигладаг талаар олж мэдэх болно. Сурагчид таавруудыг ашиглан програмыг үйл явдлуудад хариу үйлдэл үзүүлэх болно (сумны товчлуур дарагдсан гэх мэт). Тааврын төгсгөлд сурагчид өөр өөр хурд, дуу чимээ ашиглан тоглоомоо өөрчлөх боломжтой болно.",
          "student_overview": "Сургуульд видео тоглоом тоглож байхыг хүсч байна уу? Энэ хичээл дээр та өөрөө тоглоомоо хийх хэрэгтэй болно!"
        },
        "basketball/Bounce": {
          "overview": "Энэ онлайн үйл ажиллагаанд сурагчид үйл явдлууд гэж юу болох, компьютерууд видео тоглоом гэх мэт програмуудад хэрхэн ашигладаг талаар олж мэдэх болно. Сурагчид таавруудыг ашиглан програмыг үйл явдлуудад хариу үйлдэл үзүүлэх болно (сумны товчлуур дарагдсан гэх мэт). Тааврын төгсгөлд сурагчид өөр өөр хурд, дуу чимээ ашиглан тоглоомоо өөрчлөх боломжтой болно.",
          "student_overview": "Сургуульд видео тоглоом тоглож байхыг хүсч байна уу? Энэ хичээл дээр та өөрөө тоглоомоо хийх хэрэгтэй болно!"
        },
        "jigsaw/Jigsaw": {
          "overview": "Энэ хичээл нь сурагчдад компьютерын лабораторид очиход юу хүлээж болох талаархи ойлголтыг өгөх болно. Энэ нь тэднийг компьютерын лабораторийн ажлын талаар танилцуулах товч хэлэлцүүлгээс эхэлж, дараа нь онлайнаар таавраа бөглөхөд компьютер ашиглана.",
          "student_overview": "Тааваруудыг дуусгахын тулд товшоод чирнэ үү."
        },
        "coursef-2021/Virtual Pet": {
          "overview": "Энэ хичээл дээр сурагчид интерактив Виртуал Гэрийн тэжээвэр амьтдыг бий болгож, тэд хүссэн зүйлээ хийж, зохицуулдаг. Сурагчид гэрийн тэжээвэр амьтдынхаа гадаад төрхийг тохируулахын тулд Шидтэний лабын \"Костюм\" хэрэгслийг ашиглана. Дараа нь тэд гэрийн тэжээвэр амьтдаа өөрийнхөө амьдралыг өгөхийн тулд сурсан үйл явдал, зан байдал, бусад ойлголтыг ашиглах болно!",
          "student_overview": "Энэ хичээл дээр сурагчид интерактив Виртуал Гэрийн тэжээвэр амьтдыг бий болгож, тэд хүссэн зүйлээ хийж, зохицуулдаг. Сурагчид гэрийн тэжээвэр амьтдынхаа гадаад төрхийг тохируулахын тулд Шидтэний лабын \"Костюм\" хэрэгслийг ашиглана. Дараа нь тэд гэрийн тэжээвэр амьтдаа өөрийнхөө амьдралыг өгөхийн тулд сурсан үйл явдал, зан байдал, бусад ойлголтыг ашиглах болно!"
        },
        "coursef-2021/lesson-2": {
          "student_overview": "Дарамтлах нь хэзээ ч зүгээр бус. Энэ хичээл нь юу болохыг зааж, онлайнаар хэлэхэд зүгээр биш юм."
        },
        "coursef-2021/Loops with the Artist": {
          "overview": "Цөөхөн тооны блок, дижитал наалт ашиглан өөрсдийн гоёмсог дизайн хийснээр сурагчийн нүүр царай гэрэлтэж байгааг анхаараарай! Энэ хичээл нь өмнөх хичээлүүдээс давталтын талаарх ойлголтыг бий болгож, сурагчдад жинхэнэ бүтээлч байх боломжийг олгодог. Энэхүү үйл ажиллагаа нь портфолио, эцэг эх/багш нарын бага хуралд зориулж олдвор үйлдвэрлэхэд үнэхээр гайхалтай юм.",
          "student_overview": "Энэ хичээл дээр гогцоо зураачтай хамтран илүү гоё зураг гаргахад хялбар болгоно!"
        },
        "coursef-2021/Variables that Change in Artist": {
          "overview": "Энэ хичээл дээр сурагчид Зургийн орчны хувьсагчийг ашиглан давтагдах загварыг бий болгох талаар судлах болно. Сурагчид код бичихэд хялбар, уншихад хялбар болгохын тулд хувьсагчийг хэрхэн ашиглаж болохыг сурч мэдэх болно. Удирдамж бүхий тааварыг хийсний дараа сурагчид өөрсдийн сурч мэдсэн зүйлээ харуулах, өөрсдийнхөө загварыг бий болгохын тулд чөлөөтэй тоглох дээр төгсгөл болно.",
          "student_overview": "Энэ хичээл дээр та програм ажиллаж байх үед өөрчлөгддөг хувьсагчуудыг ашиглан зураг зурах болно."
        },
        "coursef-2021/Nested Loops in the Maze": {
          "overview": "Энэхүү онлайн үйл ажиллагаанд сурагчид гогцоонуудын талаарх ойлголтыг цоо шинэ төвшинд хүргэх боломжтой болно. Зөгий ба Ургамал, Зомбиг тоглож байхдаа сурагчид өөр нэг гогцоо дотор байхаар гогцоог хэрхэн програмчлах талаар сурах болно. Тэдгээр нь \"Ажиллуулах\" товчийг дарахад хоёр гогцооны бага зэрэг өөрчлөлт нь тэдний програмд хэрхэн нөлөөлөхийг олж мэдэхийг зөвлөж байна.",
          "student_overview": "Гогцоонуудын дотор талын гогцоо. Энэ юу гэсэн үг вэ? Энэ хичээл дээр өөр гогцоон дотор гогцоо байрлуулахад юу тохиолдохыг танд зааж өгөх болно."
        },
        "coursef-2021/Variables that Change in Bee": {
          "overview": "Энэ хичээл нь код ажиллаж байх үед утгыг өөрчлөх замаар хувьсагчид хэрхэн програмуудыг илүү хүчтэй болгож болохыг харуулах болно. ",
          "student_overview": "Энэ зөгий хувьсагчдад дуртай!"
        },
        "coursef-2021/For Loop Fun": {
          "overview": "Гогцоонууд нь дахин дахин хийх боломжийг олгодог гэдгийг бид мэддэг бөгөөд одоо нэмэлт бүтэцтэй нэмэлт гогцоог хэрхэн ашиглах талаар сурах болно. Эдгээр шинэ бүтэц нь сурагчдад илүү хүчирхэг, динамик кодыг бий болгох боломжийг олгоно. ",
          "student_overview": "Та `-д зориулав` гогцооны талаар сурах их сонирхолтой байх болно!"
        },
        "coursef-2021/For Loops in Bee": {
          "overview": "Зөгийг онцолж үзвэл энэ хичээл нь `-д зориулав` гогцоо, илүү төвөгтэй таавруудыг шийдвэрлэхийн тулд өсгөх хувьсагчийг ашигладаг. Сурагчид өмнөх хичээлүүдийн давталтуудыг хянан үзэж эхлэх бөгөөд дараа нь `-д зориулав` гогцоо руу орвол тэд төвөгтэй асуудлыг илүү үр дүнтэй шийдвэрлэх боломжтой болно.",
          "student_overview": "Базз базз. Эдгээр таавар дээр та `-д зориулав` гогцоог ашиглан шүүс, зөгийн бал руу чиглүүлэх болно!"
        },
        "coursef-2021/For Loops in Artist": {
          "overview": "Энэ хичээл дээр сурагчид `-д зориулав` гогцоог үргэлжлүүлэн хийдэг боловч энэ удаад Зураачтай хамт байна. Сурагчид нарийн төвөгтэй дизайн гаргахын тулд хувьсагч, гогцоо ба `-д зориулав` гогцооны санааг нэгтгэсэн тааврыг дуусгах болно. Төгсгөлд нь тэд өөрсдийн уран бүтээлийг чөлөөтэй тоглох түвшинд гаргах боломж нээгдэнэ.",
          "student_overview": "Дараагийн бүтээлээ гаргахад бэлэн байгаарай. Энд та \"-д зориулав\\` гогцоо ашиглан гайхалтай зураг гаргах болно."
        },
        "coursef-2021/Simulating Experiments": {
          "overview": "Шидтэний лаб дээр энгийн загварчлал хийснээр сурагчид хандлага эсвэл хэв маягийг тодорхойлдог өгөгдлийг цуглуулахад тооцоолол хэрхэн ашиглаж болохыг мэдрэх болно. Симуляцийг олон удаа ажиллуулсны дараа сурагчид симуляци дахь хувьсагч хэрхэн өөрчлөгдөж байгаа нь үр дүнд хэрхэн нөлөөлж болохыг урьдчилан таамаглах, тэр таамаглалыг туршиж үзэх боломжтой болно.",
          "student_overview": "Хувьсагчдыг өөрчлөх замаар компьютер дээр симуляци ажиллуулж, туршилт хий."
        },
        "coursef-2021/Internet": {
          "overview": "Интернетийг өдөр бүр ашигладаг ч олон хүн үүнийг хэрхэн ажилладагийг мэддэггүй. Энэ хичээл дээр сурагчид холболт, URL хаяг, IP хаяг, DNS-ийг сурч байхдаа интернетээр дамжуулж дүр эсгэх болно.",
          "student_overview": "Мэдээлэл интернетээр хэрхэн дамждаг талаар бодож үзсэн үү? Энэ бол ид шид биш юм! Энэ хичээл нь интернет хэрхэн ажилладаг тухай танд заах болно."
        },
        "coursef-2021/End of Course Project": {
          "student_overview": "Энэ том төслүүд нь цаг хугацаа, маш их төлөвлөлт шаарддаг. Урам зоригоо олж, төлөвлөгөө боловсруулж, бүтээлч байдлаа нээ!"
        },
        "courseb-2021/Digital Trails": {
          "student_overview": "Өөрийн дижитал ул мөр, вэбсайтуудад зочлохдоо хэрхэн аюулгүй байх талаар олж мэдээрэй. "
        },
        "courseb-2021/Move It, Move It": {
          "overview": "Энэ хичээл нь сурагчдыг оюун ухааны хувьд энэ хичээлийн туршид тулгарах кодчилох дасгалд бэлтгэхэд туслах болно. Жижиг багуудад сурагчид зорилгодоо хүрэх хүртэл байрнаасаа нухацтай алхам алхмаар явахын тулд ангийнхан руу бие бялдрын дасгал ашигладаг.",
          "student_overview": "Ангийнхаа хүүхдүүдийг газраас газарт болгоомжтой алхам хийхийг програмчил."
        },
        "courseb-2021/Sequencing in Maze": {
          "overview": "Энэ хичээл нь сурагчдад компьютерын лабораторид очиход юу хүлээж болох талаархи ойлголтыг өгөх болно. Энэ нь тэднийг компьютерын лабораторийн ажлын талаар танилцуулах товч хэлэлцүүлгээс эхэлж, дараа нь онлайнаар таавраа бөглөхөд компьютер ашиглана.",
          "student_overview": "Улаан ууртай шувууг дэггүй гахайн замаар явахад нь тусална уу."
        },
        "courseb-2021/Programming in Maze": {
          "overview": "Мөсөн галав тоглоомын тэмдэгтүүдийг ашиглан сурагчид Скратыг ээдрээний нэг талаас царцдасын нөгөө тал руу шилжүүлэх дараалсан алгоритм боловсруулна. Үүнийг хийхийн тулд тэдгээр нь кодын блокуудыг шугаман дарааллаар байрлуулж, шулуун, зүүн эсвэл баруун тийш эргүүлнэ.",
          "student_overview": "Ууртай шувууг ээдрээгээр дамжин шилжихэд туслах программыг бүтээх."
        },
        "courseb-2021/Programming in Harvester": {
          "overview": "Сурагчид сурч мэдсэн програмчлалын тухай ойлголтуудыг Ургац хураалтын орчинд хэрэгжүүлэх болно. Одоо сурагчид тэмдэгтийг зорилгоо биелүүлэхийн оронд шинэ блок ашиглан эрдэнэ шиш цуглуулах хэрэгтэй болжээ. Сурагчид алгоритмын дарааллыг үргэлжлүүлэн боловсруулж, алдаа засах процессыг ашиглаж эхэлнэ. ",
          "student_overview": "Ургац хураагчид зам дагуу ногоо цуглуулахад нь тусал."
        },
        "courseb-2021/Loops: Getting Loopy": {
          "overview": "Бид илүү урт, сонирхолтой программ бичиж эхэлмэгц манай код ихэнхдээ олон давталт агуулдаг. Энэ хичээл дээр сурагчид бүжгийн хөдөлгөөний давтагдах хэв маягийг харах замаар давталт хийх зааврыг хялбархан дамжуулахын тулд гогцоог хэрхэн ашиглах талаар сурах болно.",
          "student_overview": "Энэ хичээл дээр бид давталтын гогцоо ашиглан бүжгийн үдэшлэг хийх болно!"
        },
        "courseb-2021/Loops in Harvester": {
          "overview": "\"Гогцоо авах\"-ын зааврыг давтах концепцийг бий болгосноор энэ үе шатанд сурагчид Code.org дээр эрдэнэ шишийг илүү үр дүнтэй цуглуулахын тулд гогцоо ашигладаг.",
          "student_overview": "Ургац хураахад гогцоо ашиглан илүү ихийг цуглуулахад тусална уу!"
        },
        "courseb-2021/Loops in Collector": {
          "overview": "Энэ хичээл дээр сурагчид гогцоо гэсэн ойлголтыг үргэлжлүүлэн сурч байна. Энд Лаурел адал явдал эрэгч нээлттэй агуйд эрдэнэс цуглуулахад гогцоо ашигладаг. Аялалд нь туслахын тулд шинэ \"эрдэнэс авах\" блокийг нэвтрүүлж байна.",
          "student_overview": "Лаурелыг адал явдал эрэгчээр нээлттэй агуйд эрдэнэс цуглуулахаар программчил."
        },
        "courseb-2021/Loops in Artist": {
          "overview": "Гогцоонууд руу буцаж ирэхэд сурагчид зааврын энгийн дарааллыг давтаж зураг зурж сурдаг. Өмнөх залгуурын хичээл дээр гогцоо нь ээдрээг туулах, эрдэнэс цуглуулахад ашиглагддаг байв. Энд сурагчид гогцоо хэв маягийг бий болгож байна. Энэ үе шатны төгсгөлд сурагчдад гогцоо ашиглан өөрсдийн зургийг бүтээх боломжийг олгоно.",
          "student_overview": "Зургийг дуусгахын тулд дүрс, гогцоо ашиглана уу."
        },
        "courseb-2021/The Right App": {
          "overview": "Компьютерийн шинжлэх ухаан нь бодит амьдрал дээр хүмүүст тусалж чадна гэдгийг энэ хичээлээс сурагчид хүлээн зөвшөөрч байна. Нэгдүгээрт, сурагчид хэд хэдэн хуурамч ухаалаг гар утасны хэрэглэгчидэд тэдний сэтгэлд нийцэж, тэдний хэрэгцээнд нийцсэн \"зөв програм\" олоход нь тусалдаг. Дараа нь сурагчид нэг нэмэлт хэрэглэгчийн хэрэгцээнд нийцсэн ухаалаг гар утасныхаа апп-ыг зурахдаа сэтгэлийн хөөрөл, бүтээлч байдлыг ашигладаг. ",
          "student_overview": "Ухаалаг гар утасны аппликэйшнийхээ зургийг зур."
        },
        "courseb-2021/Events: The Big Event": {
          "overview": "Үйл явдал бол урьдчилан бичсэн алгоритмд төрөл бүрийн зүйл нэмэх гайхалтай арга юм. Заримдаа таны програм яг хэрэглэгчид хүссэн тохиолдолд яг хариу өгөх чадвартай байдаг. Энэ л үйл явдалд зориулагдсан.",
          "student_overview": "Багш нар аварга том алсын товч дээр дарахад л хөдөлж, хашгираарай."
        },
        "courseb-2021/Events in Play Lab": {
          "overview": "Энэхүү онлайн үйл ажиллагаанд сурагчид Тоглоомын лаборатори дээр үйл явдлыг хэрхэн ашиглаж сурах, хүүхэлдэйн тоглоом үүсгэхэд сурсан кодчлолын бүх чадвараа ашиглах боломжтой болно. Тоглоомын лаборатори дээр бүтээлчээр тоглох цаг боллоо!",
          "student_overview": "Арга хэмжээ зохиох эсвэл интерактив тоглоом хийхийн тулд үйл явдлыг ашиглаарай."
        },
        "coursea-2021/Learn to Drag and Drop": {
          "overview": "Энэ хичээл нь сурагчдад компьютерын лабораторид очиход юу хүлээж болох талаархи ойлголтыг өгөх болно. Энэ нь тэднийг компьютерын лабораторийн ажлын талаар танилцуулах товч хэлэлцүүлгээс эхэлж, дараа нь онлайнаар таавраа бөглөхөд компьютер ашиглана.",
          "student_overview": "Тааваруудыг дуусгахын тулд товшоод чирнэ үү."
        },
        "coursea-2021/Programming: Happy Maps": {
          "overview": "Энэхүү салгагдаагүй хичээл нь багуудыг энгийн даалгавартай болгож, үр дүнд нь \"гялбаа\" авах. Сурагчид зааврыг өгөгдсөн тэмдэглэгээ рүү хөрвүүлэхийн тулд нарийн зааврыг бичиж дадлага хийдэг. Хэрэв кодонд асуудал гарвал сурагчид алдааг таньж, шийдэл гаргахын тулд хамтран ажиллах хэрэгтэй.",
          "purpose": "Алгоритмуудаас програмчлал хүртэлх гүүр нь сурагчид дараалал төлөвлөх, тухайн дарааллыг зохих хэлээр кодлох хоёрын ялгааг ойлгосон тохиолдолд богино байх боломжтой. Энэхүү үйл ажиллагаа нь сурагчдыг стенограф кодоор унших, бичих туршлага олж авахад тусална.",
          "student_overview": "Flurb-ийг жимсэнд хүргэх зааврыг бичнэ үү."
        },
        "coursea-2021/Sequencing with Scrat": {
          "overview": "Энэ хичээл нь сурагчдад компьютерын лабораторид очиход юу хүлээж болох талаархи ойлголтыг өгөх болно. Энэ нь тэднийг компьютерын лабораторийн ажлын талаар танилцуулах товч хэлэлцүүлгээс эхэлж, дараа нь онлайнаар таавраа бөглөхөд компьютер ашиглана.",
          "student_overview": "Царцдаст хүрэхийн тулд Scrat-ыг програмчлаарай."
        },
        "coursea-2021/Programming in Ice Age": {
          "overview": "Мөсөн галав тоглоомын тэмдэгтүүдийг ашиглан сурагчид Скратыг ээдрээний нэг талаас царцдасын нөгөө тал руу шилжүүлэх дараалсан алгоритм боловсруулна. Үүнийг хийхийн тулд тэдгээр нь кодын блокуудыг шугаман дарааллаар байрлуулж, шулуун, зүүн эсвэл баруун тийш эргүүлнэ.",
          "student_overview": "Scrat-г царцдаст хүрэхэд туслах програм бичнэ үү."
        },
        "coursea-2021/Programming with Rey and BB-8": {
          "overview": "Энэ хичээл дээр сурагчид BB-8 програмын тусламжтайгаар төвөгтэй сургалт хийхдээ илүү төвөгтэй аргаар шинэ мэдлэг олгох програмчлалын чадвараа ашиглана.",
          "student_overview": "BB-8 хаягдал металл цуглуулахад тусална уу."
        },
        "coursea-2021/Loops: Happy Loops": {
          "overview": "Энэ үйл ажиллагаа нь Аз жаргалтай Газрын зургийг дахин авч үзэх болно. Энэ удаад сурагчид өөрсдийн кодоороо илүү том, урт таавруудыг шийдэж, урт кодыг хялбархан бичих боломжийг олгодог бүтэц дэх ашиг тусыг олж харах болно.",
          "student_overview": "Flurb-ийг гогцоо ашиглан том асуудлуудыг шийдвэрлэхэд тусална уу."
        },
        "coursea-2021/Loops in Ice Age": {
          "overview": "\"Аз жаргалтай гогцоо\"-ны зааврыг давтах концепцийг бий болгосноор энэ үе шатанд сурагчид Code.org дээр царцдасыг илүү үр дүнтэй цуглуулахын тулд гогцоо ашигладаг.",
          "student_overview": "Scrat-ийг гогцоо ашиглан илүү их газар бүрхэхэд тусална уу."
        },
        "coursea-2021/Loops in Collector": {
          "overview": "Энэ хичээл дээр оюутнууд гогцоо гэсэн ойлголтыг үргэлжлүүлэн сурч байна. Өмнөх хичээл дээр сурагчдыг гогцоотой танилцуулж, ээдрээгээр явуулан эрдэнэ шиш түүлгэж авав. Энд гогцоог нээлттэй агуйд эрдэнэс цуглуулахад ашигладаг.",
          "student_overview": "Лаурел адал явдал эрэгчид эрдэнэсийг газар доор нь цуглуулахад нь тусал."
        },
        "coursea-2021/Ocean Scene with Loops": {
          "overview": "Гогцоонууд руу буцаж ирэхэд сурагчид зааврын энгийн дарааллыг давтаж зураг зурж сурдаг. Өмнөх залгуурын хичээл дээр гогцоо нь ээдрээг туулах, эрдэнэс цуглуулахад ашиглагддаг байв. Энд гогцоо хэв маягийг бий болгож байна. Энэ үе шатны төгсгөлд сурагчдад гогцоо ашиглан өөрсдийн зургийг бүтээх боломжийг олгоно.",
          "student_overview": "Зургийг дуусгахын тулд гогцоо, дүрсийг ашигла."
        },
        "coursea-2021/Events: The Big Event": {
          "overview": "Үйл явдал бол урьдчилан бичсэн алгоритмд төрөл бүрийн зүйл нэмэх гайхалтай арга юм. Заримдаа таны програм яг хэрэглэгчид хүссэн тохиолдолд яг хариу өгөх чадвартай байдаг. Энэ л үйл явдалд зориулагдсан.",
          "student_overview": "Багш нар аварга том алсын товч дээр дарахад л хөдөлж, хашгираарай."
        },
        "coursea-2021/Events in Play Lab": {
          "overview": "Энэхүү онлайн үйл ажиллагаанд сурагчид Тоглоомын лаборатори дээр үйл явдлыг хэрхэн ашиглаж сурах, хүүхэлдэйн тоглоом үүсгэхэд сурсан кодчлолын бүх чадвараа ашиглах боломжтой болно. Тоглоомын лаборатори дээр бүтээлчээр тоглож түүх бүтээх цаг боллоо!",
          "student_overview": "Өөрийнхөө тоглоом эсвэл түүхийг зохио."
        },
        "coursec-2021/Programming: My Robotic Friends": {
          "overview": "Сурагчид кодын оронд олон тооны тэмдэглэгээг ашиглан алгоритм боловсруулж, өөр өөр хэв маягаар аяга овоолох \"робот\" -ыг зааж өгнө. Сурагчид роботоор ээлжлэн оролцож, зөвхөн үе тэнгийнхнийхээ тодорхойлсон алгоритмд хариу өгөх болно. Энэ сегмент нь сурагчдад тэмдэг ба үйлдлийн хоорондын холбоо, алгоритм ба програмын ялгаа, алдаа засах үнэ цэнэтэй ур чадварыг заадаг.",
          "student_overview": "Энэ хичээл дээр та ангийнхныгаа робот мэт дүр үзүүлж, овоолсон аяганы загварыг бүтээхээр програмчилсан болно."
        },
        "coursec-2021/Programming in Maze": {
          "overview": "Angry Birds тоглоомын тэмдэгтүүдийг ашиглан сурагчид шувууг ээдрээний нэг талаас гахай руу нөгөө тал руу шилжүүлэх дараалсан алгоритм боловсруулна. Үүнийг хийхийн тулд тэдгээр нь кодын блокуудыг шугаман дарааллаар байрлуулж, шулуун, зүүн эсвэл баруун тийш эргүүлнэ.",
          "student_overview": "Ууртай шувуутай хамтарсан дараалал болон алгоритмын талаар олж мэдэх."
        },
        "coursec-2021/Debugging in Maze": {
          "overview": "Алдаа засах нь программ сурахад чухал элемент юм. Энэ хичээл дээр сурагчид буруу шийдсэн таавартай тулгарах болно. Буруу гогцоо, дутуу блок, нэмэлт блок, эмх цэгцгүй блок зэрэг алдааг олж тогтоохын тулд тэд одоо байгаа кодоороо алхам алхмаар явах шаардлагатай болно.",
          "student_overview": "Таавар дотор асуудал олж, алдаа засах чадвараа дадлагажуулна уу."
        },
        "coursec-2021/Programming in Collector": {
          "overview": "Энэхүү цуврал таавруудын үеэр сурагчид алгоритм болон алдаа засах талаарх ойлголтоо үргэлжлүүлэн хөгжүүлэх болно. Лаурель адал явдал хайгч хэмээх шинэ дүр төрхөөр сурагчид зам дагуу явж байхдаа Лаурелиар эрдэнэсийг авахуулахын тулд дараалсан алгоритмуудыг бий болгоно.",
          "student_overview": "Лаурель адал явдал хайгчид олон тооны эрдэнийн чулуу цуглуулахад туслах алгоритм бичнэ үү!"
        },
        "coursec-2021/Programming in Artist": {
          "overview": "Энэ хичээл дээр сурагчид зураачийг дэлгэцэн дээрх зургийг бөглөх ажлыг удирдан зохион байгуулна. Энэхүү уран бүтээлийн үе шат нь сурагчдад \"100 пикселээр урагшлах\", \"90 градусаар баруун тийш эргүүлэх\" зэрэг шинэ блокуудыг ашиглан илүү их төвөгтэй байдлыг бий болгох боломжийг олгоно.",
          "student_overview": "Зураачийг програмчлах замаар үзэсгэлэнтэй дүр төрхийг бий болгоно."
        },
        "coursec-2021/Loops: My Loopy Robotic Friends": {
          "overview": "\"Миний робот найзууд\" анхан шатны үйл ажиллагааг үндэслэн сурагчид илүү том, илүү төвөгтэй загваруудыг шийддэг. Эдгээр том загваруудыг дуусгахын тулд өөрсдийн \"роботууд\" -ыг програмчлахын тулд сурагчид зааврынхаа дагуу гогцоо хийж сольж болох загварыг давтаж тодорхойлох шаардлагатай болно.",
          "student_overview": "Энэ хичээл дээр та ангийнхаа хүүхдүүдийг дахин програмчлах болно, гэхдээ гогцоонуудыг ашигласнаар илүү том, илүү төвөгтэй асуудлыг шийдэх боломжтой болно."
        },
        "coursec-2021/Loops with Rey and BB-8": {
          "overview": "\"Гогцоо авах\"-ын зааврыг давтах концепцийг бий болгосноор энэ үе шатанд сурагчид Code. org дээр ээдрээ дундуур өмнөхөөс илүү үр дүнтэй явахын тулд гогцоо ашигладаг.",
          "student_overview": "BB-8-ийг гогцоо ашиглан ээдрээ дундуур дамжуулж тусална уу! "
        },
        "coursec-2021/Loops in Harvester": {
          "student_overview": "Ургац хураагчид хэдэн ногоо цуглуулахад туслах гогцоо ашиглацгаая!"
        },
        "coursec-2021/Sticker Art with Loops": {
          "student_overview": "Энэ хичээл дээр гогцоо зураачтай хамтран илүү гоё зураг гаргахад хялбар болгоно!"
        },
        "coursec-2021/Events: The Big Event": {
          "overview": "Сурагчид үйл явдлууд нь урьдчилан бичсэн алгоритмд уян хатан байдлыг нэмэх сайхан арга гэдгийг удахгүй мэдэх болно. Заримдаа таны програм яг хэрэглэгчид хүссэн тохиолдолд яг хариу өгөх чадвартай байдаг. Үйл явдал нь таны хөтөлбөрийг илүү сонирхолтой, интерактив болгож чаддаг.",
          "student_overview": "Үйл явдлын талаар мэдэхийн тулд хөгжилтэй тоглоом тоглоорой. "
        },
        "coursec-2021/Build a Flappy Game": {
          "overview": "Энэхүү тусгай үе шатанд сурагчид хулганы товшилт болон обьектуудын мөргөлдөөнийг илрүүлэх үйл явдлын зохицуулагчийг ашиглан өөрсдийн Хийсдэг шувуу тоглоомыг бүтээдэг. Түвшингийн төгсгөлд сурагчид харааны болон дүрмийг өөрчлөх замаар тоглоомоо тохируулах боломжтой болно.",
          "student_overview": "Өөрийн Хийсдэг шувуу тоглоомыг дуртай байдлаараа үүсгэж, найзуудтайгаа хуваалцаарай!"
        },
        "coursec-2021/Events in Play Lab": {
          "overview": "Энэхүү онлайн үйл ажиллагаанд сурагчид Тоглоомын лаборатори дээр үйл явдлыг хэрхэн ашиглаж сурах, хүүхэлдэйн тоглоом үүсгэхэд сурсан кодчлолын бүх чадвараа ашиглах боломжтой болно. Тоглоомын лаборатори дээр бүтээлчээр тоглох цаг боллоо!",
          "student_overview": "Play Lab-д бүтээлчээр тоглох цаг боллоо!"
        },
        "coursec-2021/Picturing Data": {
          "overview": "Мэдээллийг оюутнуудад өөрсдийн ертөнцийг ойлгох, сонирхолтой асуултанд хариулахад тусалдаг. Энэ хичээл дээр оюутнууд Play Lab төслөөс өгөгдөл цуглуулж, янз бүрийн график ашиглан дүрслэн харуулах болно.",
          "student_overview": "Мэдээллийг оюутнуудад өөрсдийн ертөнцийг ойлгох, сонирхолтой асуултанд хариулахад тусалдаг. Энэ хичээл дээр оюутнууд Play Lab төслөөс өгөгдөл цуглуулж, янз бүрийн график ашиглан дүрслэн харуулах болно."
        },
        "coursec-2021/Binary Bracelets": {
          "overview": "Хоёртын систем нь компьютерийн ертөнцөд маш чухал юм. Өнөөдөр компьютеруудын дийлэнх нь бүх төрлийн мэдээллийг хоёртын хэлбэрээр хадгалдаг. Энэ хичээл нь бодит амьдралаас ямар нэг зүйлийг олж авах, үүнийг асах унтрах цуврал эргэлтэд оруулах боломжтой болохыг харуулахад тусалдаг.",
          "student_overview": "Өөрийнхөө хоёртын бугуйвчийг үүсгэж компьютерууд мэдээллийг хэрхэн санаж байгааг сурч аваарай!"
        },
        "coursec-2021/End of Course Project: Create a Play Lab Game": {
          "overview": "Энэхүү capstone хичээл нь сурагчдад өөрсдийн Play Lab төслийг боловсруулах, хөгжүүлэх, үзүүлэх үйл явцыг авч үздэг! Энэ процесс жигд явагдахын тулд бид сурагчдад цаасан дээр төлөвлөхөөс эхлээд вэбсайтаа кодлох хүртэл алхам алхмаар бүтэц зохион бүтээсэн. Нэмж дурдахад бид багш нарт үзэсгэлэнгийн ширээг зохион байгуулахад туслах санаануудыг санал болгож байна! ",
          "student_overview": "Эдгээр гаруудыг олон тооны кодлоход бэлэн байгаарай! Төслөө барьж эхлэх цаг болжээ."
        },
        "coursed-2021/lesson-5": {
          "student_overview": "Энэ хичээл дээр та нууц үг таны мэдээллийг хэрхэн хамгаалах, сайн нууц үгийг хэрхэн хийх талаар мэдэх болно."
        },
        "coursed-2021/Algorithms: Graph Paper Programming": {
          "overview": "Зураг зурахдаа бие биенээ \"програмчлах\" замаар сурагчид програмчлалын зарим үндсэн ойлголтуудыг хөгжилтэй, хүртээмжтэй байдлаар мэдрэх боломжийг олж авдаг. Анги нь сурагчдыг дүрсийг ашиглан график цаасан дээр өнгөт квадратуудыг зурж, одоо байгаа зургийг хуулбарлахыг заах замаар эхэлнэ. Хэрэв цаг зав гарвал хичээл нь сурагчдын бүтээсэн зургаар дуусч болно.  ",
          "student_overview": "Энэ хичээлээр та найзуудаараа зураг зуруулахаар 'программч'-лал хийх болно!"
        },
        "coursed-2021/Introduction to Online Puzzles": {
          "overview": "Энэхүү таавруудын хүрээнд сурагчдад Code.org-ийн онлайн ажлын талбарыг танилцуулахаас (эсвэл танай ангийн туршлагаас хамааран тоймлон) эхлэх болно. Ажлын талбарын үндсэн функцийг харуулсан видео бичлэгүүд нь 'Ажиллуулах\\`, 'Шинэчлэх', 'Алхам' товчлууруудыг багтаасан болно. Эдгээр видео бичлэгүүд дээр бас ярилцсан: Blockly блокуудыг чирэх, Blockly блокуудыг устгах, Blockly блокуудыг холбох. Дараа нь оюутнууд лабораторид _дараалуулах_ ба _алдаа засах_ чадвараа дадлагажуулах болно. Тэндээс оюутнууд _гогцоо_ -ны үндсэн үндсийг сурч байхдаа цуглуулагч, зураач, ургац хураагч гэх мэт шинэ төрлийн тааврыг олж харах болно.",
          "student_overview": "Энэ хичээл нь танд шаардлагатай сургалтанд хамрагдах ур чадварын дадлага өгөх болно."
        },
        "coursed-2021/Relay Programming": {
          "student_overview": "Сургалтын эхэнд кодоор зураг зурснаа санаж байна уу? Энэ хичээл дээр та маш төстэй зүйлийг хийх багтай хамтарч ажиллах болно!"
        },
        "coursed-2021/Debugging in Collector": {
          "overview": "Энэ онлайн үйл ажиллагаанд сурагчид \"цуглуулагч\" орчинд алдаа засах дасгал хийх болно. Оюутнууд энгийн алгоритм, гогцоо, сараалжилсан гогцоотой таавар засахын тулд код уншиж, засварлах дадлага хийлгэх болно.",
          "student_overview": "Кодлох үедээ та асуудалтай тулгарч байсан уу? Энэ хичээл дээр та алдаа засах нууцын талаар олж мэдэх болно. Алдаа засах нь таны код доторх асуудлуудыг олох, засах үйл явц юм."
        },
        "coursed-2021/Events in Bounce": {
          "overview": "Энэ онлайн үйл ажиллагаанд сурагчид үйл явдлууд гэж юу болох, компьютерууд видео тоглоом гэх мэт програмуудад хэрхэн ашигладаг талаар олж мэдэх болно. Сурагчид таавруудыг ашиглан програмыг үйл явдлуудад хариу үйлдэл үзүүлэх болно (сумны товчлуур дарагдсан гэх мэт). Тааврын төгсгөлд сурагчид өөр өөр хурд, дуу чимээ ашиглан тоглоомоо өөрчлөх боломжтой болно.",
          "student_overview": "Сургуульд видео тоглоом тоглож байхыг хүсч байна уу? Энэ хичээл дээр та өөрөө тоглоомоо хийх хэрэгтэй болно!"
        },
        "coursed-2021/Build a Star Wars Game": {
          "overview": "Энэ хичээл дээр сурагчид онлайнаар хуваалцаж болох тоглоомыг бий болгохын тулд үйл явдлуудыг ашиглан дадлага хийх болно. R2-D2 болон бусад Оддын дайн киноны дүрүүдийг сурч байгаа сурагчид үйл явдлыг удирдан чиглүүлж, дараа нь өөрийн тоглоомоо зохиох орон зайг өгдөг.",
          "student_overview": "Энэ хичээл дээр өөрийн Оддын дайн тоглоомыг бүтээхдээ хүчийг мэдэр."
        },
        "coursed-2021/Dance Party": {
          "overview": "Энэ хичээл дээр сурагчид интерактив бүжгийн үдэшлэгээ зохиох болно. Энэ хэрэгсэл нь дуу хөгжимд хариу өгөх зорилгоор бүтээгдсэн тул дуу чимээ шаардагдана.",
          "student_overview": "Тэмдэглэх цаг боллоо! Энэ хичээл дээр та интерактив бүжгийн үдэшлэгээ програмчлах болно."
        },
        "coursed-2021/Loops in Ice Age": {
          "overview": "Гогцоог ашиглахын тулд хурдан шинэчлэх (эсвэл танилцуулга) болгохын тулд энэ үе шатанд сурагчдыг 'давталт' блок ашиглан Скратыг нэг эвэртэд илүү үр дүнтэй хүргэх боломжтой болно.",
          "student_overview": "Энэ хичээл дээр та Скратыг аль болох үр дүнтэй хүрэхэд туслах давталтыг ашиглана."
        },
        "coursed-2021/Loops in Artist": {
          "overview": "Энэ хичээл нь өмнөх хичээлүүдээс гогцооны талаарх ойлголтыг бий болгож, оюутнуудад жинхэнэ бүтээлч байх боломжийг олгодог. Энэ үйл ажиллагаа нь асуудлыг шийдвэрлэх практикт нэмэлт алдаа засах дасгал болж хоёр дахин нэмэгддэг.",
          "student_overview": "Энэ хичээл дээр гогцоо зураачтай хамтран илүү гоё зураг гаргахад хялбар болгоно!"
        },
        "coursed-2021/Nested Loops in Bee": {
          "overview": "Энэхүү онлайн үйл ажиллагаанд сурагчид гогцоонуудын талаарх ойлголтыг цоо шинэ төвшинд хүргэх боломжтой болно. Зөгий ба Ургамал, Зомбиг тоглож байхдаа сурагчид өөр нэг гогцоо дотор байхаар гогцоог хэрхэн програмчлах талаар сурах болно. Тэдгээр нь \"Ажиллуулах\" товчийг дарахад хоёр гогцооны бага зэрэг өөрчлөлт нь тэдний програмд хэрхэн нөлөөлөхийг олж мэдэхийг зөвлөж байна.",
          "student_overview": "Гогцоонуудын дотор талын гогцоо. Энэ юу гэсэн үг вэ? Энэ хичээл дээр өөр гогцоон дотор гогцоо байрлуулахад юу тохиолдохыг танд зааж өгөх болно."
        },
        "coursed-2021/Conditionals with Cards": {
          "student_overview": "Зөвхөн тодорхой нөхцөлд оноо авдаг тоглоом тоглох цаг болжээ!"
        },
        "coursed-2021/lesson-6": {
          "overview": "Энэ хичээлийг анх Minecraft-ийн багтай хамт Кодын цагт зориулан хийсэн. Сурагчид өнөөг хүртэл сурсан санаагаа дадлага хийх, нөхцөлт байдлаар санаануудаа турших боломжтой болно!",
          "student_overview": "Лаваас зайлсхий! Эндээс та Minecraft ертөнцийн нөхцлийн талаар мэдэх болно."
        },
        "coursed-2021/Conditionals in Bee": {
          "overview": "Энэ үеийг хүртэл сурагчид ажиллуулах болгондоо яг ижил байдлаар гүйцэтгэдэг кодыг бичиж байсан - найдвартай, гэхдээ тийм ч уян хатан биш. Энэ хичээл дээр танай анги програмын нөхцөлд тохирсон нөхцлөөс хамааран өөр өөр үүрэг гүйцэтгэдэг кодыг бичих боломжийг нөхцөлт кодоор бичиж эхэлнэ.",
          "student_overview": "Одоо та нөхцлийг ойлгосон тул зөгийгөөр шүүс цуглуулахдаа Зөгий програмыг ашиглах цаг болжээ."
        },
        "coursed-2021/While Loops in Farmer": {
          "student_overview": "Гогцоо нь кодчилоход маш их хэрэгтэй байдаг. Энэ хичээл нь танд шинэ төрлийн гогцоо буюу байхад гогцооны талаар заах болно!"
        },
        "coursed-2021/Until Loops in Maze": {
          "overview": "Энэ хичээл дээр сурагчид `хүртэл' гогцооны талаар сурах болно. Сурагчид хүссэн тэмдэгт зогсох цэгтээ хүрэх 'хүртэл` гол дүрийн давтагдах програмуудыг бүтээнэ.",
          "student_overview": "'Хүртэл' гогцоог хамтад нь ашиглахдаа та гайхалтай зүйлийг хийж чадна!"
        },
        "coursed-2021/End of Course Project": {
          "student_overview": "Эдгээр гаруудыг олон тооны кодлоход бэлэн байгаарай! Төслөө барьж эхлэх цаг болжээ."
        },
        "express-2021/Programming with Angry Birds": {
          "overview": "Angry Birds тоглоомын тэмдэгтүүдийг ашиглан сурагчид шувууг ээдрээний нэг талаас гахай руу нөгөө тал руу шилжүүлэх дараалсан алгоритм боловсруулна. Үүнийг хийхийн тулд тэдгээр нь кодын блокуудыг шугаман дарааллаар байрлуулж, шулуун, зүүн эсвэл баруун тийш эргүүлнэ.",
          "student_overview": "Ууртай шувуутай хамтарсан дараалал болон алгоритмын талаар олж мэдэх."
        },
        "express-2021/Debugging with Scrat": {
          "overview": "Алдаа засах нь программ сурахад чухал элемент юм. Энэ хичээл дээр сурагчид буруу шийдсэн таавартай тулгарах болно. Буруу гогцоо, дутуу блок, нэмэлт блок, эмх цэгцгүй блок зэрэг алдааг олж тогтоохын тулд тэд одоо байгаа кодоороо алхам алхмаар явах шаардлагатай болно.",
          "student_overview": "Таавар дотор асуудал олж, алдаа засах чадвараа дадлагажуулна уу."
        },
        "express-2021/Collecting Treasure with Laurel": {
          "overview": "Энэхүү цуврал таавруудын үеэр сурагчид алгоритм болон алдаа засах талаарх ойлголтоо үргэлжлүүлэн хөгжүүлэх болно. Лаурель адал явдал хайгч хэмээх шинэ дүр төрхөөр сурагчид зам дагуу явж байхдаа Лаурелиар эрдэнэсийг авахуулахын тулд дараалсан алгоритмуудыг бий болгоно."
        },
        "express-2021/Creating Art with Code": {
          "overview": "Энэ хичээл дээр сурагчид зураачийг дэлгэцэн дээрх зургийг бөглөх ажлыг удирдан зохион байгуулна. Энэхүү уран бүтээлийн үе шат нь сурагчдад \"100 пикселээр урагшлах\", \"90 градусаар баруун тийш эргүүлэх\" зэрэг шинэ блокуудыг ашиглан илүү их төвөгтэй байдлыг бий болгох боломжийг олгоно.",
          "student_overview": "Зураачийг програмчлах замаар үзэсгэлэнтэй дүр төрхийг бий болгоно."
        },
        "express-2021/Swimming Fish in Sprite Lab": {
          "overview": "Энэ хичээл дээр сурагчид Шидтэний лабын төвд байдаг шидтэн ба зан байдал гэсэн хоёр ойлголтын талаар олж мэдэх болно. Шидтнүүд нь сурагчдыг зөөх, өөрчлөх, удирдахад чиглэсэн тэмдэгт эсвэл объект юм. Зан төлөв гэдэг нь шидтэнг таслан зогсоох хүртэл тасралтгүй явагдах үйлдэл юм.",
          "student_overview": "Хэрхэн шидтэн үүсгэх, засварлах талаар олж мэдэх."
        },
        "express-2021/Virtual Pet with Sprite Lab": {
          "overview": "Энэ хичээл дээр сурагчид интерактив Виртуал Гэрийн тэжээвэр амьтдыг бий болгож, тэд хүссэн зүйлээ хийж, зохицуулдаг. Сурагчид гэрийн тэжээвэр амьтдынхаа гадаад төрхийг тохируулахын тулд Шидтэний лабын \"Костюм\" хэрэгслийг ашиглана. Дараа нь тэд гэрийн тэжээвэр амьтдаа өөрийнхөө амьдралыг өгөхийн тулд сурсан үйл явдал, зан байдал, бусад ойлголтыг ашиглах болно!",
          "student_overview": "Энэ хичээл дээр сурагчид интерактив Виртуал Гэрийн тэжээвэр амьтдыг бий болгож, тэд хүссэн зүйлээ хийж, зохицуулдаг. Сурагчид гэрийн тэжээвэр амьтдынхаа гадаад төрхийг тохируулахын тулд Шидтэний лабын \"Костюм\" хэрэгслийг ашиглана. Дараа нь тэд гэрийн тэжээвэр амьтдаа өөрийнхөө амьдралыг өгөхийн тулд сурсан үйл явдал, зан байдал, бусад ойлголтыг ашиглах болно!"
        },
        "express-2021/lesson-1": {
          "overview": "Энэ хичээл дээр сурагчид интерактив бүжгийн үдэшлэгээ зохиох болно. Энэ хэрэгсэл нь дуу хөгжимд хариу өгөх зорилгоор бүтээгдсэн тул дуу чимээ шаардагдана.",
          "student_overview": "Тэмдэглэх цаг боллоо! Энэ хичээл дээр та интерактив бүжгийн үдэшлэгээ програмчлах болно."
        },
        "express-2021/Loops with Rey and BB-8": {
          "student_overview": "BB-8-ийг гогцоо ашиглан ээдрээ дундуур дамжуулж тусална уу! "
        },
        "express-2021/Sticker Art with Loops": {
          "overview": "Цөөхөн тооны блок, дижитал наалт ашиглан өөрсдийн гоёмсог дизайн хийснээр сурагчийн нүүр царай гэрэлтэж байгааг анхаараарай! Энэ хичээл нь өмнөх хичээлүүдээс давталтын талаарх ойлголтыг бий болгож, сурагчдад жинхэнэ бүтээлч байх боломжийг олгодог. Энэхүү үйл ажиллагаа нь портфолио, эцэг эх/багш нарын бага хуралд зориулж олдвор үйлдвэрлэхэд үнэхээр гайхалтай юм.",
          "student_overview": "Энэ хичээл дээр гогцоо зураачтай хамтран илүү гоё зураг гаргахад хялбар болгоно!"
        },
        "express-2021/Nested Loops in Maze": {
          "overview": "Энэхүү онлайн үйл ажиллагаанд сурагчид гогцоонуудын талаарх ойлголтыг цоо шинэ төвшинд хүргэх боломжтой болно. Зөгий ба Ургамал, Зомбиг тоглож байхдаа сурагчид өөр нэг гогцоо дотор байхаар гогцоог хэрхэн програмчлах талаар сурах болно. Тэдгээр нь \"Ажиллуулах\" товчийг дарахад хоёр гогцооны бага зэрэг өөрчлөлт нь тэдний програмд хэрхэн нөлөөлөхийг олж мэдэхийг зөвлөж байна.",
          "student_overview": "Гогцоонуудын дотор талын гогцоо. Энэ юу гэсэн үг вэ? Энэ хичээл дээр өөр гогцоон дотор гогцоо байрлуулахад юу тохиолдохыг танд зааж өгөх болно."
        },
        "express-2021/Snowflakes with Anna and Elsa": {
          "overview": "Одоо сурагчид гогцоогоо хэрхэн яаж байрлуулахаа мэддэг болсон тул маш олон сайхан зүйлийг бүтээх боломжтой болжээ. Энэ хичээл нь Анна, Эльсагийн мөсөн дээр гулгах гойд чадварыг ашиглан сурагчдад цуврал дасгалуудаар дамжуулан өөрсдийн портфельд бэлэн зургийг бүтээхэд нь туслах болно!",
          "student_overview": "Анна, Эльса нар мөсөн гулгуурын маш сайн ур чадвартай боловч мөсөн дэх хэв маягийг бий болгоход таны тусламж хэрэгтэй байна. Хэт их ГАЙХАМШИГ үүсгэхийн тулд сараалжилсан гогцоо ашиглана уу. "
        },
        "express-2021/Looking Ahead with Minecraft ": {
          "overview": "Энэ хичээлийг анх Minecraft-ийн багтай хамт Кодын цагт зориулан хийсэн. Сурагчид өнөөг хүртэл сурсан санаагаа дадлага хийх, нөхцөлт байдлаар санаануудаа турших боломжтой болно!",
          "student_overview": "Лаваас зайлсхий! Эндээс та Minecraft ертөнцийн нөхцлийн талаар мэдэх болно."
        },
        "express-2021/If/Else with Bee": {
          "overview": "Энэ үеийг хүртэл сурагчид ажиллуулах болгондоо яг ижил байдлаар гүйцэтгэдэг кодыг бичиж байсан - найдвартай, гэхдээ тийм ч уян хатан биш. Энэ хичээл дээр танай анги програмын нөхцөлд тохирсон нөхцлөөс хамааран өөр өөр үүрэг гүйцэтгэдэг кодыг бичих боломжийг нөхцөлт кодоор бичиж эхэлнэ.",
          "student_overview": "Одоо та нөхцлийг ойлгосон тул зөгийгөөр шүүс цуглуулахдаа Зөгий програмыг ашиглах цаг болжээ."
        },
        "express-2021/While Loops with the Farmer": {
          "student_overview": "Гогцоо нь кодчилоход маш их хэрэгтэй байдаг. Энэ хичээл нь танд шинэ төрлийн гогцоо буюу байхад гогцооны талаар заах болно!"
        },
        "express-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "Энэ хичээлийг анх Minecraft-ийн багтай хамт Кодын цагт зориулан хийсэн. Сурагчид өнөөг хүртэл сурсан санаагаа дадлага хийх, нөхцөлт байдлаар санаануудаа турших боломжтой болно!",
          "student_overview": "Эндээс та Minecraft ертөнцийн нөхцлийн талаар мэдэх болно."
        },
        "express-2021/Until Loops in Maze": {
          "overview": "Энэ хичээл дээр сурагчид `хүртэл' гогцооны талаар сурах болно. Сурагчид хүссэн тэмдэгт зогсох цэгтээ хүрэх 'хүртэл` гол дүрийн давтагдах програмуудыг бүтээнэ.",
          "student_overview": "'Хүртэл' гогцоог хамтад нь ашиглахдаа та гайхалтай зүйлийг хийж чадна!"
        },
        "express-2021/Harvesting with Conditionals": {
          "overview": "Сурагчид `байхад` гогцоо,`хүртэл` гогцоо,`хэрэв/өөр` мэдэгдлээр дадлагажина. Эдгээр бүх блокууд нь нөхцлийг ашигладаг. Энэ гурвын дадлага хийснээр сурагчид нарийн төвөгтэй, уян хатан код бичиж сурах болно.",
          "student_overview": "Нөхцөл бүрийг хэзээ ашиглах нь үргэлж тодорхой байдаггүй. Энэ хичээл нь юу хийхээ шийдэх дадлага хийхэд тусална."
        },
        "express-2021/Functions in Minecraft": {
          "overview": "Сурагчид энэхүү хөгжилтэй, интерактив Minecraft-ийн адал явдалд ямар функцууд тустай болохыг ойлгож эхэлнэ!",
          "student_overview": "Хамгийн үр дүнтэй кодын хувьд функцийг хэрхэн ашиглахаа тодорхойлж чадах уу?"
        },
        "express-2021/Functions with Artist": {
          "overview": "Сурагчдад Зураачийн хамт функц ашиглах талаар танилцуулах болно. Уран бүтээл дэх функцүүдийн тусламжтайгаар гайхалтай зургийг бүтээх, өөрчлөх болно. Илүү төвөгтэй хэв маягийн хувьд сурагчид нэг үүргийг нөгөө функцээс дуудах замаар сараалжилсан функцийн талаар суралцах болно.",
          "student_overview": "Функцийг ашиглан нарийн төвөгтэй зургийг илүү хялбар болго!"
        },
        "express-2021/Functions with Harvester": {
          "overview": "Сурагчид зураач мэргэжлээр гайхалтай загвар зохион бүтээх дадлага хийж, Зөгий дээрх ээдрээнд навигац хийхээр хичээллэж байсан бол өнөөдөр Фермерт ургац хураахын тулд функц ашиглах болно. Энэ хичээл нь оюутнуудыг функцийг шинэ аргаар ашиглахад нь `байхад` гогцоо ба`хэрэв/өөр` мэдэгдлүүдтэй нэгтгэхэд түлхэц өгөх болно.",
          "student_overview": "Та ургац хураахад фермерт тусалж байгаа шиг функцүүд маш их ажлыг хэмнэх болно!"
        },
        "express-2021/Variables with Artist": {
          "overview": "Энэ хичээл дээр сурагчид Зургийн орчны хувьсагчийг ашиглан давтагдах загварыг бий болгох талаар судлах болно. Сурагчид код бичихэд хялбар, уншихад хялбар болгохын тулд хувьсагчийг хэрхэн ашиглаж болохыг сурч мэдэх болно. Удирдамж бүхий тааварыг хийсний дараа сурагчид өөрсдийн сурч мэдсэн зүйлээ харуулах, өөрсдийнхөө загварыг бий болгохын тулд чөлөөтэй тоглох дээр төгсгөл болно.",
          "student_overview": "Энэ хичээл дээр та програм ажиллаж байх үед өөрчлөгддөг хувьсагчуудыг ашиглан зураг зурах болно."
        },
        "express-2021/Changing Variables with Bee": {
          "overview": "Энэ хичээл нь код ажиллаж байх үед утгыг өөрчлөх замаар хувьсагчид хэрхэн програмуудыг илүү хүчтэй болгож болохыг харуулах болно. ",
          "student_overview": "Энэ зөгий хувьсагчдад дуртай!"
        },
        "express-2021/For Loops with Bee": {
          "overview": "Зөгийг онцолж үзвэл энэ хичээл нь `-д зориулав` гогцоо, илүү төвөгтэй таавруудыг шийдвэрлэхийн тулд өсгөх хувьсагчийг ашигладаг. Сурагчид өмнөх хичээлүүдийн давталтуудыг хянан үзэж эхлэх бөгөөд дараа нь `-д зориулав` гогцоо руу орвол тэд төвөгтэй асуудлыг илүү үр дүнтэй шийдвэрлэх боломжтой болно.",
          "student_overview": "Базз базз. Эдгээр таавар дээр та `-д зориулав` гогцоог ашиглан шүүс, зөгийн бал руу чиглүүлэх болно!"
        },
        "express-2021/For Loops with Artist": {
          "overview": "Энэ хичээл дээр сурагчид `-д зориулав` гогцоог үргэлжлүүлэн хийдэг боловч энэ удаад Зураачтай хамт байна. Сурагчид нарийн төвөгтэй дизайн гаргахын тулд хувьсагч, гогцоо ба `-д зориулав` гогцооны санааг нэгтгэсэн тааврыг дуусгах болно. Төгсгөлд нь тэд өөрсдийн уран бүтээлийг чөлөөтэй тоглох түвшинд гаргах боломж нээгдэнэ.",
          "student_overview": "Дараагийн бүтээлээ гаргахад бэлэн байгаарай. Энд та \"-д зориулав\\` гогцоо ашиглан гайхалтай зураг гаргах болно."
        },
        "express-2021/End of Course Project": {
          "student_overview": "Эдгээр гаруудыг олон тооны кодлоход бэлэн байгаарай! Төслөө барьж эхлэх цаг болжээ."
        },
        "pre-express-2021/Learn to Drag and Drop": {
          "overview": "Энэ хичээл нь сурагчдад компьютерын лабораторид очиход юу хүлээж болох талаархи ойлголтыг өгөх болно. Энэ нь тэднийг компьютерын лабораторийн ажлын талаар танилцуулах товч хэлэлцүүлгээс эхэлж, дараа нь онлайнаар таавраа бөглөхөд компьютер ашиглана.",
          "student_overview": "Тааваруудыг дуусгахын тулд товшоод чирнэ үү."
        },
        "pre-express-2021/Sequencing with Scrat": {
          "overview": "Энэ хичээл нь сурагчдад компьютерын лабораторид очиход юу хүлээж болох талаархи ойлголтыг өгөх болно. Энэ нь тэднийг компьютерын лабораторийн ажлын талаар танилцуулах товч хэлэлцүүлгээс эхэлж, дараа нь онлайнаар таавраа бөглөхөд компьютер ашиглана.",
          "student_overview": "Царцдаст хүрэхийн тулд Scrat-ыг програмчлаарай."
        },
        "pre-express-2021/Programming in with Angry Birds": {
          "overview": "Мөсөн галав тоглоомын тэмдэгтүүдийг ашиглан сурагчид Скратыг ээдрээний нэг талаас царцдасын нөгөө тал руу шилжүүлэх дараалсан алгоритм боловсруулна. Үүнийг хийхийн тулд тэдгээр нь кодын блокуудыг шугаман дарааллаар байрлуулж, шулуун, зүүн эсвэл баруун тийш эргүүлнэ."
        },
        "pre-express-2021/Programming with Rey and BB-8": {
          "overview": "Энэ хичээл дээр сурагчид BB-8 програмын тусламжтайгаар төвөгтэй сургалт хийхдээ илүү төвөгтэй аргаар шинэ мэдлэг олгох програмчлалын чадвараа ашиглана."
        },
        "pre-express-2021/Programming in Harvester": {
          "overview": "Сурагчид сурч мэдсэн програмчлалын тухай ойлголтуудыг Ургац хураалтын орчинд хэрэгжүүлэх болно. Одоо сурагчид тэмдэгтийг зорилгоо биелүүлэхийн оронд шинэ блок ашиглан эрдэнэ шиш цуглуулах хэрэгтэй болжээ. Сурагчид алгоритмын дарааллыг үргэлжлүүлэн боловсруулж, алдаа засах процессыг ашиглаж эхэлнэ. ",
          "student_overview": "Ургац хураагчид зам дагуу ногоо цуглуулахад нь тусал."
        },
        "pre-express-2021/Loops with Scrat": {
          "student_overview": "Scrat-ийг гогцоо ашиглан илүү их газар бүрхэхэд тусална уу."
        },
        "pre-express-2021/Loops with Laurel": {
          "overview": "Энэ хичээл дээр сурагчид гогцоо гэсэн ойлголтыг үргэлжлүүлэн сурч байна. Энд Лаурел адал явдал эрэгч нээлттэй агуйд эрдэнэс цуглуулахад гогцоо ашигладаг. Аялалд нь туслахын тулд шинэ \"эрдэнэс авах\" блокийг нэвтрүүлж байна."
        },
        "pre-express-2021/Ocean Scene with Loops": {
          "overview": "Гогцоонууд руу буцаж ирэхэд сурагчид зааврын энгийн дарааллыг давтаж зураг зурж сурдаг. Өмнөх залгуурын хичээл дээр гогцоо нь ээдрээг туулах, эрдэнэс цуглуулахад ашиглагддаг байв. Энд гогцоо хэв маягийг бий болгож байна. Энэ үе шатны төгсгөлд сурагчдад гогцоо ашиглан өөрсдийн зургийг бүтээх боломжийг олгоно.",
          "student_overview": "Зургийг дуусгахын тулд гогцоо, дүрсийг ашигла."
        },
        "pre-express-2021/Drawing Gardens with Loops": {
          "overview": "Гогцоонууд руу буцаж ирэхэд сурагчид зааврын энгийн дарааллыг давтаж зураг зурж сурдаг. Өмнөх залгуурын хичээл дээр гогцоо нь ээдрээг туулах, эрдэнэс цуглуулахад ашиглагддаг байв. Энд сурагчид гогцоо хэв маягийг бий болгож байна. Энэ үе шатны төгсгөлд сурагчдад гогцоо ашиглан өөрсдийн зургийг бүтээх боломжийг олгоно.",
          "student_overview": "Зургийг дуусгахын тулд дүрс, гогцоо ашиглана уу."
        },
        "pre-express-2021/On the Move with Events": {
          "overview": "Энэхүү онлайн үйл ажиллагаанд сурагчид Тоглоомын лаборатори дээр үйл явдлыг хэрхэн ашиглаж сурах, хүүхэлдэйн тоглоом үүсгэхэд сурсан кодчлолын бүх чадвараа ашиглах боломжтой болно. Тоглоомын лаборатори дээр бүтээлчээр тоглож түүх бүтээх цаг боллоо!",
          "student_overview": "Өөрийнхөө тоглоом эсвэл түүхийг зохио."
        },
        "pre-express-2021/A Royal Battle with Events": {
          "overview": "Энэхүү онлайн үйл ажиллагаанд сурагчид Тоглоомын лаборатори дээр үйл явдлыг хэрхэн ашиглаж сурах, хүүхэлдэйн тоглоом үүсгэхэд сурсан кодчлолын бүх чадвараа ашиглах боломжтой болно. Тоглоомын лаборатори дээр бүтээлчээр тоглох цаг боллоо!",
          "student_overview": "Арга хэмжээ зохиох эсвэл интерактив тоглоом хийхийн тулд үйл явдлыг ашиглаарай."
        },
        "coursee-2021/Simon Says": {
          "overview": "Энэ хичээл дээр сурагчид зөв үр дүнд хүрэхийн тулд тушаал өгөх шаардлагатай байгаа талаар бодоход нь туслах тоглоом тоглох болно. Энэ нь тэднийг дараагийн хичээлүүдэд Шидтэний лабораторийг хялбархан авч явахад тусална. ",
          "student_overview": "Тоглоом тоглож, зөв үр дүнд хүрэхийн тулд ямар команд шаардлагатайг бод."
        },
        "coursee-2021/Learning Sprites with Sprite Lab": {
          "overview": "Энэ хичээл дээр сурагчид Шидтэний лабын төвд байдаг шидтэн ба зан байдал гэсэн хоёр ойлголтын талаар олж мэдэх болно. Шидтнүүд нь сурагчдыг зөөх, өөрчлөх, удирдахад чиглэсэн тэмдэгт эсвэл объект юм. Зан төлөв гэдэг нь шидтэнг таслан зогсоох хүртэл тасралтгүй явагдах үйлдэл юм.",
          "student_overview": "Хэрхэн шидтэн үүсгэх, засварлах талаар олж мэдэх."
        },
        "coursee-2021/Alien Dance Party with Sprite Lab": {
          "overview": "Энэ хичээл нь сурагчдын өөрсдийн интерактив хөдөлгөөнт тоглоом, тоглоом үүсгэх боломжтой платформоор хангадаг Шидтэний лабораторитой. Өнөөдөр сурагчид зан төлөвөөс гадна \"харийнхны бүжгийн үдэшлэг\" -ийг бий болгох үйл явдлын хувьд хэрэглэгчийн оруулсан зүйлийг нэгтгэх болно.  ",
          "student_overview": "Create an interactive project that can be shared with classmates."
        },
        "coursee-2021/Private and Personal Information": {
          "student_overview": "Интернет нь хөгжилтэй, сэтгэл хөдлөм боловч аюулгүй байх нь чухал юм. Энэхүү хичээл нь хуваалцахад аюулгүй мэдээлэл ба хувийн мэдээлэл хоорондын ялгааг зааж өгдөг."
        },
        "coursee-2021/About Me": {
          "student_overview": "ШидтэнЛаб-тай интерактив зурагт хуудас хийснээр сурагчид вэб дээр хувийн болон өөрийн мэдээллийг хуваалцах талаарх ойлголтуудыг хэрэгжүүлнэ."
        },
        "coursee-2021/Digital Sharing": {
          "student_overview": "Энэ хичээлээр та өмчлөл ба зохиогчийн эрхийн асуудал, давуу талуудын талаар олж мэдэх болно. "
        },
        "coursee-2021/Programming and Loops with the Artist": {
          "overview": "Цөөхөн тооны блок, дижитал наалт ашиглан өөрсдийн гоёмсог дизайн хийснээр сурагчийн нүүр царай гэрэлтэж байгааг анхаараарай! Энэ хичээл нь өмнөх хичээлүүдээс давталтын талаарх ойлголтыг бий болгож, сурагчдад жинхэнэ бүтээлч байх боломжийг олгодог. Энэхүү үйл ажиллагаа нь портфолио, эцэг эх/багш нарын бага хуралд зориулж олдвор үйлдвэрлэхэд үнэхээр гайхалтай юм.",
          "student_overview": "Энэ хичээл дээр гогцоо зураачтай хамтран илүү гоё зураг гаргахад хялбар болгоно!"
        },
        "coursee-2021/Nested Loops in Artist": {
          "student_overview": "Илүү их сараалжилсан гогцоо! Энэ удаад та сараалжилсан гогцоотой зарим нэг ГАЙХАЛТАЙ зургийг хийх хэрэгтэй."
        },
        "coursee-2021/Nested Loops in Frozen": {
          "overview": "Одоо сурагчид гогцоогоо хэрхэн яаж байрлуулахаа мэддэг болсон тул маш олон сайхан зүйлийг бүтээх боломжтой болжээ. Энэ хичээл нь Анна, Эльсагийн мөсөн дээр гулгах гойд чадварыг ашиглан сурагчдад цуврал дасгалуудаар дамжуулан өөрсдийн портфельд бэлэн зургийг бүтээхэд нь туслах болно!",
          "student_overview": "Анна, Эльса нар мөсөн гулгуурын маш сайн ур чадвартай боловч мөсөн дэх хэв маягийг бий болгоход таны тусламж хэрэгтэй байна. Хэт их ГАЙХАМШИГ үүсгэхийн тулд сараалжилсан гогцоо ашиглана уу. "
        },
        "coursee-2021/Functions: Songwriting": {
          "overview": "Компьютерийн шинжлэх ухааны ертөнц дэх хамгийн гайхамшигтай бүтцийн нэг бол функц юм. Функцууд (заримдаа процедур гэж нэрлэдэг) нь жижиг програмууд бөгөөд үүнийг том програм дээрээ ашиглах боломжтой. Энэхүү хичээл нь оюутнуудад кодуудыг функцэд нэгтгэх нь яагаад ийм тустай практик болохыг ойлгоход тусалдаг.",
          "student_overview": "Рок одод ч гэсэн програмчлалын ур чадвар шаардагддаг. Энэ хичээл нь дууны үгсийг ашиглан функцын талаар заах болно."
        },
        "coursee-2021/Functions in Minecraft": {
          "overview": "Сурагчид энэхүү хөгжилтэй, интерактив Minecraft-ийн адал явдалд ямар функцууд тустай болохыг ойлгож эхэлнэ!",
          "student_overview": "Хамгийн үр дүнтэй кодын хувьд функцийг хэрхэн ашиглахаа тодорхойлж чадах уу?"
        },
        "coursee-2021/Functions in Artist": {
          "overview": "Сурагчдад Зураачийн хамт функц ашиглах талаар танилцуулах болно. Уран бүтээл дэх функцүүдийн тусламжтайгаар гайхалтай зургийг бүтээх, өөрчлөх болно. Илүү төвөгтэй хэв маягийн хувьд сурагчид нэг үүргийг нөгөө функцээс дуудах замаар сараалжилсан функцийн талаар суралцах болно.",
          "student_overview": "Функцийг ашиглан нарийн төвөгтэй зургийг илүү хялбар болго!"
        },
        "coursee-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "Энэ хичээлийг анх Minecraft-ийн багтай хамт Кодын цагт зориулан хийсэн. Сурагчид өнөөг хүртэл сурсан санаагаа дадлага хийх, нөхцөлт байдлаар санаануудаа турших боломжтой болно!",
          "student_overview": "Эндээс та Minecraft ертөнцийн нөхцлийн талаар мэдэх болно."
        },
        "coursee-2021/Conditionals": {
          "overview": "Энэ хичээл нь сурагчдад `байхад` гогцоо ба `хэрэв/өөр` тайлбартай танилцуулж байна. \\_ Хэдийгээр давталтууд нь нөхцлүүд үнэн бол командыг давтан хийдэг давталтууд юм. Програмчлагч нь тушаалуудыг хэдэн удаа давтахыг тодорхой мэдэхгүй тохиолдолд давталтыг ашигладаг боловч давталтыг үргэлжлүүлэхийн тулд програмчлагч ямар нөхцөл байх ёстойг мэддэг. `Хэрэв/Өөр` мэдэгдлүүд нь үнэн байвал зөвхөн кодын бүх хэсгийг ажиллуулах замаар програмчлалын уян хатан байдлыг санал болгодог. Үгүй бол өөр зүйл ажиллуулна.",
          "student_overview": "Та хөгжилтэй, бэрхшээлтэй цувралд тодорхой нөхцөлд юу хийхээ компьютерт зааж өгөх болно."
        },
        "coursee-2021/Functions in Harvester": {
          "overview": "Сурагчид зураач мэргэжлээр гайхалтай загвар зохион бүтээх дадлага хийж, Зөгий дээрх ээдрээнд навигац хийхээр хичээллэж байсан бол өнөөдөр Фермерт ургац хураахын тулд функц ашиглах болно. Энэ хичээл нь оюутнуудыг функцийг шинэ аргаар ашиглахад нь `байхад` гогцоо ба`хэрэв/өөр` мэдэгдлүүдтэй нэгтгэхэд түлхэц өгөх болно.",
          "student_overview": "Та ургац хураахад фермерт тусалж байгаа шиг функцүүд маш их ажлыг хэмнэх болно!"
        },
        "coursee-2021/lesson-1": {
          "overview": "Гипотетик апп-уудад ашиглах боломжтой шийдлүүдийг боловсруулах, хэлэлцэх замаар сурагчид нэвтрэх чанар, сэтгэлийн хөдөлгөөний үнэ цэнийг талаар олж мэднэ. "
        },
        "coursee-2021/End of Course Project": {
          "overview": "Дараагийн дөрвөн хичээл нь сурагчдад кодчилох чадвараа capstone төсөл дээр ашиглах боломжийг олгодог. Энэхүү төсөл нь хувь хүмүүст кодлох туршлага олж авах, үе тэнгийнхэн болон хайртай хүмүүстэйгээ хуваалцах үлгэр жишээ үзүүлэхэд тусална. Энэ нь сурагчид олон удаа эсвэл олон долоо хоногийн турш явагдах төсөл байх бөгөөд сурагчдын тархинд суралцах, зураг төсөл боловсруулах, бүтээх, дараа нь эцсийн ажлаа танилцуулах цагийг зарцуулдаг.\\\\r\n\\\\r\nСудлах шатанд сурагчид зураач, Шидтэний лабораторийн төслүүдийн жишээг урам зоригоор үзэх боломжтой болно. Дараа нь сурагчид дизайны үйл явц, түүнийг өөрийн төсөлд хэрхэн хэрэгжүүлэх талаар олж мэдэх болно. Дараа нь тэдэнд Зураач эсвэл Шидтэний лабораторийн аль алинд нь өөрсдийн төслийг бий болгох зай олгоно (энэ нь төслийн хамгийн урт үе байх болно). Эцэст нь сурагчид өөрсдийн хийж гүйцэтгэсэн ажлаа үе тэнгийнхэндээ танилцуулах боломжтой болно.",
          "student_overview": "Энэ том төслүүд нь цаг хугацаа, маш их төлөвлөлт шаарддаг. Урам зоригоо олж, төлөвлөгөө боловсруулж, бүтээлч байдлаа нээ!"
        },
        "csd6-2021/The Circuit Playground": {
          "overview": "Энэ хичээл дээр сурагчид хэлхээний тоглоомын талбайг ашигладаг програм бичих анхны боломжийг олж авдаг. Эхлээд самбарыг нүдээр харж, магадгүй таамаглал дэвшүүлсний дараа оюутнууд онлайнаар шилжиж, LED удирддаг програм бичиж сурах болно. Апп Лаб дэлгэцийг Хэлхээний тоглоомын талбайнуудтай нэгтгэснээр оюутнууд аажмаар самбарын элементүүдийг гаралтын төхөөрөмж болгон нэгтгэж, хэрэглэгчийн оролтод зориулан Аппын лабораторид найдаж эхэлдэг."
        },
        "csd6-2021/Input Unplugged": {
          "overview": "Аппын лабораторитай програмчлалыг гүнзгийрүүлэх бэлтгэлд бэлтгэхийн тулд оюутнууд Тоглоомын лаборатори ба Аппын лабораторид бичигдсэн цөөн хэдэн янзын програмууд нь хэрэглэгчийн оруулсан мэдээллийг хэрхэн зохицуулж байгааг судлах болно. Програмын жишээ програм дээр үзсэн хандлагыг харьцуулж, харьцуулсны дараа оюутнууд хоорондоо хэрхэн ажилладаг талаар илүү сайн ойлголттой болохын тулд оролтын хоёр өөр загвар (нөхцөлт хязгааргүй давталт ба асинхрон үйл явдлууд) -ийг нэгтгэн гаргадаг."
        },
        "csd6-2021/Analog Input": {
          "overview": "Энэ хичээл дээр сурагчид хүрээлэн буй орчны өөрчлөлтөд хариу үйлдэл үзүүлэх хөтөлбөр бичихдээ гурван аналог мэдрэгч (дуу, гэрэл, температур) -ийг хэрхэн ашиглаж болохыг судалжээ. Эдгээр мэдрэгчийг ашиглах нь хэрэглэгчид програмтай хэрхэн харьцдаг талаархи шилжилтийг тэмдэглэж байна. Мэдрэгчийг оролт болгон ашигласнаар апп-ын хэрэглэгч нь үүнтэй шууд харьцах шаардлагагүй бөгөөд эсхүл өөрийн хийж байгаагаа ухамсарлаж харилцаж чадахгүй."
        },
        "csd6-2021/The Program Design Process": {
          "overview": "Энэ хичээл нь сурагчдыг энэ нэгжийн туршид өөрсдийн програм зохиоход ашиглах үйл явцтай танилцуулдаг. Энэ үйл явц нь төслийн удирдамжийн дагуу төвлөрч, оюутнуудад дэлгэцийнхээ зургийг зурах, ашиглахаар төлөвлөж буй Хэлхээ тоглоомын талбайн элементүүдийг тодорхойлох, хувьсагчдыг тодорхойлох, үйл явдлыг програмчлахаас өмнө дүрслэхийг шаарддаг. Энэ үйл явц нь бид 3-р нэгжид ашигладаг Тоглоомын дизайнтай төстэй юм. Энэ хичээлээс сурагчид код нуугдаж буй туг тоглоомыг тоглож эхэлдэг. Тэд програмыг хийхийн тулд самбарын бүрэлдэхүүн хэсэг, үйл явдлууд болон хувьсагчид хэрэгтэй гэж үзсэн зүйлээ хэлэлцдэг. Дараа нь тэдэнд төсөл хэрэгжүүлэх нэг арга замыг харуулсан иж бүрэн төслийн гарын авлага өгдөг. Дараа нь сурагчид энэ үйл явцыг хэд хэдэн түвшинд дамжуулж явна. Хичээлийн төгсгөлд сурагчид программыг сайжруулж, түүнийг өөрийн болгох боломжтой."
        },
        "csd6-2021/Arrays and Color LEDs": {
          "overview": "Матриц гэдэг нь ихэвчлэн ижил төрлийн зүйлийг захиалсан цуглуулга юм. Энэ хичээл дээр сурагчид жагсаалтаас тодорхой эсвэл санамсаргүй утгыг индексжүүлэх замаар олж авах аргыг сурдаг. Дараа нь тэд хэлхээний тоглоомын талбай дээрх өнгөт LED-ийн ажиллагааг хянадаг өнгөтLED матриц руу хэрхэн нэвтрэх талаар сурч мэдсэн. Сурагчид LED бүрийн өнгө, эрчмийг хянаж, дараа нь сурч мэдсэн зүйлээ ашиглан өөрсдийн гэрэлтдэг тоглоомын талбай дээр гэрлийн шоу үүсгэхийн тулд гэрлийн загвар зохион бүтээхэд ашиглана."
        },
        "csd6-2021/Arrays and For Loops": {
          "overview": "Матриц дахь бүх элементүүдийг давтахын тулд \\_-д зориулав давталт ашиглах нь ихэнх програмчлалын хэл дээр үнэхээр хэрэгтэй бүтэц юм. Энэ хичээл дээр сурагчид энэ загварыг сурч эхлэхийн тулд жагсаалт болон давталтын талаар олж мэдсэн зүйлээ нэгтгэдэг. Сурагчид гогцоог ашиглан жагсаалтын элемент тус бүрийг нэг нэгээр нь оруулаад элемент тус бүр дээр код бичих шаардлага гардаг. Хичээлийн төгсгөлд сурагчид үүнийг самбар дээрх `өнгөтLed` жагсаалтад оруулан ашиглах ба товчийг дарах тоолонд LED-г бүгдийг өөрчилдөг апп бүтээх жагсаалт гаргана."
        },
        "csd6-2021/Accelerometer": {
          "overview": "Энэ хичээл дээр сурагчид хурдатгал хэмжигч ба түүний боломжийг судлах болно. Тэд түүний үйл явдал, шинж чанаруудтай танилцах, мөн бодит ертөнцийн хэрэглээнд тохиолдсонтой адил хурд хэмжигчийг ашиглан олон програмыг бүтээх болно."
        },
        "csd6-2021/Functions with Parameters": {
          "overview": "Хичээл нь саяхан сурагчдын харсан Апп Лаб блокуудын агуулгын дагуу параметрүүдийг хурдан хянаж үзэхээс эхэлдэг. Сурагчид дараа нь App Lab дахь хэрэглэгчийн үүсгэсэн функцуудын параметрүүдийн жишээг үзэж, дэлгэцэн дээрх олон элементүүдийг хянахын тулд параметрүүдийг ашиглан функц үүсгэж, дууддаг. Үүний дараа оюутнууд матриц дээр давталт хийх гогцоог ашигладаг бөгөөд элемент бүрийг функц болгон хувиргадаг. Эцэст нь сурагчид сурсан зүйлээ ашиглан оддыг татах тоглоомыг бий болгодог."
        },
        "csd6-2021/Circuits and Physical Prototypes": {
          "overview": "Энэ бүлгийн эцсийн төсөлд бэлтгэхийн тулд сурагчид Дугуй тоглоомын талбайг багтаасан физик объектын прототипийг хэрхэн боловсруулах талаар суралцах болно. Төслийн төлөвлөлтийн загварчлалын гарын авлага ашиглан сурагчид хэд хэдэн энгийн хэлхээг хэрхэн яаж хийхийг сурч, бүтээгдэхүүний төлөвлөсөн загварыг дамжуулах чадвартай, жишээ нь картон, сувгийн соронзон хальс гэх мэт хямд, амархан олж авсан материалуудыг ашиглаж сурах болно."
        },
        "csd6-2021/Project: Prototype an Innovation": {
          "overview": "Хичээлийн энэхүү эцсийн төсөлд оюутнуудын баг Хэлхээ тоглоомын талбай дээр суурилсан шинэлэг тооцоолох төхөөрөмжийн прототипийг боловсруулж туршихаар болжээ. Самбар дээр байгаа оролт, гаралтыг ашиглан бүлгүүд нь сонирхолтой, өвөрмөц харилцан үйлчлэл хийх боломжийг олгодог программыг бий болгоно. "
        }
      }
    }
  }
}