{
  "sk-SK": {
    "data": {
      "lessons": {
        "csd5-2022/CS Discoveries Post-Course Survey": {
          "name": "Objavujeme informatiku: Záverečný dotazník"
        },
        "csd3-2022/Programming for Entertainment": {
          "name": "Programovanie pre zábavu",
          "overview": "**Otázka dňa: Aké využitie má informatika v zábavnom priemysle?**\n\nNa začiatku nášho kurzu sa zamyslíme nad „problémami“ nudy a sebavyjadrenia a nad spôsobmi, ako k týmto problémom pristupujeme v našom živote. Preskúmame, akú úlohu v tejto oblasti zohrávajú informatika a programovanie  - či ako špecifická forma zábavy alebo ako prostriedok na sebavyjadrenie.",
          "purpose": "Cieľom tejto hodiny je začať tento programovací tematický celok spôsobom, ktorý zaujme žiakov s rôznym zázemím a záujmami. Hoci sa v závere tejto lekcie od žiakov žiada, aby vytvorili hru, mali by ste sa vyhnúť tomu, aby ste na začiatku kládli veľký dôraz na _videohry_. Namiesto toho sa pokúsime rozšíriť rozhľad žiakov o tom, aký význam má programovanie pre formu zábavy alebo sebavyjadrenia, ktorá je osobne pútavá. To poskytne žiakom základ, ku ktorému sa budú vracať počas celej jednotky, keď budú uvažovať o možných využitiach rôznych programátorských zručností, ktoré si osvoja.",
          "student_overview": "**Otázka dňa: Ako sa informatika využíva pre zábavu?**\n\nV tejto lekcii preskúmaš, akú úlohu zohráva informatika a najmä programovanie v zábavnom priemysle a pri sebavyjadrovaní."
        },
        "csd3-2022/Plotting Shapes": {
          "name": "Kreslenie tvarov",
          "overview": "\\*\\*Otázka dňa: Ako môžeme dať jasné pokyny, ako niečo nakresliť na obrazovku?\n\nŽiaci skúmajú problémy spojené s dávaním pokynov na kreslenie pomocou tvarov a používajú nástroj, ktorý predstavuje, ako sa k tomuto problému pristupuje v Game Labe. Úvodná zahrievacia aktivita rýchlo demonštruje problémy s poskytovaním informácií o polohe bez nejakého spoločného referenčného bodu. V hlavnej aktivite žiaci skúmajú nástroj Game Lab, ktorý umožňuje žiakom interaktívne umiestňovať tvary na mriežku 400 x 400 v Game Labe. Potom striedavo dávajú partnerovi pokyny, ako pomocou tohto nástroja nakresliť skrytý obrázok, pričom zohľadňujú mnohé výzvy, s ktorými sa žiaci stretnú pri programovaní v Game Labe. Pred záverečnou diskusiou si žiaci môžu podľa vlastného uváženia vytvoriť vlastný obrázok, o ktorom budú hovoriť.",
          "purpose": "Hlavným cieľom tejto lekcie je oboznámiť žiakov so súradnicovým systémom, ktorý budú používať v Game Labe. Žiaci môžu mať obmedzené skúsenosti s používaním súradnicovej siete alebo môžu mať problémy s „prevrátenou“ osou y v Game Labe. Nástroj na kreslenie tiež núti žiakov premýšľať o ďalších funkciách Game Labu, s ktorými sa žiaci stretnú, keď začnú programovať v nasledujúcej lekcii. Medzi ne patrí potreba zohľadniť poradie pri kreslení, potreba určiť farbu a skutočnosť, že kruhy sa umiestňujú podľa svojho stredu a štvorce podľa ľavého horného rohu. Na konci tejto aktivity by mali byť žiaci pripravení využiť to, čo sa naučili o oznamovaní polohy, pri programovaní, ktorému sa budú venovať v nasledujúcej lekcii.",
          "student_overview": "**Otázka dňa: Ako môžeme dať jasné pokyny, ako niečo nakresliť na obrazovku?**\n\nV tejto lekcii preskúmaš výzvy, ktoré musí človek prekonať, keď chce jasne odkomunikovať pokyny. V prostredí Game Lab budeš kresliť tvary na mriežke."
        },
        "csd3-2022/Drawing in Game Lab": {
          "name": "Kreslenie v Game Labe",
          "overview": "**Otázka dňa: Ako dáme pokyn počítaču, aby nakreslil na obrazovku konkrétny tvar?**\n\nV rámci tohto tematického celku sa oboznámime s programovacím prostredím Game Labu. Na úvod sa naučíme umiestniť tvary na konkrétne miesto na mriežke. Ďalej sa oboznámime s dôležitosťou správnej postupnosti príkazov, vyskúšame si hľadanie a opravovanie chýb a naučíme sa niekoľko jednoduchých príkazov. Na konci hodiny vytvoríme online verziu obrázka navrhnutého v predchádzajúcej lekcii.",
          "purpose": "Hlavným cieľom tejto hodiny je dať žiakom možnosť oboznámiť sa s programovacím prostredím, ako aj so základnými postupnosťami a ladením, ktoré budú používať počas celého tematického celku. Žiaci sa na začiatku oboznámia s interaktívnym vývojovým prostredím (IDE) Game Labu, potom sa naučia tri príkazy ([\\`rect\\`(#4dd0e1)](/docs/gamelab/rect/), [\\`ellipse\\`(#4dd0e1)](/docs/gamelab/ellipse/) a [\\`fill\\`(#4dd0e1)](/docs/gamelab/fill/)), ktoré budú potrebovať na programovanie rovnakých typov obrázkov, aké vytvorili na papieri v predchádzajúcej lekcii.  Úrovne úloh poskytujú žiakom, ktorí majú viac skúseností s programovaním, možnosť ďalej skúmať Game Lab.",
          "student_overview": "**Otázka dňa: Ako dokážeme počítaču odkomunikovať, ako má na obrazovke kresliť tvary?**\n\nV tejto lekcii začneš využívať prostredie Game Lab na rozmiestnenie tvarov na obrazovke a popri tom si precvičíš koncepty postupností a ladenia. "
        },
        "csd3-2022/Shapes and Parameters": {
          "name": "Tvary a parametre",
          "overview": "\\*\\*Otázka dňa: Ako môžeme pomocou parametrov dať počítaču konkrétnejšie pokyny?\n\nV tejto lekcii žiaci pokračujú v rozvíjaní svojich vedomostí o Game Labe úpravou šírky a výšky tvarov, ktoré používajú na kreslenie. Hodina sa začína diskusiou, ktorá prepája rozšírené možnosti blokov (napr. rôzne veľkosti tvarov) s potrebou väčšieho počtu vstupov do blokov alebo „parametrov“. Žiaci sa naučia kresliť pomocou verzií blokov [\\`ellipse()\\`(#4dd0e1)](/docs/gamelab/ellipse/) a [\\`rect()\\`(#4dd0e1)](/docs/gamelab/rect/), ktoré obsahujú parametre šírky a výšky. Naučia sa tiež používať blok [\\`background()\\`(#4dd0e1)](/docs/gamelab/background/).",
          "purpose": "Táto lekcia dáva žiakom možnosť mierne rozšíriť svoje zručnosti v kreslení a zároveň pokračovať v rozvíjaní všeobecných programovacích zručností. Budú musieť uvažovať o súradnicovej rovine x-y, zvážiť poradie v kóde a mierne zvýšiť zložitosť svojich programov. Táto hodina by mala byť zameraná predovšetkým na budovanie zručností.",
          "student_overview": "**Otázka dňa: Ako dokážeme pomocou parametrov zadať počítaču konkrétnejšie pokyny?**\n\nV tejto lekcii budeš pokračovať s prácou v prostredí Game Lab a lepšie sa oboznámiš s kreslením tvarov na obrazovke vďaka tomu, že budeš upravovať parametre tvarov, pomocou ktorých kreslíš obrázky. "
        },
        "csd3-2022/Variables": {
          "name": "Premenné",
          "overview": "**Otázka dňa:  Ako vieme využiť premenné na skladovanie konkrétnej hodnoty a jej využitie v našom programe?**\n\nV tejto lekcii si predstavíme premenné ako spôsob na označenie čísla alebo uloženie náhodne vygenerovanej hodnoty. Začneme jednoduchým popisom premenných a ich využitia a vyskúšame ich použitie v praxi. ",
          "purpose": "Táto hodina je prvou hodinou, na ktorej sa žiaci stretnú s premennými, a neočakáva sa, že by do jej záveru úplne pochopili, ako premenné fungujú. Žiaci by mali z tejto lekcie odísť s poznatkom, že premenné predstavujú spôsob označovania hodnôt v ich programoch tak, aby ich bolo možné neskôr opätovne použiť alebo sa na ne odvolať. V nasledujúcej lekcii sa žiaci zoznámia s náhodnými číslami, v ktorých uvidia silnejšie využitie premenných.  \n\nPoužívanie premenných na manipuláciu s výkresmi je prekvapivo náročná zručnosť, ktorá si vyžaduje veľa premýšľania a plánovania. Hoci žiaci budú v tejto lekcii používať alebo upravovať mnohé programy, neočakáva sa od nich, že budú zostavovať programy, ktoré používajú premenné na úpravu vlastností výkresu. Na ďalších hodinách si žiaci rozšíria svoje poznatky o premenných a pokročilejších spôsoboch ich použitia.",
          "student_overview": "**Otázka dňa: Ako môžeme pomocou premenných ukladať informácie do našich programov?**\n\nV tejto lekcii sa oboznámiš s premennými, ktoré sú v programovaní dôležité, pretože sa do nich ukladajú hodnoty používané v programoch."
        },
        "csd3-2022/Random Numbers": {
          "name": "Náhodné čísla",
          "overview": "**Otázka dňa: Ako môžeme dosiahnuť, aby sa naše programy pri každom spustení správali inak?**\n\nŽiaci sa oboznámia s blokom [\\`randomNumber()\\`(#FFB74D)](/docs/gamelab/randomNumber/) a s tým, ako ho môžu použiť na vytvorenie nového správania svojich programov. Potom sa naučia, ako aktualizovať premenné počas vykonávania programu. Kombináciou všetkých týchto zručností žiaci kreslia náhodné obrázky.",
          "purpose": "Táto lekcia predstavuje náhodnosť, ktorá je dôležitým spôsobom, ako urobiť programy zaujímavejšími, ale zároveň aj motivuje k používaniu premenných. V polovici aktivity sa žiaci oboznámia s premennou, ktorá sa v programe viackrát aktualizuje, čím sa rozšíri ich chápanie možností použitia premenných.",
          "student_overview": "**Otázka dňa: Ako môžeme dosiahnuť, aby sa naše programy správali pri každom spustení inak?**\n\nV tejto lekcii sa naučíš používať vytvárať vo svojich programoch rôzne správania pomocou bloku randomNumber()."
        },
        "csd3-2022/Sprites": {
          "name": "Sprajty",
          "overview": "**Otázka dňa:  Ako nám môžu sprajty pomôcť zachovať prehľad o množstve informácií v našich programoch?**\n\nS cieľom vytvoriť zaujímavejšie a detailnejšie obrázky sa žiaci oboznámia s objektom sprajtu. Lekcia začína diskusiou o rôznych informáciách, ktoré musia programy sledovať, a potom predstavuje sprajty ako spôsob, ako tieto informácie sledovať. Potom sa žiaci naučia, ako priradiť každému sprajtu obrázok, čím sa výrazne zvýši zložitosť toho, čo dokážu nakresliť na obrazovku.",
          "purpose": "Sledovanie mnohých tvarov a rôznych premenných, ktoré riadia aspekty týchto tvarov, môže byť veľmi zložité. Bude existovať veľa premenných s rôznymi názvami premenných. Informatici preto vytvorili niečo, čo sa nazýva **objekt**, ktorý umožňuje, aby jeden názov premennej ovládal tvar aj všetky jeho aspekty. V Game Labe používame určitý typ objektu, ktorý sa nazýva **sprajt**. Sprajt je len obdĺžnik s **vlastnosťami**, ktoré slúžia na ovládanie jeho vzhľadu. Vlastnosti sú premenné, ktoré sú pripojené k sprajtu. Môžete k nim pristupovať prostredníctvom **zápisu s bodkou**. \n\nPomocou karty Animácia môžu žiaci vytvárať alebo importovať obrázky, ktoré sa majú použiť s ich sprajtmi. Neskôr sa tieto sprajty stanú užitočným nástrojom na vytváranie animácií, pretože ich vlastnosti možno v priebehu programu meniť a aktualizovať.",
          "student_overview": "**Otázka dňa: Ako nám dokážu sprajty pomôcť uchovávať v našich programoch väčšie množstvo údajov?**\n\nDnes sa naučíš o sprajtoch, ktoré ti umožnia nielen uchovávať v programe rôzne druhy informácií, ale aj vytvárať zaujímavejšie a zábavnejšie obrázky!"
        },
        "csd3-2022/Sprite Properties": {
          "name": "Vlastnosti sprajtov",
          "overview": "**Otázka dňa: Ako môžeme použiť vlastnosti sprajtu na zmenu jeho vzhľadu na obrazovke?**\n\nŽiaci si rozšíria svoje poznatky o sprajtoch tým, že budú pracovať s vlastnosťami sprajtu.  Žiaci začnú tým, že si zopakujú, čo je to sprajt, a potom prejdú do Game Labu, kde si viac precvičia prácu so sprajtmi a použijú ich vlastnosti na zmenu ich vzhľadu. Potom sa zamyslia nad súvislosťami medzi vlastnosťami a premennými.",
          "purpose": "Na poslednej lekcii, na ktorej sa žiaci zoznámili so sprajtmi, sa zamerali najmä na vytváranie sprajtov a priraďovanie animácií. V tejto lekcii sa začnú zaoberať tým, čo robí zo sprajtov takú mocnú programovú štruktúru – že majú vlastnosti, ktoré sa dajú meniť počas behu programu. To je základom pre väčšinu toho, čo budú žiaci robiť vo zvyšnej časti tematického celku, pokiaľ ide o prístup k vlastnostiam sprajtu a manipuláciu s nimi s cieľom vytvoriť zaujímavé správanie vo svojich programoch.",
          "student_overview": "**Otázka dňa: Ako dokážeme pomocou vlastností sprajtov meniť ich vzhľad na obrazovke?**\n\nV tejto lekcii budeš pokračovať v práci so sprajtmi – budeš im meniť vzhľad pomocou vlastností. "
        },
        "csd3-2022/Text": {
          "name": "Text",
          "overview": "\\*\\*Otázka dňa: Ako môžeme vylepšiť svoje scény a animácie pomocou textu?\n\nTáto lekcia predstavuje textové príkazy Game Labu a poskytuje žiakom viac praktických skúseností s používaním súradnicovej roviny a parametrov. Na začiatku lekcie majú žiaci za úlohu napísať titulok ku komiksu vytvorenému v Game Labe. Potom prejdú do Code Studia, kde si precvičia umiestňovanie textu na obrazovku a ovládanie ďalších vlastností textu, napríklad veľkosti. Žiaci, ktorí ukončia hodnotenie skôr, môžu pokračovať v učení sa náročnejších blokov týkajúcich sa vlastností textu. ",
          "purpose": "Táto lekcia uvádza text, ktorý budú žiaci potrebovať, keď začnú vytvárať zložitejšie programy (napr. hry s výsledkovou tabuľkou). Ide o posledný typ prvku, ktorý budú žiaci umiestňovať na obrazovku. Potom sa žiaci zamerajú na to, ako môžu ovládať pohyb a interakcie týchto prvkov.",
          "student_overview": "**Otázka dňa: Ako si môžeme pomocou textu zlepšiť scény a animácie?**\n\nV tejto lekcii sa naučíš využívať textové príkazy prostredia Game Lab na pridanie popisu k scéne. "
        },
        "csd3-2022/Mini-Project - Captioned Scenes": {
          "name": "Miniprojekt – Scény s popismi",
          "overview": "**Otázka dňa: Ako môžeme pomocou Game Labu prejaviť svoju tvorivosť?**\n\nPo rýchlom zopakovaní kódu, ktorý sa doteraz naučili, sa žiaci oboznámia so svojím prvým tvorivým projektom v rámci tohto tematického celku. Pomocou procesu riešenia problémov ako modelu žiaci definujú scénu, ktorú chcú vytvoriť, pripravia sa premyslením odlišného kódu, ktorý budú potrebovať, vyskúšajú si svoj plán v Game Labe a potom sa zamyslia nad tým, čo vytvorili. Majú tiež možnosť podeliť sa o svoje výtvory so svojimi rovesníkmi.",
          "purpose": "Na tejto hodine majú žiaci možnosť kreatívnejšie využiť získané poznatky. Niektorí žiaci môžu stráviť viac času na karte Animácia kreslením ako programovaním. Povzbuďte žiakov, aby venovali čas častiam aktivity, ktoré ich zaujímajú, pokiaľ spĺňajú požiadavky zadania.\n\nOtvorená povaha tejto lekcie tiež poskytuje učiteľovi flexibilitu pri rozhodovaní o tom, koľko času by mali žiaci stráviť nad svojou prácou, v závislosti od požiadaviek na rozvrhnutie konkrétnej realizácie kurzu.",
          "student_overview": "**Otázka dňa: Ako dokážeme pomocou prostredia Game Lab ukázať svoju tvorivosť?**\n\nV tejto lekcii budeš mať príležitosť ukázať svoju tvorivosť tým, že využiješ postup riešenia problémov na navrhnutie a naprogramovanie scény podľa svojho výberu. "
        },
        "csd3-2022/The Draw Loop": {
          "name": "Cyklus kreslenia",
          "overview": "**Otázka dňa: Ako môžeme animovať naše obrázky v Game Labe?**\n\nV tejto lekcii sa žiaci oboznámia s cyklom funkcie draw, ktorý je jednou zo základných programovacích paradigiem v Game Labe. Na začiatku hodiny si žiaci pozrú niekoľko fyzických flipbookov, aby videli, že množstvo snímok s rôznymi obrázkami vytvára dojem pohybu. Potom si žiaci pozrú video, ktoré vysvetľuje, ako cyklus funkcie draw v Game Labe pomáha vytvoriť rovnaký dojem v ich programoch. Žiaci skombinujú cyklus funkcie draw s náhodnými číslami a manipulujú s niekoľkými jednoduchými animáciami s bodkami a potom so sprajtmi.",
          "purpose": "Cyklus funkcie draw je základným prvkom Game Labu. Prostredie Game Labu opakovane volá túto funkciu mnohokrát za sekundu (štandardne 30-krát), čo umožňuje nástroju vytvárať animácie. Táto lekcia má dva ciele. Prvým je, aby žiaci videli, ako animácia vo všeobecnosti závisí od zobrazenia mnohých mierne odlišných obrázkov v sekvencii. Druhým cieľom je, aby žiaci pochopili, ako im cyklus funkcie draw umožňuje vytvoriť toto správanie v Game Labe. Žiaci by mali z lekcie odísť s poznatkom, že príkazy v cykle funkcie draw sa volajú po ostatnom kóde, ale potom sa opakovane volajú, aby sa vytvorila animácia. Žiaci budú mať možnosť pokračovať v rozvíjaní pochopenia tohto správania v nasledujúcich dvoch lekciách, ale položenie silného koncepčného základu v tejto lekcii im dobre poslúži po zvyšok tematického celku.",
          "student_overview": "**Otázka dňa: Ako dokážeme v Game Labe spraviť z obrázkov animácie?**\n\nV tejto lekcii sa naučíš, ako pomocou cyklu draw() a náhodných čísel vytvoriť svoje prvé jednoduché animácie. "
        },
        "csd3-2022/Sprite Movement": {
          "name": "Pohyb sprajtov",
          "overview": "**Otázka dňa: Ako môžeme ovládať pohyb sprajtov v Game Labe?**\n\nV tejto lekcii sa žiaci naučia ovládať pohyb sprajtov pomocou konštrukcie nazývanej počítadlo, ktorá postupne mení vlastnosti sprajtov. Žiaci sa najskôr zamyslia nad rôznymi spôsobmi, ako by mohli animovať sprajty ovládaním ich vlastností, a potom preskúmajú model počítadla v Code Studiu. Po preskúmaní funkčného kódu si žiaci vyskúšajú použitie počítadla na vytvorenie rôznych typov pohybov sprajtov.",
          "purpose": "Táto lekcia vychádza z cyklu kreslenia, ktorý sa žiaci naučili predtým, a umožňuje vytvárať programy s _cieleným_ pohybom. Pomocou zvyšovania alebo znižovania hodnôt vlastností sprajtov, ako napríklad [\\`sprite.x\\`(#f78183)](/docs/gamelab/sprite.x/), môžu žiaci písať programy, ktoré pohybujú sprajtmi podľa očakávaných vzorov namiesto náhodného pohybu, ktorý používali predtým. Animácie, ktoré sa žiaci naučia vytvárať v tejto lekcii, položia základ pre všetky animácie a hry, ktoré budú vytvárať počas zvyšku tematického celku.",
          "student_overview": "**Otázka dňa: Ako dokážeme ovládať pohyb sprajtov v Game Labe?**\n\nV tejto lekcii sa naučíš ovládať pohyb sprajtov pomocou počítadla. "
        },
        "csd3-2022/Mini-Project - Animation": {
          "name": "Miniprojekt – Animácia",
          "overview": "**Otázka dňa: Ako môžeme kombinovať rôzne programovacie vzory, aby sme vytvorili kompletnú animáciu?**\n\nV tejto lekcii majú žiaci skombinovať rôzne metódy, ktoré sa naučili, a vytvoriť animovanú scénu. Žiaci si najprv zopakujú typy pohybu a animácie, ktoré sa naučili, a zamyslia sa nad tým, aké typy scén by mohli tento pohyb potrebovať. Potom začnú plánovať vlastné animované scény, ktoré vytvoria v Game Labe.",
          "purpose": "Na tejto hodine majú žiaci možnosť kreatívnejšie využiť získané poznatky. Niektorí žiaci môžu stráviť viac času na karte Animácia kreslením ako programovaním. Povzbuďte žiakov, aby venovali čas častiam aktivity, ktoré ich zaujímajú, pokiaľ spĺňajú požiadavky zadania.",
          "student_overview": "**Otázka dňa: Ako môžeme skombinovať rôzne programovacie vzory na vytvorenie kompletnej animácie?**\n\nV tejto lekcii skombinuješ všetky koncepty z predchádzajúcich lekcií a vytvoríš si pomocou nich svoju prvú vlastnú animovanú scénu!"
        },
        "csd3-2022/Conditionals": {
          "name": "Podmienené príkazy",
          "overview": "**Otázka dňa:  Ako môžu programy reagovať na zmeny počas behu?**\n\nV tejto lekcii sa zoznámite s booleovskými výrazmi a podmienkami, ktoré umožňujú, aby program bežal inak v závislosti od toho, či je podmienka pravdivá. Žiaci začnú krátkou hrou, v ktorej reagujú podľa toho, či sú splnené určité podmienky. Potom sa presunú do Code Studia, kde sa naučia, ako počítač vyhodnocuje logické výrazy a ako sa dajú použiť na štruktúrovanie programu.",
          "purpose": "Najskôr začneme s priamym používaním booleovských výrazov a až potom budeme používať booleovské výrazy na spúšťanie príkazov _if_. V nasledujúcej lekcii si predstavíme niektoré bloky na vytváranie logických výrazov, ako napríklad [\\`keyDown()\\`(#fff176)](/docs/gamelab/keyDown/), ktoré možno použiť namiesto jednoduchých logických porovnaní na písanie programov reagujúcich na vstup od používateľa.",
          "student_overview": "**Otázka dňa: Ako dokážu programy reagovať na zmeny, keď už sú spustené?**\n\nV tejto lekcii sa naučíš o logických výrazoch a podmienených príkazoch. Tie ti umožnia vyvárať programy, ktoré fungujú rôzne v závislosti od toho, či je podmienka splnená alebo nie."
        },
        "csd3-2022/Keyboard Input": {
          "name": "Vstup z klávesnice",
          "overview": "**Otázka dňa: Ako môžu naše programy reagovať na vstupy od používateľa?**\n\nPo úvode do logických výrazov a príkazov _if_ v predchádzajúcej lekcii sa žiaci oboznámia s novým blokom s názvom [\\`keyDown()\\`(#fff176)](/docs/gamelab/keyDown/), ktorý vracia boolovskú hodnotu a možno ho použiť v podmienených príkazoch na pohyb sprajtov po obrazovke. Na konci tejto lekcie budú žiaci písať programy, ktoré prijímajú vstupy z klávesnice od používateľa na ovládanie sprajtov na obrazovke.",
          "purpose": "Jedným z bežných spôsobov, ako sa používajú podmienky, je kontrola rôznych typov používateľských vstupov, najmä stlačení klávesov. Ak má používateľ možnosť interakcie s programom, robí ho zaujímavejším a dynamickejším. Bez interakcie používateľa je veľmi ťažké vytvoriť hru. Preto je zavedenie podmienených príkazov a vstupov používateľa na rozhodovanie rozhodujúcim krokom k vytvoreniu hry.",
          "student_overview": "**Otázka dňa: Ako dokáže program reagovať na vstupy používateľa?**\n\nV tejto lekcii sa naučíš používať blok keyDown(), ktorý tvojim programom umožní reagovať na vstupy používateľa. "
        },
        "csd3-2022/Mouse Input": {
          "name": "Vstup pomocou myši",
          "overview": "\\*\\*Otázka dňa: Aké sú ďalšie spôsoby, ktorými môže počítač reagovať na vstupy používateľa?\n\nV tejto lekcii žiaci pokračujú v skúmaní spôsobov použitia podmienených príkazov na prijímanie vstupov od používateľa. Okrem príkazov z klávesnice, ktoré sa naučili včera, sa žiaci oboznámia s niekoľkými spôsobmi prijímania vstupu pomocou myši. Rozšíria tiež svoje chápanie podmienených príkazov o príkaz „else“, ktorý umožňuje počítaču spustiť určitú časť kódu, keď je podmienka pravdivá, a inú časť kódu, keď nie je.",
          "purpose": "Žiaci sa naučili robiť jednoduché rozhodnutia pomocou podmienených príkazov. Niekedy však chceme robiť rozhodnutia na základe toho, či podmienka, na ktorú sme sa pôvodne pýtali, bola nepravdivá. Vtedy prichádzajú na rad príkazy else. Príkazy else sú druhým príkazom, ktorý je pripojený k príkazu if. Príkazy else sa vykonajú, keď podmienky, ku ktorým sú pripojené, sú nepravdivé.\n\nTento koncept sa zavádza spolu s niekoľkými novými príkazmi vstupu pomocou myši, čo umožňuje žiakom postupne vytvárať programy, ktoré využívajú vstup rôznymi spôsobmi.",
          "student_overview": "**Otázka dňa: Akými ďalšími spôsobmi dokáže počítač reagovať na vstupy používateľa?**\n\nV tejto lekcii získaš ďalšie poznatky o podmienkach „ak“, oboznámiš sa s podmienkami „ak/tak“ a dozvieš sa o tom, ako dokážeme pomocou myši získať od používateľa vstupy, ktoré sa dajú využiť v podmienených príkazoch. "
        },
        "csd3-2022/Project - Interactive Card": {
          "name": "Projekt - Interaktívna pohľadnica",
          "overview": "**Otázka dňa:  Aké zručnosti a postupy sú dôležité pri tvorbe interaktívneho programu?**\n\nV tomto záverečnom projekte ku kapitole 1 žiaci naplánujú a vytvoria interaktívne blahoželanie s využitím všetkých techník programovania, ktoré sa doteraz naučili.",
          "purpose": "Toto záverečné hodnotenie poskytuje žiakom príležitosť zhrnúť si na jednom mieste všetko, čo sa naučili (kreslenie, premenné, sprajty, obrázky, podmienené príkazy, vstupy od používateľa). Žiaci by mali stále pracovať s kódom, ktorý je ľahko čitateľný a nezahŕňa príliš veľa abstrakcií na vysokej úrovni. Ak dáte žiakom možnosť byť naozaj tvoriví po tom, čo sa naučili všetky tieto nové pojmy, podporíte ich ďalšie nasadenie pri prechode na kapitolu 2.",
          "student_overview": "**Otázka dňa:  Aké zručnosti a techniky sú dôležité pri vytváraní interaktívneho programu?**\n\nV tejto lekcii si pomocou všetkých programovacích konceptov a techník, ktoré sme si doteraz predstavili, naplánuješ a vytvoríš interaktívnu pohľadnicu."
        },
        "csd3-2022/Velocity": {
          "name": "Rýchlosť",
          "overview": "**Otázka dňa:  Ako môžu programovacie jazyky skryť komplikované vzory, aby bolo programovanie jednoduchšie?**\n\nPo krátkom zopakovaní toho, ako na predchádzajúcich hodinách používali na pohyb sprajtov počítadlo, sa žiaci oboznámia s myšlienkou skrývania týchto vzorov v jednom bloku.  Potom žiaci prejdú do Code Studia, aby si vyskúšali nové bloky, ktoré priamo nastavujú rýchlosť sprajtu, a pozrú sa na rôzne spôsoby, ktorými môžu naprogramovať zložitejšie správanie svojich sprajtov.  ",
          "purpose": "Táto lekcia otvára hlavnú tému kapitoly: že zložité správanie možno vyjadriť jednoduchšími spôsobmi, ktoré uľahčujú písanie kódu a uvažovanie o ňom. \n\nV tejto lekcii sa žiaci naučia používať bloky rýchlosti na zjednodušenie kódu pre pohyb sprajtu po obrazovke. To znamená posun v spôsobe predstavenia nových blokov. Zatiaľ čo predtým boli bloky prezentované ako umožňujúce úplne nové správanie, teraz sú prezentované ako zjednodušenie kódu, ktorý mohli žiaci napísať pomocou blokov, ktoré mali k dispozícii predtým. Počas niekoľkých nasledujúcich hodín žiaci uvidia, ako im tento spôsob zjednodušenia umožňuje vytvárať zaujímavejšie správanie sprajtov.",
          "student_overview": "**Otázka dňa: Ako dokážu programovacie jazyky ukryť komplikované vzory tak, aby zjednodušili programovanie?**\n\nV tejto lekcii sa naučíš nastavovať rýchlosť sprajtu, pričom na pohyb sprajtov budeš používať počítadlo. "
        },
        "csd3-2022/Collision Detection": {
          "name": "Detekcia kolízie",
          "overview": "**Otázka dňa: Ako môže programovanie pomôcť zjednodušiť zložité problémy?**\n\nŽiaci sa učia o detekcii kolízií na počítači. Pri práci vo dvojiciach skúmajú, ako by počítač mohol pomocou vlastností umiestnenia a veľkosti sprajtov a matematiky zistiť, či sa dva sprajty dotýkajú. Potom použijú blok [\\`isTouching()\\`(#f78183)](/docs/gamelab/isTouching/) na vytvorenie rôznych efektov pri kolízii sprajtov a precvičia si používanie bloku na modelovanie rôznych interakcií.",
          "purpose": "Táto lekcia formálne zavádza používanie abstrakcií, teda jednoduchých spôsobov reprezentácie skrytej zložitosti. \n\nV minulej lekcii sa žiaci oboznámili s používaním jedného bloku na vyjadrenie zložitého kódu. Túto myšlienku žiaci ďalej skúmajú v kontexte zámerne zložitej matematickej úlohy na určenie, či sa dva sprajty dotýkajú. Použitím jedného bloku na vyjadrenie tejto zložitosti, v tomto prípade bloku isTouching, sa oveľa ľahšie zapisuje a vysvetľuje kód a žiaci dokážu oceniť hodnotu používania abstrakcií. V ďalších lekciách budú žiaci pokračovať v budovaní abstrakcie [\\`isTouching()\\`(#f78183)](/docs/gamelab/isTouching/) a vytvárať zložitejšie interakcie so sprajtmi.",
          "student_overview": "**Otázka dňa: Ako dokáže programovanie zjednodušiť komplikované problémy?**\n\nV tejto lekcii sa budeš učiť o detekcii kolízií tým, že sa pozrieš na to, ako dokáže počítač pomocou matematiky, polohy sprajtov a ich veľkosti určiť, či sa sprajty dotýkajú alebo nie. "
        },
        "csd3-2022/Mini-Project - Side Scroller": {
          "name": "Miniprojekt – Plošinovka",
          "overview": "**Otázka dňa: Ako dokážeme nové typy pohybu sprajtov a detekciu kolízií využiť na vytvorenie hry?**\n\nŽiaci využijú to, čo sa naučili o detekcii kolízií a nastavovaní rýchlosti, na vytvorenie jednoduchej plošinovky. Po prezretí vzorovej hry tohto typu sa žiaci zamyslia nad tým, aký druh hry by chceli vytvoriť, a potom pomocou štruktúrovaného postupu naprogramujú hru v Code Studiu.",
          "purpose": "Na tejto hodine majú žiaci možnosť kreatívnejšie využiť získané poznatky. Povzbuďte žiakov, aby venovali čas častiam aktivity, ktoré ich zaujímajú, pokiaľ spĺňajú požiadavky zadania. Túto lekciu možno skrátiť alebo predĺžiť v závislosti od časových možností.",
          "student_overview": "**Otázka dňa: Ako dokážeme nové typy pohybu sprajtov a detekciu kolízií využiť na vytvorenie hry?**\n\nV tejto lekcii využiješ získané vedomosti o rýchlosti a detekcii kolízií na vytvorenie jednoduchej počítačovej hry plošinovky!"
        },
        "csd3-2022/Complex Sprite Movement": {
          "name": "Komplexný pohyb sprajtov",
          "overview": "**Otázka dňa: Ako môžeme skombinovať bloky, ktoré už poznáme tak, aby vytvorili zaujímavý pohyb?**\n\nV tejto lekcii sa naučíte skombinovať pohybové vlastnosti sprajtu pomocou počítadla na vytvorenie zložitejšieho pohybu. Po zopakovaní oboch konceptov preskúmate viacero scenárov, v ktorých sa rýchlosť využíva spolu s počítadlom, vďaka čomu objavíte viacero typov výsledných pohybov. Naučíte sa simulovať gravitáciu a vyskúšate tvoriť nové pohyby len pomocou kombinácie blokov, ktoré už poznáte.",
          "purpose": "Táto lekcia nezavádza žiadne nové bloky a v skutočnosti využíva len vzory, ktoré žiaci videli v kapitole 1. Namiesto toho ukazuje, ako kombinácia týchto nástrojov, najmä abstrakcií, ktoré si žiaci osvojili v predchádzajúcich dvoch lekciách, umožňuje vytvárať nové správanie pre ich sprajty. To zdôrazňuje širšiu myšlienku, že abstrakcie nielen zjednodušujú kód, ale aj samy môžu byť použité ako stavebné bloky ešte zložitejšieho správania.  ",
          "student_overview": "**Otázka dňa: Ako sa dajú predchádzajúce bloky skombinovať do nových vzorov, aby vytvorili zaujímavé pohyby?**\n\nV tejto lekcii sa naučíš spojiť rýchlostné vlastnosti sprajtov s počítadlom, a nastaviť tak sprajtom zložitejšie pohyby. "
        },
        "csd3-2022/Collisions": {
          "name": "Kolízie sprajtov",
          "overview": "**Otázka dňa: Ako môžu programátori rozvíjať abstrakcie a vytvárať ďalšie abstrakcie?**\n\nV tejto lekcii žiaci naprogramujú svoje sprajty tak, aby spolu interagovali novými spôsobmi. Po krátkom zopakovaní toho, ako použili blok [\\`isTouching\\`(#f78183)](/docs/gamelab/isTouching/), žiaci vymyslia ďalšie spôsoby, ako by mohli dva sprajty interagovať. Potom použijú blok [\\`isTouching\\`(#f78183)](/docs/gamelab/isTouching/) na to, aby jeden sprajt tlačil druhý po obrazovke, a potom si precvičia prácu so štyrmi blokmi kolízie ([\\`collide\\`(#f78183)](/docs/gamelab/collide/), [\\`displace\\`(#f78183)](/docs/gamelab/displace/), [\\`bounce\\`(#f78183)](/docs/gamelab/bounce/) a [\\`bounceOff\\`(#f78183)](/docs/gamelab/bounceOff/)).",
          "purpose": "Táto lekcia je zameraná na kolízie, ďalšiu užitočnú abstrakciu, ktorá žiakom umožní manipulovať so sprajtmi úplne novými spôsobmi. Hoci by žiaci teoreticky mohli napísať vlastné príkazy displace, collide alebo bounce, možnosť ignorovať detaily tohto kódu im umožňuje sústrediť pozornosť na vysokoúrovňovú štruktúru hier, ktoré chcú vytvoriť.\n\nCieľom tejto lekcie je tiež umožniť žiakom lepšie si precvičiť používanie nových príkazov, ktoré sa naučili v druhej kapitole. V tejto lekcii sa naposledy naučia nové správanie sprajtov a po tejto lekcii sa žiaci preorientujú na organizáciu svojho čoraz zložitejšieho kódu.",
          "student_overview": "**Otázka dňa: Ako dokážu programátori stavať na abstrakciách, a vytvárať tak ďalšie abstrakcie?**\n\nV tejto lekcii sa naučíš používať bloky kolízií („collide“, „displace“, „bounce“ a „bounceOff“), a prinútiť tak sprajty interagovať zaujímavými novými spôsobmi. "
        },
        "csd3-2022/Mini-Project - Flyer Game": {
          "name": "Miniprojekt – Lietacia hra",
          "overview": "**Otázka dňa:  Ako sa dajú nové typy kolízií a modelovanie pohybu využiť pri tvorbe hry?**\n\nŽiaci využijú to, čo sa naučili o simulácii gravitácie a rôznych typoch kolízií, na vytvorenie jednoduchých lietacích hier. Po prezretí vzorovej lietacej hry žiaci vymyslia, aký druh lietacej hry by chceli, a potom pomocou štruktúrovaného postupu naprogramujú hru v programe Code Studiu.",
          "purpose": "Na tejto hodine majú žiaci možnosť kreatívnejšie využiť získané poznatky. Povzbuďte žiakov, aby venovali čas častiam aktivity, ktoré ich zaujímajú, pokiaľ spĺňajú požiadavky zadania.",
          "student_overview": "**Otázka dňa:  Ako sa dajú nové typy kolízií a modelovanie pohybu využiť pri tvorbe hry?**\n\nV tejto lekcii využijete to, čo ste sa naučili o simulácii gravitácie a rôznych typoch kolízií, na vytvorenie jednoduchej lietacej hry!"
        },
        "csd3-2022/Functions": {
          "name": "Funkcie",
          "overview": "**Otázka dňa: Ako môžu programátori používať funkcie na vytváranie vlastných abstrakcií?**\n\nŽiaci sa naučia vytvárať funkcie na usporiadanie svojho kódu, zlepšenie jeho čitateľnosti a odstránenie opakujúcich sa blokov kódu. Žiaci sa najprv zamyslia nad tým, aké nové bloky by chceli mať v Game Labe a aký kód by tieto bloky obsahovali. Potom sa žiaci naučia vytvárať funkcie v Game Labe. Funkcie použijú na odstránenie rozsiahlych blokov kódu z cyklu kreslenia a na nahradenie opakujúcich sa častí kódu jednou funkciou.",
          "purpose": "V predchádzajúcich lekciách sa žiaci naučili používať vo svojich programoch niekoľko abstrakcií vrátane vlastností rýchlosti, bloku isTouching a kolízií. Tieto abstrakcie im umožnili vytvárať oveľa zložitejšie programy, pričom mohli ignorovať detaily toho, ako sa toto správanie vytvára. V tejto lekcii sa žiaci naučia vytvárať vlastné abstrakcie vytváraním funkcií.\n\nŽiaci budú používať funkcie predovšetkým na rozdelenie kódu na logické časti, ktoré sa dajú ľahšie pochopiť. To predznamenáva prechod kapitoly od budovania technických zručností k organizačným procesom používaným pri vývoji softvéru.",
          "student_overview": "**Otázka dňa: Ako môžu programátori využiť funkcie na vytvorenie vlastných abstrakcií?**\n\nV tejto lekcii sa naučíte, ako lepšie zorganizovať svoj kód pomocou funkcií, aby bol kód programu čitateľnejší a aby ste odstránili opakujúce sa bloky kódu. "
        },
        "csd3-2022/The Game Design Process": {
          "name": "Proces návrhu hry",
          "overview": "**Otázka dňa: Ako vám plán uľahčí uskutočnenie veľkého projektu?**\n\nNa tejto hodine sa žiaci oboznámia s postupom, ktorý budú používať pri navrhovaní hier po zvyšok tematického celku. Tento proces sa sústreďuje na sprievodcu projektom, ktorý od žiakov vyžaduje, aby definovali svoje sprajty, premenné a funkcie predtým, ako začnú programovať svoju hru. Na začiatku tejto vyučovacej hodiny si žiaci zahrajú hru v Game Labe, v ktorej je skrytý kód. Diskutujú o tom, aké by podľa nich mali byť sprajty, premenné a funkcie na vytvorenie hry. Potom dostanú vyplneného sprievodcu projektom, ktorý ukazuje jeden zo spôsobov realizácie hry. Žiaci potom prechádzajú týmto procesom cez sériu úrovní. Na konci hodiny majú žiaci možnosť hru vylepšiť, aby bola podľa ich predstáv.",
          "purpose": "Táto lekcia približuje viacsnímkové animácie a je prvou lekciou zo série zameranej na proces tvorby softvéru.\n\nZatiaľ čo predchádzajúce lekcie sa zameriavali na používanie abstrakcií na zvládnutie zložitosti kódu, táto lekcia sa zameriava na zvládnutie zložitosti procesu vývoja softvéru. Vyučovacia hodina výrazne podporuje proces vývoja softvéru tým, že žiakom poskytuje vyplneného sprievodcu projektom, ponúka východiskový kód a sprevádza žiakov jeho implementáciou. V ďalších lekciách budú musieť žiaci samostatne dokončiť väčšiu časť tohto sprievodcu a pri záverečnom projekte budú postupovať podľa tohto procesu do značnej miery samostatne.",
          "student_overview": "**Otázka dňa: Ako vám plán uľahčí uskutočnenie veľkého projektu?**\n\nNa tejto hodine sa zoznámite s postupom, ktorý budete používať počas zvyšku tohto tematického celku pri navrhovaní hier. "
        },
        "csd3-2022/Using the Game Design Process": {
          "name": "Využitie procesu návrhu hry",
          "overview": "**Otázka dňa:  Ako môže proces riešenia problémov pomôcť programátorom zvládnuť veľké projekty?**\n\nV rámci tejto viacdňovej lekcie žiaci použijú proces riešenia problémov z 1. lekcie na vytvorenie plošinovej skákacej hry. Na začiatku si pozrú príklad plošinovej skákačky a potom definujú, ako bude vyzerať ich hra. Potom pomocou štruktúrovaného procesu naplánujú pozadia, premenné, sprajty a funkcie, ktoré budú potrebovať na realizáciu svojej hry. Po napísaní kódu hry sa žiaci zamyslia nad tým, ako by sa hra dala vylepšiť, a tieto zmeny implementujú.",
          "purpose": "Žiaci sa už naučili všetky programové štruktúry, ktoré potrebujú na vytvorenie hry. V tejto lekcii si zopakujú mnohé z týchto pojmov a zároveň sa oboznámia so štruktúrovaným postupom, ktorý im pomôže zvládnuť prácu. Nadväzuje na používanie sprievodcu projektom v predchádzajúcej lekcii tým, že žiaci samostatne dokončia väčšiu časť tohto sprievodcu projektom predtým, ako ho použijú na vytvorenie hry. Táto aktivita pripravuje žiakov na napísanie vlastnej hry od základov pre záverečný projekt.",
          "student_overview": "**Otázka dňa:  Ako môže proces riešenia problémov pomôcť programátorom zvládnuť veľké projekty?**\n\nV rámci tejto viacdňovej lekcie použijete proces riešenia problémov na vytvorenie plošinovej skákacej hry."
        },
        "csd3-2022/Project - Design a Game": {
          "name": "Projekt – Vytvor si vlastnú hru",
          "overview": "**Otázka dňa: Ako môže päť postupov informatiky (riešenie problémov, vytrvalosť, komunikácia, spolupráca a tvorivosť) pomôcť programátorom pri realizácii veľkých projektov?**\n\nŽiaci si naplánujú a vytvoria vlastnú hru s použitím sprievodcu projektom z predchádzajúcich dvoch lekcií. Pri práci samostatne alebo vo dvojiciach sa žiaci najprv rozhodnú, aký typ hry by chceli vytvoriť, pričom sa inšpirujú sadou vzorových hier. Potom vyplnia prázdneho sprievodcu projektom, v ktorom opíšu správanie hry a zakreslia premenné, sprajty a funkcie, ktoré budú potrebovať pri tvorbe. V Code Studiu im séria úrovní ponúkne všeobecnú postupnosť, ktorú môžu použiť na realizáciu tohto plánu. V priebehu tohto procesu budú žiaci zdieľať svoje čiastkové projekty na posúdenie spolužiakmi a zapracujú do nich spätnú väzbu, keď budú dokončovať svoju hru. Na konci lekcie sa žiaci podelia o svoje dokončené hry so svojimi spolužiakmi. Tento projekt bude pokrývať viacero vyučovacích hodín a môže pokojne trvať 3 až 5 vyučovacích hodín.",
          "purpose": "Táto hodina je vyvrcholením 3. lekcie a poskytuje žiakom príležitosť vytvoriť vlastný projekt v Game Labe od základov. Pomocné body, ktoré poskytuje sprievodca projektom, a prax, ktorú majú s jeho používaním, majú študentom pomôcť pri plánovaní ich projektov a doviesť ich nápady do konca. Tento projekt je príležitosťou na predvedenie technických zručností, ale budú musieť aj spolupracovať so svojím partnerom, poskytovať konštruktívnu spätnú väzbu rovesníkom a opakovane používať proces riešenia problémov, keď sa na ceste vyskytnú prekážky. Tento projekt by mal byť podľa možnosti riadený žiakmi a mal by poskytnúť posilňujúci a pamätihodný záver tohto tematického celku kurzu Objavujeme informatiku.",
          "student_overview": "**Otázka dňa: Ako môže päť postupov informatiky (riešenie problémov, vytrvalosť, komunikácia, spolupráca a tvorivosť) pomôcť programátorom pri realizácii veľkých projektov?**\n\nV tejto lekcii využijete proces riešenia problémov na naplánovanie a vytvorenie svojej vlastnej hry!"
        },
        "csd3-2022/CS Discoveries Post-Course Survey": {
          "name": "Objavujeme informatiku: Záverečný dotazník"
        },
        "csd6-2021/Functions with Parameters": {
          "name": "Funkcie s parametrami"
        },
        "csd6-2021/CS Discoveries Post-Course Survey": {
          "name": "Objavujeme informatiku: Záverečný dotazník"
        },
        "csd5-2021/CS Discoveries Post-Course Survey": {
          "name": "Objavujeme informatiku: Záverečný dotazník"
        },
        "csd3-2021/Programming for Entertainment": {
          "name": "Programovanie pre zábavu",
          "overview": "**Otázka dňa: Aké využitie má informatika v zábavnom priemysle?**\n\nNa začiatku nášho kurzu sa zamyslíme nad „problémami“ nudy a sebavyjadrenia a nad spôsobmi, ako k týmto problémom pristupujeme v našom živote. Preskúmame, akú úlohu v tejto oblasti zohrávajú informatika a programovanie  - či ako špecifická forma zábavy alebo ako prostriedok na sebavyjadrenie.",
          "preparation": "-   Preskúmajte študijné zdroje prepojené v Code Studiu\n-   Vytlačte si kópiu sprievodcu aktivitou pre každú skupinu troch žiakov",
          "purpose": "Cieľom tejto hodiny je začať tento programovací tematický celok spôsobom, ktorý zaujme žiakov s rôznym zázemím a záujmami. Hoci sa v závere tejto lekcie od žiakov žiada, aby vytvorili hru, mali by ste sa vyhnúť tomu, aby ste na začiatku kládli veľký dôraz na _videohry_. Namiesto toho sa pokúsime rozšíriť rozhľad žiakov o tom, aký význam má programovanie pre formu zábavy alebo sebavyjadrenia, ktorá je osobne pútavá. To poskytne žiakom základ, ku ktorému sa budú vracať počas celej jednotky, keď budú uvažovať o možných využitiach rôznych programátorských zručností, ktoré si osvoja.",
          "student_overview": "**Otázka dňa: Ako sa informatika využíva pre zábavu?**\n\nV tejto lekcii preskúmaš, akú úlohu zohráva informatika a najmä programovanie v zábavnom priemysle a pri sebavyjadrovaní."
        },
        "csd3-2021/Plotting Shapes": {
          "name": "Kreslenie tvarov",
          "overview": "\\*\\*Otázka dňa: Ako môžeme dať jasné pokyny, ako niečo nakresliť na obrazovku?\n\nŽiaci skúmajú problémy spojené s dávaním pokynov na kreslenie pomocou tvarov a používajú nástroj, ktorý predstavuje, ako sa k tomuto problému pristupuje v Game Labe. Úvodná zahrievacia aktivita rýchlo demonštruje problémy s poskytovaním informácií o polohe bez nejakého spoločného referenčného bodu. V hlavnej aktivite žiaci skúmajú nástroj Game Lab, ktorý umožňuje žiakom interaktívne umiestňovať tvary na mriežku 400 x 400 v Game Labe. Potom striedavo dávajú partnerovi pokyny, ako pomocou tohto nástroja nakresliť skrytý obrázok, pričom zohľadňujú mnohé výzvy, s ktorými sa žiaci stretnú pri programovaní v Game Labe. Pred záverečnou diskusiou si žiaci môžu podľa vlastného uváženia vytvoriť vlastný obrázok, o ktorom budú hovoriť.",
          "purpose": "Hlavným cieľom tejto lekcie je oboznámiť žiakov so súradnicovým systémom, ktorý budú používať v Game Labe. Žiaci môžu mať obmedzené skúsenosti s používaním súradnicovej siete alebo môžu mať problémy s „prevrátenou“ osou y v Game Labe. Nástroj na kreslenie tiež núti žiakov premýšľať o ďalších funkciách Game Labu, s ktorými sa žiaci stretnú, keď začnú programovať v nasledujúcej lekcii. Medzi ne patrí potreba zohľadniť poradie pri kreslení, potreba určiť farbu a skutočnosť, že kruhy sa umiestňujú podľa svojho stredu a štvorce podľa ľavého horného rohu. Na konci tejto aktivity by mali byť žiaci pripravení využiť to, čo sa naučili o oznamovaní polohy, pri programovaní, ktorému sa budú venovať v nasledujúcej lekcii.",
          "student_overview": "**Otázka dňa: Ako môžeme dať jasné pokyny, ako niečo nakresliť na obrazovku?**\n\nV tejto lekcii preskúmaš výzvy, ktoré musí človek prekonať, keď chce jasne odkomunikovať pokyny. V prostredí Game Lab budeš kresliť tvary na mriežke."
        },
        "csd3-2021/Drawing in Game Lab": {
          "name": "Kreslenie v Game Labe",
          "overview": "**Otázka dňa: Ako dáme pokyn počítaču, aby nakreslil na obrazovku konkrétny tvar?**\n\nV rámci tohto tematického celku sa oboznámime s programovacím prostredím Game Labu. Na úvod sa naučíme umiestniť tvary na konkrétne miesto na mriežke. Ďalej sa oboznámime s dôležitosťou správnej postupnosti príkazov, vyskúšame si hľadanie a opravovanie chýb a naučíme sa niekoľko jednoduchých príkazov. Na konci hodiny vytvoríme online verziu obrázka navrhnutého v predchádzajúcej lekcii.",
          "preparation": "-   Prečítajte si diskusné fórum\n-   Pripravte si projektor alebo iné prostriedky na premietanie videí, ak ich chcete pozerať ako trieda",
          "purpose": "Hlavným cieľom tejto hodiny je dať žiakom možnosť oboznámiť sa s programovacím prostredím, ako aj so základnými postupnosťami a ladením, ktoré budú používať počas celého tematického celku. Žiaci sa na začiatku oboznámia s interaktívnym vývojovým prostredím (IDE) Game Labu, potom sa naučia tri príkazy ([\\`rect\\`(#4dd0e1)](/docs/gamelab/rect/), [\\`ellipse\\`(#4dd0e1)](/docs/gamelab/ellipse/) a [\\`fill\\`(#4dd0e1)](/docs/gamelab/fill/)), ktoré budú potrebovať na programovanie rovnakých typov obrázkov, aké vytvorili na papieri v predchádzajúcej lekcii.  Úrovne úloh poskytujú žiakom, ktorí majú viac skúseností s programovaním, možnosť ďalej skúmať Game Lab.",
          "student_overview": "**Otázka dňa: Ako dokážeme počítaču odkomunikovať, ako má na obrazovke kresliť tvary?**\n\nV tejto lekcii začneš využívať prostredie Game Lab na rozmiestnenie tvarov na obrazovke a popri tom si precvičíš koncepty postupností a ladenia. "
        },
        "csd3-2021/Shapes and Parameters": {
          "name": "Tvary a parametre",
          "overview": "\\*\\*Otázka dňa: Ako môžeme pomocou parametrov dať počítaču konkrétnejšie pokyny?\n\nV tejto lekcii žiaci pokračujú v rozvíjaní svojich vedomostí o Game Labe úpravou šírky a výšky tvarov, ktoré používajú na kreslenie. Hodina sa začína diskusiou, ktorá prepája rozšírené možnosti blokov (napr. rôzne veľkosti tvarov) s potrebou väčšieho počtu vstupov do blokov alebo „parametrov“. Žiaci sa naučia kresliť pomocou verzií blokov [\\`ellipse()\\`(#4dd0e1)](/docs/gamelab/ellipse/) a [\\`rect()\\`(#4dd0e1)](/docs/gamelab/rect/), ktoré obsahujú parametre šírky a výšky. Naučia sa tiež používať blok [\\`background()\\`(#4dd0e1)](/docs/gamelab/background/).",
          "preparation": "-   Skontrolujte postup v úrovni v Code Studiu",
          "purpose": "Táto lekcia dáva žiakom možnosť mierne rozšíriť svoje zručnosti v kreslení a zároveň pokračovať v rozvíjaní všeobecných programovacích zručností. Budú musieť uvažovať o súradnicovej rovine x-y, zvážiť poradie v kóde a mierne zvýšiť zložitosť svojich programov. Táto hodina by mala byť zameraná predovšetkým na budovanie zručností.",
          "student_overview": "**Otázka dňa: Ako dokážeme pomocou parametrov zadať počítaču konkrétnejšie pokyny?**\n\nV tejto lekcii budeš pokračovať s prácou v prostredí Game Lab a lepšie sa oboznámiš s kreslením tvarov na obrazovke vďaka tomu, že budeš upravovať parametre tvarov, pomocou ktorých kreslíš obrázky. "
        },
        "csd3-2021/Variables": {
          "name": "Premenné",
          "overview": "**Otázka dňa:  Ako vieme využiť premenné na skladovanie konkrétnej hodnoty a jej využitie v našom programe?**\n\nV tejto lekcii si predstavíme premenné ako spôsob na označenie čísla alebo uloženie náhodne vygenerovanej hodnoty. Začneme jednoduchým popisom premenných a ich využitia a vyskúšame ich použitie v praxi. ",
          "preparation": "-   Skontrolujte postup v úrovni v Code Studiu",
          "purpose": "Táto hodina je prvou hodinou, na ktorej sa žiaci stretnú s premennými, a neočakáva sa, že by do jej záveru úplne pochopili, ako premenné fungujú. Žiaci by mali z tejto lekcie odísť s poznatkom, že premenné predstavujú spôsob označovania hodnôt v ich programoch tak, aby ich bolo možné neskôr opätovne použiť alebo sa na ne odvolať. V nasledujúcej lekcii sa žiaci zoznámia s náhodnými číslami, v ktorých uvidia silnejšie využitie premenných.  \n\nPoužívanie premenných na manipuláciu s výkresmi je prekvapivo náročná zručnosť, ktorá si vyžaduje veľa premýšľania a plánovania. Hoci žiaci budú v tejto lekcii používať alebo upravovať mnohé programy, neočakáva sa od nich, že budú zostavovať programy, ktoré používajú premenné na úpravu vlastností výkresu. Na ďalších hodinách si žiaci rozšíria svoje poznatky o premenných a pokročilejších spôsoboch ich použitia.",
          "student_overview": "**Otázka dňa: Ako môžeme pomocou premenných ukladať informácie do našich programov?**\n\nV tejto lekcii sa oboznámiš s premennými, ktoré sú v programovaní dôležité, pretože sa do nich ukladajú hodnoty používané v programoch."
        },
        "csd3-2021/Random Numbers": {
          "name": "Náhodné čísla",
          "overview": "**Otázka dňa: Ako môžeme dosiahnuť, aby sa naše programy pri každom spustení správali inak?**\n\nŽiaci sa oboznámia s blokom [\\`randomNumber()\\`(#FFB74D)](/docs/gamelab/randomNumber/) a s tým, ako ho môžu použiť na vytvorenie nového správania svojich programov. Potom sa naučia, ako aktualizovať premenné počas vykonávania programu. Kombináciou všetkých týchto zručností žiaci kreslia náhodné obrázky.",
          "preparation": "Skontrolujte postup v úrovni v Code Studiu",
          "purpose": "Táto lekcia predstavuje náhodnosť, ktorá je dôležitým spôsobom, ako urobiť programy zaujímavejšími, ale zároveň aj motivuje k používaniu premenných. V polovici aktivity sa žiaci oboznámia s premennou, ktorá sa v programe viackrát aktualizuje, čím sa rozšíri ich chápanie možností použitia premenných.",
          "student_overview": "**Otázka dňa: Ako môžeme dosiahnuť, aby sa naše programy správali pri každom spustení inak?**\n\nV tejto lekcii sa naučíš používať vytvárať vo svojich programoch rôzne správania pomocou bloku randomNumber()."
        },
        "csd3-2021/Sprites": {
          "name": "Sprajty",
          "overview": "**Otázka dňa:  Ako nám môžu sprajty pomôcť zachovať prehľad o množstve informácií v našich programoch?**\n\nS cieľom vytvoriť zaujímavejšie a detailnejšie obrázky sa žiaci oboznámia s objektom sprajtu. Lekcia začína diskusiou o rôznych informáciách, ktoré musia programy sledovať, a potom predstavuje sprajty ako spôsob, ako tieto informácie sledovať. Potom sa žiaci naučia, ako priradiť každému sprajtu obrázok, čím sa výrazne zvýši zložitosť toho, čo dokážu nakresliť na obrazovku.",
          "preparation": "-   (Nepovinné) Vytlačte kópiu sprievodcu aktivitou pre každého žiaka",
          "purpose": "Sledovanie mnohých tvarov a rôznych premenných, ktoré riadia aspekty týchto tvarov, môže byť veľmi zložité. Bude existovať veľa premenných s rôznymi názvami premenných. Informatici preto vytvorili niečo, čo sa nazýva **objekt**, ktorý umožňuje, aby jeden názov premennej ovládal tvar aj všetky jeho aspekty. V Game Labe používame určitý typ objektu, ktorý sa nazýva **sprajt**. Sprajt je len obdĺžnik s **vlastnosťami**, ktoré slúžia na ovládanie jeho vzhľadu. Vlastnosti sú premenné, ktoré sú pripojené k sprajtu. Môžete k nim pristupovať prostredníctvom **zápisu s bodkou**. \n\nPomocou karty Animácia môžu žiaci vytvárať alebo importovať obrázky, ktoré sa majú použiť s ich sprajtmi. Neskôr sa tieto sprajty stanú užitočným nástrojom na vytváranie animácií, pretože ich vlastnosti možno v priebehu programu meniť a aktualizovať.",
          "student_overview": "**Otázka dňa: Ako nám dokážu sprajty pomôcť uchovávať v našich programoch väčšie množstvo údajov?**\n\nDnes sa naučíš o sprajtoch, ktoré ti umožnia nielen uchovávať v programe rôzne druhy informácií, ale aj vytvárať zaujímavejšie a zábavnejšie obrázky!"
        },
        "csd3-2021/Sprite Properties": {
          "name": "Vlastnosti sprajtov",
          "overview": "**Otázka dňa: Ako môžeme použiť vlastnosti sprajtu na zmenu jeho vzhľadu na obrazovke?**\n\nŽiaci si rozšíria svoje poznatky o sprajtoch tým, že budú pracovať s vlastnosťami sprajtu.  Žiaci začnú tým, že si zopakujú, čo je to sprajt, a potom prejdú do Game Labu, kde si viac precvičia prácu so sprajtmi a použijú ich vlastnosti na zmenu ich vzhľadu. Potom sa zamyslia nad súvislosťami medzi vlastnosťami a premennými.",
          "purpose": "Na poslednej lekcii, na ktorej sa žiaci zoznámili so sprajtmi, sa zamerali najmä na vytváranie sprajtov a priraďovanie animácií. V tejto lekcii sa začnú zaoberať tým, čo robí zo sprajtov takú mocnú programovú štruktúru – že majú vlastnosti, ktoré sa dajú meniť počas behu programu. To je základom pre väčšinu toho, čo budú žiaci robiť vo zvyšnej časti tematického celku, pokiaľ ide o prístup k vlastnostiam sprajtu a manipuláciu s nimi s cieľom vytvoriť zaujímavé správanie vo svojich programoch.",
          "student_overview": "**Otázka dňa: Ako dokážeme pomocou vlastností sprajtov meniť ich vzhľad na obrazovke?**\n\nV tejto lekcii budeš pokračovať v práci so sprajtmi – budeš im meniť vzhľad pomocou vlastností. "
        },
        "csd3-2021/Text": {
          "name": "Text",
          "overview": "\\*\\*Otázka dňa: Ako môžeme vylepšiť svoje scény a animácie pomocou textu?\n\nTáto lekcia predstavuje textové príkazy Game Labu a poskytuje žiakom viac praktických skúseností s používaním súradnicovej roviny a parametrov. Na začiatku lekcie majú žiaci za úlohu napísať titulok ku komiksu vytvorenému v Game Labe. Potom prejdú do Code Studia, kde si precvičia umiestňovanie textu na obrazovku a ovládanie ďalších vlastností textu, napríklad veľkosti. Žiaci, ktorí ukončia hodnotenie skôr, môžu pokračovať v učení sa náročnejších blokov týkajúcich sa vlastností textu. ",
          "purpose": "Táto lekcia uvádza text, ktorý budú žiaci potrebovať, keď začnú vytvárať zložitejšie programy (napr. hry s výsledkovou tabuľkou). Ide o posledný typ prvku, ktorý budú žiaci umiestňovať na obrazovku. Potom sa žiaci zamerajú na to, ako môžu ovládať pohyb a interakcie týchto prvkov.",
          "student_overview": "**Otázka dňa: Ako si môžeme pomocou textu zlepšiť scény a animácie?**\n\nV tejto lekcii sa naučíš využívať textové príkazy prostredia Game Lab na pridanie popisu k scéne. "
        },
        "csd3-2021/Mini-Project: Captioned Scenes": {
          "name": "Miniprojekt – Scény s popismi",
          "overview": "**Otázka dňa: Ako môžeme pomocou Game Labu prejaviť svoju tvorivosť?**\n\nPo rýchlom zopakovaní kódu, ktorý sa doteraz naučili, sa žiaci oboznámia so svojím prvým tvorivým projektom v rámci tohto tematického celku. Pomocou procesu riešenia problémov ako modelu žiaci definujú scénu, ktorú chcú vytvoriť, pripravia sa premyslením odlišného kódu, ktorý budú potrebovať, vyskúšajú si svoj plán v Game Labe a potom sa zamyslia nad tým, čo vytvorili. Majú tiež možnosť podeliť sa o svoje výtvory so svojimi rovesníkmi.",
          "purpose": "Na tejto hodine majú žiaci možnosť kreatívnejšie využiť získané poznatky. Niektorí žiaci môžu stráviť viac času na karte Animácia kreslením ako programovaním. Povzbuďte žiakov, aby venovali čas častiam aktivity, ktoré ich zaujímajú, pokiaľ spĺňajú požiadavky zadania.\n\nOtvorená povaha tejto lekcie tiež poskytuje učiteľovi flexibilitu pri rozhodovaní o tom, koľko času by mali žiaci stráviť nad svojou prácou, v závislosti od požiadaviek na rozvrhnutie konkrétnej realizácie kurzu.",
          "student_overview": "**Otázka dňa: Ako dokážeme pomocou prostredia Game Lab ukázať svoju tvorivosť?**\n\nV tejto lekcii budeš mať príležitosť ukázať svoju tvorivosť tým, že využiješ postup riešenia problémov na navrhnutie a naprogramovanie scény podľa svojho výberu. "
        },
        "csd3-2021/The Draw Loop": {
          "name": "Cyklus kreslenia",
          "overview": "**Otázka dňa: Ako môžeme animovať naše obrázky v Game Labe?**\n\nV tejto lekcii sa žiaci oboznámia s cyklom funkcie draw, ktorý je jednou zo základných programovacích paradigiem v Game Labe. Na začiatku hodiny si žiaci pozrú niekoľko fyzických flipbookov, aby videli, že množstvo snímok s rôznymi obrázkami vytvára dojem pohybu. Potom si žiaci pozrú video, ktoré vysvetľuje, ako cyklus funkcie draw v Game Labe pomáha vytvoriť rovnaký dojem v ich programoch. Žiaci skombinujú cyklus funkcie draw s náhodnými číslami a manipulujú s niekoľkými jednoduchými animáciami s bodkami a potom so sprajtmi.",
          "preparation": "-   Vytlačte a zostavte pomôcky\n-   Pripravte video",
          "purpose": "Cyklus funkcie draw je základným prvkom Game Labu. Prostredie Game Labu opakovane volá túto funkciu mnohokrát za sekundu (štandardne 30-krát), čo umožňuje nástroju vytvárať animácie. Táto lekcia má dva ciele. Prvým je, aby žiaci videli, ako animácia vo všeobecnosti závisí od zobrazenia mnohých mierne odlišných obrázkov v sekvencii. Druhým cieľom je, aby žiaci pochopili, ako im cyklus funkcie draw umožňuje vytvoriť toto správanie v Game Labe. Žiaci by mali z lekcie odísť s poznatkom, že príkazy v cykle funkcie draw sa volajú po ostatnom kóde, ale potom sa opakovane volajú, aby sa vytvorila animácia. Žiaci budú mať možnosť pokračovať v rozvíjaní pochopenia tohto správania v nasledujúcich dvoch lekciách, ale položenie silného koncepčného základu v tejto lekcii im dobre poslúži po zvyšok tematického celku.",
          "student_overview": "**Otázka dňa: Ako dokážeme v Game Labe spraviť z obrázkov animácie?**\n\nV tejto lekcii sa naučíš, ako pomocou cyklu draw() a náhodných čísel vytvoriť svoje prvé jednoduché animácie. "
        },
        "csd3-2021/Sprite Movement": {
          "name": "Pohyb sprajtov",
          "overview": "**Otázka dňa: Ako môžeme ovládať pohyb sprajtov v Game Labe?**\n\nV tejto lekcii sa žiaci naučia ovládať pohyb sprajtov pomocou konštrukcie nazývanej počítadlo, ktorá postupne mení vlastnosti sprajtov. Žiaci sa najskôr zamyslia nad rôznymi spôsobmi, ako by mohli animovať sprajty ovládaním ich vlastností, a potom preskúmajú model počítadla v Code Studiu. Po preskúmaní funkčného kódu si žiaci vyskúšajú použitie počítadla na vytvorenie rôznych typov pohybov sprajtov.",
          "purpose": "Táto lekcia vychádza z cyklu kreslenia, ktorý sa žiaci naučili predtým, a umožňuje vytvárať programy s _cieleným_ pohybom. Pomocou zvyšovania alebo znižovania hodnôt vlastností sprajtov, ako napríklad [\\`sprite.x\\`(#f78183)](/docs/gamelab/sprite.x/), môžu žiaci písať programy, ktoré pohybujú sprajtmi podľa očakávaných vzorov namiesto náhodného pohybu, ktorý používali predtým. Animácie, ktoré sa žiaci naučia vytvárať v tejto lekcii, položia základ pre všetky animácie a hry, ktoré budú vytvárať počas zvyšku tematického celku.",
          "student_overview": "**Otázka dňa: Ako dokážeme ovládať pohyb sprajtov v Game Labe?**\n\nV tejto lekcii sa naučíš ovládať pohyb sprajtov pomocou počítadla. "
        },
        "csd3-2021/Mini-Project: Animation": {
          "name": "Miniprojekt – Animácia",
          "overview": "**Otázka dňa: Ako môžeme kombinovať rôzne programovacie vzory, aby sme vytvorili kompletnú animáciu?**\n\nV tejto lekcii majú žiaci skombinovať rôzne metódy, ktoré sa naučili, a vytvoriť animovanú scénu. Žiaci si najprv zopakujú typy pohybu a animácie, ktoré sa naučili, a zamyslia sa nad tým, aké typy scén by mohli tento pohyb potrebovať. Potom začnú plánovať vlastné animované scény, ktoré vytvoria v Game Labe.",
          "purpose": "Na tejto hodine majú žiaci možnosť kreatívnejšie využiť získané poznatky. Niektorí žiaci môžu stráviť viac času na karte Animácia kreslením ako programovaním. Povzbuďte žiakov, aby venovali čas častiam aktivity, ktoré ich zaujímajú, pokiaľ spĺňajú požiadavky zadania.",
          "student_overview": "**Otázka dňa: Ako môžeme skombinovať rôzne programovacie vzory na vytvorenie kompletnej animácie?**\n\nV tejto lekcii skombinuješ všetky koncepty z predchádzajúcich lekcií a vytvoríš si pomocou nich svoju prvú vlastnú animovanú scénu!"
        },
        "csd3-2021/Conditionals": {
          "name": "Podmienené príkazy",
          "overview": "**Otázka dňa:  Ako môžu programy reagovať na zmeny počas behu?**\n\nV tejto lekcii sa zoznámite s booleovskými výrazmi a podmienkami, ktoré umožňujú, aby program bežal inak v závislosti od toho, či je podmienka pravdivá. Žiaci začnú krátkou hrou, v ktorej reagujú podľa toho, či sú splnené určité podmienky. Potom sa presunú do Code Studia, kde sa naučia, ako počítač vyhodnocuje logické výrazy a ako sa dajú použiť na štruktúrovanie programu.",
          "purpose": "Najskôr začneme s priamym používaním booleovských výrazov a až potom budeme používať booleovské výrazy na spúšťanie príkazov _if_. V nasledujúcej lekcii si predstavíme niektoré bloky na vytváranie logických výrazov, ako napríklad [\\`keyDown()\\`(#fff176)](/docs/gamelab/keyDown/), ktoré možno použiť namiesto jednoduchých logických porovnaní na písanie programov reagujúcich na vstup od používateľa.",
          "student_overview": "**Otázka dňa: Ako dokážu programy reagovať na zmeny, keď už sú spustené?**\n\nV tejto lekcii sa naučíš o logických výrazoch a podmienených príkazoch. Tie ti umožnia vyvárať programy, ktoré fungujú rôzne v závislosti od toho, či je podmienka splnená alebo nie."
        },
        "csd3-2021/Keyboard Input": {
          "name": "Vstup z klávesnice",
          "overview": "**Otázka dňa: Ako môžu naše programy reagovať na vstupy od používateľa?**\n\nPo úvode do logických výrazov a príkazov _if_ v predchádzajúcej lekcii sa žiaci oboznámia s novým blokom s názvom [\\`keyDown()\\`(#fff176)](/docs/gamelab/keyDown/), ktorý vracia boolovskú hodnotu a možno ho použiť v podmienených príkazoch na pohyb sprajtov po obrazovke. Na konci tejto lekcie budú žiaci písať programy, ktoré prijímajú vstupy z klávesnice od používateľa na ovládanie sprajtov na obrazovke.",
          "purpose": "Jedným z bežných spôsobov, ako sa používajú podmienky, je kontrola rôznych typov používateľských vstupov, najmä stlačení klávesov. Ak má používateľ možnosť interakcie s programom, robí ho zaujímavejším a dynamickejším. Bez interakcie používateľa je veľmi ťažké vytvoriť hru. Preto je zavedenie podmienených príkazov a vstupov používateľa na rozhodovanie rozhodujúcim krokom k vytvoreniu hry.",
          "student_overview": "**Otázka dňa: Ako dokáže program reagovať na vstupy používateľa?**\n\nV tejto lekcii sa naučíš používať blok keyDown(), ktorý tvojim programom umožní reagovať na vstupy používateľa. "
        },
        "csd3-2021/Mouse Input": {
          "name": "Vstup pomocou myši",
          "overview": "\\*\\*Otázka dňa: Aké sú ďalšie spôsoby, ktorými môže počítač reagovať na vstupy používateľa?\n\nV tejto lekcii žiaci pokračujú v skúmaní spôsobov použitia podmienených príkazov na prijímanie vstupov od používateľa. Okrem príkazov z klávesnice, ktoré sa naučili včera, sa žiaci oboznámia s niekoľkými spôsobmi prijímania vstupu pomocou myši. Rozšíria tiež svoje chápanie podmienených príkazov o príkaz „else“, ktorý umožňuje počítaču spustiť určitú časť kódu, keď je podmienka pravdivá, a inú časť kódu, keď nie je.",
          "purpose": "Žiaci sa naučili robiť jednoduché rozhodnutia pomocou podmienených príkazov. Niekedy však chceme robiť rozhodnutia na základe toho, či podmienka, na ktorú sme sa pôvodne pýtali, bola nepravdivá. Vtedy prichádzajú na rad príkazy else. Príkazy else sú druhým príkazom, ktorý je pripojený k príkazu if. Príkazy else sa vykonajú, keď podmienky, ku ktorým sú pripojené, sú nepravdivé.\n\nTento koncept sa zavádza spolu s niekoľkými novými príkazmi vstupu pomocou myši, čo umožňuje žiakom postupne vytvárať programy, ktoré využívajú vstup rôznymi spôsobmi.",
          "student_overview": "**Otázka dňa: Akými ďalšími spôsobmi dokáže počítač reagovať na vstupy používateľa?**\n\nV tejto lekcii získaš ďalšie poznatky o podmienkach „ak“, oboznámiš sa s podmienkami „ak/tak“ a dozvieš sa o tom, ako dokážeme pomocou myši získať od používateľa vstupy, ktoré sa dajú využiť v podmienených príkazoch. "
        },
        "csd3-2021/Project - Interactive Card": {
          "name": "Projekt - Interaktívna pohľadnica",
          "overview": "**Otázka dňa:  Aké zručnosti a postupy sú dôležité pri tvorbe interaktívneho programu?**\n\nV tomto záverečnom projekte ku kapitole 1 žiaci naplánujú a vytvoria interaktívne blahoželanie s využitím všetkých techník programovania, ktoré sa doteraz naučili.",
          "preparation": "-   Prečítajte si fórum\n-   Vytlačte kópiu sprievodcu projektom pre každého žiaka",
          "purpose": "Toto záverečné hodnotenie poskytuje žiakom príležitosť zhrnúť si na jednom mieste všetko, čo sa naučili (kreslenie, premenné, sprajty, obrázky, podmienené príkazy, vstupy od používateľa). Žiaci by mali stále pracovať s kódom, ktorý je ľahko čitateľný a nezahŕňa príliš veľa abstrakcií na vysokej úrovni. Ak dáte žiakom možnosť byť naozaj tvoriví po tom, čo sa naučili všetky tieto nové pojmy, podporíte ich ďalšie nasadenie pri prechode na kapitolu 2.",
          "student_overview": "**Otázka dňa:  Aké zručnosti a techniky sú dôležité pri vytváraní interaktívneho programu?**\n\nV tejto lekcii si pomocou všetkých programovacích konceptov a techník, ktoré sme si doteraz predstavili, naplánuješ a vytvoríš interaktívnu pohľadnicu."
        },
        "csd3-2021/Velocity": {
          "name": "Rýchlosť",
          "overview": "**Otázka dňa:  Ako môžu programovacie jazyky skryť komplikované vzory, aby bolo programovanie jednoduchšie?**\n\nPo krátkom zopakovaní toho, ako na predchádzajúcich hodinách používali na pohyb sprajtov počítadlo, sa žiaci oboznámia s myšlienkou skrývania týchto vzorov v jednom bloku.  Potom žiaci prejdú do Code Studia, aby si vyskúšali nové bloky, ktoré priamo nastavujú rýchlosť sprajtu, a pozrú sa na rôzne spôsoby, ktorými môžu naprogramovať zložitejšie správanie svojich sprajtov.  ",
          "purpose": "Táto lekcia otvára hlavnú tému kapitoly: že zložité správanie možno vyjadriť jednoduchšími spôsobmi, ktoré uľahčujú písanie kódu a uvažovanie o ňom. \n\nV tejto lekcii sa žiaci naučia používať bloky rýchlosti na zjednodušenie kódu pre pohyb sprajtu po obrazovke. To znamená posun v spôsobe predstavenia nových blokov. Zatiaľ čo predtým boli bloky prezentované ako umožňujúce úplne nové správanie, teraz sú prezentované ako zjednodušenie kódu, ktorý mohli žiaci napísať pomocou blokov, ktoré mali k dispozícii predtým. Počas niekoľkých nasledujúcich hodín žiaci uvidia, ako im tento spôsob zjednodušenia umožňuje vytvárať zaujímavejšie správanie sprajtov.",
          "student_overview": "**Otázka dňa: Ako dokážu programovacie jazyky ukryť komplikované vzory tak, aby zjednodušili programovanie?**\n\nV tejto lekcii sa naučíš nastavovať rýchlosť sprajtu, pričom na pohyb sprajtov budeš používať počítadlo. "
        },
        "csd3-2021/Collision Detection": {
          "name": "Detekcia kolízie",
          "overview": "**Otázka dňa: Ako môže programovanie pomôcť zjednodušiť zložité problémy?**\n\nŽiaci sa učia o detekcii kolízií na počítači. Pri práci vo dvojiciach skúmajú, ako by počítač mohol pomocou vlastností umiestnenia a veľkosti sprajtov a matematiky zistiť, či sa dva sprajty dotýkajú. Potom použijú blok [\\`isTouching()\\`(#f78183)](/docs/gamelab/isTouching/) na vytvorenie rôznych efektov pri kolízii sprajtov a precvičia si používanie bloku na modelovanie rôznych interakcií.",
          "preparation": "-   Vytlačte kópie sprievodcu aktivitou tak, aby každá dvojica žiakov mala časť A a časť B.",
          "purpose": "Táto lekcia formálne zavádza používanie abstrakcií, teda jednoduchých spôsobov reprezentácie skrytej zložitosti. \n\nV minulej lekcii sa žiaci oboznámili s používaním jedného bloku na vyjadrenie zložitého kódu. Túto myšlienku žiaci ďalej skúmajú v kontexte zámerne zložitej matematickej úlohy na určenie, či sa dva sprajty dotýkajú. Použitím jedného bloku na vyjadrenie tejto zložitosti, v tomto prípade bloku isTouching, sa oveľa ľahšie zapisuje a vysvetľuje kód a žiaci dokážu oceniť hodnotu používania abstrakcií. V ďalších lekciách budú žiaci pokračovať v budovaní abstrakcie [\\`isTouching()\\`(#f78183)](/docs/gamelab/isTouching/) a vytvárať zložitejšie interakcie so sprajtmi.",
          "student_overview": "**Otázka dňa: Ako dokáže programovanie zjednodušiť komplikované problémy?**\n\nV tejto lekcii sa budeš učiť o detekcii kolízií tým, že sa pozrieš na to, ako dokáže počítač pomocou matematiky, polohy sprajtov a ich veľkosti určiť, či sa sprajty dotýkajú alebo nie. "
        },
        "csd3-2021/Mini-Project: Side Scroller": {
          "name": "Miniprojekt – Plošinovka",
          "overview": "**Otázka dňa: Ako dokážeme nové typy pohybu sprajtov a detekciu kolízií využiť na vytvorenie hry?**\n\nŽiaci využijú to, čo sa naučili o detekcii kolízií a nastavovaní rýchlosti, na vytvorenie jednoduchej plošinovky. Po prezretí vzorovej hry tohto typu sa žiaci zamyslia nad tým, aký druh hry by chceli vytvoriť, a potom pomocou štruktúrovaného postupu naprogramujú hru v Code Studiu.",
          "purpose": "Na tejto hodine majú žiaci možnosť kreatívnejšie využiť získané poznatky. Povzbuďte žiakov, aby venovali čas častiam aktivity, ktoré ich zaujímajú, pokiaľ spĺňajú požiadavky zadania. Túto lekciu možno skrátiť alebo predĺžiť v závislosti od časových možností.",
          "student_overview": "**Otázka dňa: Ako dokážeme nové typy pohybu sprajtov a detekciu kolízií využiť na vytvorenie hry?**\n\nV tejto lekcii využiješ získané vedomosti o rýchlosti a detekcii kolízií na vytvorenie jednoduchej počítačovej hry plošinovky!"
        },
        "csd3-2021/Complex Sprite Movement": {
          "name": "Komplexný pohyb sprajtov",
          "overview": "**Otázka dňa: Ako môžeme skombinovať bloky, ktoré už poznáme tak, aby vytvorili zaujímavý pohyb?**\n\nV tejto lekcii sa naučíte skombinovať pohybové vlastnosti sprajtu pomocou počítadla na vytvorenie zložitejšieho pohybu. Po zopakovaní oboch konceptov preskúmate viacero scenárov, v ktorých sa rýchlosť využíva spolu s počítadlom, vďaka čomu objavíte viacero typov výsledných pohybov. Naučíte sa simulovať gravitáciu a vyskúšate tvoriť nové pohyby len pomocou kombinácie blokov, ktoré už poznáte.",
          "purpose": "Táto lekcia nezavádza žiadne nové bloky a v skutočnosti využíva len vzory, ktoré žiaci videli v kapitole 1. Namiesto toho ukazuje, ako kombinácia týchto nástrojov, najmä abstrakcií, ktoré si žiaci osvojili v predchádzajúcich dvoch lekciách, umožňuje vytvárať nové správanie pre ich sprajty. To zdôrazňuje širšiu myšlienku, že abstrakcie nielen zjednodušujú kód, ale aj samy môžu byť použité ako stavebné bloky ešte zložitejšieho správania.  ",
          "student_overview": "**Otázka dňa: Ako sa dajú predchádzajúce bloky skombinovať do nových vzorov, aby vytvorili zaujímavé pohyby?**\n\nV tejto lekcii sa naučíš spojiť rýchlostné vlastnosti sprajtov s počítadlom, a nastaviť tak sprajtom zložitejšie pohyby. "
        },
        "csd3-2021/Collisions": {
          "name": "Kolízie sprajtov",
          "overview": "**Otázka dňa: Ako môžu programátori rozvíjať abstrakcie a vytvárať ďalšie abstrakcie?**\n\nV tejto lekcii žiaci naprogramujú svoje sprajty tak, aby spolu interagovali novými spôsobmi. Po krátkom zopakovaní toho, ako použili blok [\\`isTouching\\`(#f78183)](/docs/gamelab/isTouching/), žiaci vymyslia ďalšie spôsoby, ako by mohli dva sprajty interagovať. Potom použijú blok [\\`isTouching\\`(#f78183)](/docs/gamelab/isTouching/) na to, aby jeden sprajt tlačil druhý po obrazovke, a potom si precvičia prácu so štyrmi blokmi kolízie ([\\`collide\\`(#f78183)](/docs/gamelab/collide/), [\\`displace\\`(#f78183)](/docs/gamelab/displace/), [\\`bounce\\`(#f78183)](/docs/gamelab/bounce/) a [\\`bounceOff\\`(#f78183)](/docs/gamelab/bounceOff/)).",
          "purpose": "Táto lekcia je zameraná na kolízie, ďalšiu užitočnú abstrakciu, ktorá žiakom umožní manipulovať so sprajtmi úplne novými spôsobmi. Hoci by žiaci teoreticky mohli napísať vlastné príkazy displace, collide alebo bounce, možnosť ignorovať detaily tohto kódu im umožňuje sústrediť pozornosť na vysokoúrovňovú štruktúru hier, ktoré chcú vytvoriť.\n\nCieľom tejto lekcie je tiež umožniť žiakom lepšie si precvičiť používanie nových príkazov, ktoré sa naučili v druhej kapitole. V tejto lekcii sa naposledy naučia nové správanie sprajtov a po tejto lekcii sa žiaci preorientujú na organizáciu svojho čoraz zložitejšieho kódu.",
          "student_overview": "**Otázka dňa: Ako dokážu programátori stavať na abstrakciách, a vytvárať tak ďalšie abstrakcie?**\n\nV tejto lekcii sa naučíš používať bloky kolízií („collide“, „displace“, „bounce“ a „bounceOff“), a prinútiť tak sprajty interagovať zaujímavými novými spôsobmi. "
        },
        "csd3-2021/Mini-Project: Flyer Game": {
          "name": "Miniprojekt – Lietacia hra",
          "overview": "**Otázka dňa:  Ako sa dajú nové typy kolízií a modelovanie pohybu využiť pri tvorbe hry?**\n\nŽiaci využijú to, čo sa naučili o simulácii gravitácie a rôznych typoch kolízií, na vytvorenie jednoduchých lietacích hier. Po prezretí vzorovej lietacej hry žiaci vymyslia, aký druh lietacej hry by chceli, a potom pomocou štruktúrovaného postupu naprogramujú hru v programe Code Studiu.",
          "purpose": "Na tejto hodine majú žiaci možnosť kreatívnejšie využiť získané poznatky. Povzbuďte žiakov, aby venovali čas častiam aktivity, ktoré ich zaujímajú, pokiaľ spĺňajú požiadavky zadania.",
          "student_overview": "**Otázka dňa:  Ako sa dajú nové typy kolízií a modelovanie pohybu využiť pri tvorbe hry?**\n\nV tejto lekcii využijete to, čo ste sa naučili o simulácii gravitácie a rôznych typoch kolízií, na vytvorenie jednoduchej lietacej hry!"
        },
        "csd3-2021/Functions": {
          "name": "Funkcie",
          "overview": "**Otázka dňa: Ako môžu programátori používať funkcie na vytváranie vlastných abstrakcií?**\n\nŽiaci sa naučia vytvárať funkcie na usporiadanie svojho kódu, zlepšenie jeho čitateľnosti a odstránenie opakujúcich sa blokov kódu. Žiaci sa najprv zamyslia nad tým, aké nové bloky by chceli mať v Game Labe a aký kód by tieto bloky obsahovali. Potom sa žiaci naučia vytvárať funkcie v Game Labe. Funkcie použijú na odstránenie rozsiahlych blokov kódu z cyklu kreslenia a na nahradenie opakujúcich sa častí kódu jednou funkciou.",
          "purpose": "V predchádzajúcich lekciách sa žiaci naučili používať vo svojich programoch niekoľko abstrakcií vrátane vlastností rýchlosti, bloku isTouching a kolízií. Tieto abstrakcie im umožnili vytvárať oveľa zložitejšie programy, pričom mohli ignorovať detaily toho, ako sa toto správanie vytvára. V tejto lekcii sa žiaci naučia vytvárať vlastné abstrakcie vytváraním funkcií.\n\nŽiaci budú používať funkcie predovšetkým na rozdelenie kódu na logické časti, ktoré sa dajú ľahšie pochopiť. To predznamenáva prechod kapitoly od budovania technických zručností k organizačným procesom používaným pri vývoji softvéru.",
          "student_overview": "**Otázka dňa: Ako môžu programátori využiť funkcie na vytvorenie vlastných abstrakcií?**\n\nV tejto lekcii sa naučíte, ako lepšie zorganizovať svoj kód pomocou funkcií, aby bol kód programu čitateľnejší a aby ste odstránili opakujúce sa bloky kódu. "
        },
        "csd3-2021/The Game Design Process": {
          "name": "Proces návrhu hry",
          "overview": "**Otázka dňa: Ako vám plán uľahčí uskutočnenie veľkého projektu?**\n\nNa tejto hodine sa žiaci oboznámia s postupom, ktorý budú používať pri navrhovaní hier po zvyšok tematického celku. Tento proces sa sústreďuje na sprievodcu projektom, ktorý od žiakov vyžaduje, aby definovali svoje sprajty, premenné a funkcie predtým, ako začnú programovať svoju hru. Na začiatku tejto vyučovacej hodiny si žiaci zahrajú hru v Game Labe, v ktorej je skrytý kód. Diskutujú o tom, aké by podľa nich mali byť sprajty, premenné a funkcie na vytvorenie hry. Potom dostanú vyplneného sprievodcu projektom, ktorý ukazuje jeden zo spôsobov realizácie hry. Žiaci potom prechádzajú týmto procesom cez sériu úrovní. Na konci hodiny majú žiaci možnosť hru vylepšiť, aby bola podľa ich predstáv.",
          "preparation": "-   Vytlačte kópie sprievodcu projektom, ak budete žiakom rozdávať fyzické kópie.  Upozorňujeme, že tento sprievodca projektom je zámerne vyplnený. (Pozrite si poznámky v učebnom pláne.)",
          "purpose": "Táto lekcia približuje viacsnímkové animácie a je prvou lekciou zo série zameranej na proces tvorby softvéru.\n\nZatiaľ čo predchádzajúce lekcie sa zameriavali na používanie abstrakcií na zvládnutie zložitosti kódu, táto lekcia sa zameriava na zvládnutie zložitosti procesu vývoja softvéru. Vyučovacia hodina výrazne podporuje proces vývoja softvéru tým, že žiakom poskytuje vyplneného sprievodcu projektom, ponúka východiskový kód a sprevádza žiakov jeho implementáciou. V ďalších lekciách budú musieť žiaci samostatne dokončiť väčšiu časť tohto sprievodcu a pri záverečnom projekte budú postupovať podľa tohto procesu do značnej miery samostatne.",
          "student_overview": "**Otázka dňa: Ako vám plán uľahčí uskutočnenie veľkého projektu?**\n\nNa tejto hodine sa zoznámite s postupom, ktorý budete používať počas zvyšku tohto tematického celku pri navrhovaní hier. "
        },
        "csd3-2021/Using the Game Design Process": {
          "name": "Využitie procesu návrhu hry",
          "overview": "**Otázka dňa:  Ako môže proces riešenia problémov pomôcť programátorom zvládnuť veľké projekty?**\n\nV rámci tejto viacdňovej lekcie žiaci použijú proces riešenia problémov z 1. lekcie na vytvorenie plošinovej skákacej hry. Na začiatku si pozrú príklad plošinovej skákačky a potom definujú, ako bude vyzerať ich hra. Potom pomocou štruktúrovaného procesu naplánujú pozadia, premenné, sprajty a funkcie, ktoré budú potrebovať na realizáciu svojej hry. Po napísaní kódu hry sa žiaci zamyslia nad tým, ako by sa hra dala vylepšiť, a tieto zmeny implementujú.",
          "preparation": "-   Vytlačte jednu kópiu sprievodcu projektom pre každého žiaka alebo dvojicu žiakov",
          "purpose": "Žiaci sa už naučili všetky programové štruktúry, ktoré potrebujú na vytvorenie hry. V tejto lekcii si zopakujú mnohé z týchto pojmov a zároveň sa oboznámia so štruktúrovaným postupom, ktorý im pomôže zvládnuť prácu. Nadväzuje na používanie sprievodcu projektom v predchádzajúcej lekcii tým, že žiaci samostatne dokončia väčšiu časť tohto sprievodcu projektom predtým, ako ho použijú na vytvorenie hry. Táto aktivita pripravuje žiakov na napísanie vlastnej hry od základov pre záverečný projekt.",
          "student_overview": "**Otázka dňa:  Ako môže proces riešenia problémov pomôcť programátorom zvládnuť veľké projekty?**\n\nV rámci tejto viacdňovej lekcie použijete proces riešenia problémov na vytvorenie plošinovej skákacej hry."
        },
        "csd3-2021/Project - Design a Game": {
          "name": "Projekt – Vytvor si vlastnú hru",
          "overview": "**Otázka dňa: Ako môže päť postupov informatiky (riešenie problémov, vytrvalosť, komunikácia, spolupráca a tvorivosť) pomôcť programátorom pri realizácii veľkých projektov?**\n\nŽiaci si naplánujú a vytvoria vlastnú hru s použitím sprievodcu projektom z predchádzajúcich dvoch lekcií. Pri práci samostatne alebo vo dvojiciach sa žiaci najprv rozhodnú, aký typ hry by chceli vytvoriť, pričom sa inšpirujú sadou vzorových hier. Potom vyplnia prázdneho sprievodcu projektom, v ktorom opíšu správanie hry a zakreslia premenné, sprajty a funkcie, ktoré budú potrebovať pri tvorbe. V Code Studiu im séria úrovní ponúkne všeobecnú postupnosť, ktorú môžu použiť na realizáciu tohto plánu. V priebehu tohto procesu budú žiaci zdieľať svoje čiastkové projekty na posúdenie spolužiakmi a zapracujú do nich spätnú väzbu, keď budú dokončovať svoju hru. Na konci lekcie sa žiaci podelia o svoje dokončené hry so svojimi spolužiakmi. Tento projekt bude pokrývať viacero vyučovacích hodín a môže pokojne trvať 3 až 5 vyučovacích hodín.",
          "preparation": "-   Vytlačte kópie sprievodcu projektom, jednu pre každého žiaka / dvojicu žiakov\n-   Vytlačte kópie hodnotiacej tabuľky, jednu pre každého žiaka / dvojicu žiakov\n-   Vytlačte kópie sprievodcu vzájomným hodnotením, jednu pre každého žiaka / dvojicu žiakov\n-   Preskúmajte vzorové hry v Code Studiu",
          "purpose": "Táto hodina je vyvrcholením 3. lekcie a poskytuje žiakom príležitosť vytvoriť vlastný projekt v Game Labe od základov. Pomocné body, ktoré poskytuje sprievodca projektom, a prax, ktorú majú s jeho používaním, majú študentom pomôcť pri plánovaní ich projektov a doviesť ich nápady do konca. Tento projekt je príležitosťou na predvedenie technických zručností, ale budú musieť aj spolupracovať so svojím partnerom, poskytovať konštruktívnu spätnú väzbu rovesníkom a opakovane používať proces riešenia problémov, keď sa na ceste vyskytnú prekážky. Tento projekt by mal byť podľa možnosti riadený žiakmi a mal by poskytnúť posilňujúci a pamätihodný záver tohto tematického celku kurzu Objavujeme informatiku.",
          "student_overview": "**Otázka dňa: Ako môže päť postupov informatiky (riešenie problémov, vytrvalosť, komunikácia, spolupráca a tvorivosť) pomôcť programátorom pri realizácii veľkých projektov?**\n\nV tejto lekcii využijete proces riešenia problémov na naplánovanie a vytvorenie svojej vlastnej hry!"
        },
        "csd3-2021/lesson-1": {
          "name": "Objavujeme informatiku: Záverečný dotazník"
        },
        "csd1-2021/Intro to Problem Solving": {
          "name": "Úvod do riešenia problémov",
          "overview": "**Otázka dňa: Čo nám môže pomôcť spolupracovať a riešiť problémy ako tím?**\n\nV tejto lekcii žiaci pracujú v skupinách na navrhovaní lodiek z hliníkovej fólie. Cieľom je navrhnúť loďku, ktorá udrží čo najviac jednocentových mincí. Skupiny pracujú na svojich loďkách počas dvoch kôl, pričom ich cieľom je dosiahnuť, aby v druhom kole ich loďka udržala viac mincí než v prvom. Štruktúra aktivity odkazuje na rôzne kroky, z ktorých pozostáva proces riešenia problémov a žiaci sa s nimi podrobnejšie oboznámia v nasledujúcej lekcii. Na konci hodiny žiaci zreflektujú túto aktivitu a spoja si ju s prístupmi k riešeniu problémov, ktoré budú využívať po zvyšok kurzu.\n\n**K dispozícii sú aj alternatívne verzie tejto lekcie** \n\n-   [Novinový stôl](/s/csd1-2021/lessons/9/)\n-   [Špagetový most](/s/csd1-2021/lessons/10/)\n-   [Papierová veža](/s/csd1-2021/lessons/11/)",
          "preparation": "**Pre každú skupinu**\n\n-   2 kusy hliníkovej fólie s rozmermi 12,5x12,5 cm\n-   1 nádoba, do ktorej sa dá napustiť 7,5 – 12,5 cm vody\n-   Viacero papierových utierok alebo handier na umiestnenie pod nádobu\n-   15 jednocentových mincí\n-   1 kópia sprievodcu aktivitou\n\n**Pre učiteľa**\n\n-   1 nádoba, do ktorej sa dá napustiť 7,5 – 12,5 cm vody\n-   50 jednocentových mincí\n-   Papierové utierky alebo handry do zásoby ",
          "purpose": "Táto lekcia je zábavným úvodom k otvorenému, spoločnému a tvorivému riešeniu problémov, ktoré budú žiaci využívať po zvyšok tohto tematického celku a kurzu. Úloha s hliníkovými loďkami sa dá ľahko zameniť za niektorú z množstva iných úloh, pri ktorých si žiaci majú zadefinovať ciele, vytvoriť plán, vyskúšať riešenie, vyhodnotiť výsledky a potom svoje riešenie postupne zlepšovať. Výber úlohy, ktorá nesúvisí s výpočtovou technikou, je zámerný. Informatika je vo svojej podstate odbor zameraný na riešenie problémov, a tým, že v tomto bode ešte nevyužívame tradičné informatické úlohy, tento predmet rámcujeme ako kurz zameraný na všeobecnejšie riešenie problémov, ktorý informatiku využíva ako nový nástroj na riešenie istých typov úloh.",
          "student_overview": "**Otázka dňa: Čo nám môže pomôcť spolupracovať a riešiť problémy ako tím?**\n\nBudete v skupine navrhovať a testovať loďku z hliníkovej fólie. Cieľom je navrhnúť loďku, ktorá udrží čo najviac jednocentových mincí."
        },
        "csd1-2021/The Problem Solving Process": {
          "name": "Postup riešenia problémov",
          "overview": "**Otázka dňa: Aké bežné kroky môžeme použiť na riešenie rôznych typov problémov?**\n\nTáto lekcia predstavuje formálny postup riešenia problémov, podľa ktorého budú žiaci počas roka postupovať. Postup pozostáva zo štyroch krokov: definuj – priprav – vyskúšaj– vyhodnoť. Lekcia sa začína tým, že žiaci dostanú za úlohu vymenovať rôzne typy problémov, s ktorými sa stretávajú v každodennom živote. Žiaci sa potom oboznámia so štvoricou krokov, z ktorých pozostáva postup riešenia problémov, a spoločne sa snažia spojiť si tieto abstraktné kroky s vlastnými skúsenosťami s riešením problémov. Žiaci si tieto kroky najprv spoja s problémami, s ktorými sa stretli v predchádzajúcej lekcii, potom s nejakým problémom, ktorý už vedia dobre riešiť, a nakoniec s problémom, v riešení ktorého by sa chceli zlepšiť. Na konci hodiny žiaci v rámci triedy vytvoria zoznam všeobecne užitočných stratégií pre každý krok postupu riešenia problémov. Stratégie následne spíšu na plagáty, ktoré budú používať po zvyšok tematického celku a roka.",
          "preparation": "Pre každého žiaka \n\n-   Vytlačte kópiu sprievodcu aktivitou\n\nPre triedu\n\n-   Plagátový papier\n-   Fixky alebo pastelky",
          "purpose": "Cieľom tejto lekcie je ukotviť formálny postup riešenia problémov, ktorý budú žiaci využívať počas kurzu, jeho prepojením s reálnymi skúsenosťami žiakov s riešením problémov. V nasledujúcich tematických celkoch v kurze Objavujeme informatiku budú úlohy prezentované v kontextoch, ktoré žiakom môžu, no nemusia byť povedomé. Štruktúrovaný postup riešenia problémov preto bude pre žiakov dôležitým nástrojom, ktorý im pomôže úspešne riešiť aj nové a zložité úlohy.",
          "student_overview": "**Otázka dňa: Aké bežné kroky môžeme použiť na riešenie rôznych typov problémov?**\n\nDnes sa budete učiť o postupe riešenia problémov, ktorý využívame v informatike, a pozrieme sa aj na niekoľko stratégií, ako jednotlivé kroky uskutočňovať. "
        },
        "csd1-2021/Exploring Problem Solving": {
          "name": "Objavujeme riešenie problémov",
          "overview": "**Otázka dňa: Ako môžeme postup riešenia problémov využiť pri rôznych druhoch problémov?**\n\nV tejto lekcii žiaci využijú postup riešenia problémov na tri rôzne úlohy, aby lepšie pochopili hodnotu jednotlivých krokov. Vyriešia osemsmerovku, usporiadajú sedenie na narodeninovú oslavu a prerobia triedu. Každý ďalší problém je zložitejší a definovaný horšie než ten predchádzajúci, čím chceme zdôrazniť, že postup riešenia problémov je nápomocný najmä pri riešení takýchto problémov. Na konci hodiny sa žiaci zamyslia nad tým, ako využívali postup riešenia problémov. Zdôvodnia zahrnutie jednotlivých krokov a budú vymýšľať otázky a stratégie, ako čo najlepšie zadefinovať problémy s otvoreným riešením, pretože práve tento krok je často najdôležitejší.\n\nTáto lekcia pravdepodobne zaberie dve alebo viac vyučovacích hodín. Prvé dva problémy sa môžu zmestiť do jednej hodiny, ale tretí bude potrebné presunúť do druhej.\n\n**K dispozícii sú aj alternatívne verzie tejto lekcie** \n\n-   [Zvieratá](/s/csd1-2021/lessons/12/)\n-   [Hry](/s/csd1-2021/lessons/13/)",
          "preparation": "-   Vytlačte pre každého žiaka sprievodcu aktivitou\n-   Škrabací papier na riešenie narodeninovej oslavy\n-   Plagát na spísanie stratégií na definovanie problémov v záverečnej diskusii",
          "purpose": "Táto lekcia žiakom poskytuje možnosť viac si vyskúšať postup riešenia problémov v praxi a v rôznych kontextoch. Vyzdvihuje fakt, že postup riešenia problémov je užitočný najmä vtedy, keď treba riešiť zle zadefinované problémy. Záverečný brainstorming v lekcii poskytne žiakom stratégie a otázky, pomocou ktorých budú schopní lepšie definovať problémy, keďže práve tento krok je často najdôležitejší. Problémy rozoberané v tejto lekcii slúžia aj na to, aby v nasledujúcej lekcii podporili diskusiu o tom, na riešenie akých typov problémov sú počítače stavané výnimočne dobre.",
          "student_overview": "**Otázka dňa: Ako môžeme postup riešenia problémov využiť na riešenie rôznych typov problémov?**\n\nDnes využijete postup riešenia problémov na to, aby ste vyriešili tri rôzne problémy, pri ktorých bude každý ďalší problém náročnejší!"
        },
        "csd1-2021/What is a Computer?": {
          "name": "Čo je to počítač?",
          "overview": "**Otázka dňa: Čo je to počítač?**\n\nV tejto lekcii žiaci vytvoria predbežnú definíciu toho, čo je to počítač. Na začiatku lekcie budú žiaci vymýšľať možné definície počítača a svoje nápady budú písať na tabuľu. Potom budú pracovať v skupinách a na plagátový papier roztriedia obrázky do dvoch kategórií: „počítače“ a „nepočítače“. Skupiny rozmiestnia svoje plagáty po triede a stručne zdôvodnia, ako sa rozhodovali v najnáročnejších prípadoch. Učiteľ potom žiakom povie definíciu počítača a dá im možnosť upraviť svoje plagáty tak, aby na nich boli veci roztriedené v súlade s touto definíciou.",
          "preparation": "**Pre každú skupinu** \n\n-   Vytlačte sprievodcov aktivitou. Upozorňujeme, že k dispozícii sú dva súbory obrázkov, no každej skupine postačí jeden.\n-   Nožnice (ak nebudete mať čas nastrihať obrázky pred hodinou) \n-   Plagátový papier\n-   Fixky alebo pastelky\n-   Lepidlo alebo lepiaca páska na pripevnenie obrázkov ",
          "purpose": "Táto lekcia rozvíja tému riešenia problémov z predchádzajúcich lekcií a zameriava sa na špecifiká toho, ako sa pri riešení problémov využíva výpočtová technika. V tejto lekcii sa žiaci budú učiť o rôznych typoch počítačov a o tom, ako tieto počítače v rámci postupu riešenia problémov využívajú informácie. Nasledujúce lekcie sa budú podrobnejšie zameriavať na to, v čom spočívajú informačné problém a ako ich počítače riešia.",
          "student_overview": "**Otázka dňa: Čo je to počítač?**\n\nV tejto lekcii sa budete v skupinách snažiť zistiť, čo robí počítač počítačom."
        },
        "csd1-2021/Input and Output": {
          "name": "Vstup a výstup",
          "overview": "**Otázka dňa: Ako využívajú počítače vstup a výstup na získanie a poskytnutie informácií potrebných na riešenie problémov?**\n\nV tejto lekcii sa žiaci zaoberajú tým, ako počítače získavajú a poskytujú informácie používateľovi prostredníctvom vstupu a výstupu. Žiaci sa najprv zamyslia nad tým, aké informácie by boli potrebné na vyriešenie „myšlienkového“ problému, a potom na základe týchto informácií sformulujú odporučenie. Následne identifikujú vstupy a výstupy tohto procesu. Potom preskúmajú sériu aplikácií, ktorá tiež využíva tento proces, a pre každú z nich určia vstupy a výstupy informácií. Nakoniec sa pozrú na iné typy vstupov a výstupov, ktoré dokážu počítače využiť pri riešení problémov.",
          "preparation": "-   Pripravte kópie sprievodcu aktivitou",
          "purpose": "Na začiatku predchádzajúcej lekcie sa žiaci snažili vymenovať vlastnosti, na základe ktorých zariadenia klasifikujeme ako počítače. Táto lekcia predstavuje koncept vstupu a výstupu, ktoré medzi tieto vlastnosti patria. Žiaci majú za úlohu identifikovať rôzne spôsoby vstupu a výstupu v bežných aplikáciách.",
          "student_overview": "**Otázka dňa: Ako počítače využívajú vstup a výstup na získavanie a poskytovanie informácií potrebných na riešenie problémov?**\n\nV tejto lekcii sa budete učiť o tom, ako počítače získavajú od používateľa informácie a ako používateľovi informácie poskytujú prostredníctvom rôznych vstupov a výstupov. "
        },
        "csd1-2021/Processing": {
          "name": "Spracúvanie",
          "overview": "\\*\\*Otázka dňa: Akými rôznymi spôsobmi počítače spracúvajú informácie?\n\\*\\*\n\nTáto lekcia žiakom predstavuje štyri bežné spôsoby spracovania údajov: ak/tak (podmienené príkazy), hľadanie zhody (vyhľadávanie), počítanie a porovnávanie. Žiaci sa s rôznymi typmi spracúvania najskôr oboznámia prostredníctvom vzorových aplikácií. Následne preskúmajú ďalšie aplikácie, aby určili, aké typy spracúvania sa v nich používajú. Potom vymyslia svoju vlastnú aplikáciu a rozhodnú, aké typy spracúvania by potrebovala využívať. Na záver pomocou brainstormingu skúsia prísť na ďalšie typy spracúvania, ktoré by mohli byť užitočné, no v hlavnej lekcii sa nespomínali.",
          "purpose": "Táto lekcia žiakom predstaví spracúvanie v kontexte riešenia problémov pomocou počítača. Definícia spracúvania, s ktorou sa žiaci stretnú v tejto lekcii, je úmyselne sformulovaná čo najprístupnejšie. Žiaci by si mali uvedomiť, že k spracúvaniu dochádza vždy, keď počítač premieňa vstupy na výstupy, a že existuje množstvo rôznych spôsobov, ako to môžu počítače robiť. Táto lekcia neslúži na to, aby žiaci písali konkrétne algoritmy do ukážkových aplikácií.",
          "student_overview": "**Otázka dňa: Akými rôznymi spôsobmi počítače spracúvajú informácie?**\n\nV tejto lekcii sa oboznámite so štyrmi hlavnými typmi spracúvania, ktorými počítače premieňajú vstupy na výstupy."
        },
        "csd1-2021/Storage": {
          "name": "Pamäť",
          "overview": "**Otázka dňa: Prečo je pamäť dôležitou súčasťou výpočtového procesu?**\n\nV tejto lekcii sa žiaci oboznámia s poslednou súčasťou výpočtového modelu, ktorý prezentujeme v tomto tematickom celku: pamäť. Po vyskúšaní aplikácie „Výber oblečenia“ žiaci diskutujú o tom, aké informácie by mali byť v aplikácii uložené a aké informácie by sa mali zadávať ako vstupy pri každom spustení. Potom sa pozrú na sériu aplikácií a na základe svojich rozhodnutí o tom, čo sa má uložiť, spíšu všeobecné zásady pre rozhodovanie, aké informácie by sa mali ukladať. Potom preskúmajú štyri súčasti výpočtového modelu, ktorý prezentujeme v tejto kapitole: vstup, výstup, pamäť a spracúvanie. Následne budú mať ešte jednu príležitosť upraviť svoje rozhodnutia o tom, ktoré položky zo skoršej časti tejto kapitoly by mali byť zatriedené do kategórie „počítače“. Hodina sa pre žiakov končí reflexiou zameranou na ich vlastné nápady na aplikácie a to, ako by sa v nich využívala pamäť.",
          "preparation": "-   Vytlačte pre každého žiaka kópiu sprievodcu aktivitou",
          "purpose": "V 1. kapitole tohto tematického celku sa žiaci oboznámili s postupom riešenia problémov. V 2. kapitole sa naučili, ako riešia problémy počítače. V tomto bode už žiaci vedia, že počítače sú stroje na spracúvanie informácií, ktoré dokážu s informáciami narábať v štyroch rôznych ohľadoch: prijímajú vstupy, vytvárajú výstupy, ukladajú informácie pomocou pamäte a spracúvajú informácie. V tejto poslednej lekcii pred záverečným projektom k tematickému celku sa žiaci pozrú na rôzne typy vstupov, ktoré by mohli potrebovať na riešenie konkrétneho problému, a opíšu proces spracúvania a ukladania do pamäte, prostredníctvom ktorého by počítač vytvoril požadovaný výstup. Táto aktivita by žiakov mala pripraviť na to, aby boli nakoniec schopní vyriešiť problém navrhnutím vlastnej aplikácie a vysvetliť, ako by takáto aplikácia fungovala.",
          "student_overview": "**Otázka dňa: Prečo je pamäť dôležitou súčasťou výpočtového procesu?**\n\nV tejto lekcii sa dozviete o poslednej vlastnosti, ktorá robí počítač počítačom – je ňou pamäť!"
        },
        "csd1-2021/Project - Propose an App": {
          "name": "Projekt - Navrhnite aplikáciu",
          "overview": "**Otázka dňa: Ako nám model VVPS pomáha navrhnúť aplikáciu, ktorá rieši problém?**\n\nPo zvládnutí kapitoly zameranej na postup riešenia problémov a na záver kapitoly o počítačovom modeli vstup/výstup/pamäť/spracúvanie žiaci navrhnú aplikáciu, ktorej úlohou je vyriešiť problém z reálneho sveta. Projekt bude rozložený na niekoľko dní a jeho výstupom bude plagát, prostredníctvom ktorého žiaci vysvetlia ostatným spolužiakom funkcie svojej aplikácie. Žiakom pri práci na projekte pomôže sprievodca projektom, ktorý obsahuje podrobné pokyny a pomáha žiakom usporiadať si myšlienky. Projekt je určený na prácu vo dvojici, no je možné robiť ho aj samostatne.",
          "preparation": "-   Pre každú dvojicu vytlačte jednu kópiu dokumentu [r app-proposal-project/csd/2021].\n-   Pripravte žiakom plagátový papier, perá, fixky a ďalšie kancelárske potreby na výrobu plagátov",
          "purpose": "Tento projekt v sebe spája dve hlavné témy 1. tematického celku: riešenie problémov a počítačový model vstup-výstup-pamäť-spracúvanie. Projekt prepája obe témy so širším cieľom tematického celku, ktorým je identifikácia problémov z reálneho sveta a hľadanie spôsobov, ako ich vyriešiť pomocou techniky. Žiaci počas projektu spoločne pracujú na vytvorení aplikácie a zúčastňujú sa štruktúrovaného procesu spätnej väzby od spolužiakov,  s ktorým sa počas tohto kurzu stretnú ešte veľakrát. Projekt by mal byť pre žiakov zábavným a tvorivým zážitkom, ktorý im dá príležitosť prepojiť informatiku so svojimi vlastnými záujmami a cieľmi.",
          "student_overview": "**Otázka dňa: Ako nám model VVPS pomáha navrhnúť aplikáciu, ktorá rieši problém?**\n\nV tejto lekcii strávite niekoľko dní vymýšľaním aplikácie, ktorá využíva model vstup-výstup-pamäť-spracúvanie na riešenie problému z reálneho sveta."
        },
        "csd1-2021/Intro to Problem Solving - Newspaper Table (Alternate Lesson 1)": {
          "name": "Úvod do riešenia problémov – Novinový stôl (Alternatívna lekcia č. 1)",
          "overview": "**Otázka dňa: Čo nám môže pomôcť spolupracovať a riešiť problémy ako tím?**\n\nV tejto lekcii žiaci pracujú v skupinách na navrhovaní novinových stolov. Cieľom je navrhnúť stôl, ktorý udrží čo najviac kníh. Skupiny pracujú na svojich stoloch počas dvoch kôl, pričom ich cieľom je dosiahnuť, aby v druhom kole ich stôl udržal viac kníh než v prvom. Štruktúra aktivity odkazuje na rôzne kroky, z ktorých pozostáva proces riešenia problémov a žiaci sa s nimi podrobnejšie oboznámia v nasledujúcej lekcii. Na konci hodiny žiaci zreflektujú túto aktivitu a spoja si ju s prístupmi k riešeniu problémov, ktoré budú využívať po zvyšok kurzu.\n\n**Táto lekcia je alternatívou k lekcii [Úvod do riešenia problémov – Hliníkové loďky](/s/csd1-2021/lessons/1/)**",
          "preparation": "**Pre každú skupinu**\n\n-   2 výtlačky novín\n-   1 rolka lepiacej pásky\n-   1 kópia sprievodcu aktivitou\n\n**Pre učiteľa**\n\n-   10 – 20 kníh podobnej váhy.",
          "purpose": "Táto lekcia je zábavným úvodom k otvorenému, spoločnému a tvorivému riešeniu problémov, ktoré budú žiaci využívať po zvyšok tohto tematického celku a kurzu. Úloha s novinovými stolmi sa dá ľahko zameniť za niektorú z množstva iných úloh, pri ktorých si žiaci majú zadefinovať ciele, vytvoriť plán, vyskúšať riešenie, vyhodnotiť výsledky a potom svoje riešenie postupne zlepšovať. Výber úlohy, ktorá nesúvisí s výpočtovou technikou, je zámerný. Informatika je vo svojej podstate odbor zameraný na riešenie problémov, a tým, že v tomto bode ešte nevyužívame tradičné informatické úlohy, tento predmet rámcujeme ako kurz zameraný na všeobecnejšie riešenie problémov, ktorý informatiku využíva ako nový nástroj na riešenie istých typov úloh.",
          "student_overview": "**Otázka dňa: Čo nám môže pomôcť spolupracovať a riešiť problémy ako tím?**\n\nV tejto lekcii budete v skupine navrhovať, stavať a testovať stôl z novín a následne prehodnocovať svoj postup. Cieľom je navrhnúť stôl, ktorý udrží čo najviac kníh."
        },
        "csd1-2021/Intro to Problem Solving - Spaghetti Bridge (Alternate Lesson 1)": {
          "name": "Úvod do riešenia problémov – Špagetový most (Alternatívna lekcia č. 1)",
          "overview": "**Otázka dňa: Čo nám môže pomôcť spolupracovať a riešiť problémy ako tím?**\n\nV tejto lekcii žiaci pracujú v skupinách na navrhovaní špagetových mostov. Cieľom je navrhnúť most, ktorý udrží čo najviac kníh. Skupiny pracujú na svojich mostoch počas dvoch kôl, pričom ich cieľom je dosiahnuť, aby v druhom kole ich stôl udržal viac kníh než v prvom. Štruktúra aktivity odkazuje na rôzne kroky, z ktorých pozostáva proces riešenia problémov a žiaci sa s nimi podrobnejšie oboznámia v nasledujúcej lekcii. Na konci hodiny žiaci zreflektujú túto aktivitu a spoja si ju s prístupmi k riešeniu problémov, ktoré budú využívať po zvyšok kurzu.\n\n**Táto lekcia je alternatívou k lekcii [Úvod do riešenia problémov – Hliníkové loďky](/s/csd1-2021/lessons/1/)**",
          "preparation": "**Pre každú skupinu**\n\n-   1 balenie suchých špagiet (500 g)\n-   1 lepiaca pištoľ\n-   1 kópia sprievodcu aktivitou \n\n**Pre učiteľa**\n\n-   10 – 20 kníh podobnej veľkosti a váhy",
          "purpose": "Táto lekcia je zábavným úvodom k otvorenému, spoločnému a tvorivému riešeniu problémov, ktoré budú žiaci využívať po zvyšok tohto tematického celku a kurzu. Úloha so špagetovými mostami sa dá ľahko zameniť za niektorú z množstva iných úloh, pri ktorých si žiaci majú zadefinovať ciele, vytvoriť plán, vyskúšať riešenie, vyhodnotiť výsledky a potom svoje riešenie postupne zlepšovať. Výber úlohy, ktorá nesúvisí s výpočtovou technikou, je zámerný. Informatika je vo svojej podstate odbor zameraný na riešenie problémov, a tým, že v tomto bode ešte nevyužívame tradičné informatické úlohy, tento predmet rámcujeme ako kurz zameraný na všeobecnejšie riešenie problémov, ktorý informatiku využíva ako nový nástroj na riešenie istých typov úloh.",
          "student_overview": "**Otázka dňa: Čo nám môže pomôcť spolupracovať a riešiť problémy ako tím?**\n\nV tejto lekcii budete v skupine navrhovať, stavať a testovať most zo špagiet a následne prehodnocovať svoj postup. Cieľom je navrhnúť most, ktorý udrží čo najviac kníh."
        },
        "csd1-2021/Intro to Problem Solving - Paper Tower (Alternate Lesson 1)": {
          "name": "Úvod do riešenia problémov – Papierová veža (Alternatívna lekcia č. 1)",
          "overview": "**Otázka dňa: Čo nám môže pomôcť spolupracovať a riešiť problémy ako tím?**\n\nV tejto lekcii žiaci pracujú v skupinách na navrhovaní čo najvyšších papierových veží. Skupiny pracujú na svojich vežiach počas dvoch kôl, pričom ich cieľom je postaviť v druhom kole vyššiu vežu než v prvom. Štruktúra aktivity odkazuje na rôzne kroky, z ktorých pozostáva proces riešenia problémov a žiaci sa s nimi podrobnejšie oboznámia v nasledujúcej lekcii. Na konci hodiny žiaci zreflektujú túto aktivitu a spoja si ju s prístupmi k riešeniu problémov, ktoré budú využívať po zvyšok kurzu.\n\n**Táto lekcia je alternatívou k lekcii [Úvod do riešenia problémov – Hliníkové loďky](/s/csd1-2021/lessons/1/)**",
          "preparation": "**Pre každú skupinu**\n\n-   20 listov papiera veľkosti A4\n-   Priestor na stavbu veže\n-   1 kópiu sprievodcu aktivitou\n\n**Pre učiteľa**\n\n-   Papier navyše\n-   Časovač\n-   Pravítko",
          "purpose": "Táto lekcia je zábavným úvodom k otvorenému, spoločnému a tvorivému riešeniu problémov, ktoré budú žiaci využívať po zvyšok tohto tematického celku a kurzu. Úloha s papierovými vežami sa dá ľahko zameniť za niektorú z množstva iných úloh, pri ktorých si žiaci majú zadefinovať ciele, vytvoriť plán, vyskúšať riešenie, vyhodnotiť výsledky a potom svoje riešenie postupne zlepšovať. Výber úlohy, ktorá nesúvisí s výpočtovou technikou, je zámerný. Informatika je vo svojej podstate odbor zameraný na riešenie problémov, a tým, že v tomto bode ešte nevyužívame tradičné informatické úlohy, tento predmet rámcujeme ako kurz zameraný na všeobecnejšie riešenie problémov, ktorý informatiku využíva ako nový nástroj na riešenie istých typov úloh.",
          "student_overview": "**Otázka dňa: Čo nám môže pomôcť spolupracovať a riešiť problémy ako tím?**\n\nV tejto lekcii budete v skupine navrhovať, stavať a testovať papierovú vežu a následne prehodnocovať svoj postup. Cieľom je postaviť čo najvyššiu vežu."
        },
        "csd1-2021/Exploring Problem Solving - Animals Theme (Alternate Lesson 3)": {
          "name": "Objavujeme riešenie problémov – zvieratká (alternatíva k lekcii č. 3)",
          "overview": "**Otázka dňa: Ako môžeme postup riešenia problémov využiť pri rôznych druhoch problémov?**\n\nV tejto lekcii žiaci využijú postup riešenia problémov na tri rôzne úlohy, aby lepšie pochopili hodnotu jednotlivých krokov. Vyriešia tangram, vyberú niekoľkým ľuďom domáceho miláčika a naplánujú podujatie na adopciu domácich zvieratiek. Každý ďalší problém je zložitejší a definovaný horšie než ten predchádzajúci, čím chceme zdôrazniť, že postup riešenia problémov je nápomocný najmä pri riešení takýchto problémov. Na konci hodiny sa žiaci zamyslia nad tým, ako využívali postup riešenia problémov. Zdôvodnia zahrnutie jednotlivých krokov a budú vymýšľať otázky a stratégie, ako čo najlepšie zadefinovať problémy s otvoreným riešením, pretože práve tento krok je často najdôležitejší.\n\nTáto lekcia pravdepodobne zaberie dve alebo viac vyučovacích hodín. Prvé dva problémy sa môžu zmestiť do jednej hodiny, ale tretí bude potrebné presunúť do druhej.\n\n**Táto aktivita je alternatívou k aktivite [Objavujeme riešenie problémov](/s/csd1-2021/lessons/3/)**",
          "preparation": "-   Vytlačte pre každého žiaka sprievodcu aktivitou.\n-   Pripravte pre žiakov tangramy alebo každej skupine vytlačte jeden papier s tangramami a poskytnite jej nožnice.\n-   V záverečnej diskusii vytvorte plagát na zaznamenávanie stratégií, ktoré žiakom pomáhali definovať problémy.",
          "purpose": "Táto lekcia žiakom poskytuje možnosť viac si vyskúšať postup riešenia problémov v praxi a v rôznych kontextoch. Vyzdvihuje fakt, že postup riešenia problémov je užitočný najmä vtedy, keď treba riešiť zle zadefinované problémy. Záverečný brainstorming v lekcii poskytne žiakom stratégie a otázky, pomocou ktorých budú schopní lepšie definovať problémy, keďže práve tento krok je často najdôležitejší. Problémy rozoberané v tejto lekcii slúžia aj na to, aby v nasledujúcej lekcii podporili diskusiu o tom, na riešenie akých typov problémov sú počítače stavané výnimočne dobre.",
          "student_overview": "**Otázka dňa: Ako môžeme postup riešenia problémov využiť pri rôznych druhoch problémov?**\n\nV tejto lekcii budete využívať postup riešenia problémov na riešenie rôznych problémov, pričom každý ďalší bude zložitejší než ten pred ním."
        },
        "csd1-2021/Exploring Problem Solving - Games Theme (Alternate Lesson 3)": {
          "name": "Objavujeme riešenie problémov – hry (alternatíva k lekcii č. 3)",
          "overview": "**Otázka dňa: Ako môžeme postup riešenia problémov využiť pri rôznych druhoch problémov?**\n\nV tejto lekcii žiaci využijú postup riešenia problémov na tri rôzne úlohy, aby lepšie pochopili hodnotu jednotlivých krokov. Prejdú bludiskom, budú sa snažiť čo najrýchlejšie vytvoriť tím na preteky a navrhnú hru. Každý ďalší problém je zložitejší a definovaný horšie než ten predchádzajúci, čím chceme zdôrazniť, že postup riešenia problémov je nápomocný najmä pri riešení takýchto problémov. Na konci hodiny sa žiaci zamyslia nad tým, ako využívali postup riešenia problémov. Zdôvodnia zahrnutie jednotlivých krokov a budú vymýšľať otázky a stratégie, ako čo najlepšie zadefinovať problémy s otvoreným riešením, pretože práve tento krok je často najdôležitejší.\n\nTáto lekcia pravdepodobne zaberie dve alebo viac vyučovacích hodín. Prvé dva problémy sa môžu zmestiť do jednej hodiny, ale tretí bude potrebné presunúť do druhej.\n\n**Táto aktivita je alternatívou k aktivite [Objavujeme riešenie problémov](/s/csd1-2021/lessons/3/)**",
          "preparation": "-   Vytlačte pre každého žiaka sprievodcu aktivitou\n-   Škrabací papier na riešenie štafetových pretekov\n-   Plagát na spísanie stratégií na definovanie problémov v záverečnej diskusii",
          "purpose": "Táto lekcia žiakom poskytuje možnosť viac si vyskúšať postup riešenia problémov v praxi a v rôznych kontextoch. Vyzdvihuje fakt, že postup riešenia problémov je užitočný najmä vtedy, keď treba riešiť zle zadefinované problémy. Záverečný brainstorming v lekcii poskytne žiakom stratégie a otázky, pomocou ktorých budú schopní lepšie definovať problémy, keďže práve tento krok je často najdôležitejší. Problémy rozoberané v tejto lekcii slúžia aj na to, aby v nasledujúcej lekcii podporili diskusiu o tom, na riešenie akých typov problémov sú počítače stavané výnimočne dobre.",
          "student_overview": "**Otázka dňa: Ako môžeme postup riešenia problémov využiť pri rôznych druhoch problémov?**\n\nV tejto lekcii budete využívať postup riešenia problémov na riešenie rôznych problémov, pričom každý ďalší bude zložitejší než ten pred ním."
        }
      }
    }
  }
}