{
  "ta-IN": {
    "data": {
      "lessons": {
        "dance-extras/Dance Party - Go Further": {
          "purpose": "இந்த பாடம் குறியீட்டு மற்றும் நிகழ்வு நிரலாக்கத்தின் முக்கிய CS கருத்துக்களை அறிமுகப்படுத்துகிறது (தொகுதிகளைப் பயன்படுத்தி)."
        },
        "artist/Artist": {
          "student_overview": "கலைஞரை நிரலாக்குவதன் மூலம் அழகான படங்களை உருவாக்கவும்."
        },
        "dance/Dance Party": {
          "purpose": "இந்த பாடம் குறியீட்டு மற்றும் நிகழ்வு நிரலாக்கத்தின் முக்கிய CS கருத்துக்களை அறிமுகப்படுத்துகிறது (தொகுதிகளைப் பயன்படுத்தி)."
        },
        "sports/Sports": {
          "student_overview": "நீங்கள் பள்ளியில் வீடியோ கேம்களை விளையாட வேண்டும் என்று எப்போதாவது விரும்புகிறீர்களா? இந்த பாடத்தில், நீங்கள் அதை நீங்களே உருவாக்குவீர்கள்!"
        },
        "basketball/Bounce": {
          "student_overview": "நீங்கள் பள்ளியில் வீடியோ கேம்களை விளையாட வேண்டும் என்று எப்போதாவது விரும்புகிறீர்களா? இந்த பாடத்தில், நீங்கள் அதை நீங்களே உருவாக்குவீர்கள்!"
        },
        "dance-extras-2019/Dance Party - Go Further": {
          "purpose": "இந்த பாடம் குறியீட்டு மற்றும் நிகழ்வு நிரலாக்கத்தின் முக்கிய CS கருத்துக்களை அறிமுகப்படுத்துகிறது (தொகுதிகளைப் பயன்படுத்தி)."
        },
        "dance-2019/Dance Party": {
          "purpose": "இந்த பாடம் குறியீட்டு மற்றும் நிகழ்வு நிரலாக்கத்தின் முக்கிய CS கருத்துக்களை அறிமுகப்படுத்துகிறது (தொகுதிகளைப் பயன்படுத்தி)."
        },
        "outbreak/Outbreak": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "முந்தைய பாடத்தில், மாணவர்கள் ஒரு எளிய உருவகப்படுத்துதலில் இருந்து தரவைச் சேகரித்து விளக்கினர். இந்த பாடத்தில், மாணவர்கள் தங்கள் சொந்த உருவகப்படுத்துதல் மாதிரியை குறியிட வழிமுறைகளைப் பின்பற்றுவார்கள். உண்மையான உலகில் வைரஸ் வெடிப்புகள் பற்றிய மாணவர்களின் முன் அறிவு ஒரு கற்பனையான சூழ்நிலைக்கு பயன்படுத்தப்படும்.",
          "student_overview": "மான்ஸ்டர் டவுனுக்கு ஒரு வைரஸ் வந்துவிட்டது! ஒரு வைரஸ் சிமுலேட்டரை உருவாக்க கற்றுக்கொள்ளுங்கள் மற்றும் அரக்கர்கள் மீண்டும் ஆரோக்கியமாக இருக்க உதவுங்கள்."
        },
        "jigsaw/Jigsaw": {
          "student_overview": "புதிர்களை முடிக்க கிளிக் செய்து இழுக்கவும்."
        },
        "coursef-2021/lesson-6": {
          "preparation": "-   Code.org இல் மாணவர்கள் எவ்வாறு உள்நுழைகிறார்கள் என்பதைத் தீர்மானிக்கவும்.\n-   தேவைப்பட்டால், மாணவர்களுக்கு Code.org கணக்குகளை உருவாக்கவும்.\n-   மாணவர்களுக்கு ஸ்ப்ரைட் ஆய்வகத்தை அறிமுகப்படுத்துதல்.\n-   \\*\\* \\*ஆராய்ந்து பயன்பாடுகள் \\*\\* பணித்தாள் நகல்களை அச்சிடுங்கள் (அல்லது டிஜிட்டல் பதிப்பை \n    உங்கள் எல்எம்எஸ் -க்கு இடுகையிடவும்).",
          "purpose": "முதல் பாடத்தில் மாணவர்களுக்கு பாடத்திட்டத்தைப் பற்றி உற்சாகமூட்டுவது மற்றும் அவர்களின் தனிப்பட்ட நலன்களை கணினி அறிவியலுடன் இணைப்பது.",
          "student_overview": "உங்கள் வாழ்க்கையில் கணினிகள் மற்றும் தொழில்நுட்பத்தின் பங்கு பற்றி விவாதிப்பீர்கள், பயன்பாடுகள் மற்றும் கருவிகள் பயனர்களுக்கு அவற்றை எவ்வாறு பயன்படுத்துவது என்பதை எவ்வாறு தேர்வு செய்கின்றன என்பதில் கவனம் செலுத்துவீர்கள்."
        },
        "coursef-2021/lesson-7": {
          "preparation": "நிலைகளில் விளையாடுங்கள் மற்றும் \\*\\* \\*பாடம் ஸ்லைடுகளை \\*\\* மதிப்பாய்வு செய்யவும்.",
          "purpose": "இந்த பாடம் ஸ்பிரைட் ஆய்வகத்தில் மாணவர்களை நிரலாக்கத்திற்கு அறிமுகப்படுத்த வடிவமைக்கப்பட்டுள்ளது. மாணவர்கள் இந்தக் கருவியின் நிரலாக்க மாதிரியைப் பற்றிய புரிதலை உருவாக்கத் தொடங்குவார்கள், மேலும் அவர்கள் தங்களை வெளிப்படுத்திக் கொள்ள வழிகளைப் பற்றி ஆராய்கிறார்கள்.",
          "student_overview": "இந்த பாடத்தில் நீங்கள் புரோகிராம்களை எழுதுவீர்கள் மற்றும் ஸ்பிரிட்ஸ் மற்றும் நடத்தைகள் பற்றி அறிந்து கொள்வீர்கள்."
        },
        "coursef-2021/lesson-8": {
          "preparation": "நிலைகளில் விளையாடுங்கள் மற்றும் பாடம் ஸ்லைடுகளை மதிப்பாய்வு செய்யவும்.",
          "purpose": "இந்த பாடம் முந்தைய பாடத்திலிருந்து திறன்களை வலுப்படுத்த மற்றும் நிகழ்வுகளுடன் நிரலாக்கத்திற்கு மாணவர்களை அறிமுகப்படுத்த வடிவமைக்கப்பட்டுள்ளது. இந்த பாடநெறி முழுவதும், நிகழ்வுகள் மாணவர்கள் தங்கள் திட்டங்கள் காலப்போக்கில் அல்லது பயனருக்கு பதிலளிக்கும் விதமாக மாற்றுவதற்கான முதன்மை வழியாகும்.",
          "student_overview": "நீங்கள் நிரலாக்க நிலைகளின் மூலம் வேலை செய்வீர்கள் மற்றும் திறந்த-இலவச \"இலவச நாடகம்\" பணியை முடிப்பீர்கள், அங்கு நீங்கள் விரும்பியதை உருவாக்க முடியும்."
        },
        "coursef-2021/Virtual Pet": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்தப் பாடம் மாணவர்களை மற்றொரு படைப்பு சூழலில் முந்தைய பாடங்களிலிருந்து நிரலாக்கக் கருத்துகளைப் பயன்படுத்த அனுமதிக்கிறது.",
          "student_overview": "நீங்கள் விரும்பும் விதத்தில் நடந்து கொள்ளும் ஒரு ஊடாடும் மெய்நிகர் செல்லப்பிராணியை உருவாக்கவும்! உங்கள் செல்லப்பிராணிக்கு அதன் சொந்த வாழ்க்கையை கொடுங்கள்!"
        },
        "coursef-2021/lesson-2": {
          "preparation": "-   அறிவுறுத்தல் பொருட்களை மதிப்பாய்வு செய்யவும்.\n-   ஒவ்வொரு மாணவருக்கும் கையேட்டை (களை) அச்சிடுங்கள்.\n-   வகுப்பிற்கு ஒரு நீண்ட சரம் (அல்லது கயிறு) மற்றும் காகிதத்தை தயார் செய்யவும்.",
          "purpose": "இணையத்தில் யாராவது சராசரி அல்லது புண்படுத்தும் மொழியைப் பயன்படுத்தும்போது மாணவர்களுக்கு என்ன செய்ய வேண்டும் என்று கற்பிப்பதற்காக பொது அறிவு கல்வி இந்த பாடத்தை உருவாக்கியது.",
          "student_overview": "கொடுமைப்படுத்துவது ஒருபோதும் சரியல்ல. இந்த பாடம் ஆன்லைனில் சொல்வது மற்றும் எது சரியில்லை என்பதைப் பற்றி உங்களுக்குக் கற்பிக்கும்."
        },
        "coursef-2021/lesson-9": {
          "overview": "இந்த \\*\\* சூழல்-அமைத்தல் \\*\\* பாடத்தில், மாணவர்கள் ஒரு பயனரிடமிருந்து கணினிகள் எவ்வாறு உள்ளீட்டை எடுத்துச் சேமிக்கிறது என்பதைப் புரிந்துகொள்ள ஒரு பின்னணியாக நிரப்பப்பட்ட கதைகளை (Mad Libs® போன்றது) பயன்படுத்துவார்கள், பின்னர் அதை பின்வருவனவாகப் பயன்படுத்துங்கள் திட்டம் இயங்கும்.",
          "purpose": "இந்த பாடம் பகிரப்பட்ட சூழலை வழங்குகிறது, இது மாணவர்கள் நிரலாக்கத்திற்கு திரும்பும்போது மாறிகள் எவ்வாறு செயல்படுகின்றன என்பதைப் புரிந்துகொள்ள உதவும்."
        },
        "coursef-2021/lesson-10": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடத்தில், மாணவர்கள் ஸ்ப்ரைட் ஆய்வகத்தில் மாறிகளுடன் பயிற்சி பெறுவார்கள்.",
          "preparation": "நிலைகளில் விளையாடுங்கள் மற்றும் பாடம் ஸ்லைடுகளை மதிப்பாய்வு செய்யவும்.",
          "student_overview": "இந்த பாடத்தில் நீங்கள் ஸ்பிரைட் ஆய்வகத்தில் மாறிகள் பயிற்சி செய்வீர்கள்."
        },
        "coursef-2021/lesson-11": {
          "overview": "மாணவர்கள் தங்கள் புதிய திறன்களை மாறிகள் கொண்ட மூன்று திறந்த-\\*\\*சிறு திட்டங்கள் \\*\\* ஒன்றிற்குப் பயன்படுத்துவார்கள். மாணவர்கள் மாதிரி திட்டங்களை ஆராய்ந்து, தங்கள் சொந்த திட்டத்திற்கான திட்டத்தை உருவாக்கி, அதை புதிதாக நிரல் செய்வார்கள்.",
          "purpose": "இந்த பாடம் புதிய திறன்களையோ அல்லது கருத்துக்களையோ அறிமுகப்படுத்தாது, மாறாக மாணவர்களுக்கு அவர்கள் கற்றதை ஆக்கப்பூர்வமாகப் பயன்படுத்துவதற்கான வாய்ப்பை வழங்குகிறது.",
          "student_overview": "உங்கள் புதிய திறன்களை மூன்று திறந்த-திட்ட திட்டங்களில் ஒன்றிற்கு மாறிகளுடன் பயன்படுத்துங்கள்."
        },
        "coursef-2021/Loops with the Artist": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடம் ஸ்ப்ரைட் ஆய்வகத்திலிருந்து கலைஞருக்கு கவனம் செலுத்துகிறது, இது பாடத்தின் எஞ்சிய முழுவதும் மாணவர்கள் ஆராயும் ஒரு புதிய கருவி.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "மாணவர்கள் சுழல்களைப் பயன்படுத்தி பயிற்சி செய்வார்கள், இது வரவிருக்கும் பாடங்கள் முழுவதும் மறுபரிசீலனை செய்யப்படும்.",
          "student_overview": "இந்த பாடத்தில், \\*\\* சுழல்கள் \\*\\* கலைஞருடன் கூடிய குளிர் படங்களை உருவாக்குவதை எளிதாக்குகிறது!"
        },
        "coursef-2021/Variables that Change in Artist": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்."
        },
        "coursef-2021/Nested Loops in the Maze": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பதற்கான \\*\\* பாட, சுழல்களில் ஏற்படும் சிறு மாற்றங்கள் எவ்வாறு தங்கள் திட்டத்தை பாதிக்கும் என்பதைக் கண்டறிய மாணவர்கள் ஊக்குவிக்கப்படுவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடம் தேனீ புதிர்கள் எவ்வாறு வேலை செய்கிறது என்பதை அறிமுகப்படுத்துகிறது (அல்லது விமர்சனம்) மற்றும் மாணவர்களை _Netsted loops_ க்கு அறிமுகப்படுத்துகிறது. அடுத்த பாடம் மாறிகளுக்குத் திரும்பும்.",
          "student_overview": "நீங்கள் மற்றொரு வளையத்திற்குள் ஒரு வளையத்தை வைக்கும்போது என்ன நடக்கும் என்பதை இந்தப் பாடம் உங்களுக்குக் கற்பிக்கும்."
        },
        "coursef-2021/Variables that Change in Bee": {
          "overview": "குறியீடு இயங்கும்போது மதிப்புகளை மாற்றுவதன் மூலம் மாறிகள் நிரல்களை எவ்வாறு அதிக ஆற்றல்மிக்கதாக மாற்ற முடியும் என்பதை விளக்க இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடம் உதவும்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடம் மாறிவரும் மதிப்புகள் கொண்ட குறியீடு எவ்வாறு உதவியாக இருக்கும் என்பதை விளக்குகிறது மற்றும் வரவிருக்கும் பாடங்களில் \"ஃபார்\" லூப்ஸ் எவ்வாறு வேலை செய்கிறது என்பதை மாணவர்கள் புரிந்துகொள்ளத் தயார்படுத்தும்.",
          "student_overview": "இந்த தேனீ மாறிகளை விரும்புகிறது!"
        },
        "coursef-2021/For Loop Fun": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில், மாணவர்கள் சக்திவாய்ந்த, புதிய கட்டமைப்பைக் கொண்ட சுழல்களைப் பயன்படுத்துவார்கள்.",
          "preparation": "-   \\*\\* \\*வீடியோ \\*\\* ஐப் பாருங்கள்.\n-   ஒரு குழுவிற்கு \\*\\* \\*பணித்தாளை \\*\\* அச்சிடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் \\*\\* \\*மதிப்பீடு \\*\\* ஒன்றை அச்சிடவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "\"ஃபார்\" லூப்ஸ் பற்றி கற்றுக்கொள்வதில் நீங்கள் நிறைய வேடிக்கைகளைப் பெறப் போகிறீர்கள்!"
        },
        "coursef-2021/For Loops in Bee": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடம் சுழல்களுக்கு கவனம் செலுத்துகிறது மற்றும் அதிக சிக்கலான புதிர்களைத் தீர்க்க ஒரு அதிகரிக்கும் மாறியைப் பயன்படுத்துகிறது.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "இந்த புதிர்களில் நீங்கள் ஒரு தேனியை தேன் மற்றும் தேனுக்கு வழிநடத்துவீர்கள் சுழல்களுக்குப் பயன்படுத்துவதற்க்கு "
        },
        "coursef-2021/For Loops in Artist": {
          "overview": "இந்த \\*\\* திறமையை வளர்த்துக் கொள்ளும் \\*\\* பாடத்தில், மாணவர்கள் கலைஞருக்காக \"ஃபார்\" லூப்ஸ் பயிற்சி செய்கிறார்கள். சிக்கலான வடிவமைப்புகள் மற்றும் தனித்துவமான கலைகளை உருவாக்க மாணவர்கள் புதிர்களை முடிப்பார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "படைப்பாற்றல் மற்றும் விமர்சன சிந்தனை இந்த பாடத்தில் அழகாக ஒன்றாக வருகிறது. மாணவர்கள் தாடை-கைவிடும் படங்களை உருவாக்கும் போது சுழல்கள் மற்றும் மாறிகளுடன் தங்கள் பயிற்சியைத் தொடர்வார்கள். கணினி அறிவியலுக்கு முக்கிய கருத்துக்களை கற்பிக்கும் போது இந்த பாடம் ஒரு படைப்பு மனதை ஊக்குவிக்கிறது.",
          "student_overview": "உங்கள் அடுத்த தலைசிறந்த படைப்பை உருவாக்க தயாராகுங்கள். இங்கே நீங்கள் சில தாடை-கைவிடும் படங்களை உருவாக்க சுழல்களுக்குப் பயன்படுத்துவீர்கள்."
        },
        "coursef-2021/Simulating Experiments": {
          "student_overview": "கணினியில் உருவகப்படுத்துதல்களை இயக்கவும் மற்றும் மாறிகளை மாற்றுவதன் மூலம் பரிசோதனை செய்யவும்."
        },
        "coursef-2021/lesson-5": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "முந்தைய பாடத்தில், மாணவர்கள் ஒரு எளிய உருவகப்படுத்துதலில் இருந்து தரவைச் சேகரித்து விளக்கினர். இந்த பாடத்தில், மாணவர்கள் தங்கள் சொந்த உருவகப்படுத்துதல் மாதிரியை குறியிட வழிமுறைகளைப் பின்பற்றுவார்கள். உண்மையான உலகில் வைரஸ் வெடிப்புகள் பற்றிய மாணவர்களின் முன் அறிவு ஒரு கற்பனையான சூழ்நிலைக்கு பயன்படுத்தப்படும்.",
          "student_overview": "மான்ஸ்டர் டவுனுக்கு ஒரு வைரஸ் வந்துவிட்டது! ஒரு வைரஸ் சிமுலேட்டரை உருவாக்க கற்றுக்கொள்ளுங்கள் மற்றும் அரக்கர்கள் மீண்டும் ஆரோக்கியமாக இருக்க உதவுங்கள்."
        },
        "coursef-2021/AI for Oceans": {
          "overview": "இந்த \\*\\* ஆய்வு \\*\\* பாடத்தில், மாணவர்கள் மீன் மற்றும் பிற பொருள்களை வகைப்படுத்தி இயந்திர கற்றல் மாதிரிக்கு பயிற்சி அளிப்பார்கள்."
        },
        "coursef-2021/Internet": {
          "overview": "இந்த \\*\\* ஆய்வு \\*\\* பாடத்தில் இணைப்புகள், URL கள், ஐபி முகவரிகள் மற்றும் டிஎன்எஸ் பற்றி கற்றுக் கொள்ளும் போது மாணவர்கள் இணையம் வழியாக பாய்வது போல் நடிப்பார்கள்.",
          "purpose": "இந்த பாடத்திட்டத்தில் நீங்கள் ஒவ்வொரு பாடத்தையும் செய்து கொண்டிருந்தால், உங்கள் வகுப்பறையில் உள்ள ஒவ்வொரு மாணவரும் இணையத்தைப் பயன்படுத்தியிருக்கிறார்கள் ... ஆனால் அது எப்படி வேலை செய்கிறது என்பது எத்தனை பேருக்குத் தெரியும்? இணையத்தைப் பற்றி மேலும் கற்றுக்கொள்வது மாணவர்களுக்கு அதன் முடிவற்ற சாத்தியக்கூறுகளை நன்கு புரிந்துகொள்ள உதவும்.",
          "student_overview": "இணையத்தில் தகவல் எவ்வாறு பயணிக்கிறது என்று எப்போதாவது யோசித்திருக்கிறீர்களா? இது மந்திரம் அல்ல! இணையம் எவ்வாறு செயல்படுகிறது என்பதற்கான அடிப்படைகளை இந்த பாடம் உங்களுக்குக் கற்பிக்கும்."
        },
        "coursef-2021/End of Course Project": {
          "overview": "இந்த \\*\\* திட்டம் \\*\\* பாடம் புதிய திட்டங்களை வடிவமைத்தல், மேம்படுத்துதல் மற்றும் காட்சிப்படுத்துதல் ஆகியவற்றின் மூலம் மாணவர்களை அழைத்துச் செல்கிறது!",
          "student_overview": "இந்த பெரிய திட்டங்களுக்கு நிறைய நேரமும் திட்டமிடலும் தேவை. உங்கள் உத்வேகத்தைக் கண்டுபிடி, ஒரு திட்டத்தை உருவாக்கி, உங்கள் படைப்பாற்றலை கட்டவிழ்த்து விடுங்கள்!"
        },
        "courseb-2021/Digital Trails": {
          "preparation": "-   அறிவுறுத்தல் பொருட்களை மதிப்பாய்வு செய்யவும்.\n-   ஒவ்வொரு மாணவருக்கும் கையேட்டை (களை) அச்சிடுங்கள்.",
          "purpose": "காமன் சென்ஸ் கல்வி இந்த பாடத்தை மாணவர்களுக்கு \"டிஜிட்டல் தடம்\" பற்றி கற்பிப்பதற்காக உருவாக்கியது, மேலும் அவர்கள் சொந்தமாக வைத்திருப்பது என்ன தகவல் என்பது சரி.",
          "student_overview": "உங்கள் டிஜிட்டல் தடம் மற்றும் வலைத்தளங்களைப் பார்வையிடும்போது பாதுகாப்பாக இருப்பது எப்படி என்பதை அறியவும்."
        },
        "courseb-2021/Move It, Move It": {
          "overview": "இந்த \\*\\* சூழல் அமைப்பு \\*\\* பாடத்தில் தரையில் உள்ள ஒரு பெரிய கட்டத்தை சுற்றி கவனமாக படிப்பதற்கு மாணவர்கள் தங்கள் வகுப்பு தோழர்களை திட்டமிடுவார்கள்.",
          "preparation": "-   \\*\\* \\*ஆசிரியர் வீடியோவைப் பாருங்கள் \\*\\*\n-   ஒரு \\*\\* \\*பணித்தாள் பதில் விசையை \\*\\* அச்சிடு (அல்லது காட்டத் தயாராகுங்கள்) \\*\\*\n-   2-3 மாணவர்களின் குழுவிற்கு ஒன்று \\*\\* \\*வரைபட செயல்பாடு \\*\\* மற்றும் ஒன்று \\*\\* \\*பணித்தாள் \\*\\* \n    அச்சிடுங்கள்\n    மீதமுள்ள நடைபயிற்சி கட்டத்தை நிரப்ப வெற்று காகிதங்களைத் தயாரிக்கவும் (ஒரு குழுவிற்கு 4- \n    7 தேவை)",
          "student_overview": "உங்கள் வகுப்பு தோழர்களை இடத்திலிருந்து இடத்திற்கு கவனமாக செல்ல திட்டமிடவும்."
        },
        "courseb-2021/Sequencing in Maze": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில், மாணவர்கள் ஒரு பிரமை ஒரு பக்கத்திலிருந்து மற்றொரு பக்கத்திலுள்ள பன்றிக்கு ஒரு பறவையை நகர்த்துவதற்கான தொடர்ச்சியான வழிமுறைகளை உருவாக்கும். இதைச் செய்ய அவர்கள் குறியீட்டுத் தொகுதிகளை ஒரு நேரியல் வரிசையில் ஒன்றாக அடுக்கி வைப்பார்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் கணினித் தளத்தில் நிரலாக்க மற்றும் பிழைத்திருத்த திறன்களை வளர்த்துக் கொள்வார்கள். இந்த புதிர்களின் தொகுதி அடிப்படையிலான வடிவம் தொடரியல் மற்றும் கருத்துக்களைப் பற்றி மாணவர்கள் அறிய உதவுகிறது, தொடரியல் சரியானது பற்றி கவலைப்படாமல்.",
          "student_overview": "குறும்பு பன்றியின் வழியைப் பின்பற்ற கோப பறவைக்கு உதவுங்கள்."
        },
        "courseb-2021/Programming in Maze": {
          "overview": "இந்த \\*\\* திறனை வளர்த்தல் \\*\\* பாடத்தில், மாணவர்கள் தொடர்ச்சியான வழிமுறைகளை உருவாக்கிக்கொண்டே இருப்பார்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் கணினித் தளத்தில் நிரலாக்க திறன்களை வளர்த்துக் கொள்வார்கள். இந்த புதிர்களின் தொகுதி அடிப்படையிலான வடிவம், தொடரியல் மற்றும் கருத்தாக்கங்களைப் பற்றி மாணவர்கள் கற்றுக்கொள்ள உதவுகிறது.",
          "student_overview": "கோபம் பறவை\\_ பிரமை வழியாக செல்ல உதவும் திட்டங்களை உருவாக்கவும்."
        },
        "courseb-2021/Programming in Harvester": {
          "overview": "மாணவர்கள் தாங்கள் கற்றுக்கொண்ட நிரலாக்கக் கருத்துகளை இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில் ஹார்வெஸ்டர் சூழலுக்குப் பயன்படுத்துவார்கள். மாணவர்கள் தொடர்ச்சியான அல்காரிதம் திறன்களை வளர்த்து, பிழைத்திருத்த செயல்முறையைப் பயன்படுத்தத் தொடங்குவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் பிழைத்திருத்த திறன்களை வளர்த்துக் கொள்வார்கள் மற்றும் அவர்களின் நிரலாக்க திறன்களை தொடர்ந்து வளர்த்துக் கொள்வார்கள்.",
          "student_overview": "ஒரு பாதையில் காய்கறிகளை சேகரிக்க ஹார்வெஸ்டருக்கு உதவுங்கள்."
        },
        "courseb-2021/Loops: Getting Loopy": {
          "overview": "இந்த \\*\\* சூழல்-அமைப்பு \\*\\* பாடத்தில், மாணவர்கள் ஒரு நடனத்தின் தொடர்ச்சியான வடிவங்களைப் பார்த்து எளிதாக அறிவுறுத்தல்களைத் தெரிவிக்க சுழல்களைப் பயன்படுத்த கற்றுக்கொள்வார்கள்.",
          "preparation": "-   \\*\\* \\*பணித்தாளை \\*\\* மாணவர்களுக்குக் காண்பிக்கத் தயாராகுங்கள்.\n-   ஒரு மாணவருக்கு \\*\\* \\*மதிப்பீடு \\*\\* ஒன்றை அச்சிடவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து \n    கொள்ளுங்கள்.",
          "student_overview": "இந்த பாடத்தில், நாங்கள் மீண்டும் மீண்டும் சுழல்களைப் பயன்படுத்தி ஒரு நடன விருந்து நடத்துவோம்!"
        },
        "courseb-2021/Loops in Harvester": {
          "overview": "இந்த \\*\\* திறன் வளர்ப்பு \\*\\* பாடத்தில், மாணவர்கள் அறுவடை செய்பவர் வளையங்களைப் பயன்படுத்தி பயிர்களை சேகரிக்க உதவுவார்கள்.",
          "student_overview": "வளையங்களைப் பயன்படுத்தி ஹார்வெஸ்டர் இன்னும் அதிகமாக சேகரிக்க உதவுங்கள்!"
        },
        "courseb-2021/Loops in Collector": {
          "overview": "இந்த \\*\\* திறனை வளர்த்துக் கொள்ளும் \\*\\* பாடத்தில், மாணவர்கள் சுழல்களின் கருத்தை தொடர்ந்து கற்றுக் கொள்கிறார்கள். இங்கே, லாரல் சாகசக்காரர் திறந்த குகை இடங்களில் புதையலைச் சேகரிக்க சுழல்களைப் பயன்படுத்துகிறார்.",
          "purpose": "இந்த பாடம் மாணவர்களுக்கு சுழல்களுடன் அதிக பயிற்சியை அளிக்கிறது மற்றும் முடிந்தவரை புதையலைச் சேகரிக்க முயற்சிக்கும்போது ஒரு \\`ரிப்பீட் 'க்குள் பல தொகுதிகளை வைக்க ஊக்குவிக்கிறது.",
          "student_overview": "திறந்த குகையில் புதையலைச் சேகரிக்க சாகசக்காரர் லாரல் திட்டம்."
        },
        "courseb-2021/Loops in Artist": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பதற்கான \\*\\* பாடத்தில், மாணவர்கள் அறிவுறுத்தல்களின் எளிய வரிசைகளை சுழற்றுவதன் மூலம் படங்களை வரைய கற்றுக்கொள்கிறார்கள். இங்கே, மாணவர்கள் வடிவங்களை உருவாக்க சுழல்களைப் பயன்படுத்துகின்றனர்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறிய பாடத்திற்கு முன் \n    புதிர்கள் மூலம் விளையாடுங்கள்.\n-   மதிப்பாய்வு \\*\\* \\*சிஎஸ் அடிப்படைகள் முக்கிய செயல்பாட்டு உதவிக்குறிப்புகள் - பாடம் \n    பரிந்துரைகள் \\*\\*.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து \n    கொள்ளுங்கள்.",
          "student_overview": "படங்களை முடிக்க வடிவங்கள் மற்றும் சுழல்களைப் பயன்படுத்தவும்."
        },
        "courseb-2021/The Right App": {
          "overview": "இந்த \\*\\* ஆய்வு \\*\\* பாடத்தில், மாணவர்கள் பல கற்பனையான ஸ்மார்ட்ஃபோன் பயனர்களுடன் பச்சாதாபம் கொள்கிறார்கள்.",
          "student_overview": "உங்கள் சொந்த ஸ்மார்ட்போன் பயன்பாட்டை வரையவும்."
        },
        "courseb-2021/Events: The Big Event": {
          "overview": "இந்த \\*\\* சூழல்-அமைப்பு \\*\\* பாடத்தில், ஒரு மாபெரும் ரிமோட்டில் பொத்தான்களை அழுத்தும்போது அவை நகரும் அல்லது கத்தும் ஒரு விளையாட்டின் மூலம் நிகழ்வுகளின் கருத்தை வகுப்பு அனுபவிக்கும்.",
          "preparation": "-   திட்டத்திற்கு தயாராகுங்கள் \\*\\* \\*கட்டுப்படுத்தி படம் \\*\\*.\n-   ஒரு மாணவருக்கு \\*\\* \\*மதிப்பீடு \\*\\* ஒன்றை அச்சிடவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "உங்கள் ஆசிரியர் ஒரு பெரிய ரிமோட்டில் பொத்தான்களை அழுத்தும்போது நகர்த்தவும் அல்லது கத்தவும்."
        },
        "courseb-2021/Events in Play Lab": {
          "student_overview": "ஒரு கதையை உருவாக்க அல்லது ஒரு ஊடாடும் விளையாட்டை உருவாக்க நிகழ்வுகளைப் பயன்படுத்தவும்."
        },
        "courseb-2021/lesson-1": {
          "overview": "இந்த \\*\\* திட்டம் \\*\\* பாடத்தில், மாணவர்கள் பிளே லேப் மூலம் ஒரு திறந்தநிலை திட்டத்தில் வரிசை மற்றும் நிகழ்வுகள் பற்றி தாங்கள் கற்றுக்கொண்டதை பயன்படுத்துகின்றனர்.",
          "preparation": "-   மாணவர்களை ஊக்குவிக்க உங்கள் சொந்த ப்ளே லேப் திட்டங்களை முன்கூட்டியே குறியிடவும்!",
          "purpose": "இந்த பாடம் மாணவர்களுக்கு அவர்களின் புதிய கணினி அறிவியல் திறன்களை ஆக்கப்பூர்வமாக பயன்படுத்த கடைசி வாய்ப்பை அளிக்கிறது.",
          "student_overview": "உங்கள் சொந்த கதை அல்லது விளையாட்டை உருவாக்கவும்."
        },
        "coursea-2021/Safety in My Online Neighborhood": {
          "preparation": "-   அறிவுறுத்தல் பொருட்களை மதிப்பாய்வு செய்யவும்.\n-   ஒவ்வொரு மாணவருக்கும் கையேட்டை (களை) அச்சிடுங்கள்.\n-   (விரும்பினால்) வகுப்பறை காட்சிக்கு கவிதை சுவரொட்டியை அச்சிடுங்கள்.",
          "purpose": "காமன் சென்ஸ் கல்வி இந்த பாடத்தை உருவாக்கியது, மாணவர்கள் ஆன்லைனில் எப்படி பாதுகாப்பாக இடங்களுக்கு செல்ல முடியும் என்பதை கற்பிக்க.",
          "student_overview": "ஆன்லைனில் பாதுகாப்பாக இடங்களுக்குச் செல்வது எப்படி என்பதை அறிக."
        },
        "coursea-2021/Learn to Drag and Drop": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடம் மாணவர்களுக்கு கணினி ஆய்வகத்திற்குச் செல்லும்போது என்ன எதிர்பார்க்கலாம் என்ற யோசனையை அளிக்கும். கணினி ஆய்வக பழக்கவழக்கங்களை அவர்களுக்கு அறிமுகப்படுத்தும் ஒரு சுருக்கமான விவாதத்துடன் இது தொடங்குகிறது, பின்னர் அவர்கள் ஆன்லைன் புதிர்களை முடிக்க ஒரு கணினியைப் பயன்படுத்துவதில் முன்னேறுவார்கள்.",
          "student_overview": "புதிர்களை முடிக்க கிளிக் செய்து இழுக்கவும்."
        },
        "coursea-2021/Programming: Happy Maps": {
          "overview": "இந்த \\*\\* சூழல் அமைப்பு \\*\\* பாடம் ஒரு எளிய பணியுடன் குழுக்களை ஒன்றிணைக்கிறது: பழத்திற்கு \"ஃப்ளர்ப்\" கிடைக்கும். கொடுக்கப்பட்ட குறியீடுகளில் அறிவுறுத்தல்களை மொழிபெயர்க்க அவர்கள் வேலை செய்வதால் மாணவர்கள் துல்லியமான வழிமுறைகளை எழுதப் பயிற்சி செய்வார்கள்.",
          "preparation": "2-3\\*குழுவிற்கு ஒன்று \\*\\* \\*பணித்தாள் \\*\\* மற்றும் \\*\\* \\*சூழ்ச்சிகள் \\*\\* என்ற ஒரு தொகுப்பை அச்சிடுங்கள்.\n\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "பழத்திற்கு ஃப்ளர்பைப் பெறுவதற்கான வழிமுறைகளை எழுதுங்கள்."
        },
        "coursea-2021/Sequencing with Scrat": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில், மாணவர்கள் ஒரு பிரமை ஒரு பக்கத்திலிருந்து மற்றொரு பக்கத்தில் உள்ள ஏகோர்னுக்கு ஒரு அணில் பாத்திரத்தை நகர்த்துவதற்கான தொடர்ச்சியான வழிமுறைகளை உருவாக்கும். இதைச் செய்ய அவர்கள் குறியீட்டுத் தொகுதிகளை ஒரு நேரியல் வரிசையில் ஒன்றாக அடுக்கி வைப்பார்கள்.",
          "preparation": "-   \\*\\* \\*கையாளுதல்கள் \\*\\* இலிருந்து திசைத் தொகுதிகளை வெட்டி, மகிழ்ச்சியான வரைபடப் \n    பிரிட்ஜிங் செயல்பாட்டைப் பயன்படுத்தவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் கணினித் தளத்தில் நிரலாக்க மற்றும் பிழைத்திருத்த திறன்களை வளர்த்துக் கொள்வார்கள். இந்த புதிர்களின் தொகுதி அடிப்படையிலான வடிவம் தொடரியல் மற்றும் கருத்துக்களைப் பற்றி மாணவர்கள் அறிய உதவுகிறது, தொடரியல் சரியானது பற்றி கவலைப்படாமல்.",
          "student_overview": "ஏகார்னை அடைய ஸ்க்ராட் திட்டம்."
        },
        "coursea-2021/Programming in Ice Age": {
          "overview": "இந்த \\*\\* திறனை வளர்த்தல் \\*\\* பாடத்தில், மாணவர்கள் தொடர்ச்சியான வழிமுறைகளை உருவாக்கிக்கொண்டே இருப்பார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் \n    விளையாடுங்கள்.\n-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் கணினித் தளத்தில் நிரலாக்க மற்றும் பிழைத்திருத்த திறன்களை வளர்த்துக் கொள்வார்கள். இந்த புதிர்களின் தொகுதி அடிப்படையிலான வடிவம் தொடரியல் மற்றும் கருத்துக்களைப் பற்றி மாணவர்கள் அறிய உதவுகிறது, தொடரியல் சரியானது பற்றி கவலைப்படாமல்.",
          "student_overview": "ஸ்க்ராட் ஏகோர்னை அடைய உதவும் நிரல்களை எழுதுங்கள்."
        },
        "coursea-2021/Programming with Rey and BB-8": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில், மாணவர்கள் _BB-8_ உடன் ஒரு தந்திரமான பாடத்திட்டத்திற்கு செல்ல மிகவும் சிக்கலான வழிகளில் தங்கள் புதிய நிரலாக்க திறன்களைப் பயன்படுத்துவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறிய இந்தப் பாடத்துடன் \n    தொடர்புடைய புதிர்கள் மூலம் விளையாடுங்கள்.\n-   மதிப்பாய்வு \\*\\* \\*சிஎஸ் அடிப்படைகள் முக்கிய செயல்பாட்டு உதவிக்குறிப்புகள் - பாடம் \n    பரிந்துரைகள் \\*\\*.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "ஸ்கிராப் உலோகத்தை சேகரிக்க BB -8 க்கு உதவுங்கள்."
        },
        "coursea-2021/Loops: Happy Loops": {
          "overview": "இந்த \\*\\* சூழல் அமைப்பு \\*\\* பாடம் இனிய வரைபடத்தை மறுபரிசீலனை செய்கிறது. இந்த நேரத்தில், மாணவர்கள் தங்கள் குறியீட்டைக் கொண்டு பெரிய, நீண்ட புதிர்களைத் தீர்க்க சுழல்களைப் பயன்படுத்துவார்கள்.",
          "preparation": "-   வகுப்பிற்கு காண்பிக்க \\*\\* \\*பணித்தாளை \\*\\* அச்சிடவும்\n-   ஒவ்வொரு 2-3 குழுவிற்கும், ஒவ்வொன்றிலும் ஒன்றை அச்சிடவும்: \\*\\* \\*விளையாட்டுத் \n    துண்டுகள், \\*எக்ஸ்எல் பணித்தாள் மற்றும் \\*போனஸ் பேக் கையாளுதல்கள் \\*\\*.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் \n    கொள்ளுங்கள்.",
          "student_overview": "சுழல்களைப் பயன்படுத்தி பெரிய சிக்கல்களைத் தீர்க்க ஃப்ளர்பிற்கு உதவுங்கள்."
        },
        "coursea-2021/Loops in Ice Age": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில், அணில் ஏகோர்னை அடைய உதவுவதே குறிக்கோளாக இருக்கும் புரோகிராமிங் புதிர்களில் மாணவர்கள் சுழல்களைப் பயிற்சி செய்வார்கள்.",
          "student_overview": "சுழல்களைப் பயன்படுத்தி அதிக நிலத்தை மறைக்க ஸ்க்ராட்டுக்கு உதவுங்கள்."
        },
        "coursea-2021/Loops in Collector": {
          "overview": "இந்த \\*\\* திறனை வளர்த்துக் கொள்ளும் \\*\\* பாடத்தில், மாணவர்கள் சுழல்களின் கருத்தை தொடர்ந்து கற்றுக் கொள்கிறார்கள். இங்கே, மாணவர்கள் திறந்த குகை இடங்களில் புதையலை சேகரிக்க சுழல்களை பயன்படுத்துகின்றனர்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் \n    விளையாடுங்கள்.\n-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   மதிப்பாய்வு \\*\\* \\*CSF பாடம் பரிந்துரைகள் \\*\\*\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்",
          "purpose": "இந்த பாடம் மாணவர்களுக்கு சுழல்களுடன் அதிக பயிற்சியை அளிக்கிறது மற்றும் `புதையலைப் பெறு` என்ற புதிய தொகுதியை அறிமுகப்படுத்துகிறது. ஹார்வெஸ்டரில் `பிக் கார்ன்` போலவே தொகுதி வேலை செய்கிறது. இந்த புதிர்கள் மிகவும் திறந்தவை, மாணவர்களுக்கு அவர்களின் இறுதி தீர்வுகளுக்கு அதிக நெகிழ்வுத்தன்மையை அளிக்கிறது.",
          "student_overview": "புதையலை நிலத்தடியில் சேகரிக்க சாகசக்காரர் லாரலுக்கு உதவுங்கள்."
        },
        "coursea-2021/Ocean Scene with Loops": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பதற்கான \\*\\* பாடத்தில், மாணவர்கள் அறிவுறுத்தல்களின் எளிய வரிசைகளை சுழற்றுவதன் மூலம் படங்களை வரைய கற்றுக்கொள்கிறார்கள். இங்கே, சுழல்கள் வடிவங்களை உருவாக்குகின்றன. இந்த பாடத்தின் முடிவில், மாணவர்கள் தங்கள் சொந்த படங்களை உருவாக்குவார்கள்.",
          "purpose": "இந்த பாடம் நிரல்கள் நிரல்களை எவ்வாறு உருவாக்க முடியும் என்பதைப் பற்றிய வித்தியாசமான பார்வையை அளிக்கிறது. \\`ரிபீட் 'லூப்ஸின் உதவியின்றி இந்த ப்ரோக்ராமுக்கு எத்தனை ப்ளாக் தேவைப்படும் என்பதால் மாணவர்கள் இங்கே லூப்ஸ் இல்லாமல் ப்ரோக்ராமிங்கின் திறமையின்மையை பிரதிபலிக்க முடியும்.",
          "student_overview": "படங்களை முடிக்க சுழல்கள் மற்றும் வடிவங்களைப் பயன்படுத்தவும்."
        },
        "coursea-2021/Events: The Big Event": {
          "overview": "இந்த \\*\\* சூழல்-அமைப்பு \\*\\* பாடத்தில், ஒரு மாபெரும் ரிமோட்டில் பொத்தான்களை அழுத்தும்போது அவை நகரும் அல்லது கத்தும் ஒரு விளையாட்டின் மூலம் நிகழ்வுகளின் கருத்தை வகுப்பு அனுபவிக்கும்.",
          "preparation": "-   திட்டத்திற்கு தயாராகுங்கள் \\*\\* \\*கட்டுப்பாட்டாளர் படம் \\*\\*.\n-   ஒரு மாணவருக்கு \\*\\* \\*மதிப்பீடு \\*\\* ஒன்றை அச்சிடவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து \n    கொள்ளுங்கள்.",
          "student_overview": "உங்கள் ஆசிரியர்கள் ஒரு பெரிய ரிமோட்டில் பொத்தான்களை அழுத்தும்போது நகர்ந்து கத்துங்கள்."
        },
        "coursea-2021/Events in Play Lab": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் \n    விளையாடுங்கள்.\n-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   மதிப்பாய்வு \\*\\* \\*CSF பாடம் பரிந்துரைகள் \\*\\*.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "உங்கள் சொந்த விளையாட்டு அல்லது கதையை உருவாக்கவும்."
        },
        "coursea-2021/lesson-1": {
          "overview": "இந்த \\*\\* ப்ராஜெக்ட் \\*\\* பாடத்தில், மாணவர்கள் ஆர்டிஸ்ட்டுடன் சீக்வென்சிங் மற்றும் லூப்ஸ் பற்றி கற்றுக்கொண்டதைப் பயன்படுத்துகிறார்கள்.",
          "preparation": "-   மாணவர்களுக்கு உத்வேகம் அளிப்பதற்காக முன்கூட்டியே கலைஞருக்காக உங்கள் சொந்த கதையை எழுதி குறியிடவும்!",
          "purpose": "இந்த பாடம் மாணவர்களுக்கு அவர்களின் புதிய கணினி அறிவியல் திறன்களை ஆக்கப்பூர்வமாக பயன்படுத்த கடைசி வாய்ப்பை அளிக்கிறது.",
          "student_overview": "கலைஞருடன் கதை சொல்லுங்கள்!"
        },
        "coursec-2021/Putting a STOP to Online Meanness": {
          "preparation": "-   அறிவுறுத்தல் பொருட்களை மதிப்பாய்வு செய்யவும்.\n-   ஒவ்வொரு மாணவருக்கும் கையேட்டை (களை) அச்சிடுங்கள்.\n-   ஒரு அடைத்த விலங்கு அல்லது பொம்மையை வகுப்பிற்கு கொண்டு வாருங்கள்.",
          "purpose": "பொது அறிவு கல்வி மாணவர்களுக்கு சராசரி மற்றும் அவர்கள் ஆன்லைனில் சந்தித்தால் என்ன செய்ய வேண்டும் என்பதை கற்பிக்க இந்த பாடத்தை உருவாக்கியது."
        },
        "coursec-2021/Programming: My Robotic Friends": {
          "overview": "இந்த \\*\\* சூழல்-அமைப்பு \\*\\* பாடங்களில், மாணவர்கள் பல்வேறு வடிவங்களில் கோப்பைகளை அடுக்கி வைக்க \"ரோபோ\" க்கு அறிவுறுத்துவதற்கு ஒரு சின்னங்களின் தொகுப்பைப் பயன்படுத்துவார்கள். மாணவர்கள் மாறி மாறி ரோபோவாக பங்கேற்பார்கள், தங்கள் சகாக்களால் வரையறுக்கப்பட்ட வழிமுறைகளுக்கு மட்டுமே பதிலளிப்பார்கள்.",
          "student_overview": "இந்த பாடத்தில், உங்கள் வகுப்பு தோழர்கள் ரோபோக்கள் போல் நடித்து, அடுக்கப்பட்ட கோப்பைகளின் வடிவங்களை உருவாக்க அவற்றை நிரல் செய்வீர்கள்."
        },
        "coursec-2021/Programming in Maze": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் \n    விளையாடுங்கள்.\n-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் கணினித் தளத்தில் நிரலாக்க மற்றும் பிழைத்திருத்த திறன்களை வளர்த்துக் கொள்வார்கள். இந்த புதிர்களின் தொகுதி அடிப்படையிலான வடிவம் தொடரியல் மற்றும் கருத்துக்களைப் பற்றி மாணவர்கள் அறிய உதவுகிறது, தொடரியல் சரியானது பற்றி கவலைப்படாமல்.",
          "student_overview": "கோபம் பறவைகள்\\_ மூலம் வரிசைகள் மற்றும் வழிமுறைகளைப் பற்றி அறியவும்."
        },
        "coursec-2021/Debugging in Maze": {
          "overview": "இந்த \\*\\* திறமையை வளர்க்கும் \\*\\* பாடத்தில், மாணவர்கள் தவறுகள் அடங்கிய முன்பே எழுதப்பட்ட குறியீட்டை சந்திப்பார்கள். பிழைகளை அடையாளம் காண அவர்கள் ஏற்கனவே உள்ள குறியீட்டைப் பின்பற்ற வேண்டும்.",
          "student_overview": "புதிர்களில் சிக்கல்களைக் கண்டறிந்து உங்கள் பிழைத்திருத்தத் திறனைப் பயிற்சி செய்யுங்கள்."
        },
        "coursec-2021/Programming in Collector": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "லாரல் சாகசக்காரர் நிறைய ரத்தினங்களை சேகரிக்க உதவும் வழிமுறைகளை எழுதுங்கள்!"
        },
        "coursec-2021/Programming in Artist": {
          "overview": "இந்த \\*\\* திறமையை வளர்க்கும் \\*\\* பாடத்தில், மாணவர்கள் திரையில் வரைபடங்களை முடிக்க கலைஞரின் கட்டுப்பாட்டை எடுத்துக்கொள்வார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   (விருப்பத்தேர்வு) புதிர்களை முடிக்க அவர்கள் பயன்படுத்த வேண்டிய கோணங்களை கற்பனை செய்ய உங்கள் வகுப்பிற்கான ப்ராட்ராக்டர்களைப் பெறுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் \\*\\* \\*மாணவர் கையேடு \\*\\* ஐ அச்சிடுங்கள்.",
          "student_overview": "கலைஞரை நிரலாக்குவதன் மூலம் அழகான படங்களை உருவாக்கவும்."
        },
        "coursec-2021/Loops: My Loopy Robotic Friends": {
          "overview": "இந்த \\*\\* சூழல்-அமைப்பு \\*\\* பாடம் பெரிய மற்றும் சிக்கலான வடிவமைப்புகளைக் கொண்ட ஆரம்ப \"மை ரோபோடிக் நண்பர்கள்\" செயல்பாட்டை உருவாக்குகிறது.",
          "student_overview": "இந்த பாடத்தில், நீங்கள் உங்கள் வகுப்பு தோழர்களை மீண்டும் திட்டமிடலாம், ஆனால் சுழல்களைப் பயன்படுத்தி நீங்கள் பெரிய மற்றும் சிக்கலான சிக்கல்களை தீர்க்க முடியும்."
        },
        "coursec-2021/Loops with Rey and BB-8": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடம் BB-8 திறம்பட ஒரு பிரமைக்கு உதவ மாணவர்கள் சுழல்களைப் பயன்படுத்துகிறது.",
          "preparation": "-   ஏதேனும் பிரச்சனை இருக்குமா என்பதை அறிய புதிர்கள் மூலம் விளையாடுங்கள்\n    உங்கள் வகுப்பிற்கான பகுதிகள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "சுழல்களைப் பயன்படுத்தி பிரமை மூலம் _BB-8_ க்கு உதவுங்கள்!"
        },
        "coursec-2021/Loops in Harvester": {
          "overview": "இந்த \\*\\* திறன் வளர்ப்பு \\*\\* பாடத்தில் அறுவடை இயந்திரம் பெரிய கொத்தாக வளரும் பல காய்கறிகளை சேகரிக்க உதவுவதற்காக மாணவர்கள் புதிய செயல்களைச் செய்கிறார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் பூசணிக்காயை அறுவடை செய்வது போன்ற செயல்களை மீண்டும் செய்ய சுழல்களை பயன்படுத்துவார்கள். புதிய வடிவங்கள் வெளிவரும் மற்றும் மாணவர்கள் எந்த குறியீட்டை மீண்டும் செய்ய வேண்டும் மற்றும் எத்தனை முறை என்பதைத் தீர்மானிக்க படைப்பாற்றல் மற்றும் தர்க்கரீதியான சிந்தனையைப் பயன்படுத்துவார்கள்.",
          "student_overview": "அறுவடை இயந்திரம் சில காய்கறிகளைச் சேகரிக்க உதவும் சுழல்களைப் பயன்படுத்துவோம்!"
        },
        "coursec-2021/Sticker Art with Loops": {
          "overview": "இந்த \\*\\* சிறு திட்டம் \\*\\* பாடம் முந்தைய பாடங்களிலிருந்து சுழல்களைப் புரிந்துகொள்வதை அடிப்படையாகக் கொண்டது. மாணவர்கள் கலைஞருடன் தனித்துவமான கலைப்படைப்புகளை உருவாக்குவார்கள்.",
          "preparation": "-   உங்கள் சொந்த வடிவமைப்பை உருவாக்க பயிற்சி செய்யுங்கள். முன்பு வந்த எல்லாவற்றிலிருந்தும் இந்த நிலைகள் எவ்வாறு வேறுபடுகின்றன என்பதைக் கவனியுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த தொடர் ஆக்கபூர்வமான மற்றும் தனிப்பட்ட வடிவமைப்புகளுடன் சுழல்களின் சக்தியை எடுத்துக்காட்டுகிறது.\n\nஒரு திட்ட-ஆதரவு வரிசையாக வழங்கப்படும், இந்த முன்னேற்றம் மாணவர்கள் தங்கள் சொந்த வேலையின் மேல் உருவாக்க மற்றும் அற்புதமான கலைப்பொருட்களை உருவாக்க அனுமதிக்கும்.",
          "student_overview": "இந்த பாடத்தில், சுழல்கள் கலைஞருடன் கூட குளிர்ச்சியான படங்களை உருவாக்குவதை எளிதாக்குகின்றன!"
        },
        "coursec-2021/Events: The Big Event": {
          "overview": "இந்த \\*\\* சூழல்-அமைப்பு \\*\\* பாடத்தில், முன்பே எழுதப்பட்ட வழிமுறையில் நெகிழ்வுத்தன்மையைச் சேர்க்க நிகழ்வுகள் சிறந்த வழியாகும் என்பதை மாணவர்கள் கற்றுக்கொள்வார்கள்.",
          "preparation": "-   \\*\\* \\*நிகழ்வு கட்டுப்பாட்டாளர் \\*\\* ஐ அச்சிடவும் அல்லது காண்பிக்கவும்.\n-   ஒவ்வொரு மாணவருக்கும் \\*\\* \\*மதிப்பீடு \\*\\* ஒன்றை அச்சிடவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து \n    கொள்ளுங்கள்.",
          "student_overview": "நிகழ்வுகளைப் பற்றி அறிய ஒரு வேடிக்கையான விளையாட்டை விளையாடுங்கள்."
        },
        "coursec-2021/Build a Flappy Game": {
          "overview": "இந்த பாடம் \\*\\* திறனை வளர்ப்பது \\*\\* நிகழ்வுகளைச் சுற்றி \\*\\* சிறு திட்டத்துடன் \\*\\* ஒருங்கிணைக்கிறது, அங்கு மாணவர்கள் தங்கள் சொந்த Flappy Bird விளையாட்டை உருவாக்க முடியும். பாடத்தின் முடிவில், மாணவர்கள் காட்சிகள் அல்லது விதிகளை மாற்றுவதன் மூலம் தங்கள் விளையாட்டைத் தனிப்பயனாக்க முடியும்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "உங்களுக்கு விருப்பமான Flappy Bird விளையாட்டை உருவாக்குங்கள், பின்னர் அதை உங்கள் நண்பர்களுடன் பகிர்ந்து கொள்ளுங்கள்!"
        },
        "coursec-2021/Events in Play Lab": {
          "overview": "இந்த பாடம் \\*\\* திறனை வளர்ப்பது \\*\\* நிகழ்வுகளைச் சுற்றி \\*\\* சிறு திட்டத்துடன் \\*\\* ஒருங்கிணைக்கிறது, அங்கு மாணவர்கள் தங்கள் சொந்த அனிமேஷன் விளையாட்டை உருவாக்க முடியும்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "பிளே லேபில் ஆக்கப்பூர்வமாக விளையாடுவதற்கான நேரம் இது!"
        },
        "coursec-2021/Picturing Data": {
          "overview": "மாணவர்கள் ஒரு ப்ளே லேப் திட்டத்திலிருந்து தரவுகளைச் சேகரித்து, இந்த \\*\\* ஆய்வு \\*\\* பாடத்தில் வெவ்வேறு வரைபடங்களைப் பயன்படுத்தி காட்சிப்படுத்துவார்கள்.",
          "student_overview": "நம் உலகத்தைப் புரிந்துகொள்ளவும் சுவாரஸ்யமான கேள்விகளுக்குப் பதிலளிக்கவும் தரவு பயன்படுத்தப்படலாம்."
        },
        "coursec-2021/Binary Bracelets": {
          "overview": "இந்த \\*\\* ஆய்வு \\*\\* பாடம் பைனரி என்ற கருத்தை அறிமுகப்படுத்துகிறது, இது கணினிகள் இன்று அனைத்து வகையான தகவல்களையும் சேமித்து வைக்கிறது.",
          "student_overview": "உங்கள் சொந்த பைனரி வளையலை உருவாக்கி, கணினிகள் தகவல்களை எவ்வாறு நினைவில் கொள்கின்றன என்பதை அறியவும்!"
        },
        "coursec-2021/End of Course Project: Create a Play Lab Game": {
          "overview": "இந்த \\*\\* திட்டம் \\*\\* பாடம் புதிய பிளே லேப் திட்டங்களை வடிவமைத்தல், மேம்படுத்துதல் மற்றும் காண்பிப்பதன் மூலம் மாணவர்களை அழைத்துச் செல்கிறது.",
          "purpose": "இந்த பாடம் மாணவர்களுக்கு தங்கள் சொந்த வடிவமைப்பின் ஒரு திட்டத்தை உருவாக்க, ஒரு படிப்படியான செயல்முறையைப் பயன்படுத்தி திட்டமிடல் தேவைப்படுகிறது ஆனால் பரந்த படைப்பாற்றலை அனுமதிக்கிறது."
        },
        "coursed-2021/lesson-5": {
          "preparation": "-   அறிவுறுத்தல் பொருட்களை மதிப்பாய்வு செய்யவும்.\n-   ஒவ்வொரு மாணவருக்கும் கையேட்டை (களை) அச்சிடுங்கள்.\n-   மாணவர்களுக்கு எழுது காகிதம் அல்லது குறிப்பேடுகளை தயார் செய்யவும்.",
          "purpose": "காமன் சென்ஸ் கல்வி இந்த பாடத்தை உருவாக்கியது, வலுவான கடவுச்சொற்கள் எவ்வாறு அவர்களின் தனியுரிமையைப் பாதுகாக்க உதவும் என்பதைப் பற்றி கற்பிக்க.",
          "student_overview": "இந்த பாடத்தில், கடவுச்சொற்கள் உங்கள் தகவலை எவ்வாறு பாதுகாக்கின்றன, எப்படி ஒரு நல்ல கடவுச்சொல்லை உருவாக்குவது என்பது பற்றி அறிந்து கொள்வீர்கள்."
        },
        "coursed-2021/Algorithms: Graph Paper Programming": {
          "student_overview": "இந்த பாடத்தில், உங்கள் வகுப்புத் தோழரை படங்களை வரைய நிரல் செய்வீர்கள்!"
        },
        "coursed-2021/Introduction to Online Puzzles": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பதற்கான \\*\\* பாடத்தில், மாணவர்கள் தங்கள் \\_ அடுத்தடுத்த\\_பிரச்சனை புதிர் களில் பிழைதிருத்தும் திறன்களை பயிற்சி செய்வார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "இந்த பாடத்திற்கு உங்களுக்கு தேவையான திறன்களில் இந்த பாடம் பயிற்சி அளிக்கும்."
        },
        "coursed-2021/Relay Programming": {
          "overview": "இந்த \\*\\* சூழல் அமைத்தல் \\*\\* பாடம் பிழைத்திருத்தம் மற்றும் விடாமுயற்சி பற்றிய ஒரு சிறு பாடத்துடன் தொடங்கும், பின்னர் மாணவர்கள் குழுக்களாக உடைந்து ஒரு நேரத்தில் ஒரு அறிவுறுத்தலை எழுத ஒன்றாக வேலை செய்வதால் கடிகாரத்திற்கு எதிரான பந்தயத்திற்கு விரைவாக நகரும்.",
          "student_overview": "பாடநெறியின் தொடக்கத்தில் நீங்கள் குறியீட்டைக் கொண்டு வரைபடங்களை உருவாக்கியதை நினைவில் கொள்கிறீர்களா? இந்த பாடத்தில், நீங்கள் மிகவும் ஒத்த ஒன்றை செய்ய ஒரு குழுவுடன் இணைந்து செயல்படுவீர்கள்!"
        },
        "coursed-2021/Debugging in Collector": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடத்தில், மாணவர்கள் \"கலெக்டர்\" சூழலில் பிழைத்திருத்தத்தை பயிற்சி செய்வார்கள். எளிய வழிமுறைகள், சுழல்கள் மற்றும் உள்ளமைக்கப்பட்ட சுழல்கள் மூலம் புதிர்களை சரிசெய்ய மாணவர்கள் படிக்க மற்றும் திருத்தும் குறியீட்டைப் பயிற்சி செய்வார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்."
        },
        "coursed-2021/Events in Bounce": {
          "overview": "இந்த \\*\\* சூழல் அமைப்பில் **/** திறனை வளர்ப்பதற்கான \\*\\* பாடத்தில், மாணவர்கள் என்ன நிகழ்வுகள் மற்றும் புரோகிராமர்கள் அவற்றை வீடியோ கேம்களில் எவ்வாறு பயன்படுத்துகிறார்கள் என்பதை கற்றுக்கொள்வார்கள். மாணவர்கள் வெவ்வேறு வேகம் மற்றும் ஒலியுடன் தனிப்பயனாக்கக்கூடிய ஒரு விளையாட்டை உருவாக்குவார்கள்.",
          "preparation": "-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.\n-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n    \\-\\*\\* \\*ஸ்லைடு டெக் \\*\\* ஐ வாசிக்கவும் (வகுப்பு முடிவில் மாணவர்களுக்கு வழங்கப்பட வேண்டும்).",
          "student_overview": "நீங்கள் பள்ளியில் வீடியோ கேம்களை விளையாட வேண்டும் என்று எப்போதாவது விரும்புகிறீர்களா? இந்த பாடத்தில், நீங்கள் அதை நீங்களே உருவாக்குவீர்கள்!"
        },
        "coursed-2021/Build a Star Wars Game": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடத்தில், மாணவர்கள் அவர்கள் பகிர்ந்து கொள்ளக்கூடிய ஒரு விளையாட்டை உருவாக்க நிகழ்வுகளை பயன்படுத்தி பயிற்சி செய்வார்கள்.",
          "preparation": "-   புதிர்கள் மூலம் விளையாடுங்கள் மற்றும் சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறியவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து \n    கொள்ளுங்கள்.",
          "student_overview": "இந்த பாடத்தில் உங்கள் சொந்த ஸ்டார் வார்ஸ் விளையாட்டை உருவாக்கும்போது சக்தியை உணருங்கள்."
        },
        "coursed-2021/Dance Party": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.\n-   ஹெட்ஃபோன்களின் தேவையைக் கவனியுங்கள். இந்த செயல்பாடு ஒலியை நம்பியுள்ளது.",
          "purpose": "இந்த பாடம் குறியீட்டு மற்றும் நிகழ்வு நிரலாக்கத்தின் முக்கிய CS கருத்துக்களை அறிமுகப்படுத்துகிறது (தொகுதிகளைப் பயன்படுத்தி)."
        },
        "coursed-2021/Loops in Ice Age": {
          "overview": "இந்த \\*\\* சூழல்-அமைப்பு/திறமை-கட்டமைப்பு \\*\\* பாடம் மாணவர்களை விரைவாக சுழல்களுக்கு அறிமுகப்படுத்தும்.",
          "preparation": "-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "இந்த பாடத்தில் ஸ்க்ராட் ஏகோர்னை முடிந்தவரை திறமையாக அடைய உதவும் வகையில் மீண்டும் மீண்டும் பயன்படுத்துவீர்கள்."
        },
        "coursed-2021/Loops in Artist": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடம் முந்தைய பாடத்திலிருந்து சுழல்களைப் புரிந்துகொள்வதை உருவாக்குகிறது மற்றும் கூடுதல் சிக்கல் தீர்க்கும் பயிற்சிக்கான பிழைத்திருத்தப் பயிற்சியாக இரட்டிப்பாகிறது.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த தொடர், சுழற்சியின் சக்தியை, புதிர்களின் வரிசையை முன்னிலைப்படுத்துகிறது.",
          "student_overview": "இந்த பாடத்தில், லூப்ஸ் கலைஞருடன் சிறந்த படங்களை உருவாக்குவதை எளிதாக்குகிறது!"
        },
        "coursed-2021/Nested Loops in Bee": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடத்தில், மாணவர்கள் மற்றொரு வளையத்திற்குள் ஒரு வளையத்தை எவ்வாறு நிரல் செய்வது என்று கற்றுக்கொள்வார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்."
        },
        "coursed-2021/Conditionals with Cards": {
          "overview": "இந்த \\*\\* சூழல்-அமைத்தல் \\*\\* பாடத்தில், எளிய அட்டை விளையாட்டுகளின் விதிகளை கூற மாணவர்கள் நிபந்தனை (என்றால்/வேறு) அறிக்கைகளை எழுதுவார்கள்.",
          "student_overview": "சில நிபந்தனைகளின் கீழ் நீங்கள் புள்ளிகளைப் பெறும் ஒரு விளையாட்டை விளையாட வேண்டிய நேரம் இது!"
        },
        "coursed-2021/lesson-6": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடம் மாணவர்களுக்கு இது வரை கற்றுக்கொண்ட கருத்துக்களைப் பயிற்சி செய்து, நிபந்தனைகளுடன் முதல் அனுபவத்தைப் பெற வாய்ப்பளிக்கிறது!",
          "preparation": "-   இந்த பாடத்துடன் தொடர்புடைய புதிர்களைக் கண்டுபிடித்து அவற்றைக் கண்டுபிடிக்கவும்\n    உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "எரிமலைக்குழாயைத் தவிர்க்கவும்! இங்கே நீங்கள் _Minecraft_ உலகில் உள்ள நிபந்தனைகள் பற்றி அறியத் தொடங்குவீர்கள்."
        },
        "coursed-2021/Conditionals in Bee": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில், உங்கள் வகுப்பு நிபந்தனைகளுடன் குறியீட்டைத் தொடரும், நிரல் எதிர்கொள்ளும் குறிப்பிட்ட நிலைமைகளைப் பொறுத்து வித்தியாசமாக செயல்படும் குறியீட்டை எழுத அனுமதிக்கிறது.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "இப்போது நீங்கள் நிபந்தனைகளை புரிந்துகொண்டுள்ளீர்கள், தேன் மற்றும் தேன் சேகரிக்கும் போது அவற்றைப் பயன்படுத்த பீ திட்டமிட வேண்டிய நேரம் இது."
        },
        "coursed-2021/While Loops in Farmer": {
          "overview": "இந்த \\*\\* திறமையை வளர்க்கும் \\*\\* பாடத்தில், மாணவர்கள் விவசாயிக்குள் துளைகளை நிரப்பவும் மற்றும் அழுக்கைத் தோண்டவும் வேலை செய்வார்கள், ஆனால் துளைகளின் அளவு அல்லது மண் மேடுகளின் உயரம் அவர்களுக்கு தெரியாது. இந்தப் புதிர்களைத் தீர்க்க, மாணவர்கள் ஒரு புதிய வகையான வளையத்தைப் பயன்படுத்துவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "குறியீட்டில் சுழல்கள் மிகவும் பயனுள்ளதாக இருக்கும். இந்த பாடம் ஒரு புதிய வகையான வளையத்தைப் பற்றி உங்களுக்குக் கற்பிக்கும்: சுழல்கள் இருக்கும் போது!"
        },
        "coursed-2021/Until Loops in Maze": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த புதிர்களின் தொகுப்பு, `வரை` நிபந்தனையைச் சேர்ப்பதன் மூலம் சுழல்களின் அறிவை திடப்படுத்தவும் உருவாக்கவும் வேலை செய்யும். இந்த கருத்துக்களை இணைப்பதன் மூலம், மாணவர்கள் சிக்கலான மற்றும் புதுமையான திட்டங்களை உருவாக்கும் திறனை ஆராய முடியும்.",
          "student_overview": "நீங்கள் \"வரை\" சுழல்களைப் பயன்படுத்தும் போது சில அற்புதமான விஷயங்களைச் செய்யலாம்!"
        },
        "coursed-2021/End of Course Project": {
          "overview": "இந்த \\*\\* திட்டம் \\*\\* பாடம் புதிய திட்டங்களை வடிவமைத்தல், மேம்படுத்துதல் மற்றும் காட்சிப்படுத்துதல் ஆகியவற்றின் மூலம் மாணவர்களை அழைத்துச் செல்கிறது!",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் \n    விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் (அல்லது ஜோடி) ஒன்றை \\*\\* \\*திட்டமிடல் வழிகாட்டி \\*\\* அச்சிடவும்.\n-   (விரும்பினால்) உங்கள் சொந்த திட்டமிடல் வழிகாட்டி மற்றும் மாணவர்களுக்கு காண்பிக்க உங்கள் \n    சொந்த திட்டத்தை குறியிடவும்!",
          "purpose": "இந்த பாடம் மாணவர்களுக்கு தங்கள் சொந்த வடிவமைப்பின் ஒரு திட்டத்தை உருவாக்க, ஒரு படிப்படியான செயல்முறையைப் பயன்படுத்தி திட்டமிடல் தேவைப்படுகிறது ஆனால் பரந்த படைப்பாற்றலை அனுமதிக்கிறது."
        },
        "express-2021/Programming with Angry Birds": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் \n    விளையாடுங்கள்.\n-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் கணினித் தளத்தில் நிரலாக்க திறன்களை வளர்த்துக் கொள்வார்கள். இந்த புதிர்களின் தொகுதி அடிப்படையிலான வடிவம், தொடரியல் மற்றும் கருத்தாக்கங்களைப் பற்றி மாணவர்கள் கற்றுக்கொள்ள உதவுகிறது.",
          "student_overview": "கோபம் பறவைகள்\\_ மூலம் வரிசைகள் மற்றும் வழிமுறைகளைப் பற்றி அறியவும்."
        },
        "express-2021/Debugging with Scrat": {
          "overview": "இந்த \\*\\* திறமையை வளர்க்கும் \\*\\* பாடத்தில், மாணவர்கள் தவறுகள் அடங்கிய முன்பே எழுதப்பட்ட குறியீட்டை சந்திப்பார்கள். பிழைகளை அடையாளம் காண அவர்கள் ஏற்கனவே உள்ள குறியீட்டைப் பின்பற்ற வேண்டும்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறிய பாடத்தின் மூலம் \n    விளையாடுங்கள்.\n-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "புதிர்களில் சிக்கல்களைக் கண்டறிந்து உங்கள் பிழைத்திருத்தத் திறனைப் பயிற்சி செய்யுங்கள்."
        },
        "express-2021/Collecting Treasure with Laurel": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "லாரல் தி அட்வென்ச்சர்\\_ நிறைய ரத்தினங்களை சேகரிக்க உதவும் வழிமுறைகளை எழுதுங்கள்!"
        },
        "express-2021/Creating Art with Code": {
          "overview": "இந்த \\*\\* திறமையை வளர்க்கும் \\*\\* பாடத்தில், மாணவர்கள் திரையில் வரைபடங்களை முடிக்க கலைஞரின் கட்டுப்பாட்டை எடுத்துக்கொள்வார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   (விருப்பத்தேர்வு) புதிர்களை முடிக்க அவர்கள் பயன்படுத்த வேண்டிய கோணங்களை கற்பனை செய்ய உங்கள் வகுப்பிற்கான ப்ராட்ராக்டர்களைப் பெறுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் \\*\\* \\*மாணவர் கையேடு \\*\\* ஐ அச்சிடுங்கள்.",
          "student_overview": "கலைஞரை நிரலாக்குவதன் மூலம் அழகான படங்களை உருவாக்கவும்."
        },
        "express-2021/Swimming Fish in Sprite Lab": {
          "overview": "இந்த \\*\\* திறனை வளர்க்கும் பாடத்தில் \\*\\* எளிய அனிமேஷன் செய்யப்பட்ட நீருக்கடியில் காட்சியை மாணவர்கள் நிரல் செய்வார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "உருவங்களை உருவாக்குவது மற்றும் திருத்துவது எப்படி என்பதை அறிக."
        },
        "express-2021/lesson-2": {
          "preparation": "நிலைகளில் விளையாடுங்கள் மற்றும் \\*\\* \\*பாடம் ஸ்லைடுகளை \\*\\* மதிப்பாய்வு செய்யவும்.",
          "purpose": "இந்த பாடம் ஸ்பிரைட் ஆய்வகத்தில் மாணவர்களை நிரலாக்கத்திற்கு அறிமுகப்படுத்த வடிவமைக்கப்பட்டுள்ளது. மாணவர்கள் இந்தக் கருவியின் நிரலாக்க மாதிரியைப் பற்றிய புரிதலை உருவாக்கத் தொடங்குவார்கள், மேலும் அவர்கள் தங்களை வெளிப்படுத்திக் கொள்ள வழிகளைப் பற்றி ஆராய்கிறார்கள்.",
          "student_overview": "இந்த பாடத்தில் நீங்கள் புரோகிராம்களை எழுதுவீர்கள் மற்றும் ஸ்பிரிட்ஸ் மற்றும் நடத்தைகள் பற்றி அறிந்து கொள்வீர்கள்."
        },
        "express-2021/lesson-3": {
          "preparation": "நிலைகளில் விளையாடுங்கள் மற்றும் பாடம் ஸ்லைடுகளை மதிப்பாய்வு செய்யவும்.",
          "purpose": "இந்த பாடம் மாணவர்களுக்கு நிகழ்வுகளுடன் நிரலாக்கத்தை அறிமுகப்படுத்த வடிவமைக்கப்பட்டுள்ளது. இந்த பாடநெறி முழுவதும், நிகழ்வுகள் மாணவர்கள் தங்கள் திட்டங்கள் காலப்போக்கில் அல்லது பயனருக்கு பதிலளிக்கும் விதமாக மாற்றுவதற்கான முதன்மை வழியாகும்.",
          "student_overview": "நீங்கள் நிரலாக்க நிலைகளின் மூலம் வேலை செய்வீர்கள் மற்றும் திறந்த-இலவச \"இலவச நாடகம்\" பணியை முடிப்பீர்கள், அங்கு நீங்கள் விரும்பியதை உருவாக்க முடியும்."
        },
        "express-2021/Virtual Pet with Sprite Lab": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "இந்தப் பாடம் மாணவர்களை மற்றொரு படைப்பு சூழலில் முந்தைய பாடங்களிலிருந்து நிரலாக்கக் கருத்துகளைப் பயன்படுத்த அனுமதிக்கிறது.",
          "student_overview": "நீங்கள் விரும்பும் விதத்தில் நடந்து கொள்ளும் ஒரு ஊடாடும் மெய்நிகர் செல்லப்பிராணியை உருவாக்கவும்! உங்கள் செல்லப்பிராணிக்கு அதன் சொந்த வாழ்க்கையை கொடுங்கள்!"
        },
        "express-2021/lesson-1": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.\n-   ஹெட்ஃபோன்களின் தேவையைக் கவனியுங்கள். இந்த செயல்பாடு ஒலியை நம்பியுள்ளது.",
          "purpose": "இந்த பாடம் குறியீட்டு மற்றும் நிகழ்வு நிரலாக்கத்தின் முக்கிய CS கருத்துக்களை அறிமுகப்படுத்துகிறது (தொகுதிகளைப் பயன்படுத்தி)."
        },
        "express-2021/Loops with Rey and BB-8": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில் மாணவர்கள் _ஸ்டார் வார்ஸ்_ கதாபாத்திரம் _BB-8_ திறம்பட பிரமைக்கு செல்ல வளையங்களைப் பயன்படுத்துகின்றனர்.",
          "preparation": "-   ஏதேனும் பிரச்சனை இருக்குமா என்பதை அறிய புதிர்கள் மூலம் விளையாடுங்கள்\n    உங்கள் வகுப்பிற்கான பகுதிகள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "சுழல்களைப் பயன்படுத்தி பிரமை மூலம் _BB-8_ க்கு உதவுங்கள்!"
        },
        "express-2021/Sticker Art with Loops": {
          "overview": "இந்த \\*\\* சிறு திட்டம் \\*\\* பாடம் சுழல்களைப் புரிந்துகொள்வதை அடிப்படையாகக் கொண்டது. மாணவர்கள் கலைஞருடன் தனித்துவமான கலைப்படைப்புகளை உருவாக்குவார்கள்.",
          "preparation": "-   உங்கள் சொந்த வடிவமைப்பை உருவாக்க பயிற்சி செய்யுங்கள். முன்பு வந்த எல்லாவற்றிலிருந்தும் இந்த நிலைகள் எவ்வாறு வேறுபடுகின்றன என்பதைக் கவனியுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "இந்த தொடர் ஆக்கபூர்வமான மற்றும் தனிப்பட்ட வடிவமைப்புகளுடன் சுழல்களின் சக்தியை எடுத்துக்காட்டுகிறது.\n\nஒரு திட்ட-ஆதரவு வரிசையாக வழங்கப்படும், இந்த முன்னேற்றம் மாணவர்கள் தங்கள் சொந்த வேலையின் மேல் உருவாக்க மற்றும் அற்புதமான கலைப்பொருட்களை உருவாக்க அனுமதிக்கும்.",
          "student_overview": "இந்த பாடத்தில், சுழல்கள் கலைஞருடன் கூட குளிர்ச்சியான படங்களை உருவாக்குவதை எளிதாக்குகின்றன!"
        },
        "express-2021/Nested Loops in Maze": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடத்தில், மாணவர்கள் மற்றொரு வளையத்திற்குள் ஒரு வளையத்தை எவ்வாறு நிரல் செய்வது என்று கற்றுக்கொள்வார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "சுழல்கள் உள்ளே சுழல்கள் உள்ளே சுழல்கள். இதற்கு என்ன அர்த்தம்? நீங்கள் ஒரு கூட்டை உருவாக்கும்போது என்ன நடக்கும் என்பதை இந்த பாடம் உங்களுக்குக் கற்பிக்கும்."
        },
        "express-2021/Snowflakes with Anna and Elsa": {
          "overview": "இந்த \\*\\* சிறு திட்டம் \\*\\* பாடம் _Frozen_ திரைப்படங்களின் கதாபாத்திரங்களைப் பயன்படுத்தி ஸ்னோஃப்ளேக் படங்களை உருவாக்க தொடர்ச்சியான பயிற்சிகள் மூலம் மாணவர்களை அழைத்துச் செல்கிறது.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறிய பாடம் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "*அன்னா மற்றும் \\_ எல்சா* சிறந்த ஐஸ்-ஸ்கேட்டிங் திறன்களைக் கொண்டுள்ளனர், ஆனால் பனியில் வடிவங்களை உருவாக்க உங்கள் உதவி தேவை. சூப்பர் கூல் ஒன்றை உருவாக்க கூடு கட்டப்பட்ட சுழல்களைப் பயன்படுத்தவும்."
        },
        "express-2021/Looking Ahead with Minecraft ": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடம் மாணவர்களுக்கு இது வரை கற்றுக்கொண்ட கருத்துக்களைப் பயிற்சி செய்து, நிபந்தனைகளுடன் முதல் அனுபவத்தைப் பெற வாய்ப்பளிக்கிறது!",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறிய இந்தப் பாடத்துடன் \n    தொடர்புடைய புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "எரிமலைக்குழாயைத் தவிர்க்கவும்! இங்கே நீங்கள் _Minecraft_ உலகில் உள்ள நிபந்தனைகள் பற்றி அறியத் தொடங்குவீர்கள்."
        },
        "express-2021/If/Else with Bee": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில், உங்கள் வகுப்பு நிபந்தனைகளுடன் குறியீட்டைத் தொடரும், நிரல் எதிர்கொள்ளும் குறிப்பிட்ட நிலைமைகளைப் பொறுத்து வித்தியாசமாக செயல்படும் குறியீட்டை எழுத அனுமதிக்கிறது.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "மாணவர்கள் தங்கள் திட்டங்களில் நிபந்தனைகளை பயன்படுத்தி பயிற்சி செய்வார்கள். If / else தொகுதிகள் மிகவும் நெகிழ்வான நிரலை அனுமதிக்கும். தேனீ தேனை மட்டும் சேகரிக்கும் \\_ பூ இருந்தால் அல்லது தேன் செய்யும் \\_ \\_\\_ தேன்கூடு இருந்தால்.",
          "student_overview": "இப்போது நீங்கள் நிபந்தனைகளை புரிந்துகொண்டுள்ளீர்கள், தேன் மற்றும் தேன் சேகரிக்கும் போது அவற்றைப் பயன்படுத்த பீ திட்டமிட வேண்டிய நேரம் இது."
        },
        "express-2021/While Loops with the Farmer": {
          "overview": "இந்த \\*\\* திறமையை வளர்க்கும் \\*\\* பாடத்தில், மாணவர்கள் விவசாயிக்குள் துளைகளை நிரப்பவும் மற்றும் அழுக்கைத் தோண்டவும் வேலை செய்வார்கள், ஆனால் துளைகளின் அளவு அல்லது மண் மேடுகளின் உயரம் அவர்களுக்கு தெரியாது. இந்தப் புதிர்களைத் தீர்க்க, மாணவர்கள் ஒரு புதிய வகையான வளையத்தைப் பயன்படுத்துவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "குறியீட்டில் சுழல்கள் மிகவும் பயனுள்ளதாக இருக்கும். இந்த பாடம் ஒரு புதிய வகையான வளையத்தைப் பற்றி உங்களுக்குக் கற்பிக்கும்: சுழல்கள் இருக்கும் போது!"
        },
        "express-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "இந்த \\*\\* சூழல் அமைத்தல் \\*\\* பாடத்தில், மாணவர்கள் இது வரை கற்றுக்கொண்ட உள்ளடக்கத்தைப் பயிற்சி செய்வதற்கான வாய்ப்பைப் பெறுவார்கள், அதே போல் நிபந்தனைகளில் ஒரு பின்தொடர்வைப் பெறுவார்கள்!",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறிய இந்தப் பாடத்துடன் \n    தொடர்புடைய புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "சுழல்கள் மற்றும் நிபந்தனைகளின் அறிவை திடப்படுத்தவும் உருவாக்கவும் இந்த புதிர்களின் தொகுப்பு வேலை செய்யும். இந்த இரண்டு கருத்துகளையும் ஒன்றாக இணைப்பதன் மூலம், மாணவர்கள் புதிய மற்றும் உற்சாகமான சூழலில் வேடிக்கையான மற்றும் புதுமையான நிகழ்ச்சிகளை உருவாக்கும் திறனை ஆராய முடியும்.",
          "student_overview": "இங்கே நீங்கள் Minecraft உலகில் நிபந்தனைகளை பயன்படுத்துவீர்கள்."
        },
        "express-2021/Until Loops in Maze": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "இந்த புதிர்களின் தொகுப்பு நிபந்தனை வரை சேர்ப்பதன் மூலம் சுழல்களின் அறிவை திடப்படுத்தவும் உருவாக்கவும் வேலை செய்யும். இந்த கருத்துக்களை இணைப்பதன் மூலம், மாணவர்கள் சிக்கலான மற்றும் புதுமையான திட்டங்களை உருவாக்கும் திறனை ஆராய முடியும்.",
          "student_overview": "நீங்கள் சுழல்கள் வரை பயன்படுத்தும் போது சில அற்புதமான விஷயங்களைச் செய்யலாம்!"
        },
        "express-2021/Harvesting with Conditionals": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறிய பாடத்தின் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "ஒவ்வொரு நிபந்தனையையும் எப்போது பயன்படுத்துவது என்பது எப்போதும் தெளிவாக இல்லை. என்ன செய்வது என்று முடிவெடுக்க பயிற்சி பெற இந்த பாடம் உதவும்."
        },
        "express-2021/Functions in Minecraft": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடத்தில், செயல்பாடுகள் எவ்வாறு உதவிகரமாக இருக்கும் என்பதை மாணவர்கள் புரிந்து கொள்ளத் தொடங்குவார்கள்!",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "மாணவர்கள் பல்வேறு சூழல்களில் செயல்படுவதன் மூலம் நிரலாக்கத்தின் பன்முகத்தன்மையைக் கண்டுபிடிப்பார்கள். இங்கே, மாணவர்கள் மீண்டும் பயன்படுத்தக்கூடிய வடிவங்களை அங்கீகரிப்பார்கள் மற்றும் முன் வரையறுக்கப்பட்ட செயல்பாடுகளை அழைக்க பெயரிடப்பட்ட தொகுதிகளை இணைக்க முடியும்.",
          "student_overview": "மிகவும் திறமையான குறியீட்டிற்கான செயல்பாடுகளை எவ்வாறு பயன்படுத்துவது என்பதை உங்களால் கண்டுபிடிக்க முடியுமா?"
        },
        "express-2021/Functions with Artist": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடத்தில், மாணவர்கள் கலைஞருடன் செயல்பாடுகளை பயன்படுத்துவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "செயல்பாடுகளுடன் மிகவும் சிக்கலான வரைபடங்களை உருவாக்கவும்!"
        },
        "express-2021/Functions with Harvester": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில், மாணவர்கள் ஹார்வெஸ்டரில் பயிர்களை அறுவடை செய்வதற்கான செயல்பாடுகளுடன் நிபந்தனைகளை பயன்படுத்துவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   எப்போதாவது மாணவர் ஒரு பிரதிபலிப்பு இதழ் வைத்திருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "விவசாயியின் அறுவடைக்கு நீங்கள் உதவுவதால் செயல்பாடுகள் உங்களுக்கு நிறைய வேலைகளைச் சேமிக்கும்!"
        },
        "express-2021/lesson-4": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடத்தில், மாணவர்கள் ஸ்ப்ரைட் ஆய்வகத்தில் மாறிகளுடன் பயிற்சி பெறுவார்கள்.",
          "preparation": "நிலைகளில் விளையாடுங்கள் மற்றும் பாடம் ஸ்லைடுகளை மதிப்பாய்வு செய்யவும்.",
          "student_overview": "இந்த பாடத்தில் நீங்கள் ஸ்பிரைட் ஆய்வகத்தில் மாறிகள் பயிற்சி செய்வீர்கள்."
        },
        "express-2021/Variables with Artist": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்."
        },
        "express-2021/Changing Variables with Bee": {
          "overview": "குறியீடு இயங்கும்போது மதிப்புகளை மாற்றுவதன் மூலம் மாறிகள் நிரல்களை எவ்வாறு அதிக ஆற்றல்மிக்கதாக மாற்ற முடியும் என்பதை விளக்க இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடம் உதவும்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "இந்த பாடம் மாறிவரும் மதிப்புகள் கொண்ட குறியீடு எவ்வாறு உதவியாக இருக்கும் என்பதை விளக்கும் மற்றும் வரவிருக்கும் பாடங்களில் \"சுழல்களுக்கு\" எவ்வாறு வேலை செய்கிறது என்பதை மாணவர்கள் புரிந்துகொள்ளத் தயார்படுத்தும்.",
          "student_overview": "இந்த தேனீ மாறிகளை விரும்புகிறது!"
        },
        "express-2021/For Loops with Bee": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடம் சுழல்களுக்கு கவனம் செலுத்துகிறது மற்றும் அதிக சிக்கலான புதிர்களைத் தீர்க்க ஒரு அதிகரிக்கும் மாறியைப் பயன்படுத்துகிறது.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "student_overview": "Buzz buzz. இந்த புதிர்களில் நீங்கள் தேனீ மற்றும் தேன் ஆகியவற்றிற்கு தேனீக்கு வழிகாட்டி இருப்பீர்கள்."
        },
        "express-2021/For Loops with Artist": {
          "overview": "இந்த \\*\\* திறமையை வளர்த்துக் கொள்ளும் \\*\\* பாடத்தில், மாணவர்கள் கலைஞருக்காக \"ஃபார்\" லூப்ஸ் பயிற்சி செய்கிறார்கள். சிக்கலான வடிவமைப்புகள் மற்றும் தனித்துவமான கலைகளை உருவாக்க மாணவர்கள் புதிர்களை முடிப்பார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறிய பாடம் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "படைப்பாற்றல் மற்றும் விமர்சன சிந்தனை இந்த பாடத்தில் அழகாக ஒன்றாக வருகிறது. மாணவர்கள் தாடை-கைவிடும் படங்களை உருவாக்கும் போது சுழல்கள் மற்றும் மாறிகளுடன் தங்கள் பயிற்சியைத் தொடர்வார்கள். கணினி அறிவியலுக்கு முக்கிய கருத்துக்களை கற்பிக்கும் போது இந்த பாடம் ஒரு படைப்பு மனதை ஊக்குவிக்கிறது.",
          "student_overview": "உங்கள் அடுத்த தலைசிறந்த படைப்பை உருவாக்க தயாராகுங்கள். இங்கே நீங்கள் சில தாடை-கைவிடும் படங்களை உருவாக்க சுழல்களுக்குப் பயன்படுத்துவீர்கள்."
        },
        "express-2021/End of Course Project": {
          "overview": "இந்த \\*\\* திட்டம் \\*\\* பாடம் புதிய திட்டங்களை வடிவமைத்தல், மேம்படுத்துதல் மற்றும் காட்சிப்படுத்துதல் ஆகியவற்றின் மூலம் மாணவர்களை அழைத்துச் செல்கிறது!",
          "purpose": "இந்த பாடம் மாணவர்களுக்கு தங்கள் சொந்த வடிவமைப்பின் ஒரு திட்டத்தை உருவாக்க, ஒரு படிப்படியான செயல்முறையைப் பயன்படுத்தி திட்டமிடல் தேவைப்படுகிறது ஆனால் பரந்த படைப்பாற்றலை அனுமதிக்கிறது."
        },
        "pre-express-2021/Learn to Drag and Drop": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடம் மாணவர்களுக்கு கணினி ஆய்வகத்திற்குச் செல்லும்போது என்ன எதிர்பார்க்கலாம் என்ற யோசனையை அளிக்கும். கணினி ஆய்வக பழக்கவழக்கங்களை அவர்களுக்கு அறிமுகப்படுத்தும் ஒரு சுருக்கமான விவாதத்துடன் இது தொடங்குகிறது, பின்னர் அவர்கள் ஆன்லைன் புதிர்களை முடிக்க ஒரு கணினியைப் பயன்படுத்துவதில் முன்னேறுவார்கள்.",
          "student_overview": "புதிர்களை முடிக்க கிளிக் செய்து இழுக்கவும்."
        },
        "pre-express-2021/Sequencing with Scrat": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில், மாணவர்கள் ஒரு பிரமை ஒரு பக்கத்திலிருந்து மற்றொரு பக்கத்தில் உள்ள ஏகோர்னுக்கு ஒரு அணில் பாத்திரத்தை நகர்த்துவதற்கான தொடர்ச்சியான வழிமுறைகளை உருவாக்கும். இதைச் செய்ய அவர்கள் குறியீட்டுத் தொகுதிகளை ஒரு நேரியல் வரிசையில் ஒன்றாக அடுக்கி வைப்பார்கள்.",
          "preparation": "ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் கணினித் தளத்தில் நிரலாக்க மற்றும் பிழைத்திருத்த திறன்களை வளர்த்துக் கொள்வார்கள். இந்த புதிர்களின் தொகுதி அடிப்படையிலான வடிவம் தொடரியல் மற்றும் கருத்துக்களைப் பற்றி மாணவர்கள் அறிய உதவுகிறது, தொடரியல் சரியானது பற்றி கவலைப்படாமல்.",
          "student_overview": "ஏகார்னை அடைய ஸ்க்ராட் திட்டம்."
        },
        "pre-express-2021/Programming in with Angry Birds": {
          "overview": "இந்த \\*\\* திறனை வளர்த்தல் \\*\\* பாடத்தில், மாணவர்கள் தொடர்ச்சியான வழிமுறைகளை உருவாக்கிக்கொண்டே இருப்பார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறிய பாடத்தின் மூலம் விளையாடுங்கள்.\n-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் கணினித் தளத்தில் நிரலாக்க மற்றும் பிழைத்திருத்த திறன்களை வளர்த்துக் கொள்வார்கள். இந்த புதிர்களின் தொகுதி அடிப்படையிலான வடிவம் தொடரியல் மற்றும் கருத்துக்களைப் பற்றி மாணவர்கள் அறிய உதவுகிறது, தொடரியல் சரியானது பற்றி கவலைப்படாமல்."
        },
        "pre-express-2021/Programming with Rey and BB-8": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில், மாணவர்கள் BB-8 உடன் ஒரு தந்திரமான பாடத்திட்டத்திற்கு செல்ல மிகவும் சிக்கலான வழிகளில் தங்கள் புதிய நிரலாக்க திறன்களைப் பயன்படுத்துவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறிய பாடத்தின் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்."
        },
        "pre-express-2021/Programming in Harvester": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடத்தில், மாணவர்கள் தாங்கள் கற்றுக்கொண்ட நிரலாக்கக் கருத்துகளை ஹார்வெஸ்டர் சூழலுக்குப் பயன்படுத்துவார்கள். மாணவர்கள் தொடர்ச்சியான அல்காரிதம் திறன்களை வளர்த்து, பிழைத்திருத்த செயல்முறையைப் பயன்படுத்தத் தொடங்குவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் பிழைத்திருத்த திறன்களை வளர்த்துக் கொள்வார்கள் மற்றும் அவர்களின் நிரலாக்க திறன்களை தொடர்ந்து வளர்த்துக் கொள்வார்கள்.",
          "student_overview": "ஒரு பாதையில் காய்கறிகளை சேகரிக்க ஹார்வெஸ்டருக்கு உதவுங்கள்."
        },
        "pre-express-2021/Loops with Scrat": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில், அணில் ஏகோர்னை அடைய உதவுவதே குறிக்கோளாக இருக்கும் புரோகிராமிங் புதிர்களில் மாணவர்கள் சுழல்கள் என்ற கருத்தை பயிற்சி செய்வார்கள்.",
          "preparation": "-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "சுழல்களைப் பயன்படுத்தி அதிக நிலத்தை மறைக்க ஸ்க்ராட்டுக்கு உதவுங்கள்."
        },
        "pre-express-2021/Loops with Laurel": {
          "overview": "இந்த பாடத்தில், மாணவர்கள் சுழல்களின் கருத்தை தொடர்ந்து கற்றுக் கொள்கிறார்கள். இங்கே, லாரல் சாகசக்காரர் திறந்த குகை இடங்களில் புதையலைச் சேகரிக்க சுழல்களைப் பயன்படுத்துகிறார். அவளுடைய பயணத்திற்கு உதவ ஒரு புதிய `புதையலைப் பெறு` தொகுதி அறிமுகப்படுத்தப்பட்டது.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் \n    விளையாடுங்கள்.\n-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "இந்த பாடம் மாணவர்களுக்கு சுழல்களுடன் அதிக பயிற்சியை அளிக்கிறது மற்றும் முடிந்தவரை புதையலைச் சேகரிக்க முயற்சிக்கும்போது ஒரு \\`ரிப்பீட் 'க்குள் பல தொகுதிகளை வைக்க ஊக்குவிக்கிறது."
        },
        "pre-express-2021/Ocean Scene with Loops": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பதற்கான \\*\\* பாடத்தில், மாணவர்கள் அறிவுறுத்தல்களின் எளிய வரிசைகளை சுழற்றுவதன் மூலம் படங்களை வரைய கற்றுக்கொள்கிறார்கள். இங்கே, சுழல்கள் வடிவங்களை உருவாக்குகின்றன. இந்த பாடத்தின் முடிவில், மாணவர்கள் தங்கள் சொந்த படங்களை உருவாக்க வாய்ப்பு வழங்கப்படும்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "இந்த பாடம் நிரல்கள் நிரல்களை எவ்வாறு உருவாக்க முடியும் என்பதைப் பற்றிய வித்தியாசமான பார்வையை அளிக்கிறது. \\`ரிபீட் 'லூப்ஸின் உதவியின்றி இந்த ப்ரோக்ராமுக்கு எத்தனை ப்ளாக் தேவைப்படும் என்பதால் மாணவர்கள் இங்கே லூப்ஸ் இல்லாமல் ப்ரோக்ராமிங்கின் திறமையின்மையை பிரதிபலிக்க முடியும்.",
          "student_overview": "படங்களை முடிக்க சுழல்கள் மற்றும் வடிவங்களைப் பயன்படுத்தவும்."
        },
        "pre-express-2021/Drawing Gardens with Loops": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பதற்கான \\*\\* பாடத்தில், மாணவர்கள் அறிவுறுத்தல்களின் எளிய வரிசைகளை சுழற்றுவதன் மூலம் படங்களை வரைய கற்றுக்கொள்கிறார்கள். இங்கே, மாணவர்கள் வடிவங்களை உருவாக்க சுழல்களைப் பயன்படுத்துகின்றனர். இந்த பாடத்தின் முடிவில், மாணவர்கள் தங்கள் சொந்த படங்களை உருவாக்க வாய்ப்பு வழங்கப்படும்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டறிய பாடத்தின் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "படங்களை முடிக்க வடிவங்கள் மற்றும் சுழல்களைப் பயன்படுத்தவும்."
        },
        "pre-express-2021/On the Move with Events": {
          "overview": "இந்த \\*\\* மினி-ப்ராஜெக்ட் \\*\\* இல், மாணவர்களுக்கு பிளே லேப்பில் நிகழ்வுகளை எப்படிப் பயன்படுத்துவது மற்றும் அனிமேஷன் விளையாட்டை உருவாக்க அவர்கள் கற்றுக்கொண்ட அனைத்து குறியீட்டுத் திறன்களையும் பயன்படுத்துவதற்கான வாய்ப்பு கிடைக்கும். பிளே லேபில் படைப்பாற்றல் மற்றும் கதையை உருவாக்கும் நேரம் இது!",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு இதழ் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்",
          "student_overview": "உங்கள் சொந்த விளையாட்டு அல்லது கதையை உருவாக்கவும்."
        },
        "pre-express-2021/A Royal Battle with Events": {
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் \n    விளையாடுங்கள்.\n-   (விரும்பினால்) உங்கள் வகுப்பில் குழுவாகச் செய்ய இரண்டு புதிர்களைத் தேர்ந்தெடுக்கவும்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "ஒரு கதையை உருவாக்க அல்லது ஒரு ஊடாடும் விளையாட்டை உருவாக்க நிகழ்வுகளைப் பயன்படுத்தவும்."
        },
        "coursee-2021/Simon Says": {
          "overview": "இந்த \\*\\* சூழல்-அமைப்பு \\*\\* பாடத்தில், மாணவர்கள் தொடர்ச்சியான வழிமுறைகளைப் பற்றி சிந்திக்க வைக்கும் ஒரு விளையாட்டை விளையாடுவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடம் ஸ்பிரைட் லேப், நடத்தைகளில் உள்ள முக்கிய நிரலாக்கக் கருத்துக்களில் ஒன்றைப் பற்றி சிந்திக்க மாணவர்களைத் தயார்படுத்த வடிவமைக்கப்பட்டுள்ளது.",
          "student_overview": "ஒரு விளையாட்டை விளையாடுங்கள் மற்றும் சரியான முடிவைப் பெற என்ன கட்டளைகள் தேவை என்று சிந்தியுங்கள்."
        },
        "coursee-2021/Learning Sprites with Sprite Lab": {
          "overview": "மாணவர்கள் இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில் ஒரு எளிய அனிமேஷன் நீருக்கடியில் காட்சியை நிரல் செய்வார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "உருவங்களை உருவாக்குவது மற்றும் திருத்துவது எப்படி என்பதை அறிக."
        },
        "coursee-2021/Alien Dance Party with Sprite Lab": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடத்தில் பயனர் உள்ளீட்டின் அடிப்படையில் மாணவர்கள் திரையை சுற்றி திரிவதற்கு நிகழ்வுகளை பயன்படுத்துவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடம் நிரலாக்கத்தில் நிகழ்வுகளுக்கு ஒரு சிறந்த அறிமுகத்தை வழங்குகிறது மற்றும் மாணவர்களுக்கு படைப்பாற்றலைக் காட்ட ஒரு வாய்ப்பை வழங்குகிறது! பாடத்தின் முடிவில், மாணவர்கள் தங்கள் திட்டங்களைப் பகிர்ந்து கொள்ளும் வாய்ப்பு வழங்கப்படும்.",
          "student_overview": "வகுப்பு தோழர்களுடன் பகிரக்கூடிய ஒரு ஊடாடும் திட்டத்தை உருவாக்கவும்."
        },
        "coursee-2021/lesson-4": {
          "preparation": "-   அறிவுறுத்தல் பொருட்களை மதிப்பாய்வு செய்யவும்.\n-   ஒவ்வொரு மாணவருக்கும் கையேட்டை (களை) அச்சிடுங்கள்.\n-   மாணவர்களுக்கு வண்ண பென்சில்கள் அல்லது குறிப்பான்களை தயார் செய்யவும்.",
          "purpose": "சைபர் கொடுமைப்படுத்துதலைக் காணும்போது மாணவர்களுக்கு எப்படித் துணைநிற்பவர்களாக இருக்க முடியும் என்பதை கற்பிக்க காமன் சென்ஸ் கல்வி இந்த பாடத்தை உருவாக்கியது.",
          "student_overview": "நீங்கள் சைபர் மிரட்டலைக் காணும்போது நீங்கள் எவ்வாறு ஒரு சிறந்தவராக இருக்க முடியும் என்பதை அறியுங்கள்."
        },
        "coursee-2021/Private and Personal Information": {
          "preparation": "-   அறிவுறுத்தல் பொருட்களை மதிப்பாய்வு செய்யவும்.\n-   ஒவ்வொரு மாணவருக்கும் கையேட்டை (களை) அச்சிடுங்கள்.",
          "purpose": "ஆன்லைனில் பகிர்வது பற்றி மாணவர்களுக்கு என்ன தகவல் இருக்கிறது என்பதை கற்பிக்க காமன் சென்ஸ் கல்வி இந்த பாடத்தை உருவாக்கியது."
        },
        "coursee-2021/About Me": {
          "overview": "இந்த \\*\\* சிறு திட்டத்தில் \\*\\* ஒரு ஊடாடும் சுவரொட்டியை உருவாக்குவதன் மூலம் மாணவர்கள் தனிப்பட்ட மற்றும் தனிப்பட்ட தகவல்களை இணையத்தில் பகிர்வதற்கான புரிதலைப் பயன்படுத்துவார்கள்.",
          "preparation": "-   (விரும்பினால்) மாணவர்களுக்கான \\*\\* \\*திட்ட வழிகாட்டி \\*\\* நகல்களை அச்சிடவும் அல்லது \n    டிஜிட்டல் நகல்களை விநியோகிக்கவும்.\n-   வகுப்போடு பகிர்ந்து கொள்ள ஒரு உதாரணத் திட்டத்தை நீங்களே உருவாக்குங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து \n    கொள்ளுங்கள்.",
          "student_overview": "ஒரு ஊடாடும் சுவரொட்டியை உருவாக்குதல், ஆனால் ஆன்லைனில் பகிர என்ன தகவல் பாதுகாப்பானது என்பதை கவனமாக சிந்தியுங்கள்."
        },
        "coursee-2021/Digital Sharing": {
          "overview": "இந்த \\*\\* ஆய்வு \\*\\* பாடம், குறிப்பாக டிஜிட்டல் சூழல்களில், உரிமை மற்றும் பதிப்புரிமையை மதிப்பதன் சவால்கள் மற்றும் நன்மைகளை மாணவர்கள் புரிந்துகொள்ள உதவுகிறது.",
          "purpose": "மாணவர்கள் விரைவில் பகிர்ந்து கொள்ள திட்டங்களை உருவாக்குவார்கள் மற்றும் இந்த திட்டங்களில் பெரும்பாலானவை மாணவர்கள் தங்களை உருவாக்காத குறியீடு அல்லது படங்களை கொண்டிருக்கும். இந்த பாடம் மாணவர்களுக்கு சொந்தமில்லாத உள்ளடக்கத்தின் பயன்பாட்டைக் கையாள சரியான வழியைக் காண்பிக்க இங்கே உள்ளது.",
          "student_overview": "இந்த பாடத்தில், உரிமை மற்றும் பதிப்புரிமை ஆகியவற்றின் சவால்கள் மற்றும் நன்மைகள் பற்றி நீங்கள் அறிந்து கொள்வீர்கள்."
        },
        "coursee-2021/Programming and Loops with the Artist": {
          "overview": "இந்த \\*\\* சூழல்-அமைப்பு \\*\\* பாடம் ஸ்ப்ரைட் ஆய்வகத்திலிருந்து கலைஞருக்கு கவனம் செலுத்துகிறது, இது பாடத்தின் எஞ்சிய முழுவதும் மாணவர்கள் ஆராயும் ஒரு புதிய கருவி.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "மாணவர்கள் சுழல்களைப் பயன்படுத்தி பயிற்சி செய்வார்கள், இது வரவிருக்கும் பாடங்கள் முழுவதும் மறுபரிசீலனை செய்யப்படும்.",
          "student_overview": "இந்த பாடத்தில், \\*\\* சுழல்கள் \\*\\* கலைஞருடன் கூடிய குளிர் படங்களை உருவாக்குவதை எளிதாக்குகிறது!"
        },
        "coursee-2021/Nested Loops in Artist": {
          "overview": "இந்த \\*\\* திறமையை வளர்க்கும் \\*\\* பாடத்தில், மாணவர்கள் கலைஞரைப் பயன்படுத்தி சிக்கலான வடிவமைப்புகளை உருவாக்குவார்கள். மாணவர்கள் தங்கள் சொந்த வடிவமைப்புகளை உருவாக்கும் வாய்ப்போடு பாடம் முடிகிறது.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் \n    விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.\n-   உங்கள் மாணவர்களுக்கு திருப்பங்கள் மற்றும் கோணங்களில் என்ன ஆதரவு தேவை என்பதை \n    கருத்தில் கொள்ளுங்கள்."
        },
        "coursee-2021/Nested Loops in Frozen": {
          "overview": "இந்த \\*\\* சிறு திட்டம் \\*\\* பாடம் _Frozen_ திரைப்படங்களின் கதாபாத்திரங்களைப் பயன்படுத்தி ஸ்னோஃப்ளேக் படங்களை உருவாக்க தொடர்ச்சியான பயிற்சிகள் மூலம் மாணவர்களை அழைத்துச் செல்கிறது.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடத்தில், மாணவர்கள் தங்கள் திறமைகளை உள்ளமைக்கப்பட்ட சுழல்களுடன் பயன்படுத்துவதன் மூலம் அவர்கள் பகிர்ந்து கொள்ள உற்சாகமாக இருக்கும் படங்களை உருவாக்கலாம்.",
          "student_overview": "*அன்னா மற்றும் \\_ எல்சா* சிறந்த ஐஸ்-ஸ்கேட்டிங் திறன்களைக் கொண்டுள்ளனர், ஆனால் பனியில் வடிவங்களை உருவாக்க உங்கள் உதவி தேவை. சூப்பர் கூல் ஒன்றை உருவாக்க கூடு கட்டப்பட்ட சுழல்களைப் பயன்படுத்தவும்."
        },
        "coursee-2021/Functions: Songwriting": {
          "overview": "இந்த \\*\\* சூழல்-அமைப்பு \\*\\* பாடம் மாணவர்களுக்கு குறியீட்டின் பகுதிகளை ஏன் செயல்பாடுகளாக இணைப்பது ஒரு பயனுள்ள பயிற்சியாக இருக்கும் என்பதைப் புரிந்துகொள்ள உதவும்.",
          "preparation": "-   (விரும்பினால்) \\*\\* \\*பாடம் செயல் \\*\\* வீடியோவைப் பாருங்கள்.\n-   ஒவ்வொரு குழுவிற்கும் பல \\*\\* \\*பணித்தாள்களை \\*\\* அச்சிடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் \\*\\* \\*மதிப்பீடு \\*\\* ஒன்றை அச்சிடவும்.\n-   செயல்பாட்டிற்கான பாடல்கள் மற்றும் பாடல்களுக்கான பாதுகாப்பான அணுகல்.\n-   ஒவ்வொரு மாணவரிடமும் ஒரு பத்திரிகை இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.",
          "purpose": "செயல்பாடுகளின் பயன்பாடு குறியீட்டை எளிதாக்க உதவுகிறது மற்றும் மாணவர் தங்கள் திட்டத்தை ஒழுங்கமைக்கும் திறனை வளர்க்க உதவுகிறது. எழுதும் செயல்பாடுகள் தங்கள் நீண்ட நிரல்களை எளிதாகப் படிக்கவும், ஏதேனும் தவறு நடந்தால் பிழைத்திருத்தத்தை எளிதாக்கவும் முடியும் என்பதை மாணவர்கள் விரைவாக அங்கீகரிப்பார்கள்.",
          "student_overview": "ராக்ஸ்டார்களுக்கு கூட நிரலாக்க திறன்கள் தேவை. பாடங்களிலிருந்து வரிகளைப் பயன்படுத்தி செயல்பாடுகள் பற்றி இந்தப் பாடம் உங்களுக்குக் கற்பிக்கும்."
        },
        "coursee-2021/Functions in Minecraft": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடத்தில், செயல்பாடுகள் எவ்வாறு உதவிகரமாக இருக்கும் என்பதை மாணவர்கள் புரிந்து கொள்ளத் தொடங்குவார்கள்!",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "மாணவர்கள் பல்வேறு சூழல்களில் செயல்படுவதன் மூலம் நிரலாக்கத்தின் பன்முகத்தன்மையைக் கண்டுபிடிப்பார்கள். இங்கே, மாணவர்கள் மீண்டும் பயன்படுத்தக்கூடிய வடிவங்களை அங்கீகரிப்பார்கள் மற்றும் முன் வரையறுக்கப்பட்ட செயல்பாடுகளை அழைக்க பெயரிடப்பட்ட தொகுதிகளை இணைக்க முடியும்.",
          "student_overview": "மிகவும் திறமையான குறியீட்டிற்கான செயல்பாடுகளை எவ்வாறு பயன்படுத்துவது என்பதை உங்களால் கண்டுபிடிக்க முடியுமா?"
        },
        "coursee-2021/Functions in Artist": {
          "overview": "இந்த \\*\\* திறமையை வளர்ப்பது \\*\\* பாடத்தில், மாணவர்கள் கலைஞருடன் செயல்பாடுகளை பயன்படுத்துவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "செயல்பாடுகளுடன் மிகவும் சிக்கலான வரைபடங்களை உருவாக்கவும்!"
        },
        "coursee-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "இந்த \\*\\* சூழல் அமைத்தல் \\*\\* பாடத்தில், மாணவர்கள் இது வரை கற்றுக்கொண்ட உள்ளடக்கத்தைப் பயிற்சி செய்வதற்கான வாய்ப்பைப் பெறுவார்கள், அதே போல் நிபந்தனைகளில் ஒரு பின்தொடர்வைப் பெறுவார்கள்!",
          "preparation": "-   இந்த பாடத்துடன் தொடர்புடைய புதிர்களைக் கண்டுபிடித்து அவற்றைக் கண்டுபிடிக்கவும்\n    உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "student_overview": "_Minecraft_ உலகில் உள்ள நிபந்தனைகள் பற்றி இங்கே நீங்கள் அறிந்து கொள்வீர்கள்."
        },
        "coursee-2021/Conditionals": {
          "overview": "இந்த \\*\\* திறமை-கட்டமைப்பு \\*\\* பாடம் ஒரு புதிய வகை நிரலாக்க புதிர் மீது கவனம் செலுத்துகிறது, இதில் பயிர்களை நடவு செய்வதற்கு ஒரு விவசாயி தனது வயல்களை தயார் செய்ய வேண்டும்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடம் மாணவர்களுக்கு சுழல்கள் மற்றும் \"if / else\" அறிக்கைகளை அறிமுகப்படுத்துகிறது.",
          "student_overview": "பயிர்களை நடவு செய்வதற்கு விவசாயி தனது வயல்களை தயார் செய்து நிபந்தனைகள் பற்றி மேலும் அறிய உதவுங்கள்!"
        },
        "coursee-2021/Functions in Harvester": {
          "overview": "இந்த \\*\\* திறன் வளர்ப்பு \\*\\* பாடத்தில், மாணவர்கள் ஹார்வேஸ்டரில் பயிர்களை அறுவடை செய்வதற்கான செயல்பாடுகளுடன் நிபந்தனைகளை பயன்படுத்துவார்கள்.",
          "preparation": "-   உங்கள் வகுப்பிற்கான சாத்தியமான சிக்கல் பகுதிகளைக் கண்டுபிடிக்க புதிர்கள் மூலம் விளையாடுங்கள்.\n-   ஒவ்வொரு மாணவருக்கும் ஒரு பிரதிபலிப்பு பத்திரிகை இருப்பதை உறுதி செய்து கொள்ளுங்கள்.",
          "purpose": "இந்த பாடம் மாணவர்களை மேலும் செயல்பாடுகளுடன் நிபந்தனைகளைப் பயன்படுத்தத் தூண்டுகிறது. இந்த புதிர்கள் சிக்கல் தீர்க்கும் மற்றும் விமர்சன சிந்தனை திறன்களை அதிகரிக்க வேண்டும்.",
          "student_overview": "விவசாயியின் அறுவடைக்கு நீங்கள் உதவுவதால் செயல்பாடுகள் உங்களுக்கு நிறைய வேலைகளைச் சேமிக்கும்!"
        },
        "coursee-2021/lesson-1": {
          "student_overview": "மூளைச்சலவை மற்றும் அனுமான பயன்பாடுகளுக்கான அணுகக்கூடிய தீர்வுகளை வடிவமைப்பதன் மூலம் அணுகல் மற்றும் பச்சாத்தாபத்தின் மதிப்பு பற்றி அறியவும்."
        },
        "coursee-2021/End of Course Project": {
          "overview": "இந்த \\*\\* திட்டம் \\*\\* பாடம் புதிய திட்டங்களை வடிவமைத்தல், மேம்படுத்துதல் மற்றும் காட்சிப்படுத்துதல் ஆகியவற்றின் மூலம் மாணவர்களை அழைத்துச் செல்கிறது!",
          "student_overview": "இந்த பெரிய திட்டங்களுக்கு நிறைய நேரமும் திட்டமிடலும் தேவை. உங்கள் உத்வேகத்தைக் கண்டுபிடி, ஒரு திட்டத்தை உருவாக்கி, உங்கள் படைப்பாற்றலை கட்டவிழ்த்து விடுங்கள்!"
        }
      }
    }
  }
}