{
  "sv-SE": {
    "data": {
      "lessons": {
        "poem-art-2021/Poem Art": {
          "overview": "I den här Datavetenskap- och språkintegrerade lektionen för nya kodare kommer studenterna att animera en dikt med kod för att illustrera stämningen i en dikt. Eleverna kommer att läsa och upptäcka stämningen i en dikt. De hittar sedan motsvarande effekter och bilder för att illustrera diktens stämning. Slutligen kommer studenterna att använda händelser (kod) för att illustrera en förändring i stämningen eller animera introduktionen av nya bilder i en dikt.\n\nDenna lektion kan genomföras som en 1-timmes fristående lektion. Det finns också ett alternativ att använda den här lektionen som den första lektionen i flerlektionsmodulen som heter [Coding with Poetry](http://studio.code.org/s/poetry-2021).",
          "preparation": "-   Granska och slutför självstudien online själv: [Diktkonst](http://studio.code.org/s/poem-art).\n\n-   Prova alltid aktiviteterna själv innan du ber dina elever att utföra dem.\n\n-   Kontrollera din teknik och avgör om du behöver felsöka något i förväg.\n\n-   Vissa nivåer kräver ljud vid uppspelning. Dela ut hörlurar i förväg. \n\n-   [Valfritt] Två fästisar per elev till utvärderingen."
        },
        "poem-art/lesson-1": {
          "overview": "I den här Datavetenskap- och språkintegrerade lektionen kommer studenterna att animera en dikt med kod för att illustrera stämningen i en dikt. Under denna inledande kodningsaktivitet läser och identifierar studenterna stämningen i en dikt. Sedan hittar de motsvarande effekter och bilder för att illustrera diktens stämning. Slutligen använder eleverna händelser (kod) för att illustrera en förändring i stämningen eller animera införandet av nya bilder i en dikt. \n\nDenna lektion kan genomföras som en fristående lektion på en timme. Det går även att använda den här lektionen som den första lektionen i lektionsmodulen i fem delar som heter [Koda med poesi](http://code.org/poetry). I slutet av modulen Koda med poesi skriver eleverna sina egna dikter och skapar en app för att generera dikter som de kan dela med sina vänner.\n\nKoda med poesi ingår i Code.orgs läroplan DV Sammanhang, som är tänkt att integrera datavetenskap med andra ämnen som matematik, språk och naturvetenskap med anpassning till standarderna för CCSS, NGSS och CSTA.",
          "preparation": "-   Granska och slutför självstudien online själv: [Diktkonst](http://studio.code.org/s/poem-art).\n\n-   Prova alltid aktiviteterna själv innan du ber dina elever att utföra dem.\n\n-   Kontrollera din teknik och avgör om du behöver felsöka något i förväg.\n\n-   Vissa nivåer kräver ljud vid uppspelning. Dela ut hörlurar i förväg. \n\n-   [Valfritt] Två fästisar per elev till utvärderingen."
        }
      }
    }
  }
}