{
  "pt-BR": {
    "data": {
      "lessons": {
        "coursef-2021/Virtual Pet": {
          "overview": "Nesta lição, os alunos criarão um animal de estimação virtual interativo que se parece e se comporta como deseja. Os alunos usarão a ferramenta \"Trajes\" do Sprite Lab para personalizar a aparência do animal. Eles então usarão eventos, comportamentos e outros conceitos que aprenderam para dar vida própria ao animal de estimação!",
          "student_overview": "Nesta lição, os alunos criarão um animal de estimação virtual interativo que se parece e se comporta como deseja. Os alunos usarão a ferramenta \"Trajes\" do Sprite Lab para personalizar a aparência do animal. Eles então usarão eventos, comportamentos e outros conceitos que aprenderam para dar vida própria ao animal de estimação!"
        },
        "coursef-2021/lesson-2": {
          "student_overview": "Bullying nunca é bom. Esta lição ensinará sobre o que é e o que não é bom dizer on-line."
        },
        "coursef-2021/Loops with the Artist": {
          "overview": "Veja os rostos dos alunos se iluminarem enquanto criam seus próprios designs lindos usando um pequeno número de blocos e adesivos digitais! Esta lição baseia-se na compreensão dos loops das lições anteriores e oferece aos alunos a chance de serem verdadeiramente criativos. Essa atividade é fantástica para a produção de artefatos para portfólios ou conferências de pais/professores.",
          "student_overview": "Nesta lição, os loops facilitam a criação de imagens ainda mais legais com o Artist!"
        },
        "coursef-2021/Variables that Change in Artist": {
          "overview": "Nesta lição, os alunos explorarão a criação de designs repetitivos usando variáveis ​​no ambiente do Artist. Os alunos aprenderão como as variáveis ​​podem ser usadas para tornar o código mais fácil de escrever e mais fácil de ler. Após quebra-cabeças guiados, os alunos terminam em um nível de freeplay para mostrar o que aprenderam e criar seus próprios designs.",
          "student_overview": "Nesta lição, você fará desenhos usando variáveis ​​que mudam à medida que o programa é executado."
        },
        "coursef-2021/Nested Loops in the Maze": {
          "overview": "Nesta atividade on-line, os alunos terão a oportunidade de elevar sua compreensão dos laços a um nível totalmente novo. Jogando com a Abelha e Plantas vs Zumbis, os alunos aprenderão como programar um laço para ficar dentro de outro laço. Eles também serão incentivados a descobrir como poucas alterações em qualquer laço afetarão seu programa quando clicarem em \\`Executar '.",
          "student_overview": "Laços dentro de loops dentro de laços. O que isto significa? Esta lição ensinará o que acontece quando você coloca uma repetição dentro de outro laço."
        },
        "coursef-2021/Variables that Change in Bee": {
          "overview": "Esta lição ajudará a ilustrar como as variáveis ​​podem tornar os programas mais poderosos, permitindo que os valores mudem enquanto o código está em execução. ",
          "student_overview": "Esta abelha adora variáveis!"
        },
        "coursef-2021/For Loop Fun": {
          "overview": "Sabemos que os loops nos permitem fazer as coisas repetidas vezes, mas agora vamos aprender a usar loops com estruturas extras integradas. Essas novas estruturas permitirão que os alunos criem código mais poderoso e dinâmico. ",
          "student_overview": "Você vai se divertir aprendendo muito sobre os loops `for`!"
        },
        "coursef-2021/For Loops in Bee": {
          "overview": "Apresentando Bee, esta lição se concentra nos loops `for` e no uso de uma variável de incremento para resolver quebra-cabeças mais complicados. Os alunos começarão revisando os loops das lições anteriores e depois farão uma introdução aos loops `for` para que possam resolver de maneira mais eficaz problemas complicados.",
          "student_overview": "Buzz buzz. Nestes quebra-cabeças, você guiará uma abelha para o néctar e o mel usando loops `for`!"
        },
        "coursef-2021/For Loops in Artist": {
          "overview": "Nesta lição, os alunos continuam praticando loops `for`, mas desta vez com o Artist. Os alunos irão completar quebra-cabeças combinando as idéias de variáveis, loops e loops `for` para criar designs complexos. No final, eles terão a chance de criar sua própria arte em um nível de freeplay.",
          "student_overview": "Prepare-se para fazer sua próxima obra-prima. Aqui você usará loops `for` para fazer algumas fotos de cair o queixo."
        },
        "coursef-2021/Simulating Experiments": {
          "overview": "Ao executar uma simulação simples no Sprite Lab, os alunos experimentarão como a computação pode ser usada para coletar dados que identificam tendências ou padrões. Depois de executar a simulação várias vezes, os alunos terão a oportunidade de fazer uma previsão sobre como a alteração de uma variável na simulação pode impactar o resultado e depois testar essa hipótese.",
          "student_overview": "Execute simulações no computador e experimente alterando variáveis."
        },
        "coursef-2021/Internet": {
          "overview": "Embora muitas pessoas usem a Internet diariamente, poucas sabem como ela funciona. Nesta lição, os alunos fingirão fluir pela Internet, aprendendo o tempo todo sobre conexões, URLs, endereços IP e DNS.",
          "student_overview": "Já imaginou como a informação viaja pela Internet? Não é mágico! Esta lição ensinará os conceitos básicos de como a Internet funciona."
        },
        "coursef-2021/End of Course Project": {
          "student_overview": "Projetos desse tamanho levam tempo e muito planejamento. Encontre sua inspiração, desenvolva um plano e libere sua criatividade!"
        },
        "courseb-2021/Digital Trails": {
          "student_overview": "Aprenda sobre sua pegada digital e como se manter seguro ao visitar sites. "
        },
        "courseb-2021/Move It, Move It": {
          "overview": "Esta lição trabalhará para preparar mentalmente os alunos para os exercícios de codificação que eles encontrarão ao longo deste curso. Em equipes pequenas, os alunos usarão atividade física para programar seus colegas de classe para que sigam com cuidado de um lugar para outro até que uma meta seja alcançada.",
          "student_overview": "Programe seus colegas de classe para caminhar com cuidado de um lugar para outro."
        },
        "courseb-2021/Sequencing in Maze": {
          "overview": "Esta lição dará aos alunos uma ideia sobre o que esperar quando eles vão para o laboratório de informática. A lição começa com uma breve discussão introduzindo à eles as condutas do laboratório de informática, então eles irão progredir usando um computador para completar quebra-cabeças online.",
          "student_overview": "Ajude o Angry Bird Vermelho a seguir o caminho para o porco travesso."
        },
        "courseb-2021/Programming in Maze": {
          "overview": "Usando personagens da Era do Gelo, os alunos desenvolverão algoritmos seqüenciais para mover o Scrat de um lado de um labirinto para a bolota do outro lado. Para fazer isso, eles empilharão os blocos de código em uma sequência linear, fazendo com que eles se movam reto, vire à esquerda ou vire à direita.",
          "student_overview": "Crie programas para ajudar o Angry Bird a se mover pelo labirinto."
        },
        "courseb-2021/Programming in Harvester": {
          "overview": "Os alunos aplicarão os conceitos de programação que aprenderam no ambiente Colheita. Agora, em vez de apenas atingir o objetivo, os alunos precisam coletar milho usando um novo bloco. Os alunos continuarão a desenvolver habilidades de algoritmo seqüencial e começarão a usar o processo de depuração. ",
          "student_overview": "Ajude a colheitadeira a coletar vegetais ao longo de um caminho."
        },
        "courseb-2021/Loops: Getting Loopy": {
          "overview": "Quando começamos a escrever programas mais longos e mais interessantes, nosso código geralmente contém muita repetição. Nesta lição, os alunos aprenderão sobre como os loops podem ser usados ​​para comunicar mais facilmente instruções que têm muita repetição, observando os padrões repetidos de movimento em uma dança.",
          "student_overview": "Nesta lição, teremos uma festa de dança usando repetidos loops!"
        },
        "courseb-2021/Loops in Harvester": {
          "overview": "Com base no conceito de repetir instruções de \"Getting Loopy\", nesta etapa, os alunos usarão loops para colher milho com mais eficiência no Code.org.",
          "student_overview": "Ajude a Colheitadeira a coletar ainda mais, usando loops!"
        },
        "courseb-2021/Loops in Collector": {
          "overview": "Nesta lição, os alunos continuam aprendendo o conceito de loops. Aqui, Laurel, o Aventureiro, usa loops para coletar tesouros em espaços abertos de cavernas. Um novo bloco de obtenção de tesouros é introduzido para ajudá-la em sua jornada.",
          "student_overview": "Programe Laurel, o aventureiro, para coletar tesouros em uma caverna aberta."
        },
        "courseb-2021/Loops in Artist": {
          "overview": "Voltando aos loops, os alunos aprendem a desenhar imagens repetindo sequências simples de instruções. Na lição on-line anterior, loops foram usados ​​para atravessar um labirinto e coletar tesouros. Aqui, os alunos usam loops para criar padrões. No final desta etapa, os alunos terão a oportunidade de criar suas próprias imagens usando loops.",
          "student_overview": "Use padrões e loops para finalizar as imagens."
        },
        "courseb-2021/The Right App": {
          "overview": "Esta lição faz com que os alunos reconheçam que a ciência da computação pode ajudar as pessoas na vida real. Primeiro, os alunos simpatizam com vários usuários fictícios de smartphones, a fim de ajudá-los a encontrar o \"aplicativo certo\" que atenda às suas necessidades. Em seguida, os alunos exercitam empatia e criatividade para desenhar seu próprio aplicativo para smartphone que atenda às necessidades de um usuário adicional. ",
          "student_overview": "Esboce seu próprio aplicativo para smartphone."
        },
        "courseb-2021/Events: The Big Event": {
          "overview": "Eventos são uma ótima forma de adicionar variedade a um algoritmo pré-escrito. Algumas vezes você quer que o seu programa esteja apto a responder ao usuário exatamente quando o usuário quiser.\nÉ para isto que os eventos servem.",
          "student_overview": "Mova-se ou grite quando o professor pressionar botões em um controle remoto gigante."
        },
        "courseb-2021/Events in Play Lab": {
          "overview": "Nesta atividade online, os alunos terão a oportunidade de aprender a usar eventos no Play Lab e aplicar todas as habilidades de codificação que aprenderam para criar um jogo animado. É hora de ser criativo e criar um jogo no Play Lab!",
          "student_overview": "Use eventos para criar uma história ou criar um jogo interativo."
        },
        "coursea-2021/Learn to Drag and Drop": {
          "overview": "Esta lição dará aos alunos uma ideia sobre o que esperar quando eles vão para o laboratório de informática. A lição começa com uma breve discussão introduzindo à eles as condutas do laboratório de informática, então eles irão progredir usando um computador para completar quebra-cabeças online.",
          "student_overview": "Clique e arraste para finalizar os quebra-cabeças."
        },
        "coursea-2021/Programming: Happy Maps": {
          "overview": "A ponte de algoritmos para programação pode ser curta se os alunos entenderem a diferença entre planejar uma sequência e programar esta sequência em uma linguagem apropriada. Esta atividade irá ajudar os alunos a ganhar experiência escrevendo e lendo em códigos abreviados.",
          "purpose": "A ponte de algoritmos para programação pode ser curta se os alunos entenderem a diferença entre planejar uma sequência e programar esta sequência em uma linguagem apropriada. Esta atividade irá ajudar os alunos a ganhar experiência escrevendo e lendo em códigos abreviados.",
          "student_overview": "Escreva instruções para levar o Flurb à fruta."
        },
        "coursea-2021/Sequencing with Scrat": {
          "overview": "Esta lição dará aos alunos uma ideia sobre o que esperar quando eles vão para o laboratório de informática. A lição começa com uma breve discussão introduzindo à eles as condutas do laboratório de informática, então eles irão progredir usando um computador para completar quebra-cabeças online.",
          "student_overview": "Programe Scrat para alcançar a bolota."
        },
        "coursea-2021/Programming in Ice Age": {
          "overview": "Usando personagens da Era do Gelo, os alunos desenvolverão algoritmos seqüenciais para mover o Scrat de um lado de um labirinto para a bolota do outro lado. Para fazer isso, eles empilharão os blocos de código em uma sequência linear, fazendo com que eles se movam reto, vire à esquerda ou vire à direita.",
          "student_overview": "Escreva programas para ajudar Scrat a alcançar a bolota."
        },
        "coursea-2021/Programming with Rey and BB-8": {
          "overview": "Nesta lição, os alunos usarão suas novas habilidades de programação de maneiras mais complicadas para navegar em um curso complicado com o BB-8.",
          "student_overview": "Ajude o BB-8 a coletar a sucata."
        },
        "coursea-2021/Loops: Happy Loops": {
          "overview": "Repetições são uma ferramenta muito útil e poderosa em programação. Para entender como repetições úteis podem ser, os alunos precisarão ser levados a desejar uma maneira mais fácil de resolver problemas mundanos.",
          "student_overview": "Ajude o Flurb a resolver problemas maiores usando loops."
        },
        "coursea-2021/Loops in Ice Age": {
          "overview": "Com base no conceito de repetir instruções de \"Happy Loops\", nesta etapa, os alunos usarão loops para chegar à bolota com mais eficiência no Code.org.",
          "student_overview": "Ajude Scrat a cobrir mais terreno usando loops."
        },
        "coursea-2021/Loops in Collector": {
          "overview": "Aproveitando o conceito de repetição de instruções da aula \"Repetições Felizes\", este nível os alunos irão usar repetições para coletar tesouro de uma forma mais eficiente no Code.org.",
          "student_overview": "Ajude Laurel, o aventureiro, a coletar o tesouro no subsolo."
        },
        "coursea-2021/Ocean Scene with Loops": {
          "overview": "Retornando às repetições, os alunos aprendem a desenhar imagens repetindo sequências simples de instruções. Na última lição online, repetições foram utilizadas para atravessar um labirinto e coletar tesouro. Aqui, as repetições estão criando padrões. No fim deste nível, os alunos terão a oportunidade de criar as suas próprias imagens usando repetições.",
          "student_overview": "Use loops e padrões para finalizar as imagens."
        },
        "coursea-2021/Events: The Big Event": {
          "overview": "Eventos são uma ótima forma de adicionar variedade a um algoritmo pré-escrito. Algumas vezes você quer que o seu programa esteja apto a responder ao usuário exatamente quando o usuário quiser.\nÉ para isto que os eventos servem.",
          "student_overview": "Mova-se e grite quando seus professores pressionam botões em um controle remoto gigante."
        },
        "coursea-2021/Events in Play Lab": {
          "overview": "Nesta atividade online, os alunos irão ter a oportunidade de aprender a como utilizar eventos no Laboratório de Jogos e aplicar todas as habilidades de programação que eles aprenderam para criar um jogo animado. É hora de ser criativo e criar uma história no Laboratório de Jogos!",
          "student_overview": "Crie seu próprio jogo ou história."
        },
        "coursec-2021/Programming: My Robotic Friends": {
          "overview": "Usando um conjunto de símbolos no lugar do código, os alunos projetam algoritmos para instruir um \"robô\" a empilhar copos em diferentes padrões. Os alunos se revezam participando como o robô, respondendo apenas ao algoritmo definido por seus colegas. Esse segmento ensina aos alunos a conexão entre símbolos e ações, a diferença entre um algoritmo e um programa e a valiosa habilidade de depuração.",
          "student_overview": "Nesta lição, você fingirá que seus colegas de classe são robôs e os programará para criar padrões de copos empilhados."
        },
        "coursec-2021/Programming in Maze": {
          "overview": "Usando os personagens do jogo Angry Birds, os alunos desenvolverão algoritmos sequenciais para mover um pássaro de um lado de um labirinto para o porco do outro lado. Para fazer isso, eles empilharão os blocos de código em uma sequência linear, fazendo com que eles se movam reto, vire à esquerda ou vire à direita.",
          "student_overview": "Aprenda sobre sequências e algoritmos com o Angry Birds."
        },
        "coursec-2021/Debugging in Maze": {
          "overview": "A depuração é um elemento essencial para aprender a programar. Nesta lição, os alunos encontrarão quebra-cabeças que foram resolvidos incorretamente. Eles precisarão percorrer o código existente para identificar erros, incluindo loops incorretos, blocos ausentes, blocos extras e blocos fora de ordem.",
          "student_overview": "Encontre problemas em quebra-cabeças e pratique suas habilidades de depuração."
        },
        "coursec-2021/Programming in Collector": {
          "overview": "Nesta série de quebra-cabeças, os alunos continuarão a desenvolver sua compreensão de algoritmos e depuração. Com um novo personagem, Laurel, o Aventureiro, os alunos criarão algoritmos sequenciais para que Laurel pegue um tesouro enquanto ela caminha por um caminho.",
          "student_overview": "Escreva algoritmos para ajudar Laurel, o Aventureiro, a coletar muitas jóias!"
        },
        "coursec-2021/Programming in Artist": {
          "overview": "Nesta lição, os alunos assumirão o controle do Artista para concluir os desenhos na tela. Esta etapa do Artista permitirá que os alunos criem imagens de complexidade crescente usando novos blocos como \"avançar em 100 pixels\" e \"virar à direita em 90 graus\".",
          "student_overview": "Crie belas imagens programando o Artista."
        },
        "coursec-2021/Loops: My Loopy Robotic Friends": {
          "overview": "Com base na atividade inicial \"Meus amigos robóticos\", os alunos lidam com projetos maiores e mais complicados. Para programar seus \"robôs\" para concluir esses projetos maiores, os alunos precisarão identificar padrões repetidos em suas instruções que possam ser substituídos por um loop.",
          "student_overview": "Nesta lição, você programará seus colegas novamente, mas, usando loops, poderá resolver problemas maiores e mais complicados."
        },
        "coursec-2021/Loops with Rey and BB-8": {
          "overview": "Com base no conceito de repetir instruções de \"Getting Loopy\", nesta etapa, os alunos usarão loops para ajudar o BB-8 a atravessar um labirinto com mais eficiência do que antes.",
          "student_overview": "Ajude o BB-8 através de labirintos usando loops! "
        },
        "coursec-2021/Loops in Harvester": {
          "student_overview": "Vamos usar loops para ajudar a colheitadeira a coletar alguns vegetais!"
        },
        "coursec-2021/Sticker Art with Loops": {
          "student_overview": "Nesta lição, os loops facilitam a criação de imagens ainda mais legais com o Artist!"
        },
        "coursec-2021/Events: The Big Event": {
          "overview": "Em breve, os alunos aprenderão que os eventos são uma ótima maneira de adicionar flexibilidade a um algoritmo pré-escrito. Às vezes, você deseja que seu programa seja capaz de responder ao usuário exatamente quando o usuário deseja. Os eventos podem tornar seu programa mais interessante e interativo.",
          "student_overview": "Jogue um jogo divertido para aprender sobre os eventos. "
        },
        "coursec-2021/Build a Flappy Game": {
          "overview": "Nesta etapa especial, os alunos constroem seu próprio jogo Flappy Bird usando manipuladores de eventos para detectar cliques do mouse e colisões de objetos. No final do nível, os alunos poderão personalizar seu jogo alterando os visuais ou regras.",
          "student_overview": "Construa seu próprio jogo Flappy Bird da maneira que quiser e compartilhe com seus amigos!"
        },
        "coursec-2021/Events in Play Lab": {
          "overview": "Nesta atividade online, os alunos terão a oportunidade de aprender a usar eventos no Play Lab e aplicar todas as habilidades de codificação que aprenderam para criar um jogo animado. É hora de ser criativo e criar um jogo no Play Lab!",
          "student_overview": "É hora de ser criativo e criar um jogo no Play Lab!"
        },
        "coursec-2021/Picturing Data": {
          "overview": "Os dados podem ser usados ​​para ajudar os alunos a entender seu mundo e responder a perguntas interessantes. Nesta lição, os alunos coletarão dados de um projeto do Play Lab e os visualizarão usando diferentes tipos de gráficos.",
          "student_overview": "Os dados podem ser usados ​​para ajudar os alunos a entender seu mundo e responder a perguntas interessantes. Nesta lição, os alunos coletarão dados de um projeto do Play Lab e os visualizarão usando diferentes tipos de gráficos."
        },
        "coursec-2021/Binary Bracelets": {
          "overview": "Binário é extremamente importante no mundo dos computadores. Atualmente, a maioria dos computadores armazena todos os tipos de informações em formato binário. Esta lição ajuda a demonstrar como é possível tirar algo da vida real e traduzi-lo em uma série de prós e contras.",
          "student_overview": "Crie sua própria pulseira binária e aprenda como os computadores lembram informações!"
        },
        "coursec-2021/End of Course Project: Create a Play Lab Game": {
          "overview": "Esta lição fundamental leva os alunos ao processo de criar, desenvolver e apresentar seus próprios projetos do Play Lab! Para garantir que esse processo ocorra sem problemas, fornecemos uma estrutura passo a passo para os alunos seguirem, desde o planejamento em papel até a codificação em nosso site. Além disso, oferecemos idéias para ajudar os professores a facilitar um final de demonstração! ",
          "student_overview": "Prepare essas mãos para muita codificação! É hora de começar a construir seu projeto."
        },
        "coursed-2021/lesson-5": {
          "student_overview": "Nesta lição, você aprenderá sobre como as senhas protegem suas informações e como criar uma boa senha."
        },
        "coursed-2021/Algorithms: Graph Paper Programming": {
          "overview": "Ao \"programar\" uns aos outros para desenhar imagens, os alunos têm a oportunidade de experimentar alguns dos principais conceitos de programação de uma maneira divertida e acessível. A aula começará com os alunos usando símbolos para instruir uns aos outros a colorir quadrados em papel milimétrico, em um esforço para reproduzir uma imagem existente. Se houver tempo, a lição pode terminar com imagens criadas pelos alunos.  ",
          "student_overview": "Nesta lição, você programará seu colega de classe para desenhar desenhos!"
        },
        "coursed-2021/Introduction to Online Puzzles": {
          "overview": "Neste conjunto de quebra-cabeças, os alunos irão iniciar com uma introdução (ou revisão, dependendo da experiência da sua sala de aula) do espaço de trabalho online da Code.org. Haverá vídeos que apontam o funcionamento mais básico do espaço, incluindo os botôes \"Executar\", \"Reiniciar\" e \"Passo\". Também serão discutidos nestes vídeos: arrastando blocos Blockly, deletando blocos Blockly, e conectando blocos Blockly. Em seguida, os alunos irão praticar suas habilidades de _sequenciamento_ e _depuração_ no labirinto. Dali, os alunos irão conhecer novos tipos de quebra-cabeças como Coletor, Artista e Colheitador quando forem aprender o básico de _laços_.",
          "student_overview": "Esta lição lhe permitirá praticar as habilidades necessárias para este curso."
        },
        "coursed-2021/Relay Programming": {
          "student_overview": "Lembra no início do curso quando você fez desenhos com código? Nesta lição, você estará trabalhando com uma equipe para fazer algo muito semelhante!"
        },
        "coursed-2021/Debugging in Collector": {
          "overview": "Nesta atividade online, os alunos praticarão a depuração no ambiente \"coletor\". Os alunos aprenderão a ler e editar código para corrigir quebra-cabeças com algoritmos simples, laços e laços aninhados.",
          "student_overview": "Você já teve problemas durante a codificação? Nesta lição, você aprenderá sobre os segredos da depuração. Depuração é o processo de encontrar e corrigir problemas no seu código."
        },
        "coursed-2021/Events in Bounce": {
          "overview": "Nesta atividade online, os alunos aprenderão o que são eventos e como os computadores os usam em programas como videogames. Os alunos trabalharão com quebra-cabeças, fazendo o programa reagir a eventos (como botões de seta sendo pressionados.) No final do quebra-cabeça, os alunos terão a oportunidade de personalizar seu jogo com diferentes velocidades e sons.",
          "student_overview": "Você já desejou poder jogar videogame na escola? Nesta lição, você poderá fazer o seu próprio!"
        },
        "coursed-2021/Build a Star Wars Game": {
          "overview": "Nesta lição, os alunos irão praticar o uso de eventos para criar um jogo que eles possam compartilhar on-line. Apresentando R2-D2 e outros personagens de Star Wars, os alunos serão guiados através de eventos e, em seguida, terão espaço para criar seu próprio jogo.",
          "student_overview": "Sinta a força ao construir seu próprio jogo Star Wars nesta lição."
        },
        "coursed-2021/Dance Party": {
          "overview": "Nesta lição, os alunos irão programar sua própria festa de dança interativa. Esta atividade requer som, pois a ferramenta foi criada para responder à música.",
          "student_overview": "Hora de celebrar! Nesta lição, você programa sua própria festa de dança interativa."
        },
        "coursed-2021/Loops in Ice Age": {
          "overview": "Como uma rápida atualização (ou introdução) do uso de loops, nesta etapa, os alunos usam o bloco `repeat` para levar o Scrat à bolota com mais eficiência.",
          "student_overview": "Nesta lição, você usará o bloco de repetição para ajudar o Scrat a alcançar a bolota da maneira mais eficiente possível."
        },
        "coursed-2021/Loops in Artist": {
          "overview": "Esta lição baseia-se na compreensão dos loops das lições anteriores e oferece aos alunos a chance de serem verdadeiramente criativos. Essa atividade funciona como um exercício de depuração para prática extra de solução de problemas.",
          "student_overview": "Nesta lição, os loops facilitam a criação de imagens interessantes com o Artista!"
        },
        "coursed-2021/Nested Loops in Bee": {
          "overview": "Nesta atividade on-line, os alunos terão a oportunidade de elevar sua compreensão dos laços a um nível totalmente novo. Jogando com a Abelha e Plantas vs Zumbis, os alunos aprenderão como programar um laço para ficar dentro de outro laço. Eles também serão incentivados a descobrir como poucas alterações em qualquer laço afetarão seu programa quando clicarem em \\`Executar '.",
          "student_overview": "Loops dentro de loops dentro de loops. O que isto significa? Esta lição ensinará o que acontece quando você cria um loop aninhado."
        },
        "coursed-2021/Conditionals with Cards": {
          "student_overview": "É hora de jogar um jogo em que você ganha pontos apenas sob certas condições!"
        },
        "coursed-2021/lesson-6": {
          "overview": "Esta lição foi criada originalmente para a Hour of Code, juntamente com a equipe do Minecraft. Os alunos terão a chance de praticar as idéias que aprenderam até o momento, além de obter uma prévia dos condicionais!",
          "student_overview": "Evite a lava! Aqui você começará a aprender sobre condicionais no mundo do Minecraft."
        },
        "coursed-2021/Conditionals in Bee": {
          "overview": "Até esse momento, os alunos escreviam um código que é executado exatamente da mesma maneira cada vez que é executado - confiável, mas não muito flexível. Nesta lição, sua classe começará a codificar com condicionais, permitindo que eles escrevam códigos que funcionem de maneira diferente, dependendo das condições específicas que o programa encontra.",
          "student_overview": "Agora que você entende os condicionais, é hora de programar a Abelha para coletar mel e néctar. "
        },
        "coursed-2021/While Loops in Farmer": {
          "student_overview": "Laços são muito úteis na codificação. Esta lição ensinará sobre um novo tipo de laço: laços enquanto!"
        },
        "coursed-2021/Until Loops in Maze": {
          "overview": "Nesta lição, os alunos aprenderão sobre os loops \\`até '. Os alunos criarão programas que terão como personagem principal repetir ações até atingirem o ponto de parada desejado.",
          "student_overview": "Você pode fazer coisas incríveis quando usar loops `até`!"
        },
        "coursed-2021/End of Course Project": {
          "student_overview": "Prepare essas mãos para muita codificação! É hora de começar a construir seu projeto."
        },
        "express-2021/Programming with Angry Birds": {
          "overview": "Usando os personagens do jogo Angry Birds, os alunos desenvolverão algoritmos sequenciais para mover um pássaro de um lado de um labirinto para o porco do outro lado. Para fazer isso, eles empilharão os blocos de código em uma sequência linear, fazendo com que eles se movam reto, vire à esquerda ou vire à direita.",
          "student_overview": "Aprenda sobre sequências e algoritmos com o Angry Birds."
        },
        "express-2021/Debugging with Scrat": {
          "overview": "A depuração é um elemento essencial para aprender a programar. Nesta lição, os alunos encontrarão quebra-cabeças que foram resolvidos incorretamente. Eles precisarão percorrer o código existente para identificar erros, incluindo loops incorretos, blocos ausentes, blocos extras e blocos fora de ordem.",
          "student_overview": "Encontre problemas em quebra-cabeças e pratique suas habilidades de depuração."
        },
        "express-2021/Collecting Treasure with Laurel": {
          "overview": "Nesta série de quebra-cabeças, os alunos continuarão a desenvolver sua compreensão de algoritmos e depuração. Com um novo personagem, Laurel, o Aventureiro, os alunos criarão algoritmos sequenciais para que Laurel pegue um tesouro enquanto ela caminha por um caminho."
        },
        "express-2021/Creating Art with Code": {
          "overview": "Nesta lição, os alunos assumirão o controle do Artista para concluir os desenhos na tela. Esta etapa do Artista permitirá que os alunos criem imagens de complexidade crescente usando novos blocos como \"avançar em 100 pixels\" e \"virar à direita em 90 graus\".",
          "student_overview": "Crie belas imagens programando o Artista."
        },
        "express-2021/Swimming Fish in Sprite Lab": {
          "overview": "Nesta lição, os alunos aprenderão sobre os dois conceitos no coração do Sprite Lab: sprites e comportamentos. Sprites são personagens ou objetos na tela que os alunos podem mover, alterar e manipular. Comportamentos são ações que os sprites executarão continuamente até serem interrompidos.",
          "student_overview": "Aprenda a criar e editar sprites."
        },
        "express-2021/Virtual Pet with Sprite Lab": {
          "overview": "Nesta lição, os alunos criarão um animal de estimação virtual interativo que se parece e se comporta como deseja. Os alunos usarão a ferramenta \"Trajes\" do Sprite Lab para personalizar a aparência do animal. Eles então usarão eventos, comportamentos e outros conceitos que aprenderam para dar vida própria ao animal de estimação!",
          "student_overview": "Nesta lição, os alunos criarão um animal de estimação virtual interativo que se parece e se comporta como deseja. Os alunos usarão a ferramenta \"Trajes\" do Sprite Lab para personalizar a aparência do animal. Eles então usarão eventos, comportamentos e outros conceitos que aprenderam para dar vida própria ao animal de estimação!"
        },
        "express-2021/lesson-1": {
          "overview": "Nesta lição, os alunos irão programar sua própria festa de dança interativa. Esta atividade requer som, pois a ferramenta foi criada para responder à música.",
          "student_overview": "Hora de celebrar! Nesta lição, você programa sua própria festa de dança interativa."
        },
        "express-2021/Loops with Rey and BB-8": {
          "student_overview": "Ajude o BB-8 através de labirintos usando loops! "
        },
        "express-2021/Sticker Art with Loops": {
          "overview": "Veja os rostos dos alunos se iluminarem enquanto criam seus próprios designs lindos usando um pequeno número de blocos e adesivos digitais! Esta lição baseia-se na compreensão dos loops das lições anteriores e oferece aos alunos a chance de serem verdadeiramente criativos. Essa atividade é fantástica para a produção de artefatos para portfólios ou conferências de pais/professores.",
          "student_overview": "Nesta lição, os loops facilitam a criação de imagens ainda mais legais com o Artist!"
        },
        "express-2021/Nested Loops in Maze": {
          "overview": "Nesta atividade on-line, os alunos terão a oportunidade de elevar sua compreensão dos laços a um nível totalmente novo. Jogando com a Abelha e Plantas vs Zumbis, os alunos aprenderão como programar um laço para ficar dentro de outro laço. Eles também serão incentivados a descobrir como poucas alterações em qualquer laço afetarão seu programa quando clicarem em \\`Executar '.",
          "student_overview": "Loops dentro de loops dentro de loops. O que isto significa? Esta lição ensinará o que acontece quando você cria um loop aninhado."
        },
        "express-2021/Snowflakes with Anna and Elsa": {
          "overview": "Agora que os alunos sabem como estratificar seus loops, eles podem criar tantas coisas bonitas. Esta lição levará os alunos a uma série de exercícios para ajudá-los a criar suas próprias imagens prontas para o portfólio, usando as excelentes habilidades de patinação no gelo de Anna e Elsa!",
          "student_overview": "Anna e Elsa têm excelentes habilidades de patinação no gelo, mas precisam de sua ajuda para criar padrões no gelo. Use loops aninhados para criar algo super legal. "
        },
        "express-2021/Looking Ahead with Minecraft ": {
          "overview": "Esta lição foi criada originalmente para a Hour of Code, juntamente com a equipe do Minecraft. Os alunos terão a chance de praticar as idéias que aprenderam até o momento, além de obter uma prévia dos condicionais!",
          "student_overview": "Evite a lava! Aqui você começará a aprender sobre condicionais no mundo do Minecraft."
        },
        "express-2021/If/Else with Bee": {
          "overview": "Até esse momento, os alunos escreviam um código que é executado exatamente da mesma maneira cada vez que é executado - confiável, mas não muito flexível. Nesta lição, sua classe começará a codificar com condicionais, permitindo que eles escrevam códigos que funcionem de maneira diferente, dependendo das condições específicas que o programa encontra.",
          "student_overview": "Agora que você entende os condicionais, é hora de programar a Abelha para coletar mel e néctar. "
        },
        "express-2021/While Loops with the Farmer": {
          "student_overview": "Laços são muito úteis na codificação. Esta lição ensinará sobre um novo tipo de laço: laços enquanto!"
        },
        "express-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "Esta lição foi criada originalmente para a Hour of Code, juntamente com a equipe do Minecraft. Os alunos terão a chance de praticar as idéias que aprenderam até o momento, além de obter uma prévia dos condicionais!",
          "student_overview": "Aqui você aprenderá sobre condicionais no mundo do Minecraft."
        },
        "express-2021/Until Loops in Maze": {
          "overview": "Nesta lição, os alunos aprenderão sobre os loops \\`até '. Os alunos criarão programas que terão como personagem principal repetir ações até atingirem o ponto de parada desejado.",
          "student_overview": "Você pode fazer coisas incríveis quando usar loops `até`!"
        },
        "express-2021/Harvesting with Conditionals": {
          "overview": "Os alunos irão praticar os laços `enquanto`,`ate` e `se / senao`. Todos esses blocos usam condicionais. Ao praticar todos os três, os alunos aprenderão a escrever código complexo e flexível.",
          "student_overview": "Nem sempre é claro quando usar cada condicional. Esta lição ajudará você a praticar o processo de decisão."
        },
        "express-2021/Functions in Minecraft": {
          "overview": "Os alunos começarão a entender como as funções podem ser úteis nesta divertida e interativa aventura de Minecraft!",
          "student_overview": "Você pode descobrir como usar funções para o código mais eficiente?"
        },
        "express-2021/Functions with Artist": {
          "overview": "Os alunos serão apresentados ao uso de funções no Code.org. Imagens magníficas serão criadas e modificadas com funções no Artista. Para padrões mais complicados, os alunos aprenderão sobre aninhamento de funções, chamando uma função dentro de outra.",
          "student_overview": "Faça desenhos complexos mais facilmente com funções!"
        },
        "express-2021/Functions with Harvester": {
          "overview": "Os alunos praticaram a criação de designs impressionantes no Artist e a navegar labirintos no Bee, mas hoje eles usarão funções para colher colheitas em Harvester. Esta lição levará os alunos a usar funções de novas maneiras, combinando-as com loops `while` e instruções`if/else`.",
          "student_overview": "As funções economizarão muito trabalho, pois você ajuda o fazendeiro com sua colheita!"
        },
        "express-2021/Variables with Artist": {
          "overview": "Nesta lição, os alunos explorarão a criação de designs repetitivos usando variáveis ​​no ambiente do Artist. Os alunos aprenderão como as variáveis ​​podem ser usadas para tornar o código mais fácil de escrever e mais fácil de ler. Após quebra-cabeças guiados, os alunos terminam em um nível de freeplay para mostrar o que aprenderam e criar seus próprios designs.",
          "student_overview": "Nesta lição, você fará desenhos usando variáveis ​​que mudam à medida que o programa é executado."
        },
        "express-2021/Changing Variables with Bee": {
          "overview": "Esta lição ajudará a ilustrar como as variáveis ​​podem tornar os programas mais poderosos, permitindo que os valores mudem enquanto o código está em execução. ",
          "student_overview": "Esta abelha adora variáveis!"
        },
        "express-2021/For Loops with Bee": {
          "overview": "Apresentando Bee, esta lição se concentra nos loops `for` e no uso de uma variável de incremento para resolver quebra-cabeças mais complicados. Os alunos começarão revisando os loops das lições anteriores e depois farão uma introdução aos loops `for` para que possam resolver de maneira mais eficaz problemas complicados.",
          "student_overview": "Buzz buzz. Nestes quebra-cabeças, você guiará uma abelha para o néctar e o mel usando loops `for`!"
        },
        "express-2021/For Loops with Artist": {
          "overview": "Nesta lição, os alunos continuam praticando loops `for`, mas desta vez com o Artist. Os alunos irão completar quebra-cabeças combinando as idéias de variáveis, loops e loops `for` para criar designs complexos. No final, eles terão a chance de criar sua própria arte em um nível de freeplay.",
          "student_overview": "Prepare-se para fazer sua próxima obra-prima. Aqui você usará loops `for` para fazer algumas fotos de cair o queixo."
        },
        "express-2021/End of Course Project": {
          "student_overview": "Prepare essas mãos para muita codificação! É hora de começar a construir seu projeto."
        },
        "pre-express-2021/Learn to Drag and Drop": {
          "overview": "Esta lição dará aos alunos uma ideia sobre o que esperar quando eles vão para o laboratório de informática. A lição começa com uma breve discussão introduzindo à eles as condutas do laboratório de informática, então eles irão progredir usando um computador para completar quebra-cabeças online.",
          "student_overview": "Clique e arraste para finalizar os quebra-cabeças."
        },
        "pre-express-2021/Sequencing with Scrat": {
          "overview": "Esta lição dará aos alunos uma ideia sobre o que esperar quando eles vão para o laboratório de informática. A lição começa com uma breve discussão introduzindo à eles as condutas do laboratório de informática, então eles irão progredir usando um computador para completar quebra-cabeças online.",
          "student_overview": "Programe Scrat para alcançar a bolota."
        },
        "pre-express-2021/Programming in with Angry Birds": {
          "overview": "Usando personagens da Era do Gelo, os alunos desenvolverão algoritmos seqüenciais para mover o Scrat de um lado de um labirinto para a bolota do outro lado. Para fazer isso, eles empilharão os blocos de código em uma sequência linear, fazendo com que eles se movam reto, vire à esquerda ou vire à direita."
        },
        "pre-express-2021/Programming with Rey and BB-8": {
          "overview": "Nesta lição, os alunos usarão suas novas habilidades de programação de maneiras mais complicadas para navegar em um curso complicado com o BB-8."
        },
        "pre-express-2021/Programming in Harvester": {
          "overview": "Os alunos aplicarão os conceitos de programação que aprenderam no ambiente Colheita. Agora, em vez de apenas atingir o objetivo, os alunos precisam coletar milho usando um novo bloco. Os alunos continuarão a desenvolver habilidades de algoritmo seqüencial e começarão a usar o processo de depuração. ",
          "student_overview": "Ajude a colheitadeira a coletar vegetais ao longo de um caminho."
        },
        "pre-express-2021/Loops with Scrat": {
          "student_overview": "Ajude Scrat a cobrir mais terreno usando loops."
        },
        "pre-express-2021/Loops with Laurel": {
          "overview": "Nesta lição, os alunos continuam aprendendo o conceito de loops. Aqui, Laurel, o Aventureiro, usa loops para coletar tesouros em espaços abertos de cavernas. Um novo bloco de obtenção de tesouros é introduzido para ajudá-la em sua jornada."
        },
        "pre-express-2021/Ocean Scene with Loops": {
          "overview": "Retornando às repetições, os alunos aprendem a desenhar imagens repetindo sequências simples de instruções. Na última lição online, repetições foram utilizadas para atravessar um labirinto e coletar tesouro. Aqui, as repetições estão criando padrões. No fim deste nível, os alunos terão a oportunidade de criar as suas próprias imagens usando repetições.",
          "student_overview": "Use loops e padrões para finalizar as imagens."
        },
        "pre-express-2021/Drawing Gardens with Loops": {
          "overview": "Voltando aos loops, os alunos aprendem a desenhar imagens repetindo sequências simples de instruções. Na lição on-line anterior, loops foram usados ​​para atravessar um labirinto e coletar tesouros. Aqui, os alunos usam loops para criar padrões. No final desta etapa, os alunos terão a oportunidade de criar suas próprias imagens usando loops.",
          "student_overview": "Use padrões e loops para finalizar as imagens."
        },
        "pre-express-2021/On the Move with Events": {
          "overview": "Nesta atividade online, os alunos irão ter a oportunidade de aprender a como utilizar eventos no Laboratório de Jogos e aplicar todas as habilidades de programação que eles aprenderam para criar um jogo animado. É hora de ser criativo e criar uma história no Laboratório de Jogos!",
          "student_overview": "Crie seu próprio jogo ou história."
        },
        "pre-express-2021/A Royal Battle with Events": {
          "overview": "Nesta atividade online, os alunos terão a oportunidade de aprender a usar eventos no Play Lab e aplicar todas as habilidades de codificação que aprenderam para criar um jogo animado. É hora de ser criativo e criar um jogo no Play Lab!",
          "student_overview": "Use eventos para criar uma história ou criar um jogo interativo."
        },
        "coursee-2021/Simon Says": {
          "overview": "Nesta lição, os alunos jogarão um jogo destinado a fazê-los pensar sobre a maneira como os comandos devem ser dados para produzir o resultado certo. Isso os ajudará a transportar o Sprite Lab com mais facilidade nas próximas lições. ",
          "student_overview": "Jogue um jogo e pense em quais comandos são necessários para obter o resultado certo."
        },
        "coursee-2021/Learning Sprites with Sprite Lab": {
          "overview": "Nesta lição, os alunos aprenderão sobre os dois conceitos no coração do Sprite Lab: sprites e comportamentos. Sprites são personagens ou objetos na tela que os alunos podem mover, alterar e manipular. Comportamentos são ações que os sprites executarão continuamente até serem interrompidos.",
          "student_overview": "Aprenda a criar e editar sprites."
        },
        "coursee-2021/Alien Dance Party with Sprite Lab": {
          "overview": "Esta lição apresenta o Sprite Lab, uma plataforma na qual os alunos podem criar suas próprias animações e jogos interativos. Além dos comportamentos, hoje os alunos incorporam a entrada do usuário como eventos para criar uma \"festa de dança alienígena\".  ",
          "student_overview": "Crie um projeto interativo que possa ser compartilhado com os colegas de classe."
        },
        "coursee-2021/Private and Personal Information": {
          "student_overview": "A internet é divertida mas é importante estar seguro também. Esta lição ensina a diferença entre informações seguras para compartilhar e informações particulares."
        },
        "coursee-2021/About Me": {
          "student_overview": "Ao criar um pôster interativo com o SpriteLab, os alunos aplicarão seu entendimento sobre o compartilhamento de informações pessoais e privadas na web."
        },
        "coursee-2021/Digital Sharing": {
          "student_overview": "Nesta lição, você aprenderá sobre os desafios e benefícios da propriedade e dos direitos autorais. "
        },
        "coursee-2021/Programming and Loops with the Artist": {
          "overview": "Veja os rostos dos alunos se iluminarem enquanto criam seus próprios designs lindos usando um pequeno número de blocos e adesivos digitais! Esta lição baseia-se na compreensão dos loops das lições anteriores e oferece aos alunos a chance de serem verdadeiramente criativos. Essa atividade é fantástica para a produção de artefatos para portfólios ou conferências de pais/professores.",
          "student_overview": "Nesta lição, os loops facilitam a criação de imagens ainda mais legais com o Artist!"
        },
        "coursee-2021/Nested Loops in Artist": {
          "student_overview": "Mais laços aninhados! Desta vez, você pode fazer alguns desenhos INCRÍVEIS com laços aninhados."
        },
        "coursee-2021/Nested Loops in Frozen": {
          "overview": "Agora que os alunos sabem como estratificar seus loops, eles podem criar tantas coisas bonitas. Esta lição levará os alunos a uma série de exercícios para ajudá-los a criar suas próprias imagens prontas para o portfólio, usando as excelentes habilidades de patinação no gelo de Anna e Elsa!",
          "student_overview": "Anna e Elsa têm excelentes habilidades de patinação no gelo, mas precisam de sua ajuda para criar padrões no gelo. Use loops aninhados para criar algo super legal. "
        },
        "coursee-2021/Functions: Songwriting": {
          "overview": "Uma das estruturas mais incríveis no mundo da ciência da computação é a função. As funções (chamadas às vezes de procedimentos) são miniprogramas que podem ser usados repetidas vezes dentro do programa maior. Esta aula ajudará os alunos a entender, de maneira intuitiva, por que combinar blocos de códigos em funções pode ser uma prática útil.",
          "student_overview": "Até as estrelas do rock precisam de habilidades de programação. Esta lição ensinará sobre funções usando letras de músicas."
        },
        "coursee-2021/Functions in Minecraft": {
          "overview": "Os alunos começarão a entender como as funções podem ser úteis nesta divertida e interativa aventura de Minecraft!",
          "student_overview": "Você pode descobrir como usar funções para o código mais eficiente?"
        },
        "coursee-2021/Functions in Artist": {
          "overview": "Os alunos serão apresentados ao uso de funções no Code.org. Imagens magníficas serão criadas e modificadas com funções no Artista. Para padrões mais complicados, os alunos aprenderão sobre aninhamento de funções, chamando uma função dentro de outra.",
          "student_overview": "Faça desenhos complexos mais facilmente com funções!"
        },
        "coursee-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "Esta lição foi criada originalmente para a Hour of Code, juntamente com a equipe do Minecraft. Os alunos terão a chance de praticar as idéias que aprenderam até o momento, além de obter uma prévia dos condicionais!",
          "student_overview": "Aqui você aprenderá sobre condicionais no mundo do Minecraft."
        },
        "coursee-2021/Conditionals": {
          "overview": "Esta lição apresenta aos alunos loops `while` e declarações`if / else`. _Enquanto loops_ são loops que continuam repetindo comandos desde que uma condição seja verdadeira. Enquanto loops são usados ​​quando o programador não sabe o número exato de vezes que os comandos precisam ser repetidos, mas o programador sabe qual condição precisa ser verdadeira para que o loop continue em repetição. As instruções `If / Else` oferecem flexibilidade na programação executando seções inteiras de código apenas se algo for verdadeiro, caso contrário, ele executa outra coisa.",
          "student_overview": "Você vai conseguir dizer ao computador o que fazer sob certas condições nesta série divertida e desafiadora."
        },
        "coursee-2021/Functions in Harvester": {
          "overview": "Os alunos praticaram a criação de designs impressionantes no Artist e a navegar labirintos no Bee, mas hoje eles usarão funções para colher colheitas em Harvester. Esta lição levará os alunos a usar funções de novas maneiras, combinando-as com loops `while` e instruções`if/else`.",
          "student_overview": "As funções economizarão muito trabalho, pois você ajuda o fazendeiro com sua colheita!"
        },
        "coursee-2021/lesson-1": {
          "overview": "Nesta lição, os alunos aprenderão sobre acessibilidade e o valor da empatia por meio de brainstorming e design de soluções acessíveis para aplicativos hipotéticos. "
        },
        "coursee-2021/End of Course Project": {
          "overview": "As próximas quatro lições proporcionam aos alunos a oportunidade de usar suas habilidades de codificação em um projeto principal. Este projeto ajudará as pessoas a ganhar experiência com codificação e produzir um exemplo para compartilhar com colegas e entes queridos. Com a intenção de ser uma experiência de várias lições ou de várias semanas, os alunos passarão um tempo explorando o brainstorming, aprendendo sobre o processo de design, construindo e apresentando seu trabalho final. \\\\r\n\\\\r\nNa fase de exploração, os alunos brincam com exemplos pré-criados de projetos no Artist e no Sprite Lab para se inspirar. Em seguida, os alunos aprenderão sobre o processo de design e como implementá-lo em seus próprios projetos. Eles terão espaço para criar seu próprio projeto no Artist, no Sprite Lab ou em outra interface com a qual se familiarizarem (esse é provavelmente o estágio mais longo do projeto). Finalmente, os alunos poderão apresentar seus trabalhos concluídos aos colegas.",
          "student_overview": "Projetos desse tamanho levam tempo e muito planejamento. Encontre sua inspiração, desenvolva um plano e libere sua criatividade!"
        }
      }
    }
  }
}