{
  "ar-SA": {
    "data": {
      "lessons": {
        "coursef-2021/Virtual Pet": {
          "overview": "في هذا الدرس، سينشئ الطلاب حيوانًا افتراضيًا تفاعليًا يبدو ويتصرف بالطريقة التي يرغبون بها. سيستخدم الطلاب أداة \"ازياء\" مختبر النقوش المتحركة لتخصيص مظهر حيوانهم الأليف. سيستخدمون بعد ذلك الأحداث والسلوكيات والمفاهيم الأخرى التي تعلموها لإعطاء حيواناتهم الأليفة حياة خاصة بهم!",
          "student_overview": "في هذا الدرس، سينشئ الطلاب حيوانًا افتراضيًا تفاعليًا يبدو ويتصرف بالطريقة التي يرغبون بها. سيستخدم الطلاب أداة \"ازياء\" مختبر النقوش المتحركة لتخصيص مظهر حيوانهم الأليف. سيستخدمون بعد ذلك الأحداث والسلوكيات والمفاهيم الأخرى التي تعلموها لإعطاء حيواناتهم الأليفة حياة خاصة بهم!"
        },
        "coursef-2021/lesson-2": {
          "student_overview": "التنمر ليس جيدًا أبدًا. سيعلمك هذا الدرس الأمور التي من المقبول قولها على الإنترنت والأمور غير المقبولة."
        },
        "coursef-2021/Loops with the Artist": {
          "overview": "ينقل درس \\*\\* بناء المهارات \\*\\* هذا التركيز من مختبر الرسوم المتحركة إلى الفنان، وهي أداة جديدة سيستكشفها الطلاب خلال الفترة المتبقية من الدورة التدريبية.",
          "student_overview": "في هذا الدرس، تسهل الحلقات إنشاء أروع مع الفنان!"
        },
        "coursef-2021/Variables that Change in Artist": {
          "overview": "في هذا الدرس، سوف يستكشف الطلاب كيفية إنشاء تصميمات متكررة باستخدام المتغيرات في بيئة الفنان. سوف يتعلم الطلاب كيف يمكن استخدام المتغيرات لجعل التعليمات البرمجية أسهل في الكتابة وأسهل للقراءة. بعد الألغاز الموجهة، سينتهي الطلاب بالمستوى الحر لإظهار ما تعلموه وإنشاء تصميماتهم الخاصة.",
          "student_overview": "في هذا الدرس، ستقوم بعمل رسومات باستخدام متغيرات تتغير أثناء تشغيل البرنامج."
        },
        "coursef-2021/Nested Loops in the Maze": {
          "overview": "في هذا النشاط عبر الإنترنت، ستتاح للطلاب الفرصة لدفع فهمهم للحلقات إلى مستوى جديد تمامًا. من خلال اللعب مع النحلة ولعبة النباتات ضد الزومبي، سيتعلم الطلاب كيفية برمجة حلقة لتكون داخل حلقة أخرى. سيجري تشجيعهم أيضًا على معرفة مدى تأثير التغييرات الصغيرة في أي حلقة على برنامجهم عند النقر فوق \"تشغيل\".",
          "student_overview": "حلقات داخل حلقات داخل حلقات. ماذا يعني هذا؟ سيعلمك هذا الدرس ما يحدث عند وضع حلقة داخل حلقة أخرى."
        },
        "coursef-2021/Variables that Change in Bee": {
          "overview": "سيساعد هذا الدرس على توضيح قدرة المتغيرات على جعل البرامج أقوى من خلال السماح بتغيير القيم أثناء تشغيل التعليمات البرمجية.",
          "student_overview": "هذه النحلة تحب المتغيرات!"
        },
        "coursef-2021/For Loop Fun": {
          "overview": "نحن نعلم أن الحلقات تسمح لنا بفعل الأشياء مرارًا وتكرارًا، ولكننا الآن سنتعلم كيفية استخدام الحلقات التي تحتوي على هياكل إضافية مدمجة فيها. ستسمح هذه الهياكل الجديدة للطلاب بكتابة تعليمات برمجية أكثر قوة وديناميكية.",
          "student_overview": "ستحصل على الكثير من التعلم الممتع عن حلقات \"for\"!"
        },
        "coursef-2021/For Loops in Bee": {
          "overview": "يستعين هذا الدرس بنحلة ليركز على حلقات \"for\" واستخدام متغير متزايد لحل الألغاز الأكثر تعقيدًا. سيبدأ الطلاب بمراجعة الحلقات من الدروس السابقة، ثم يتابعون إلى مقدمة عن حلقات \"for\" لحل المشكلات المعقدة بشكل أكثر فعالية.",
          "student_overview": "وز وز. في هذه الألغاز، ستقوم بتوجيه نحلة باتجاه الرحيق والعسل باستخدام حلقات \"for\"!"
        },
        "coursef-2021/For Loops in Artist": {
          "overview": "في هذا الدرس، يستمر الطلاب في التدرب على حلقات \"for\"، هذه المرة باستخدام الفنان. سيكمل الطلاب الألغاز التي تجمع بين أفكار المتغيرات والحلقات وحلقات \"for\" لإنشاء تصميمات معقدة. في النهاية، سيكون لديهم فرصة لإنشاء تصاميمهم الخاصة على المستوى الحر.",
          "student_overview": "استعد لصنع تحفتك القادمة. هنا سوف تستخدم حلقات \"for\" لعمل بعض الصور المذهلة."
        },
        "coursef-2021/Simulating Experiments": {
          "overview": "من خلال تشغيل محاكاة بسيطة في مختبر النقوش المتحركة، سيختبر الطلاب كيف يمكن استخدام الحوسبة لجمع البيانات التي تحدد الاتجاهات أو الأنماط. بعد تشغيل المحاكاة عدة مرات، ستتاح للطلاب فرصة للتنبؤ بكيفية تأثير تغيير متغير في المحاكاة على النتيجة، ثم اختبار تلك الفرضية.",
          "student_overview": "قم بتشغيل المحاكاة على الحاسوب وجرب تغيير المتغيرات."
        },
        "coursef-2021/Internet": {
          "overview": "على الرغم من أن العديد من الأشخاص يستخدمون الإنترنت يوميًا، إلا أن الكثير منهم لا يعرفون كيف يعمل. في هذا الدرس، سيتظاهر الطلاب بالتحرك عبر الإنترنت، أثناء تعلمهم عن الاتصالات وعناوين URL وعناوين IP وDNS.",
          "student_overview": "هل تساءلت يومًا عن كيفية انتقال المعلومات عبر الإنترنت؟ إنه ليس سحرًا! سيعلمك هذا الدرس أساسيات عمل الإنترنت."
        },
        "coursef-2021/End of Course Project": {
          "student_overview": "تستغرق المشاريع الكبيرة وقتًا طويلاً والكثير من التخطيط. اعثر على إلهامك، ثم ضع خطة وأطلق العنان لإبداعك!"
        },
        "courseb-2021/Digital Trails": {
          "student_overview": "تعرف على بصمتك الرقمية وكيفية الحفاظ على سلامتك عند زيارة مواقع الويب."
        },
        "courseb-2021/Move It, Move It": {
          "overview": "سيقوم الطلاب ببرمجة زملائهم في الفصل للتحرك بعناية حول شبكة كبيرة على الأرض في هذا الدرس \\*\\* إعداد السياق \\*\\*.",
          "student_overview": "برمج زملائك في الصف للانتقال بعناية من مكان إلى آخر."
        },
        "courseb-2021/Sequencing in Maze": {
          "overview": "سيقدم هذا الدرس للطلاب فكرة عمّا يمكن توقعه عندما يتوجهون إلى مختبر الحاسوب. يبدأ الدرس بمناقشة موجزة لتعريفهم على آداب التعامل داخل مختبر الحاسوب، ثم يتقدمون في استخدام الحاسوب لإكمال الألغاز عبر الإنترنت.",
          "student_overview": "ساعد الطائر الغاضب الأحمر على اتباع الطريق إلى الخنزير المشاغب."
        },
        "courseb-2021/Programming in Maze": {
          "overview": "باستخدام شخصيات من فلم العصر الجليدي (Ice Age)، سيطور الطلاب خوارزميات متتابعة لإيصال سكرات من أحد جوانب المتاهة إلى البلوط في الجانب الآخر. للقيام بذلك، سيقومون بتجميع قوالب التعليمات البرمجية معًا في تسلسل خطي، ما يجعلهم يتحركون بشكل مستقيم، أو يستديرون لليسار، أو يستديرون لليمين.",
          "student_overview": "إنشاء برامج لمساعدة الطيور الغاضبة على التحرّك عبر المتاهة."
        },
        "courseb-2021/Programming in Harvester": {
          "overview": "سيطبق الطلاب مفاهيم البرمجة التي تعلموها على بيئة الحاصدة. الآن، بدلاً من مجرد إيصال الشخصية إلى الهدف، يجب على الطلاب جمع الذرة باستخدام قطعة برمجية جديد. سيستمر الطلاب في تطوير مهارات الخوارزمية التسلسلية والبدء في استخدام عملية تصحيح الأخطاء.",
          "student_overview": "ساعد الحصّادة على جمع الخضراوات على طول المسار."
        },
        "courseb-2021/Loops: Getting Loopy": {
          "overview": "عندما نبدأ في كتابة برامج أطول وأكثر إثارة للاهتمام، غالبًا ما تحتوي تعليماتنا البرمجية على الكثير من التكرار. في هذا الدرس، سيتعرف الطلاب على كيفية استخدام الحلقات لتوصيل التعليمات التي تحتوي على الكثير من التكرار بسهولة أكبر من خلال النظر إلى أنماط الحركة المتكررة في الرقص.",
          "student_overview": "في هذا الدرس، سيكون لدينا حفلة رقص تستخدم حلقات التكرار!"
        },
        "courseb-2021/Loops in Harvester": {
          "overview": "بناءً على مفهوم تكرار التعليمات من \"الدوران\"، ستجعل هذه المرحلة الطلاب يستخدمون الحلقات لجمع الذرة بكفاءة أكبر على Code.org.",
          "student_overview": "ساعد الحصّادة على جمع المزيد باستخدام الحلقات!"
        },
        "courseb-2021/Loops in Collector": {
          "overview": "في هذا الدرس، يواصل الطلاب تعلم مفهوم الحلقات. هنا، تستخدم لوريل المغامرة حلقات لجمع الكنز في مساحات الكهوف المفتوحة.",
          "student_overview": "برمج لوريل المغامرة لجمع الكنز في كهف مفتوح."
        },
        "courseb-2021/Loops in Artist": {
          "overview": "في درس \\*\\* بناء المهارات \\*\\* هذا ، يتعلم الطلاب رسم الصور من خلال تكرار سلاسل بسيطة من التعليمات. هنا، يستخدم الطلاب الحلقات لإنشاء أنماط.",
          "student_overview": "استخدم الأنماط والحلقات لإنهاء الصور."
        },
        "courseb-2021/The Right App": {
          "overview": "في هذا الدرس \\*\\* الاستكشافي \\*\\* ، يتعاطف الطلاب مع العديد من مستخدمي الهواتف الذكية الوهميين لمساعدتهم في العثور على \"التطبيق المناسب\" الذي يلبي احتياجاتهم.",
          "student_overview": "خطط تطبيق الهاتف الذكي الخاص بك."
        },
        "courseb-2021/Events: The Big Event": {
          "overview": "تعدّ الأحداث طريقة رائعة لإضافة مجموعة متنوعة إلى خوارزمية مكتوبة مسبقًا. في بعض الأحيان تريد أن يكون برنامجك قادرًا على الاستجابة للمستخدم بالضبط عندما يريد المستخدم ذلك. هذا هو الغرض من الأحداث.",
          "student_overview": "تحرك أو اصرخ عندما يضغط معلمك على الأزرار الموجودة على جهاز تحكم عملاق."
        },
        "courseb-2021/Events in Play Lab": {
          "overview": "في هذا النشاط عبر الإنترنت، ستتاح للطلاب الفرصة لتعلم كيفية استخدام الأحداث في مختبر الألعاب وكيفية تطبيق جميع مهارات البرمجة التي تعلموها لإنشاء لعبة رسوم متحركة. حان الوقت للإبداع وإنشاء لعبة في مختبر الألعاب!",
          "student_overview": "استخدم الأحداث لإنشاء قصة أو عمل لعبة تفاعلية."
        },
        "coursea-2021/Learn to Drag and Drop": {
          "overview": "سيقدم هذا الدرس للطلاب فكرة عمّا يمكن توقعه عندما يتوجهون إلى مختبر الحاسوب. يبدأ الدرس بمناقشة موجزة لتعريفهم على آداب التعامل داخل مختبر الحاسوب، ثم يتقدمون في استخدام الحاسوب لإكمال الألغاز عبر الإنترنت.",
          "student_overview": "انقر واسحب لإنهاء الألغاز."
        },
        "coursea-2021/Programming: Happy Maps": {
          "overview": "يجمع هذا الدرس غير المتصل الفرق معًا في مهمة بسيطة: إيصال الفليرب إلى الفاكهة. سيتدرب الطلاب على كتابة تعليمات دقيقة أثناء عملهم لترجمة التعليمات إلى الرموز المقدمة.",
          "purpose": "يمكن أن يكون الجسر من الخوارزميات إلى البرمجة قصيرًا إذا فهم الطلاب الفرق بين تخطيط القائم على التسلسل وترميز هذا التسلسل إلى اللغة المناسبة. سيساعد هذا النشاط الطلاب على اكتساب خبرة في القراءة والكتابة بأوامر برمجية مختصرة.",
          "student_overview": "اكتب تعليمات لإيصال الفليرب إلى الفاكهة."
        },
        "coursea-2021/Sequencing with Scrat": {
          "overview": "سيقدم هذا الدرس للطلاب فكرة عمّا يمكن توقعه عندما يتوجهون إلى مختبر الحاسوب. يبدأ الدرس بمناقشة موجزة لتعريفهم على آداب التعامل داخل مختبر الحاسوب، ثم يتقدمون في استخدام الحاسوب لإكمال الألغاز عبر الإنترنت.",
          "student_overview": "برمج سكرات للوصول إلى البلوط."
        },
        "coursea-2021/Programming in Ice Age": {
          "overview": "باستخدام شخصيات من فلم العصر الجليدي (Ice Age)، سيطور الطلاب خوارزميات متتابعة لإيصال سكرات من أحد جوانب المتاهة إلى البلوط في الجانب الآخر. للقيام بذلك، سيقومون بتجميع قوالب التعليمات البرمجية معًا في تسلسل خطي، ما يجعلهم يتحركون بشكل مستقيم، أو يستديرون لليسار، أو يستديرون لليمين.",
          "student_overview": "اكتب برامج لمساعدة سكرات على الوصول إلى البلوط."
        },
        "coursea-2021/Programming with Rey and BB-8": {
          "overview": "في هذا الدرس، سيستخدم الطلاب مهاراتهم البرمجية المكتشفة حديثًا بطرق أكثر تعقيدًا للتنقل في مسار صعب باستخدام BB-8.",
          "student_overview": "ساعد BB-8 جمع الخردة المعدنية."
        },
        "coursea-2021/Loops: Happy Loops": {
          "overview": "يرجع هذا النشاط إلى الخرائط السعيدة. هذه المرة، سيحل الطالب ألغازًا أكبر وأطول باستخدام تعليماتهم البرمجية، ما يدفعهم إلى رؤية الفائدة في الهياكل التي تتيح لهم كتابة تعليمات برمجية أطول بطريقة أسهل.",
          "student_overview": "ساعد الفليرب على حل المشكلات الأكبر باستخدام الحلقات."
        },
        "coursea-2021/Loops in Ice Age": {
          "overview": "بناءً على مفهوم تكرار التعليمات من \"الحلقات السعيدة\"، ستجعل هذه المرحلة الطلاب يستخدمون الحلقات للوصول إلى البلوط بكفاءة أكبر على Code.org.",
          "student_overview": "ساعد سكرات على تغطية مساحة أكبر من الأرض باستخدام الحلقات."
        },
        "coursea-2021/Loops in Collector": {
          "overview": "في هذا الدرس، يواصل الطلاب تعلم مفهوم الحلقات. في الدرس السابق، تم تعريف الطلاب على الحلقات من خلال التحرك عبر متاهة وقطف الذرة. هنا، يجري استخدام الحلقات لجمع الكنز في الكهوف المفتوحة.",
          "student_overview": "ساعد لوريل المغامرة في جمع الكنوز تحت الأرض."
        },
        "coursea-2021/Ocean Scene with Loops": {
          "overview": "في درس \\*\\* بناء المهارات \\*\\* هذا، يتعلم الطلاب رسم الصور من خلال تكرار سلاسل بسيطة من التعليمات. هنا، الحلقات تخلق أنماطًا. في نهاية هذا الدرس، سيقوم الطلاب بإنشاء صورهم الخاصة.",
          "student_overview": "استخدم الحلقات والأنماط لإنهاء الصور."
        },
        "coursea-2021/Events: The Big Event": {
          "overview": "تعدّ الأحداث طريقة رائعة لإضافة مجموعة متنوعة إلى خوارزمية مكتوبة مسبقًا. في بعض الأحيان تريد أن يكون برنامجك قادرًا على الاستجابة للمستخدم بالضبط عندما يريد المستخدم ذلك. هذا هو الغرض من الأحداث.",
          "student_overview": "تحرك واصرخ عندما يضغط معلمك على الأزرار الموجودة على جهاز تحكم عملاق."
        },
        "coursea-2021/Events in Play Lab": {
          "overview": "في هذا النشاط عبر الإنترنت، ستتاح للطلاب الفرصة لتعلم كيفية استخدام الأحداث في مختبر الألعاب وكيفية تطبيق جميع مهارات البرمجة التي تعلموها لإنشاء لعبة رسوم متحركة. حان الوقت للإبداع وإنشاء قصة في مختبر الألعاب!",
          "student_overview": "صمم لعبتك أو قصتك."
        },
        "coursec-2021/Programming: My Robotic Friends": {
          "overview": "في دروس \\*\\* إعداد السياق \\*\\*، سيستخدم الطلاب مجموعة من الرموز لتوجيه \"الروبوت\" لتكديس الأكواب بأنماط مختلفة. يتناوب الطلاب على المشاركة كإنسان آلي، ويستجيبون فقط للخوارزمية التي حددها أقرانهم.",
          "student_overview": "في هذا الدرس، سوف تتظاهر بأن زملائك في المدرسة هم من الروبوتات وتبرمجهم لبناء أنماط أكواب مكدسة."
        },
        "coursec-2021/Programming in Maze": {
          "overview": "في درس \\*\\* بناء المهارات \\*\\* هذا، سيطوّر الطلاب خوارزميات متسلسلة لنقل الطائر من جانب واحد من المتاهة إلى الخنزير في الجانب الآخر. للقيام بذلك، سيقومون بوضع قطع التعليمات البرمجية معًا في تسلسل خطي، مما يجعلها تتحرك بشكل مستقيم، أو تستدير لليسار، أو تنعطف إلى اليمين.",
          "student_overview": "تعرف على التسلسلات والخوارزميات مع الطيور الغاضبة."
        },
        "coursec-2021/Debugging in Maze": {
          "overview": "تصحيح الأخطاء عنصر أساسي في تعلم البرمجة. في هذا الدرس، سيواجه الطلاب ألغازًا تم حلها بشكل غير صحيح. سيحتاجون إلى مراجعة التعليمات البرمجية الموجودة لتحديد الأخطاء، بما في ذلك الحلقات غير الصحيحة والقطع الناقصة والزائدة والقطع الخارجة عن الترتيب الصحيح.",
          "student_overview": "اعثر على المشاكل في الألغاز وطبق عمليًا مهارات تصحيح الأخطاء لديك."
        },
        "coursec-2021/Programming in Collector": {
          "overview": "في هذه السلسلة من الألغاز، سيواصل الطلاب تطوير فهمهم للخوارزميات وتصحيح الأخطاء. مع شخصية جديدة، وهي لوريل المغامِرة، سيقوم الطلاب بإنشاء خوارزميات متسلسلة لجعل لوريل تلتقط الكنز أثناء سيرها على المسار.",
          "student_overview": "اكتب خوارزميات لمساعدة لوريل المغامِرة على جمع الكثير من الأحجار الكريمة!"
        },
        "coursec-2021/Programming in Artist": {
          "overview": "في هذا الدرس، سيتحكم الطلاب بالفنان لإكمال الرسومات على الشاشة. ستسمح مرحلة الفنان هذه للطلاب بإنشاء صور ذات تعقيد متزايد باستخدام قطع جديدة مثل \"تحرك إلى الأمام بمقدار 100 بكسل\" و \"انعطف يمينًا بمقدار 90 درجة\".",
          "student_overview": "صمم صورًا جميلة من خلال برمجة الفنان."
        },
        "coursec-2021/Loops: My Loopy Robotic Friends": {
          "overview": "بناءً على نشاط \"أصدقائي الآليون\" الأولي، يعالج الطلاب تصميمات أكبر وأكثر تعقيدًا. من أجل برمجة \"رجالهم الآليين\" لإكمال هذه التصميمات الأكبر، سيحتاج الطلاب إلى تحديد الأنماط المتكررة في تعليماتهم والتي يمكن استبدالها بحلقة.",
          "student_overview": "في هذا الدرس، ستبرمج زملائك في الصف مرة أخرى، ولكن باستخدام الحلقات ستتمكن من حل المشكلات الأكبر والأكثر تعقيدًا."
        },
        "coursec-2021/Loops with Rey and BB-8": {
          "overview": "بناءً على مفهوم تكرار التعليمات من \"الدوران\"، ستجعل هذه المرحلة الطلاب يستخدمون الحلقات لمساعدة BB-8 في اجتياز المتاهة بكفاءة أكبر من ذي قبل.",
          "student_overview": "ساعد BB-8 ليعبر المتاهات باستخدام الحلقات!"
        },
        "coursec-2021/Loops in Harvester": {
          "student_overview": "دعونا نستخدم الحلقات لمساعدة الحصّادة على جمع بعض خضراوات!"
        },
        "coursec-2021/Sticker Art with Loops": {
          "student_overview": "في هذا الدرس، تسهل الحلقات إنشاء أروع مع الرسام!"
        },
        "coursec-2021/Events: The Big Event": {
          "overview": "سيتعلم الطلاب أن الأحداث طريقة رائعة لإضافة المرونة إلى خوارزمية مكتوبة مسبقًا. في بعض الأحيان تريد أن يكون برنامجك قادرًا على الاستجابة للمستخدم بالضبط عندما يريد المستخدم ذلك. يمكن للأحداث أن تجعل برنامجك أكثر إثارة للاهتمام وتفاعلًا.",
          "student_overview": "العب لعبة ممتعة للتعرف على الأحداث."
        },
        "coursec-2021/Build a Flappy Game": {
          "overview": "في هذه المرحلة الخاصة، سيتمكن الطلاب من بناء نسختهم من لعبة فلابي الطائر باستخدام معالجات الأحداث للكشف عن نقرات الماوس وتصادم الأشياء. في نهاية المستوى، سيتمكن الطلاب من تخصيص لعبتهم عن طريق تغيير العناصر المرئية أو القواعد.",
          "student_overview": "صمم لعبة نسختك من لعبة فلابي الطائر كيفما تشاء، ثم شاركها مع أصدقائك!"
        },
        "coursec-2021/Events in Play Lab": {
          "overview": "في هذا النشاط عبر الإنترنت، ستتاح للطلاب الفرصة لتعلم كيفية استخدام الأحداث في مختبر الألعاب وكيفية تطبيق جميع مهارات البرمجة التي تعلموها لإنشاء لعبة رسوم متحركة. حان الوقت للإبداع وإنشاء لعبة في مختبر الألعاب!",
          "student_overview": "حان الوقت للإبداع وإنشاء لعبة في مختبر الألعاب!"
        },
        "coursec-2021/Picturing Data": {
          "overview": "يمكن استخدام البيانات لمساعدة الطلاب على فهم عالمهم والإجابة عن الأسئلة المثيرة للاهتمام. في هذا الدرس، سيقوم الطلاب بجمع البيانات من مشروع مختبر اللعب وتصورها باستخدام أنواع مختلفة من الرسوم البيانية.",
          "student_overview": "يمكن استخدام البيانات لمساعدة الطلاب على فهم عالمهم والإجابة عن الأسئلة المثيرة للاهتمام. في هذا الدرس، سيقوم الطلاب بجمع البيانات من مشروع مختبر اللعب وتصورها باستخدام أنواع مختلفة من الرسوم البيانية."
        },
        "coursec-2021/Binary Bracelets": {
          "overview": "النظام الثنائي مهم للغاية في عالم الحاسوب. تخزن غالبية أجهزة الحاسوب اليوم جميع أنواع المعلومات بالنظام الثنائي. يساعد هذا الدرس على توضيح كيف يمكن أخذ شيء ما من حياتنا اليومية وترجمته إلى سلسلة من عمليات التشغيل وإيقاف التشغيل.",
          "student_overview": "صمم سوارك الثنائي وتعلم كيف تتذكر أجهزة الحاسوب المعلومات!"
        },
        "coursec-2021/End of Course Project: Create a Play Lab Game": {
          "overview": "يأخذ هذا الدرس الرئيسي الطلاب في عملية تصميم وتطوير وعرض مشاريع مختبر اللعب الخاصة بهم! لضمان سير هذه العملية بسلاسة، قدمنا هيكلاً يتبعه الطلاب خطوة بخطوة، من التخطيط على الورق إلى البرمجة على موقعنا. بالإضافة إلى ذلك، نقدم أفكارًا لمساعدة المعلمين في تسهيل العرض الختامي!",
          "student_overview": "جهز تلك الأيدي لكثير من كتابة الأوامر البرمجية! حان الوقت لبدء تصميم مشروعك."
        },
        "coursed-2021/lesson-5": {
          "student_overview": "ستتعلم في هذا الدرس كيف تحمي كلمات المرور معلوماتك وكيفية إنشاء كلمة مرور جيدة."
        },
        "coursed-2021/Algorithms: Graph Paper Programming": {
          "overview": "من خلال \"البرمجة\" الطلاب بعضهم لبعض من أجل رسم الصور، سيحصل الطلاب على فرصة لتجربة بعض المفاهيم الأساسية في البرمجة بطريقة ممتعة وسهلة المنال. سيبدأ الدرس باستخدام الطلاب الرموز لتوجيه زملائهم لتلوين مربعات على ورق الرسم البياني في محاولة لإعادة إنتاج صورة موجودة. إذا كان هناك وقت، يمكن اختتام الدرس بصورٍ صممها الطلاب بأنفسهم.",
          "student_overview": "في هذا الدرس، ستبرمج زميلك في الفصل الدراسي لرسم الصور!"
        },
        "coursed-2021/Introduction to Online Puzzles": {
          "overview": "في هذه المجموعة من الألغاز، سيبدأ الطلاب بمقدمة (أو مراجعة حسب خبرة فصلك الدراسي) عن مساحة عمل Code.org على الإنترنت. ستكون هناك مقاطع فيديو تشير إلى الوظائف الأساسية لمساحة العمل بما في ذلك أزرار \"تشغيل\" و\"إعادة تعيين\" و\"خطوة\". كما تناقش مقاطع الفيديو الأمور التالية: سحب قطع بلوكلي، وحذف قطع بلوكلي، وربط قطع بلوكلي. بعد ذلك، سوف يمارس الطلاب مهارات _التسلسل_ و_تصحيح الأخطاء_ في المتاهة. من هناك، سيشاهد الطلاب أنواعًا جديدة من الألغاز مثل التجميع والفنان والحصّادة عندما يتعلمون أساسيات _الحلقات_.",
          "student_overview": "سيمنحك هذا الدرس التدريب على المهارات التي ستحتاجها لهذه الدورة."
        },
        "coursed-2021/Relay Programming": {
          "student_overview": "هل تتذكر في بداية الدورة عندما قمت صممت رسومات مستخدمًا أوامر برمجية؟ في هذا الدرس، ستعمل مع فريق للقيام بشيء مشابه جدًا!"
        },
        "coursed-2021/Debugging in Collector": {
          "overview": "في هذا النشاط عبر الإنترنت، سيمارس الطلاب تصحيح الأخطاء في بيئة \"لعبة التجميع\". سوف يتدرب الطلاب على قراءة التعليمات البرمجية وتعديلها لإصلاح الألغاز باستخدام خوارزميات بسيطة وحلقات وحلقات متداخلة.",
          "student_overview": "هل سبق أن واجهت مشاكل أثناء البرمجة؟ في هذا الدرس، ستتعرف على أسرار تصحيح الأخطاء. يمثل تصحيح الأخطاء عملية البحث عن المشاكل في الأوامر البرمجية وإصلاحها."
        },
        "coursed-2021/Events in Bounce": {
          "overview": "في هذا النشاط عبر الإنترنت، سيتعلم الطلاب ماهية الأحداث وكيف تستخدمها أجهزة الحاسوب في برامج مثل ألعاب الفيديو. سيعمل الطلاب على ألغاز تجعل البرنامج يتفاعل مع الأحداث (مثل الضغط على أزرار الأسهم). في نهاية اللغز، ستتاح للطلاب الفرصة لتخصيص لعبتهم بسرعات وأصوات مختلفة.",
          "student_overview": "هل تمنيت من قبل أن تلعب ألعاب الفيديو في المدرسة؟ في هذا الدرس، ستحصل على أمنيتك!"
        },
        "coursed-2021/Build a Star Wars Game": {
          "overview": "في هذا الدرس، سيتدرب الطلاب على استخدام الأحداث لتصميم لعبة يمكنهم مشاركتها عبر الإنترنت. من خلال استخدام شخصية R2D2 وشخصيات حرب النجوم الأخرى، سيتم توجيه الطلاب خلال الأحداث، ثم يتم منحهم مساحة لإنشاء لعبتهم الخاصة.",
          "student_overview": "اشعر بالقوة بينما تصمم لعبة حرب النجوم الخاصة بك في هذا الدرس."
        },
        "coursed-2021/Dance Party": {
          "overview": "في هذا الدرس، سيقوم الطلاب ببرمجة حفلة الرقص التفاعلية الخاصة بهم. يتطلب هذا النشاط صوتًا حيث تم تصميم الأداة للاستجابة للموسيقى.",
          "student_overview": "وقت الاحتفال! في هذا الدرس، ستبرمج نسختك الخاصة من حفلة الرقص التفاعلية."
        },
        "coursed-2021/Loops in Ice Age": {
          "overview": "كتحديث سريع (أو مقدمة) لاستخدام الحلقات، ستجعل هذه المرحلة الطلاب يستخدمون حلقة \"التكرار'' لإيصال سكرات إلى البلوط بشكل أكثر كفاءة.",
          "student_overview": "في هذا الدرس، ستستخدم حلقة التكرار لمساعدة سكرات في الوصول إلى البلوط بأكبر قدر ممكن من الكفاءة."
        },
        "coursed-2021/Loops in Artist": {
          "overview": "يعتمد هذا الدرس على فهم الحلقات من الدروس السابقة ويعطي الطلاب فرصة ليكونوا مبدعين حقًا. كما يؤدي هذا النشاط دورًا إضافيًا كتمرين على تصحيح الأخطاء لمزيدِ من التدرّب على حل المشكلات.",
          "student_overview": "في هذا الدرس، تسهل الحلقات إنشاء صور رائعة مع الفنان!"
        },
        "coursed-2021/Nested Loops in Bee": {
          "overview": "في هذا النشاط عبر الإنترنت، ستتاح للطلاب الفرصة لدفع فهمهم للحلقات إلى مستوى جديد تمامًا. من خلال اللعب مع النحلة ولعبة النباتات ضد الزومبي، سيتعلم الطلاب كيفية برمجة حلقة لتكون داخل حلقة أخرى. سيجري تشجيعهم أيضًا على معرفة مدى تأثير التغييرات الصغيرة في أي حلقة على برنامجهم عند النقر فوق \"تشغيل\".",
          "student_overview": "حلقات داخل حلقات داخل حلقات. ماذا يعني هذا؟ سيعلمك هذا الدرس ما يحدث عندما تصنع حلقة متداخلة."
        },
        "coursed-2021/Conditionals with Cards": {
          "student_overview": "حان الوقت للعب لعبة تكسب فيها النقاط فقط في ظل شروط معينة!"
        },
        "coursed-2021/lesson-6": {
          "overview": "تم إنشاء هذا الدرس في الأصل لساعة من البرمجة، إلى جانب فريق ماينكرافت. سيحصل الطلاب على فرصة لممارسة الأفكار التي تعلموها حتى هذه اللحظة، بالإضافة إلى إلقاء نظرة خاطفة على العبارات الشرطية!",
          "student_overview": "تجنب الحمم البركانية! هنا ستبدأ التعرف على العبارات الشرطية في عالم ماينكرافت."
        },
        "coursed-2021/Conditionals in Bee": {
          "overview": "حتى هذه اللحظة، كان الطلاب يكتبون تعليمات برمجية يجري تنفيذها بنفس الطريقة تمامًا كلما جرى تشغيلها، لذلك فهي موثوقة، ولكنها ليست مرنة جدًا. في هذا الدرس، سيبدأ فصلك في البرمجة باستخدام العبارات الشرطية، ما يسمح لهم بكتابة تعليمات برمجية تعمل بشكل مختلف اعتمادًا على الشروط المحددة التي يواجهها البرنامج.",
          "student_overview": "الآن بعد أن فهمت التعبيرات الشرطية، حان الوقت لبرمجة النحل لاستخدامها عند جمع العسل والرحيق."
        },
        "coursed-2021/While Loops in Farmer": {
          "student_overview": "الحلقات مفيدة جدًا في البرمجة. سيعلمك هذا الدرس نوعًا جديدًا من الحلقات: حلقات while!"
        },
        "coursed-2021/Until Loops in Maze": {
          "overview": "في هذا الدرس، سيتعرف الطلاب على حلقات \"until\". سيقوم الطلاب بتصميم برامج تكرر فيها الشخصية الرئيسية أفعالاً معينة \"حتى\" تصل إلى نقطة التوقف المطلوبة.",
          "student_overview": "يمكنك القيام ببعض الأشياء المذهلة عند استخدام حلقات \"until\"!"
        },
        "coursed-2021/End of Course Project": {
          "student_overview": "جهز تلك الأيدي لكثير من كتابة الأوامر البرمجية! حان الوقت لبدء تصميم مشروعك."
        },
        "express-2021/Programming with Angry Birds": {
          "overview": "باستخدام شخصيات من لعبة الطيور الغاضبة (Angry Birds)، سيطور الطلاب خوارزميات متتابعة لإيصال طائر من أحد جوانب المتاهة إلى الخنزير في الجانب الآخر. للقيام بذلك، سيقومون بتجميع قوالب التعليمات البرمجية معًا في تسلسل خطي، ما يجعلهم يتحركون بشكل مستقيم، أو يستديرون لليسار، أو يستديرون لليمين.",
          "student_overview": "تعرف على التسلسلات والخوارزميات مع الطيور الغاضبة."
        },
        "express-2021/Debugging with Scrat": {
          "overview": "تصحيح الأخطاء عنصر أساسي في تعلم البرمجة. في هذا الدرس، سيواجه الطلاب ألغازًا تم حلها بشكل غير صحيح. سيحتاجون إلى مراجعة التعليمات البرمجية الموجودة لتحديد الأخطاء، بما في ذلك الحلقات غير الصحيحة والقطع الناقصة والزائدة والقطع الخارجة عن الترتيب الصحيح.",
          "student_overview": "اعثر على المشاكل في الألغاز وطبق عمليًا مهارات تصحيح الأخطاء لديك."
        },
        "express-2021/Collecting Treasure with Laurel": {
          "overview": "في هذه السلسلة من الألغاز، سيواصل الطلاب تطوير فهمهم للخوارزميات وتصحيح الأخطاء. مع شخصية جديدة، وهي لوريل المغامِرة، سيقوم الطلاب بإنشاء خوارزميات متسلسلة لجعل لوريل تلتقط الكنز أثناء سيرها على المسار."
        },
        "express-2021/Creating Art with Code": {
          "overview": "في هذا الدرس، سيتحكم الطلاب بالفنان لإكمال الرسومات على الشاشة. ستسمح مرحلة الفنان هذه للطلاب بإنشاء صور ذات تعقيد متزايد باستخدام قطع جديدة مثل \"تحرك إلى الأمام بمقدار 100 بكسل\" و \"انعطف يمينًا بمقدار 90 درجة\".",
          "student_overview": "صمم صورًا جميلة من خلال برمجة الفنان."
        },
        "express-2021/Swimming Fish in Sprite Lab": {
          "overview": "في هذا الدرس، سيتعرف الطلاب على المفهومين الذين يمثلان صميم مختبر النقوش المتحركة: النقوش المتحركة والسلوكيات. النقوش المتحركة شخصيات أو أشياء على الشاشة يمكن للطلاب تحريكها وتغييرها والتلاعب بها. أما السلوكيات فهي الأفعال التي ستنفذها النقوش المتحركة بشكل مستمر حتى إيقافها.",
          "student_overview": "تعلم كيفية إنشاء النقوش المتحركة وتعديلها."
        },
        "express-2021/Virtual Pet with Sprite Lab": {
          "overview": "في هذا الدرس، سينشئ الطلاب حيوانًا افتراضيًا تفاعليًا يبدو ويتصرف بالطريقة التي يرغبون بها. سيستخدم الطلاب أداة \"ازياء\" مختبر النقوش المتحركة لتخصيص مظهر حيوانهم الأليف. سيستخدمون بعد ذلك الأحداث والسلوكيات والمفاهيم الأخرى التي تعلموها لإعطاء حيواناتهم الأليفة حياة خاصة بهم!",
          "student_overview": "في هذا الدرس، سينشئ الطلاب حيوانًا افتراضيًا تفاعليًا يبدو ويتصرف بالطريقة التي يرغبون بها. سيستخدم الطلاب أداة \"ازياء\" مختبر النقوش المتحركة لتخصيص مظهر حيوانهم الأليف. سيستخدمون بعد ذلك الأحداث والسلوكيات والمفاهيم الأخرى التي تعلموها لإعطاء حيواناتهم الأليفة حياة خاصة بهم!"
        },
        "express-2021/lesson-1": {
          "overview": "في هذا الدرس، سيقوم الطلاب ببرمجة حفلة الرقص التفاعلية الخاصة بهم. يتطلب هذا النشاط صوتًا حيث تم تصميم الأداة للاستجابة للموسيقى.",
          "student_overview": "وقت الاحتفال! في هذا الدرس، ستبرمج نسختك الخاصة من حفلة الرقص التفاعلية."
        },
        "express-2021/Loops with Rey and BB-8": {
          "student_overview": "ساعد BB-8 ليعبر المتاهات باستخدام الحلقات!"
        },
        "express-2021/Sticker Art with Loops": {
          "overview": "شاهد وجوه الطلاب تشع سعادة وهم يصنعون تصميماتهم الرائعة باستخدام عدد صغير من القطع والملصقات الرقمية! يعتمد هذا الدرس على فهم الحلقات من الدروس السابقة ويعطي الطلاب فرصة ليكونوا مبدعين حقًا. هذا النشاط رائع لإنتاج إبداعات لقوائم المشاريع أو مؤتمرات الآباء/ المعلمين.",
          "student_overview": "في هذا الدرس، تسهل الحلقات إنشاء أروع مع الرسام!"
        },
        "express-2021/Nested Loops in Maze": {
          "overview": "في هذا النشاط عبر الإنترنت، ستتاح للطلاب الفرصة لدفع فهمهم للحلقات إلى مستوى جديد تمامًا. من خلال اللعب مع النحلة ولعبة النباتات ضد الزومبي، سيتعلم الطلاب كيفية برمجة حلقة لتكون داخل حلقة أخرى. سيجري تشجيعهم أيضًا على معرفة مدى تأثير التغييرات الصغيرة في أي حلقة على برنامجهم عند النقر فوق \"تشغيل\".",
          "student_overview": "حلقات داخل حلقات داخل حلقات. ماذا يعني هذا؟ سيعلمك هذا الدرس ما يحدث عندما تصنع حلقة متداخلة."
        },
        "express-2021/Snowflakes with Anna and Elsa": {
          "overview": "الآن بعد أن عرف الطلاب كيفية ترتيب حلقاتهم، يمكنهم إبداع العديد من الأشياء الجميلة. سيأخذ هذا الدرس الطلاب في سلسلة من التمارين لمساعدتهم على إنشاء صور خاصة بهم جاهزة للمشاريع باستخدام مهارات آنا وإلسا الممتازة في التزلج على الجليد!",
          "student_overview": "تتمتع آنا وإلسا بمهارات ممتازة في التزلج على الجليد، لكنهما بحاجة إلى مساعدتك في إنشاء أنماط في الجليد. استخدم حلقات متداخلة لإنشاء شيء رائع."
        },
        "express-2021/Looking Ahead with Minecraft ": {
          "overview": "تم إنشاء هذا الدرس في الأصل لساعة من البرمجة، إلى جانب فريق ماينكرافت. سيحصل الطلاب على فرصة لممارسة الأفكار التي تعلموها حتى هذه اللحظة، بالإضافة إلى إلقاء نظرة خاطفة على العبارات الشرطية!",
          "student_overview": "تجنب الحمم البركانية! هنا ستبدأ التعرف على العبارات الشرطية في عالم ماينكرافت."
        },
        "express-2021/If/Else with Bee": {
          "overview": "حتى هذه اللحظة، كان الطلاب يكتبون تعليمات برمجية يجري تنفيذها بنفس الطريقة تمامًا كلما جرى تشغيلها، لذلك فهي موثوقة، ولكنها ليست مرنة جدًا. في هذا الدرس، سيبدأ فصلك في البرمجة باستخدام العبارات الشرطية، ما يسمح لهم بكتابة تعليمات برمجية تعمل بشكل مختلف اعتمادًا على الشروط المحددة التي يواجهها البرنامج.",
          "student_overview": "الآن بعد أن فهمت التعبيرات الشرطية، حان الوقت لبرمجة النحل لاستخدامها عند جمع العسل والرحيق."
        },
        "express-2021/While Loops with the Farmer": {
          "student_overview": "الحلقات مفيدة جدًا في البرمجة. سيعلمك هذا الدرس نوعًا جديدًا من الحلقات: حلقات while!"
        },
        "express-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "تم إنشاء هذا الدرس في الأصل لساعة من البرمجة، إلى جانب فريق ماينكرافت. سيحصل الطلاب على فرصة لممارسة الأفكار التي تعلموها حتى هذه اللحظة، بالإضافة إلى إلقاء نظرة خاطفة على العبارات الشرطية!",
          "student_overview": "هنا ستتعرف على العبارات الشرطية في عالم ماينكرافت."
        },
        "express-2021/Until Loops in Maze": {
          "overview": "في هذا الدرس، سيتعرف الطلاب على حلقات \"until\". سيقوم الطلاب بتصميم برامج تكرر فيها الشخصية الرئيسية أفعالاً معينة \"حتى\" تصل إلى نقطة التوقف المطلوبة.",
          "student_overview": "يمكنك القيام ببعض الأشياء المذهلة عند استخدام حلقات \"until\"!"
        },
        "express-2021/Harvesting with Conditionals": {
          "overview": "سوف يتدرب الطلاب على حلقات \"while\" وحلقات \"until\" وتعبيرات \"if/else\". كل هذه القطع البرمجية تستخدم عبارات شرطية. من خلال التدرب على ما سبق ذكره، سيتعلم الطلاب كيفية كتابة تعليمات برمجية معقدة ومرنة.",
          "student_overview": "لا يكون من الواضح دائمًا ما التعبير الشرطي الذي ينبغي استخدامه. سيساعدك هذا الدرس في التمرين على تحديد ما يجب فعله."
        },
        "express-2021/Functions in Minecraft": {
          "overview": "سيبدأ الطلاب في فهم كيف يمكن أن تكون الوظائف مفيدة في هذه المغامرة الممتعة والتفاعلية من ماينكرافت!",
          "student_overview": "هل يمكنك معرفة كيفية استخدام الدوال للوصول إلى التعليمات البرمجية الأكثر فعالية؟"
        },
        "express-2021/Functions with Artist": {
          "overview": "سيتم تعريف الطلاب على استخدام الوظائف في لعبة الفنان. وسيتم إنشاء الصور الرائعة وتعديلها. وبالنسبة للأنماط الأكثر تعقيدًا، سيتعلم الطلاب المزيد من المعلومات حول الوظائف المتداخلة عن طريق استدعاء وظيفة واحدة من داخل أخرى.",
          "student_overview": "أصبحت الرسومات المعقدة أسهل باستخدام الوظائف!"
        },
        "express-2021/Functions with Harvester": {
          "overview": "لقد تدرّب الطلاب على إنشاء تصميمات رائعة في لعبة الرسام وعلى التنقل في متاهات لعبة النحل، ولكنهم سيستخدمون اليوم الوظائف لحصاد المحاصيل في لعبة الحصّادة. سيدفع هذا الدرس الطلاب إلى استخدام الوظائف بالطرق الجديدة من خلال دمجها مع حلقات \"while\" وتعبيرات \"if / else\".",
          "student_overview": "ستوفر لك الوظائف الكثير من العمل والوقت وأنت تساعد المزارعة في حصادها!"
        },
        "express-2021/Variables with Artist": {
          "overview": "في هذا الدرس، سوف يستكشف الطلاب كيفية إنشاء تصميمات متكررة باستخدام المتغيرات في بيئة الفنان. سوف يتعلم الطلاب كيف يمكن استخدام المتغيرات لجعل التعليمات البرمجية أسهل في الكتابة وأسهل للقراءة. بعد الألغاز الموجهة، سينتهي الطلاب بالمستوى الحر لإظهار ما تعلموه وإنشاء تصميماتهم الخاصة.",
          "student_overview": "في هذا الدرس، ستقوم بعمل رسومات باستخدام متغيرات تتغير أثناء تشغيل البرنامج."
        },
        "express-2021/Changing Variables with Bee": {
          "overview": "سيساعد هذا الدرس على توضيح قدرة المتغيرات على جعل البرامج أقوى من خلال السماح بتغيير القيم أثناء تشغيل التعليمات البرمجية.",
          "student_overview": "هذه النحلة تحب المتغيرات!"
        },
        "express-2021/For Loops with Bee": {
          "overview": "يستعين هذا الدرس بنحلة ليركز على حلقات \"for\" واستخدام متغير متزايد لحل الألغاز الأكثر تعقيدًا. سيبدأ الطلاب بمراجعة الحلقات من الدروس السابقة، ثم يتابعون إلى مقدمة عن حلقات \"for\" لحل المشكلات المعقدة بشكل أكثر فعالية.",
          "student_overview": "وز وز. في هذه الألغاز، ستقوم بتوجيه نحلة باتجاه الرحيق والعسل باستخدام حلقات \"for\"!"
        },
        "express-2021/For Loops with Artist": {
          "overview": "في هذا الدرس، يستمر الطلاب في التدرب على حلقات \"for\"، هذه المرة باستخدام الفنان. سيكمل الطلاب الألغاز التي تجمع بين أفكار المتغيرات والحلقات وحلقات \"for\" لإنشاء تصميمات معقدة. في النهاية، سيكون لديهم فرصة لإنشاء تصاميمهم الخاصة على المستوى الحر.",
          "student_overview": "استعد لصنع تحفتك القادمة. هنا سوف تستخدم حلقات \"for\" لعمل بعض الصور المذهلة."
        },
        "express-2021/End of Course Project": {
          "student_overview": "جهز تلك الأيدي لكثير من كتابة الأوامر البرمجية! حان الوقت لبدء تصميم مشروعك."
        },
        "pre-express-2021/Learn to Drag and Drop": {
          "overview": "سيقدم هذا الدرس للطلاب فكرة عمّا يمكن توقعه عندما يتوجهون إلى مختبر الحاسوب. يبدأ الدرس بمناقشة موجزة لتعريفهم على آداب التعامل داخل مختبر الحاسوب، ثم يتقدمون في استخدام الحاسوب لإكمال الألغاز عبر الإنترنت.",
          "student_overview": "انقر واسحب لإنهاء الألغاز."
        },
        "pre-express-2021/Sequencing with Scrat": {
          "overview": "سيقدم هذا الدرس للطلاب فكرة عمّا يمكن توقعه عندما يتوجهون إلى مختبر الحاسوب. يبدأ الدرس بمناقشة موجزة لتعريفهم على آداب التعامل داخل مختبر الحاسوب، ثم يتقدمون في استخدام الحاسوب لإكمال الألغاز عبر الإنترنت.",
          "student_overview": "برمج سكرات للوصول إلى البلوط."
        },
        "pre-express-2021/Programming in with Angry Birds": {
          "overview": "باستخدام شخصيات من فلم العصر الجليدي (Ice Age)، سيطور الطلاب خوارزميات متتابعة لإيصال سكرات من أحد جوانب المتاهة إلى البلوط في الجانب الآخر. للقيام بذلك، سيقومون بتجميع قوالب التعليمات البرمجية معًا في تسلسل خطي، ما يجعلهم يتحركون بشكل مستقيم، أو يستديرون لليسار، أو يستديرون لليمين."
        },
        "pre-express-2021/Programming with Rey and BB-8": {
          "overview": "في هذا الدرس، سيستخدم الطلاب مهاراتهم البرمجية المكتشفة حديثًا بطرق أكثر تعقيدًا للتنقل في مسار صعب باستخدام BB-8."
        },
        "pre-express-2021/Programming in Harvester": {
          "overview": "سيطبق الطلاب مفاهيم البرمجة التي تعلموها على بيئة الحصّادة. الآن، بدلاً من مجرد إيصال الشخصية إلى الهدف، يجب على الطلاب جمع الذرة باستخدام قطعة جديدة. سيستمر الطلاب في تطوير مهارات الخوارزمية التسلسلية والبدء في استخدام عملية تصحيح الأخطاء.",
          "student_overview": "ساعد الحصّادة على جمع الخضراوات على طول المسار."
        },
        "pre-express-2021/Loops with Scrat": {
          "student_overview": "ساعد سكرات على تغطية مساحة أكبر من الأرض باستخدام الحلقات."
        },
        "pre-express-2021/Loops with Laurel": {
          "overview": "في هذا الدرس، يواصل الطلاب تعلم مفهوم الحلقات. هنا، تستخدم لوريل المغامرة حلقات لجمع الكنز في مساحات الكهوف المفتوحة. تم تقديم قالب \"احصل على الكنز'' جديد لمساعدتها في رحلتها."
        },
        "pre-express-2021/Ocean Scene with Loops": {
          "overview": "بالعودة إلى الحلقات، يتعلم الطلاب رسم الصور من خلال تكرار تسلسلات بسيطة من الأوامر. في الدرس السابق غير المتصل، تم استخدام الحلقات لاجتياز متاهة وجمع الكنوز. هنا، تقوم الحلقات بإنشاء أنماط. في نهاية هذه المرحلة، سيتم منح الطلاب الفرصة لإنشاء صورهم الخاصة باستخدام الحلقات.",
          "student_overview": "استخدم الحلقات والأنماط لإنهاء الصور."
        },
        "pre-express-2021/Drawing Gardens with Loops": {
          "overview": "بالعودة إلى الحلقات، يتعلم الطلاب رسم الصور من خلال تكرار تسلسلات بسيطة من التعليمات. في الدرس السابق عبر الإنترنت، تم استخدام الحلقات لاجتياز متاهة وجمع الكنوز. هنا، يستخدم الطلاب الحلقات لإنشاء أنماط. في نهاية هذه المرحلة، سيتم منح الطلاب الفرصة لإنشاء صورهم الخاصة باستخدام الحلقات.",
          "student_overview": "استخدم الأنماط والحلقات لإنهاء الصور."
        },
        "pre-express-2021/On the Move with Events": {
          "overview": "في هذا النشاط عبر الإنترنت، ستتاح للطلاب الفرصة لتعلم كيفية استخدام الأحداث في مختبر الألعاب وكيفية تطبيق جميع مهارات البرمجة التي تعلموها لإنشاء لعبة رسوم متحركة. حان الوقت للإبداع وإنشاء قصة في مختبر الألعاب!",
          "student_overview": "صمم لعبتك أو قصتك."
        },
        "pre-express-2021/A Royal Battle with Events": {
          "overview": "في هذا النشاط عبر الإنترنت، ستتاح للطلاب الفرصة لتعلم كيفية استخدام الأحداث في مختبر الألعاب وكيفية تطبيق جميع مهارات البرمجة التي تعلموها لإنشاء لعبة رسوم متحركة. حان الوقت للإبداع وإنشاء لعبة في مختبر الألعاب!",
          "student_overview": "استخدم الأحداث لإنشاء قصة أو عمل لعبة تفاعلية."
        },
        "coursee-2021/Simon Says": {
          "overview": "في هذا الدرس، سيلعب الطلاب لعبة تهدف إلى جعلهم يفكرون في طريقة لإعطاء الأوامر المتسلسلة. سيساعدهم ذلك على الانتقال بسهولة أكبر إلى مختبر النقوش المتحركة في الدروس القادمة.",
          "student_overview": "العب لعبة وفكر في الأوامر المطلوبة للحصول على النتيجة الصحيحة."
        },
        "coursee-2021/Learning Sprites with Sprite Lab": {
          "overview": "سيقوم الطلاب ببرمجة رسوم متحركة بسيط تحت الماء في هذا الدرس \\*\\* بناء المهارات \\*\\*.",
          "student_overview": "تعلم كيفية إنشاء النقوش المتحركة وتعديلها."
        },
        "coursee-2021/Alien Dance Party with Sprite Lab": {
          "overview": "سيستخدم الطلاب الأحداث لجعل النقوش المتحركة تتحرك حول الشاشة بناءً على مدخلات المستخدم في درس \\*\\* بناء المهارات \\*\\* هذا.",
          "student_overview": "صمم مشروعًا تفاعليًا يمكنك مشاركته مع زملائك."
        },
        "coursee-2021/Private and Personal Information": {
          "student_overview": "الإنترنت ممتع ومثير، ولكن من المهم أن تظل آمنًا أيضًا. يعلمك هذا الدرس الفرق بين المعلومات الآمنة التي يمكنك مشاركتها والمعلومات الخاصة."
        },
        "coursee-2021/About Me": {
          "student_overview": "من خلال إنشاء ملصق تفاعلي في مختبر النقوش المتحركة، سيطبق الطلاب فهمهم لمشاركة المعلومات الشخصية والخاصة على الويب."
        },
        "coursee-2021/Digital Sharing": {
          "student_overview": "ستتعرف في هذا الدرس على تحديات الملكية وحقوق النشر وفوائدها."
        },
        "coursee-2021/Programming and Loops with the Artist": {
          "overview": "شاهد وجوه الطلاب تشع سعادة وهم يصنعون تصميماتهم الرائعة باستخدام عدد صغير من القطع والملصقات الرقمية! يعتمد هذا الدرس على فهم الحلقات من الدروس السابقة ويعطي الطلاب فرصة ليكونوا مبدعين حقًا. هذا النشاط رائع لإنتاج إبداعات لقوائم المشاريع أو مؤتمرات الآباء/ المعلمين.",
          "student_overview": "في هذا الدرس، تسهل الحلقات إنشاء أروع مع الفنان!"
        },
        "coursee-2021/Nested Loops in Artist": {
          "student_overview": "المزيد من الحلقات المتداخلة! هذه المرة، يمكنك عمل رسم مدهش مستعينًا بالحلقات المتداخلة."
        },
        "coursee-2021/Nested Loops in Frozen": {
          "overview": "الآن بعد أن عرف الطلاب كيفية ترتيب حلقاتهم، يمكنهم إبداع العديد من الأشياء الجميلة. سيأخذ هذا الدرس الطلاب في سلسلة من التمارين لمساعدتهم على إنشاء صور خاصة بهم جاهزة للمشاريع باستخدام مهارات آنا وإلسا الممتازة في التزلج على الجليد!",
          "student_overview": "تتمتع آنا وإلسا بمهارات ممتازة في التزلج على الجليد، لكنهما بحاجة إلى مساعدتك في إنشاء أنماط في الجليد. استخدم حلقات متداخلة لإنشاء شيء رائع."
        },
        "coursee-2021/Functions: Songwriting": {
          "overview": "الوظيفة هي واحدة من أروع الأساسيات في عالم علم الحاسوب. الوظيفة (تسمى أحيانًا الإجراءات) هي برامج صغيرة يمكنك استخدامها مرارًا وتكرارًا داخل البرنامج الأكبر. سيساعد هذا الدرس الطلاب على الفهم بشكل بديهي لماذا يُعد الجمع بين أجزاء من التعليمات البرمجية في الوظائف ممارسة مفيدة.",
          "student_overview": "حتى نجوم موسيقى الروك يحتاجون إلى مهارات البرمجة. سيعلمك هذا الدرس المزيد من المعلومات عن الوظائف باستخدام كلمات الأغاني."
        },
        "coursee-2021/Functions in Minecraft": {
          "overview": "سيبدأ الطلاب في فهم كيف يمكن أن تكون الوظائف مفيدة في هذه المغامرة الممتعة والتفاعلية من ماينكرافت!",
          "student_overview": "هل يمكنك معرفة كيفية استخدام الدوال للوصول إلى التعليمات البرمجية الأكثر فعالية؟"
        },
        "coursee-2021/Functions in Artist": {
          "overview": "سيتم تعريف الطلاب على استخدام الوظائف في لعبة الفنان. وسيتم إنشاء الصور الرائعة وتعديلها. وبالنسبة للأنماط الأكثر تعقيدًا، سيتعلم الطلاب المزيد من المعلومات حول الوظائف المتداخلة عن طريق استدعاء وظيفة واحدة من داخل أخرى.",
          "student_overview": "أصبحت الرسومات المعقدة أسهل باستخدام الوظائف!"
        },
        "coursee-2021/Conditionals in Minecraft: Voyage Aquatic": {
          "overview": "تم إنشاء هذا الدرس في الأصل لساعة من البرمجة، إلى جانب فريق ماينكرافت. سيحصل الطلاب على فرصة لممارسة الأفكار التي تعلموها حتى هذه اللحظة، بالإضافة إلى إلقاء نظرة خاطفة على العبارات الشرطية!",
          "student_overview": "هنا ستتعرف على العبارات الشرطية في عالم ماينكرافت."
        },
        "coursee-2021/Conditionals": {
          "overview": "يعرّف هذا الدرس الطلاب على حلقات \"while\" وعبارات \"if / else\". إن حلقات While هي حلقات تستمر في تكرار الأوامر طالما أن التعبير الشرطي صحيح. ويتم استخدام حلقات While عندما لا يعرف المبرمج عدد المرات الدقيق لتكرار الأوامر، ولكن المبرمج يعرف الحالة التي يجب أن تكون صحيحة لكي تستمر الحلقة في التكرار. توفر عبارات \"If / Else\" مرونة في البرمجة من خلال تشغيل أقسام كاملة من التعليمات البرمجية فقط إذا كان هناك شيء صحيح، وإلّا فإنها تقوم بتشغيل شيء آخر.",
          "student_overview": "ستخبر الحاسوب بما يجب فعله في ظل ظروف معينة في هذه السلسلة المسلية والمليئة بالتحديات."
        },
        "coursee-2021/Functions in Harvester": {
          "overview": "لقد تدرّب الطلاب على إنشاء تصميمات رائعة في لعبة الفنان وعلى التنقل في متاهات لعبة النحل، ولكنهم سيستخدمون اليوم الوظائف لحصاد المحاصيل في لعبة الحصّادة. سيدفع هذا الدرس الطلاب إلى استخدام الوظائف بالطرق الجديدة من خلال دمجها مع حلقات \"while\" وتعبيرات \"if / else\".",
          "student_overview": "ستوفر لك الوظائف الكثير من العمل والوقت وأنت تساعد المزارعة في حصادها!"
        },
        "coursee-2021/lesson-1": {
          "overview": "في هذا الدرس، سيتعرف الطلاب على إمكانية الوصول وقيمة تقمص الشخصية من خلال العصف الذهني وتصميم حلول يمكن الوصول إليها في تطبيقات افتراضية."
        },
        "coursee-2021/End of Course Project": {
          "overview": "توفر الدروس الأربعة التالية فرصة للطلاب لوضع مهاراتهم في البرمجة لاستخدامها في مشروع رئيسي. سيساعد هذا المشروع الأفراد على اكتساب خبرة في البرمجة وإنتاج نموذج مثالي لمشاركته مع أقرانهم وأحبائهم. تهدف هذه الدروس إلى أن تكون تجربة متعددة الدروس أو متعددة الأسابيع، وسوف يقضي الطلاب وقتًا في استكشاف طريقة العصف الذهني، والتعرف على عملية التصميم، والبناء، وتقديم أعمالهم النهائية. \n\nفي مرحلة الاستكشاف، سيلعب الطلاب بأمثلة لمشاريع الفنان ومختبر النقوش المتحركة التي تم إنشاؤها مسبقًا للحصول على الإلهام. بعد ذلك، سيتعرف الطلاب على عملية التصميم وكيفية تنفيذها في مشاريعهم الخاصة. سيتم منحهم بعد ذلك مساحة لإنشاء مشروعهم الخاص إما في الفنان أو مختبر الألعاب أو واجهة أخرى أصبحوا على دراية بها (من المحتمل أن تكون هذه أطول مرحلة من المشروع). أخيرًا، سيتمكن الطلاب من عرض أعمالهم النهائية على أقرانهم.",
          "student_overview": "تستغرق المشاريع الكبيرة وقتًا طويلاً والكثير من التخطيط. اعثر على إلهامك، ثم ضع خطة وأطلق العنان لإبداعك!"
        }
      }
    }
  }
}