{
  "ru-RU": {
    "data": {
      "lessons": {
        "artist/Artist": {
          "overview": "В ходе этого урока ученики будут управлять Художником, чтобы отобразить рисунки на экране. Этот этап работы с Художником позволит ученикам создавать все более сложные изображения с помощью новых блоков, таких как \"переместиться вперед на 100 точек\" или \"повернуть на 90 градусов направо\"."
        },
        "sports/Sports": {
          "overview": "В ходе этого онлайн-занятия учащиеся узнают, что такое события и как компьютеры используют их в таких программах, как видеоигры. Ученики будут работать с головоломками, заставляя программу реагировать на события (такие как нажатия клавиш со стрелками). В заключение ученики смогут индивидуализировать свою игру, задавая различные скорости и звуки."
        },
        "basketball/Bounce": {
          "overview": "В ходе этого онлайн-занятия учащиеся узнают, что такое события и как компьютеры используют их в таких программах, как видеоигры. Ученики будут работать с головоломками, заставляя программу реагировать на события (такие как нажатия клавиш со стрелками). В заключение ученики смогут индивидуализировать свою игру, задавая различные скорости и звуки."
        },
        "oceans/Oceans": {
          "student_overview": "Краткое содержание урока: сначала ученики классифицируют объекты либо как \"рыбу\", либо как\" не рыбу\", чтобы попытаться удалить мусор из океана. Затем учащиеся должны будут расширить свой набор данных обучения, чтобы включить в него других морских существ, которые живут в воде. Во второй части занятия учащиеся будут выбирать собственные метки для нанесения на изображения случайно сгенерированных рыб. Эти обучающие данные используются для модели машинного обучения, которая затем должна иметь возможность самостоятельно маркировать новые изображения."
        },
        "jigsaw/Jigsaw": {
          "overview": "Этот урок даст учащимся понятие о том, что ожидает их в компьютерном классе. Он начинается с краткого обсуждения, в ходе которого они знакомятся с правилами пребывания в компьютерном классе, затем речь идет об использовании компьютера и создании онлайн-головоломок.",
          "student_overview": "Щелкните и перетащите, чтобы закончить головоломки."
        },
        "coursef-2021/lesson-6": {
          "overview": "На этом занятии по **настройке контекста** ученики обсудят роль компьютеров и технологий в их жизни, фокусируясь на том, как приложения и инструменты позволяют пользователям выбирать порядок их использования. Ученики также рассмотрят приложения, аналогичные тем, которые они позднее будут создавать самостоятельно.",
          "preparation": "-   Определите, как студенты будут входить на сайт Code.org. \n-   При необходимости создайте учетные записи Code.org для студентов. \n-   Назначьте студентам Introducing Sprite Lab. \n-   Распечатайте копии рабочей страницы **\\*Exploring Apps** (или опубликуйте цифровую версию в своей системе LMS).",
          "purpose": "Первое занятие посвящено тому, как пробудить у учеников интерес к курсу и привязать их персональные интересы к информатике.",
          "student_overview": "Вы будете обсуждать роль компьютеров и технологий в вашей жизни с акцентом на том, как приложения и инструменты позволяют пользователям выбирать способы их использования."
        },
        "coursef-2021/Variables that Change in Artist": {
          "purpose": "Переменные, в сущности, представляют собой поля для подстановки значений, которые неизвестны во время запуска программы или могут изменяться во время ее выполнения. Эти конструкции жизненно важны для создания динамического кода, так как они позволяют вашей программе изменяться и развиваться но основе любого количества возможных модификаций. На этом этапе ученики узнают, что такое переменные, используя наиболее общие способы присвоения им значений и их применения."
        },
        "coursef-2021/Nested Loops in the Maze": {
          "student_overview": "Цикл внутри цикла. Что это значит? Этот урок объяснит вам, что происходит, когда вы помещаете цикл внутри другого цикла."
        },
        "coursef-2021/AI for Oceans": {
          "overview": "\\*\\* Краткое содержание урока: \\* \\* сначала ученики классифицируют объекты либо как \"рыбу\", либо как\" не рыбу\", чтобы попытаться удалить мусор из океана. Затем учащиеся должны будут расширить свой набор данных обучения, чтобы включить в него других морских существ, которые живут в воде. Во второй части занятия учащиеся будут выбирать собственные метки для нанесения на изображения случайно сгенерированных рыб. Эти обучающие данные используются для модели машинного обучения, которая затем должна иметь возможность самостоятельно маркировать новые изображения.\\\\р\n\\\\r\n\\\\r\n\\*\\* Проверка правильности: \\* \\* этот учебник не скажет ученикам, правильно ли они прошли уровень. Можно быстро пропустить различные части действия. Поощряйте учащихся смотреть видео, читать инструкции и пробовать разные вещи по пути. В любой момент они могут поделиться своими находками с вами или одноклассником.\\\\р",
          "student_overview": "Краткое содержание урока: сначала ученики классифицируют объекты либо как \"рыбу\", либо как\" не рыбу\", чтобы попытаться удалить мусор из океана. Затем учащиеся должны будут расширить свой набор данных обучения, чтобы включить в него других морских существ, которые живут в воде. Во второй части занятия учащиеся будут выбирать собственные метки для нанесения на изображения случайно сгенерированных рыб. Эти обучающие данные используются для модели машинного обучения, которая затем должна иметь возможность самостоятельно маркировать новые изображения."
        },
        "courseb-2021/Sequencing in Maze": {
          "purpose": "В ходе этого урока учащиеся будут овладевать навыками программирования и отладки программ на компьютерах. Блочных формат изучаемых головоломок помогает ученикам усваивать последовательность работ и используемые концепции, не отвлекаясь на синтаксическую отладку."
        },
        "courseb-2021/Loops in Artist": {
          "purpose": "Этот урок позволяет по-иному взглянуть на роль циклов в программировании. Ученики проверят свои навыки критического мышления, оценивая рассматриваемый код и определяя, что следует к нему добавить, чтобы решить головоломку. При этом ученики смогут также подумать о неэффективности программирования без циклов, увидев сколько блоков потребовала бы программа, если бы не существовало циклов \"повторить\"."
        },
        "courseb-2021/Events in Play Lab": {
          "purpose": "На этом онлайн-занятии учащиеся научатся использовать события в Лаборатории игр. Они начнут с того, что научат рыцаря перемещаться по нажатию клавиш со стрелками, а в конце им будет предоставлена возможность, создавая головоломки в режиме свободного творчества, продемонстрировать прочие навыки, которыми они овладели за время прохождения курса, в том числе использование последовательностей и циклов."
        },
        "coursea-2021/Safety in My Online Neighborhood": {
          "student_overview": "Узнайте, как безопасно посещать сайты в Интернете."
        },
        "coursea-2021/Learn to Drag and Drop": {
          "student_overview": "Щелкните и перетащите, чтобы закончить головоломки."
        },
        "coursea-2021/Sequencing with Scrat": {
          "purpose": "В ходе этого урока учащиеся будут овладевать навыками программирования и отладки программ на компьютерах. Блочных формат изучаемых головоломок помогает ученикам усваивать последовательность работ и используемые концепции, не отвлекаясь на синтаксическую отладку.",
          "student_overview": "Запрограммируйте Скрета, чтобы добраться до желудя."
        },
        "coursea-2021/Programming in Ice Age": {
          "purpose": "В ходе этого урока учащиеся будут овладевать навыками программирования и отладки программ на компьютерах. Блочных формат изучаемых головоломок помогает ученикам усваивать последовательность работ и используемые концепции, не отвлекаясь на синтаксическую отладку."
        },
        "coursea-2021/Loops: Happy Loops": {
          "overview": "Циклы - это очень полезный и мощный инструмент в программировании. Чтобы понять, насколько полезными могут быть циклы, ученикам нужно будет водить, чтобы найти более простой способ решить повседневные проблемы.",
          "purpose": "Это вводный урок по циклам. Циклы позволяют ученикам упростить их код путем группировки команд, которые должны повторяться. Обучаясь замечать повторения движений своих одноклассников и определяя, сколько раз надо повторить команды, учащиеся овладевают навыками критического мышления. Повторно просматривая \"Счастливые карты\", ученики получают возможность связать старый навык формирования последовательностей с новым понятием циклов повтора."
        },
        "coursea-2021/Events in Play Lab": {
          "purpose": "Сегодня, с помощью Лаборатории игр (для дошкольников), учащиеся углубят свое понимание событий. В большинстве компьютерных программ использование события является очень распространенным приемом. На этом занятии ученики будут использовать события для того, чтобы заставить персонажа перемещаться по экрану и издавать звуки, а также чтобы менять фон в связи с событиями, инициируемыми пользователем."
        },
        "coursec-2021/Programming: My Robotic Friends": {
          "purpose": "На этом офлайн-уроке класс собирается вместе, чтобы командно выполнить несложное задание: заставить \"робота\" составить чашки в определенном порядке. На этом занятии создается основа для задач по программированию, которые ученики будут выполнять на протяжении всего курса по мере достижения понимания важности составления алгоритма с четкой коммуникацией."
        },
        "coursec-2021/Programming in Maze": {
          "purpose": "В ходе этого урока учащиеся будут овладевать навыками программирования и отладки программ на компьютерах. Блочных формат изучаемых головоломок помогает ученикам усваивать последовательность работ и используемые концепции, не отвлекаясь на синтаксическую отладку."
        },
        "coursec-2021/Programming in Artist": {
          "purpose": "На основе предыдущего опыта учащихся по последовательному программированию этот урок будет стимулировать творческий подход к написанию кода. Целью данного урока является закрепление знаний о последовательном программировании за счет знакомства с новыми блоками и целями. Используя новые блоки, ученики узнают больше о точках и углах и продолжат на практике осваивать навыки последовательного программирования. Они также смогут наглядно представить новые цели, в частности, программируя рисование квадрата Художником."
        },
        "coursec-2021/Loops: My Loopy Robotic Friends": {
          "purpose": "Этот урок служит для нового знакомства с циклами с помощью уже знакомого набора программных команд, управляющих \"роботами\". Учащиеся будут овладевать навыками критического мышления, занимаясь поиском повторяющихся схем в движениях своих одноклассников и находя способы упрощения этих повторяющихся схем с помощью циклов."
        },
        "coursec-2021/Sticker Art with Loops": {
          "purpose": "Эта серия демонстрирует преимущества циклов при работе с творческими и персонализированными изображениями. \n\nПредлагаемая в качестве последовательности проектных работ, данная серия позволит учащимся, опираясь на собственный опыт работы, создавать удивительные произведения искусства."
        },
        "coursec-2021/Events in Play Lab": {
          "purpose": "Здесь, с помощью Лаборатории игр, учащиеся углубят свое понимание событий. Ученики будут использовать события для того, чтобы заставить персонажей перемещаться по экрану и издавать звуки, а также чтобы менять фон в связи с данными, вводимыми пользователем. По завершении работы с головоломками ученикам будет предоставлена возможность поделиться своими проектами."
        },
        "coursed-2021/Algorithms: Graph Paper Programming": {
          "purpose": "Цель этого занятия – формирование навыков критического мышления и заинтересованности в изучении курса путем знакомства с некоторыми базовыми понятиями программирования, которые будут использоваться на протяжении всего курса. Знакомясь в классе, в ходе офлайн-занятия с такими основными понятиями, как последовательное программирование и алгоритмы, даже учащиеся, неуверенно чувствующие себя за компьютером, смогут понять основное содержание соответствующих тем. На этом уроке ученики узнают, как разрабатывать алгоритмы и писать программы на их основе."
        },
        "coursed-2021/Introduction to Online Puzzles": {
          "purpose": "Мы признаем, что каждый класс имеет свой \"спектр\" понимания каждого предмета. Некоторые ученики в Вашем классе могут быть компьютерными \"волшебниками\", тогда как остальные вообще не имеют особого опыта работы на компьютере. Для создания единого игрового (и учебного) поля мы разработали \"Этап подтягивания уровня\" для курса Г. Он может использоваться в качестве введения или обзора способа использования Code.org и основных понятий информатики. Этот этап обеспечивает создание всех условий, необходимых для начала прохождения курса Г."
        },
        "coursed-2021/Events in Bounce": {
          "purpose": "События очень часто используются в компьютерных программах, особенно в видеоиграх. \n\nВ ходе этого урока ученики лучше поймут события, создавая игру на тему спорта. Они научатся заставлять платформу перемещаться по нажатию клавиш со стрелками и генерировать звуки при столкновении объектов. В заключение им нужно будет индивидуализировать игру, сделав ее более оригинальной!"
        },
        "express-2021/Creating Art with Code": {
          "purpose": "На основе предыдущего опыта учащихся по последовательному программированию этот урок будет стимулировать творческий подход к написанию кода. Целью данного урока является закрепление знаний о последовательном программировании за счет знакомства с новыми блоками и целями. Используя новые блоки, ученики узнают больше о точках и углах и продолжат на практике осваивать навыки последовательного программирования. Они также смогут наглядно представить новые цели, в частности, программируя рисование квадрата Художником."
        },
        "express-2021/Sticker Art with Loops": {
          "purpose": "Эта серия демонстрирует преимущества циклов при работе с творческими и персонализированными изображениями. \n\nПредлагаемая в качестве последовательности проектных работ, данная серия позволит учащимся, опираясь на собственный опыт работы, создавать удивительные произведения искусства."
        },
        "express-2021/Snowflakes with Anna and Elsa": {
          "purpose": "В этой серии головоломок учащиеся должны будут практиковаться во вложении циклов при создании изображений, которыми они смогут с удовольствием поделиться. \n\nНачав с использования небольшого числа команд, ученики примут самостоятельные решения о создании изображений, которые будут повторяться. Затем ученики будут различными способами вращать изображения, что приведет к созданию поистине уникальных произведений искусства."
        },
        "express-2021/Harvesting with Conditionals": {
          "purpose": "Практика использования условных операторов в различных сценариях помогает добиться понимания учениками того, что могут делать условные операторы. На предыдущем уроке ученики использовали условные операторы для перемещения по лабиринту. В ходе этого урока они будут использовать условные операторы, чтобы помочь фермерше узнать, где нужно собрать урожай. Появятся новые схемы, и ученики будут использовать творческий подход и логическое мышление, чтобы определить условия, при которых код должен выполняться и повторяться."
        },
        "express-2021/Variables with Artist": {
          "purpose": "Переменные, в сущности, представляют собой поля для подстановки значений, которые неизвестны во время запуска программы или могут изменяться во время ее выполнения. Эти конструкции жизненно важны для создания динамического кода, так как они позволяют вашей программе изменяться и развиваться но основе любого количества возможных модификаций. На этом этапе ученики узнают, что такое переменные, используя наиболее общие способы присвоения им значений и их применения."
        },
        "pre-express-2021/Learn to Drag and Drop": {
          "student_overview": "Щелкните и перетащите, чтобы закончить головоломки."
        },
        "pre-express-2021/Sequencing with Scrat": {
          "purpose": "В ходе этого урока учащиеся будут овладевать навыками программирования и отладки программ на компьютерах. Блочных формат изучаемых головоломок помогает ученикам усваивать последовательность работ и используемые концепции, не отвлекаясь на синтаксическую отладку.",
          "student_overview": "Запрограммируйте Скрета, чтобы добраться до желудя."
        },
        "pre-express-2021/Programming in with Angry Birds": {
          "purpose": "В ходе этого урока учащиеся будут овладевать навыками программирования и отладки программ на компьютерах. Блочных формат изучаемых головоломок помогает ученикам усваивать последовательность работ и используемые концепции, не отвлекаясь на синтаксическую отладку."
        },
        "pre-express-2021/Programming with Rey and BB-8": {
          "purpose": "Способствуя передаче знаний, этот урок предоставляет учащимся новую среду для практического применения освоенных навыков. Фанаты Звездных войн будут прыгать от радости, когда увидят эти головоломки. Каждая головоломка этой серии была добавлена в нее с целью обеспечить более глубокое понимание основных понятий, которые ученики будут использовать на протяжении всей оставшейся части этого курса."
        },
        "pre-express-2021/Loops with Scrat": {
          "purpose": "В ходе этого урока учащиеся продолжат изучение циклов и узнают, как они используются при программировании с помощью библиотеки Блокли. Использование _циклов_ является важным навыком в программировании, так как повторение команд вручную утомительно и неэффективно. С помощью этих головоломок с Code.org ученики учатся добавлять команды внутрь существующих циклов, организовывать в циклы повторяющиеся фрагменты кода и распознавать схемы, которые следует повторять."
        },
        "pre-express-2021/Ocean Scene with Loops": {
          "purpose": "Этот урок позволяет по-новому взглянуть на роль циклов в программировании. Ученики также получают возможность подумать о неэффективности программирования без циклов, о том, сколько блоков потребовала бы программа, если бы не было циклов \"повторить\"."
        },
        "pre-express-2021/Drawing Gardens with Loops": {
          "purpose": "Этот урок позволяет по-иному взглянуть на роль циклов в программировании. Ученики проверят свои навыки критического мышления, оценивая рассматриваемый код и определяя, что следует к нему добавить, чтобы решить головоломку. При этом ученики смогут также подумать о неэффективности программирования без циклов, увидев сколько блоков потребовала бы программа, если бы не существовало циклов \"повторить\"."
        },
        "pre-express-2021/On the Move with Events": {
          "purpose": "Сегодня, с помощью Лаборатории игр (для дошкольников), учащиеся углубят свое понимание событий. В большинстве компьютерных программ использование события является очень распространенным приемом. На этом занятии ученики будут использовать события для того, чтобы заставить персонажа перемещаться по экрану и издавать звуки, а также чтобы менять фон в связи с событиями, инициируемыми пользователем."
        },
        "pre-express-2021/A Royal Battle with Events": {
          "purpose": "На этом онлайн-занятии учащиеся научатся использовать события в Лаборатории игр. Они начнут с того, что научат рыцаря перемещаться по нажатию клавиш со стрелками, а в конце им будет предоставлена возможность, создавая головоломки в режиме свободного творчества, продемонстрировать прочие навыки, которыми они овладели за время прохождения курса, в том числе использование последовательностей и циклов."
        },
        "coursee-2021/Nested Loops in Artist": {
          "purpose": "На этом онлайн-занятии ученики будут создавать с помощью \"Художника\" изображения, которыми они смогут с гордостью делиться с теми, кого они любят. \n\nЦель этого занятия – использовать вложенные циклы, чтобы внушить ученикам, обладающих художественным чувством, отношение к написанию кода как к одному из видов творчества. Этот набор головоломок был создан для развития навыков критического мышления, понимания основ геометрии, а также творческих способностей – и все это в связи с изучением вложенных циклов!"
        },
        "coursee-2021/Functions: Songwriting": {
          "overview": "Одним из самых великолепных структур в мире компьютерной науки является функция.  Функции (иногда называемые процедурами) - это мини-программы, которые можно использовать снова и снова внутри большой программы. Этот урок поможет учащимся интуитивно понять, почему объединение частей кода в функцию является такой полезной практикой.  ",
          "purpose": "Использование функций помогает упростить код и развивает у учащихся умение упорядочивать программы. Ученики быстро поймут, что написание функций облегчит чтение длинных программ и их отладку, если что-то пойдет не так, как надо."
        },
        "coursee-2021/lesson-1": {
          "student_overview": "Узнай о значении доступности и эмпатии путем коллективного обсуждения и разработки решений в области доступа для гипотетических приложений. "
        }
      }
    }
  }
}