{
  "uz-UZ": {
    "data": {
      "lessons": {
        "coursef-2022/The Power of Words": {
          "name": "The Power of Words",
          "overview": "[![sog'lom aqlli ta'lim](https://curriculum.code.org/static/img/common_sense_education.png)](https://www.commonsense.org)\n\nUshbu dars dastlab Common Sense Education tomonidan yaratilgan. [Batafsil.](https://www.commonsense.org/education/digital-citizenship/curriculum)\n\nBolalar o'sib ulg'aygan sari, ular tabiiy ravishda Internetda ko'proq muloqot qilishni boshlaydilar. Ammo ular ko'rgan narsalarning ba'zilari ularni xafa qilishlari, xafa qilishlari, g'azablanishlari yoki hatto qo'rqishlariga olib kelishi mumkin. Talabalaringizga boshqalarga nisbatan hamdardlikni rivojlantirishga yordam bering va kiberbullingga duch kelganda foydalanish strategiyalarini o'rganing.",
          "preparation": "-   o'quv materiallarini ko'rib chiqish.\n-   Har bir talaba uchun tarqatma materiallarni chop eting.\n-   Sinf uchun uzun ip (yoki arqon) va qog'oz tayyorlang.",
          "purpose": "Common Sense’ning raqamli fuqarolik o‘quv dasturi bolalar, ommaviy axborot vositalari va texnologiyalar bo‘yicha so‘nggi tadqiqotlarga asoslangan oltita asosiy mavzuni ko‘rib chiqadi. Bu dars kiberbulling, raqamli drama va nafrat nutqiga qaratilgan. Talabalar ushbu qiyin mavzularni o'rganishadi va ijobiy, qo'llab-quvvatlovchi onlayn hamjamiyatlarni yaratish va onlayn shafqatsizlikka qarshi kurashish uchun faol rol o'ynaydi.",
          "student_overview": "Bezorilik hech qachon yaxshi bo’lmaydi. Ushbu dars sizga onlaynda nima deyish va nima deyish mumkinligi to’g’risida ma’lumot beradi."
        },
        "coursef-2022/Introducing Sprite Lab": {
          "name": "Sprite laboratoriyasi bilan tanishish",
          "overview": "Ushbu **kontekstni sozlash** darsida talabalar kompyuterlar va texnologiyalarning hayotlarida tutgan o‘rnini muhokama qilib, ilovalar va vositalar foydalanuvchilarga ulardan qanday foydalanishni tanlash imkonini berishiga e’tibor qaratadilar. Talabalar keyinchalik oʻzlari yaratadigan ilovalarga oʻxshash ilovalarni ham oʻrganadilar.",
          "preparation": "-   Talabalar Code.org saytiga qanday kirishlarini aniqlang.\n-   Agar kerak bo'lsa, talabalar uchun Code.org hisoblarini yarating.\n-   Talabalarga Sprite Lab bilan tanishtirishni topshiring.\n-   **\\*Exploring Apps** ish varag‘ining nusxalarini chop eting (yoki raqamli versiyasini LMS-ga joylashtiring).",
          "purpose": "Birinchi dars talabalarni kursga qiziqtirish va shaxsiy qiziqishlarini informatika bilan bog'lashdan iborat.",
          "student_overview": "Ilovalar va vositalar foydalanuvchilarga ulardan qanday foydalanishni tanlash imkonini beradigan kompyuterlar va texnologiyalarning hayotingizdagi rolini muhokama qilasiz."
        },
        "coursef-2022/Making Sprites": {
          "name": "Sprayt yasash",
          "overview": "Ushbu **malaka oshirish** darsida talabalar kompyuterda bir qator dasturlash darajalari orqali ishlaydilar va ochiq “erkin o‘yin” topshirig‘i bilan yakunlaydilar, bu yerda ular o‘zlari yoqtirgan narsani qurishlari mumkin. Talabalar dasturlar yozadilar va Sprite Lab markazidagi ikkita tushuncha: spritlar va xatti-harakatlar haqida bilib olishadi.",
          "preparation": "Darajalar bo'ylab o'ynang va **\\*dars slaydlarini** ko'rib chiqing."
        },
        "coursef-2022/Sprites in Action": {
          "name": "Spraytlar amalda"
        },
        "coursef-2022/Mini-Project: Virtual Pet": {
          "name": "Mini-loyiha: Virtual Pet",
          "overview": "Bu darsda talabalar ular xohlagandek ko‘rinadigan va o‘zini tutadigan interfaol virtual uy hayvonini yaratishadi. Talabalar uy hayvoninig tashqi ko‘rinishini moslashtirish uchun Sprite Labning \"Costumes\" qurilmasidan foydalanishadi. Keyin ular uy hayvonini jonlantirish uchun hodisalar, xatti-harakatlar va ular o‘rgangan boshqa tushunchalardan foydalanishadi!",
          "student_overview": "In this lesson, students will create an interactive Virtual Pet that looks and behaves how they wish. Students will use Sprite Lab's \"Costumes\" tool to customize their pet's appearance. They will then use events, behaviors, and other concepts they have learned to give their pet a life of its own!"
        },
        "coursef-2022/Blank Space Stories": {
          "preparation": "6 ta konvertni oling (shuningdek, mos keladi: qog'oz yoki indeks kartalari, yarmiga katlanmış).\n\n-   Har bir konvertning old tomonini katta harflar bilan belgilang: ob'ekt, suyuqlik, raqam, sifat, tana qismi, raqam\n-   Talabaning **\\*ish varag'i** nusxalarini chop eting (yoki raqamli versiyasini LMSga joylashtiring).",
          "purpose": "Ushbu dars o'quvchilar dasturlashga qaytganlarida o'zgaruvchilar qanday ishlashini tushunishga yordam beradigan umumiy kontekstni taqdim etadi.",
          "student_overview": "Ushbu mashg'ulotda siz kompyuterlar foydalanuvchidan ma'lumotni qanday qabul qilish va saqlashni tushunishga tayyorgarlik ko'rish uchun bo'sh joyni to'ldirish hikoyalaridan (Mad Libs® ga o'xshash) foydalanasiz, so'ngra undan dastur ishga tushganda foydalanasiz."
        },
        "coursef-2022/Text and Prompts": {
          "name": "Matn va takliflar",
          "overview": "Ushbu **malaka oshirish** darsida talabalar Sprite Lab-da o'zgaruvchilar bilan mashq qiladilar.",
          "preparation": "Darajalar bo'ylab o'ynang va dars slaydlarini ko'rib chiqing.",
          "purpose": "O'zgaruvchilar ushbu kursda ma'lumotlarni saqlash va o'zgartirish uchun ishlatiladi. Bu vaqtda o'quvchilar qiymatlarni o'zgartirmagan holda saqlash va olish bilan shug'ullanadilar. Keyingi darslarda talabalar raqamli qiymatlarni saqlaydi va vaqt o'tishi bilan o'yinchining o'yindagi ballini kuzatib borish uchun ularni o'zgartiradi.",
          "student_overview": "Ushbu darsda siz Sprite Lab-da o'zgaruvchilar bilan mashq qilasiz."
        },
        "coursef-2022/Mini-Project: User Input Programs": {
          "name": "Chat-Bot yaratish",
          "overview": "Talabalar o'zgaruvchilar bilan o'zlarining yangi ko'nikmalarini uchta ochiq \\*\\* mini-loyihalardan birida qo'llashadi. Talabalar namunaviy dasturlarni o'rganadilar, o'z loyihasi uchun reja tuzadilar va uni noldan boshlab dasturlashadilar.",
          "preparation": "-   Rejalashtirish bo'yicha qo'llanmani chop eting yoki raqamli nusxasini har bir talabaga tarqating. Agar sinfingizga mos keladigan o'zgartirishlar kiritmoqchi bo'lsangiz, uni oldindan ko'rib chiqing.\n\n-   Talabalar amal qilishi kerak bo'lgan oqim bilan tanishish uchun 3-darajali variantlarni oldindan ko'rib chiqing.\n\n-   Bu dars bir necha sinf davrlariga cho'zilishi mumkin. Vaqtni rejalashtirish oqibatlarini oldindan ko'rib chiqing.",
          "purpose": "Ushbu dars yangi ko'nikmalar yoki tushunchalarni kiritmaydi, aksincha, o'quvchilarga o'rganganlarini ijodiy tarzda qo'llash imkoniyatini beradi.",
          "student_overview": "O'zgaruvchilar bilan yangi ko'nikmalaringizni uchta ochiq loyihadan biriga qo'llang."
        },
        "coursef-2022/[New] Lots of Sprites": {
          "student_overview": "Siz Sprite Laboratoriyasi bilan yanada ko'proq ishlashni va ko'plab spritlar bilan loyihalar yaratishni o'rganasiz!"
        },
        "coursef-2022/[New] Counting with Variables": {
          "name": "O'zgaruvchilarni sanash",
          "overview": "Ushbu **malaka oshirish** darsida talabalar hisoblagich kabi vaqt o‘tishi bilan o‘zgarib turadigan qiymatni kuzatish uchun o‘zgaruvchilardan foydalanadilar. Ushbu darsda talabalar oddiy o'yin yaratadigan qisqa **mini-loyiha** ham mavjud.",
          "purpose": "Oldingi darslarda talabalar keyinroq olinishi mumkin bo'lgan ma'lumotlarni saqlash uchun o'zgaruvchilardan foydalanishni o'rganadilar. Ushbu darsda talabalar o'zgaruvchida saqlangan ma'lumotlarni o'zgartirishni o'rganishni boshlaydilar. O'zgaruvchilar qanday ishlashini tushunish, ularga yanada ilg'or loyihalarni yaratishga imkon beradi.",
          "student_overview": "Hisoblagich yaratish yoki o'yinda hisobni kuzatish uchun o'zgaruvchilardan foydalanishni o'rganasiz."
        },
        "coursef-2022/[New] Mini-Project: Collector Game": {
          "overview": "Ushbu **mini-loyiha** darsida talabalar moslashtirilgan \"kollektor o'yini\" yaratadilar, unda foydalanuvchi ob'ektlarni yig'ish uchun spraytni harakatga keltiradi.",
          "purpose": "Ushbu loyiha talabalarga o'zgaruvchilar haqidagi yangi bilimlarini qiziqarli tarzda qo'llash imkonini berish uchun mo'ljallangan. O'zgaruvchida saqlangan qiymatni qanday o'zgartirishni tushunib, talabalar o'yinchining harakatlariga qarab hisobni avtomatik ravishda saqlaydigan o'yin yaratishlari mumkin.",
          "student_overview": "Barcha spritlarni to'plang! Ushbu loyihada siz boshqalar o'ynashi mumkin bo'lgan o'yin yaratasiz"
        },
        "coursef-2022/Simulating Experiments": {
          "name": "Simulating Experiments",
          "overview": "By running a simple simulation in Sprite Lab, students will experience how computing can be used to collect data that identify trends or patterns. After running the simulation multiple times, students will have an opportunity to make a prediction about how changing a variable in the simulation might impact the outcome, and then test that hypothesis.",
          "student_overview": "Run simulations on the computer and experiment by changing variables."
        },
        "coursef-2022/Outbreak": {
          "name": "Avj olish",
          "overview": "Bu dars voqealar atrofida **ko‘nikma oshirish**ni **mini-loyiha** bilan birlashtiradi, bunda talabalar Sprite Laboratoriyasida o‘zlarining kompyuter simulyatsiyasini yaratishlari mumkin. Talabalar virus qanchalik tez tarqalishini va uni sekinlashtirish uchun nima qilish kerakligini tushunish uchun simulyatsiyani o'rganadilar.",
          "preparation": "-   Sinfingiz uchun mumkin bo'lgan muammoli joylarni topish uchun jumboqlarni o'ynang.\n-   Har bir o'quvchining aks ettirish jurnali borligiga ishonch hosil qiling.",
          "purpose": "Oldingi darsda talabalar oddiy simulyatsiyadan ma'lumotlarni to'pladilar va sharhladilar. Ushbu darsda talabalar o'zlarining simulyatsiya modellarini kodlash bo'yicha ko'rsatmalarga amal qilishadi. Talabalarning haqiqiy dunyoda virus tarqalishi haqidagi oldingi bilimlari xayoliy stsenariyda qo'llaniladi.",
          "student_overview": "Monster Townga virus keldi! Virus simulyatorini yaratishni o'rganing va hayvonlarning sog'lom bo'lishiga yordam bering."
        },
        "coursef-2022/AI For Oceans": {
          "name": "AI for Oceans",
          "overview": "\\*\\* O'quv qo'llanmasining qisqacha mazmuni: \\*\\* Dastlabki talabalar okeandan chiqindilarni olib tashlash uchun ob'ektlarni \" baliq yoki 'baliq emas 'deb tasniflashadi. Keyin talabalar o'zlarining o'quv ma'lumotlari to'plamini kengaytirishlari kerak bo'ladi. Suvga kiradigan boshqa dengiz jonivorlarini qo'shish. Faoliyatning ikkinchi qismida talabalar tasodifiy hosil bo'lgan baliqlarning rasmlariga murojaat qilish uchun o'zlarining yorliqlarini tanlaydilar. Bu o'quv ma'lumotlari keyinchalik o'rganish imkoniyatiga ega bo'lishi kerak bo'lgan mashinani o'rganish modeli uchun ishlatiladi. U o'z-o'zidan yangi rasmlarni belgilay oladi.\\\\r\n\\\\r\n\\\\r\n\\*\\* To'g'rilikni tekshirish: \\*\\* Ushbu o'quv qo'llanma talabalarga ularning saviyasini to'g'ri to'ldirgan-qilmaganligini aytmaydi. Faoliyatning turli qismlaridan tezda o'tish mumkin. Talabalarni rasmlarni tomosha qilishga undaydi. Videolar, ko'rsatmalarni o'qing va yo'lda turli xil narsalarni sinab ko'ring. Istalgan vaqtda ular siz yoki sinfdoshingiz bilan o'zlarining topilmalari haqida bo'lishishlari mumkin. \\\\r",
          "purpose": "Ushbu dars talabalarni sun'iy intellektning bir turi bo'lgan mashinani o'rganish bilan tezda tanishtirish uchun mo'ljallangan. Talabalar yangi ma'lumotlarni tasniflash uchun mashinani o'rganish modelini yoqish uchun o'quv ma'lumotlaridan qanday foydalanishni o'rganadilar. Talabalar dars davomida ijobiy tajribaga ega bo'lishlari va eng muhimi, kompyuter fanlarini o'rganishni davom ettirishlari kerak.",
          "student_overview": "O'quv qo'llanmasining qisqacha mazmuni: Dastlab talabalar okeandan chiqindilarni olib tashlash uchun obyektlarni 'baliqlar' yoki 'baliqlar emas' deb tasniflashadi. Keyin talabalar o'zlarining ma'lumot to'plamlarini boshqa dengizni o'z ichiga olgan holda kengaytirishlari kerak bo'ladi. Faoliyatning ikkinchi qismida talabalar tasodifiy hosil bo'lgan baliqlarning rasmlariga murojaat qilish uchun o'zlarining yorliqlarini tanlaydilar. Ushbu ma'lumotlar yangi tasvirlarni belgilashga qodir bo'lgan mashina o'rganish modeli uchun ishlatiladi. "
        },
        "coursef-2022/The Internet": {
          "name": "Internet",
          "overview": "Ko'pchilik Internetdan har kuni foydalanayotganiga qaramay, ko'pchilik uning qanday ishlashini bilmaydi. Ushbu darsda talabalar ulanishlar, URL manzillari, IP-manzillar va DNS haqida ma'lumot olish davomida o'zlarini Internetda aylanib yurgandek his qilishadi. ",
          "preparation": "-   **\\*Internet**-ni tomosha qiling - O'qituvchi videosi.\n-   Etarlicha chop eting **\\*IP-manzil kartalari va yetkazib berish turi kartalari** - Har bir guruh uchun manipulyatorlar.\n-   Bitta **\\*Internet** Baholash - har bir talaba uchun chop eting.\n-   Internetga kirish (masalan, **\\*get-site-ip.com**).\n-   Har bir o'quvchining aks ettirish jurnali borligiga ishonch hosil qiling.",
          "purpose": "Agar siz ushbu kursda har bir darsni bajarayotgan bo'lsangiz, sinfingizdagi har bir o'quvchi internetdan foydalangan... lekin uning qanday ishlashini qanchalar biladi? Internet haqida ko'proq ma'lumot olish talabalarga uning cheksiz imkoniyatlarini yaxshiroq tushunishga yordam beradi.",
          "student_overview": "Axborot qanday qilib Internet orqali tarqalishini o'ylab ko'rganmisiz? Bu sehr emas! Bu dars sizga Internet qanday ishlashi asoslarini o'rgatadi."
        },
        "coursef-2022/End of Course Project": {
          "name": "End of Course Project",
          "overview": "Ushbu yakunlovchi dars o‘quvchilarni o‘zlarining loyihalarini loyihalashtirish, ishlab chiqish va namoyish etish jarayonidan o‘tadi!",
          "preparation": "-   Artist va Sprite laboratoriyasida o‘zingizning loyihangizni tayyorlashga vaqt ajrating. Har bir uskunaning imkoniyatlari va cheklovlari bilan tanishib chiqing. \n-   Rubrikani sinf maqsadlariga mos ravishda o‘zgartiring va har bir talaba uchun nusxasini chop eting. . \n-   Loyiha dizayni jadvalini sinfingizga mos ravishda o‘zgartiring va har bir talaba uchun bitta paketni chop eting. ",
          "purpose": "Talabalar to‘g‘ridan-to‘g‘ri o‘z loyihalarini yaratish uchun tayyor bo‘lishlari mumkin, ammo bu dars ularning g‘oyalarini rejalarga aylantirishga yordam beradi. Ushbu tuzilma orzu qiluvchi ko‘ngillilarni bir joyda ushlab turgan holda, o’zlarini zulmatda qolgandek  his qiladiganlar uchun yo‘lni yoritib beradi. Qolaversa, talabalarga  o‘z loyihalarini yaratish va qayta ko‘rib chiqish uchun  yetarli vaqt bilan ta’minlaydi. Ushbu darsda ishtirok etgan sinov va xatolar muammolarni hal qilishga va qat’iylikka o‘rgatadi. ",
          "student_overview": "Projects this big take time and plenty of planning. Find your inspiration, develop a plan, and unleash your creativity!"
        },
        "express-2022/Programming with Angry Birds": {
          "name": "Jahldor qushlar bilan dasturlash",
          "overview": "Jahldor qushlar o‘yinidagi obrazlardan foydalanib, talabalar qushni labirintning bir tomonidan boshqa tomonidagi cho‘chqaga qaratib harakatlantirish uchun ketma-ket algoritmlarni tuzib chiqadilar. Buni qilish uchun ular to‘g‘riga, chapga va keyin o‘ngga harakatlanadigan qilib kod bo‘limlarini chiziqli ketma-ketlikda taxlab chiqishadi.",
          "preparation": "-   Sinfingiz uchun mumkin bo'lgan muammoli joylarni topish uchun jumboqlarni o'ynang.\n-   (Ixtiyoriy) Sinfingiz bilan guruh bo'lib bajarish uchun bir nechta jumboqlarni tanlang.\n-   Har bir o'quvchining aks ettirish jurnali borligiga ishonch hosil qiling.",
          "purpose": "Ushbu darsda talabalar kompyuter platformasida dasturlash ko'nikmalarini rivojlantiradilar. Ushbu boshqotirmalarning blokli formati o‘quvchilarga sintaksisni mukammallashtirish haqida tashvishlanmasdan, ketma-ketlik va tushunchalarni o‘rganishga yordam beradi.",
          "student_overview": "Angry Birds bilan ketma-ketlik va algoritmlar haqida o‘rganing."
        },
        "express-2022/Debugging in Maze": {
          "name": "Debugging in Maze",
          "overview": "Debug qilish dasturlashni o‘rganishning muhim elementidir. Bu darsda, talabalar noto‘g‘ri yechilgan boshqotirmalarga duch kelishadi. Ular xatolikni topish uchun mavjud kodni qatorma-qator tekshirib chiqishadi, jumladan, noto‘g‘ri ishlatilgan sikllar, unutib qoldirilgan bo‘limlar, ortiqcha bo‘limlar va tartibdan tashqaridagi bo‘limlarni.",
          "preparation": "-   Sinfingiz uchun har qanday muammoli joylarni topish uchun dars davomida o'ynang.\n-   (Ixtiyoriy) Sinfingiz bilan guruh bo'lib bajarish uchun bir nechta jumboqlarni tanlang.\n-   Har bir talabada Reflection Journal borligiga ishonch hosil qiling.",
          "purpose": "Nosozliklarni tuzatish mohiyati tufayli sinfingizdagi o‘quvchilar bu darsdan hafsalasi pir bo‘lishi mumkin. Nosozliklarni tuzatish - bu kompyuter dasturlash uchun juda muhim bo'lgan tushunchadir. Kompyuter olimlari o'z dasturlaridagi xatolarni topishda juda yaxshi bo'lishlari kerak. Nosozliklarni tuzatish talabalarni muammolarni tan olishga va tanqidiy fikrlash va muammolarni hal qilish ko'nikmalarini shakllantirishda ularni engishga majbur qiladi",
          "student_overview": "Boshqotirmalardagi muammolarni toping va debug qilish mahoratingizni amalda sinab ko‘ring."
        },
        "express-2022/Collecting Treasure with Laurel": {
          "name": "Laurel bilan xazina yig‘ish",
          "overview": "Boshqotirmalar to‘plamida, talabalar algoritmlar va debug qilish bo‘yicha o‘zlarining tushunchalarini rivojlantirishda davom etishadi. Yangi obraz, sarguzashtchi Laurel bilan talabalar Laurelni u yo‘lak bo‘ylab harakatlanganda xazinalar cho‘qqisiga olib chiqish uchun algoritmlar ketma-ketligini yaratishadi.",
          "preparation": "-   Sinfingiz uchun mumkin bo'lgan muammoli joylarni topish uchun jumboqlarni o'ynang.\n-   Har bir talabada Reflection Journal borligiga ishonch hosil qiling.",
          "purpose": "Ushbu darsda talabalar yangi qahramon _Laurel the Adventurer_ yordamida dasturlash ko'nikmalarini mashq qiladilar. Biror kishi dasturlashni boshlaganda, ular mashina o'qiy oladigan narsadan foydalanib, ma'lum bir tartibda ko'rsatmalarni birlashtiradi. Dasturlashdan foydalanish orqali talabalar kompyuterning ko'rsatmalar va tartiblarni qanday boshqarishi haqida tushuncha hosil qiladi. Boshqa jumboq maqsadi bilan yangi belgidan foydalanish talabalarga dasturlashda ketma-ketlik va algoritmlar bo'yicha tajriba doirasini kengaytirishga yordam beradi.",
          "student_overview": "_Laurel the Sarguzashtga_ ko'plab qimmatbaho toshlarni yig'ishda yordam berish uchun algoritmlarni yozing!"
        },
        "express-2022/Creating Art with Code": {
          "name": "Kod bilan san’at yaratish",
          "overview": "Bu darsda talabalar ekrandagi chizmalarni tugatish uchun Rassomni boshqarishadi. Bu Rassom bosqichi talabalarga yangi bo‘limlar, masalan, `move forward by 100 pixels` va `turn right by 90 degrees` kabilardan foydalangan holda yuqori mukammallikdagi rasmlar yaratish imkonini beradi.",
          "preparation": "-   Sinfingiz uchun mumkin bo'lgan muammoli joylarni topish uchun jumboqlarni o'ynang.\n-   (ixtiyoriy) Sinfingiz uchun jumboqlarni bajarish uchun foydalanishi kerak bo'lgan burchaklarni tasavvur qilish uchun transport vositalarini oling.\n-   Har bir talaba uchun bitta **\\*Talaba varaqasi** chop eting.",
          "purpose": "Talabalar oldingi tajribalarini ketma-ketlik bilan boshlagan bo‘lsa, bu dars kod yozishni ko‘proq ijodkorlik bilan ilhomlantirish uchun ishlaydi. Bu darsning maqsadi yangi bo‘limlar va maqsadlarni tanishtirish orqali ketma-ketlik bo‘yicha bilimlarni mustahkamlash uchun. Bu holda, talabalar hamon o‘zlarining ketma-ketlik bo‘yicha ko‘nikmalarini amalda sinash bilan bir vaqtda yangi bo‘limlardan foydalanib, ko‘proq piksellar va burchaklar haqida ham o‘rganishadi. Shuningdek, talabalar yangi maqsadlar, masalan, biron kvadrat chizish uchun ushbu San’atkorni kodini yozishni tasavvur qilishga qodir bo‘ladi.",
          "student_overview": "Rassomni dasturlash orqali chiroyli rasmlar yarating."
        },
        "express-2022/Swimming Fish in Sprite Lab": {
          "name": "Sprite laboratoriyasida baliq suzish",
          "overview": "In this lesson, students will learn about the two concepts at the heart of Sprite Lab: sprites and behaviors. Sprites are characters or objects on the screen that students can move, change, and manipulate. Behaviors are actions that sprites will take continuously until they are stopped.",
          "preparation": "-   Sinfingiz uchun mumkin bo'lgan muammoli joylarni topish uchun jumboqlarni o'ynang.\n-   Har bir talabada Reflection Journal borligiga ishonch hosil qiling.",
          "purpose": "Bu dars talabalarni Sprite Laboratoriyasining asosiy lugʻatlari bilan tanishtirish va ularga boshqa muhitlarda oʻrgangan tushunchalarini ushbu vositada qoʻllash imkonini berish uchun moʻljallangan. Baliq tankini yaratish orqali talabalar ushbu vositaning dasturlash modeli haqida tushuncha hosil qila boshlaydilar va undan o'z fikrlarini ifodalash uchun foydalanish usullarini o'rganadilar.",
          "student_overview": "Learn how to create and edit sprites."
        },
        "express-2022/Making Sprites": {
          "name": "Sprayt yasash",
          "overview": "Ushbu **malaka oshirish** darsida talabalar kompyuterda bir qator dasturlash darajalari orqali ishlaydilar va ochiq “erkin o‘yin” topshirig‘i bilan yakunlaydilar, bu yerda ular o‘zlari yoqtirgan narsani qurishlari mumkin. Talabalar dasturlar yozadilar va Sprite Lab markazidagi ikkita tushuncha: spritlar va xatti-harakatlar haqida bilib olishadi.",
          "preparation": "Darajalar bo'ylab o'ynang va **\\*dars slaydlarini** ko'rib chiqing.",
          "purpose": "Ushbu dars talabalarni Sprite Laboratoriyasida dasturlash bilan tanishtirish uchun mo'ljallangan. Talabalar ushbu vositaning dasturlash modeli haqida tushuncha hosil qila boshlaydilar va undan o'z fikrlarini ifodalash uchun foydalanish usullarini o'rganadilar.",
          "student_overview": "Ushbu darsda siz dasturlar yozasiz va spritlar va xatti-harakatlar haqida bilib olasiz."
        },
        "express-2022/Sprites in Action": {
          "name": "Spraytlar amalda",
          "overview": "Ushbu **malaka oshirish** darsida talabalar kompyuterda bir qator dasturlash darajalari orqali ishlaydilar va ochiq “erkin o‘yin” topshirig‘i bilan yakunlaydilar, bu yerda ular o‘zlari yoqtirgan narsani qurishlari mumkin. Talabalar vaqtli voqealar va foydalanuvchi kiritishiga javob beradigan dasturlarni yozadilar.",
          "preparation": "Darajalar bo'ylab o'ynang va dars slaydlarini ko'rib chiqing.",
          "purpose": "Ushbu dars talabalarni voqealar bilan dasturlash bilan tanishtirish uchun mo'ljallangan. Ushbu kurs davomida voqealar talabalar o'z dasturlarini vaqt o'tishi bilan yoki foydalanuvchiga javoban qanday ishlashini o'zgartirishning asosiy usuli bo'ladi.",
          "student_overview": "Siz dasturlash darajalari orqali ishlaysiz va o'zingizga yoqqan narsani yaratishingiz mumkin bo'lgan ochiq \"erkin o'yin\" topshirig'ini bajarasiz."
        },
        "express-2022/Virtual Pet with Sprite Lab": {
          "name": "Virtual Pet with Sprite Lab",
          "overview": "Bu darsda talabalar ular xohlagandek ko‘rinadigan va o‘zini tutadigan interfaol virtual uy hayvonini yaratishadi. Talabalar uy hayvoninig tashqi ko‘rinishini moslashtirish uchun Sprite Labning \"Costumes\" qurilmasidan foydalanishadi. Keyin ular uy hayvonini jonlantirish uchun hodisalar, xatti-harakatlar va ular o‘rgangan boshqa tushunchalardan foydalanishadi!",
          "student_overview": "In this lesson, students will create an interactive Virtual Pet that looks and behaves how they wish. Students will use Sprite Lab's \"Costumes\" tool to customize their pet's appearance. They will then use events, behaviors, and other concepts they have learned to give their pet a life of its own!"
        },
        "express-2022/Dance Party": {
          "name": "Dance Party",
          "overview": "Bu darsda, talabalar o‘zlarining interaktiv raqs bazmini dasturlashtiradilar. Qurilma musiqaga javob qaytarish uchun yaratilganligi sababli bu mashg‘ulot tovushni talab qiladi.",
          "preparation": "-   Sinfingiz uchun mumkin bo'lgan muammoli joylarni topish uchun jumboqlarni o'ynang.\n-   Har bir talabada Reflection Journal borligiga ishonch hosil qiling.\n-   Eshitish vositalariga ehtiyoj borligini ko'rib chiqing. Bu faoliyat tovushga tayanadi.",
          "purpose": "Ushbu dars Infomatikadagi asosiy tushunchalar, kodlash va hodisaviy dasturlash (bloklardan foydalangan holda) bilan tanishtiradi.",
          "student_overview": "Bayram qilish vaqti keldi! Ushbu darsda siz o‘z interaktiv raqs bazmingizni dasturlashtirasiz."
        },
        "express-2022/Loops with Rey and BB-8": {
          "name": "Loops with Rey and BB-8",
          "overview": "Ushbu **malaka oshirish** darsida o‘quvchilar _Yulduzli urushlar_ qahramoni _BB-8_ labirintni samarali bosib o‘tishga yordam berish uchun halqalardan foydalanadilar.",
          "preparation": "-   Sinfingiz uchun muammoli joylar mavjudligini aniqlash uchun jumboqlarni o'ynang.\n-   Har bir talabada Reflection Journal borligiga ishonch hosil qiling.",
          "purpose": "Ushbu darsda talabalar tsikllar va ularni Blockly kodida qanday amalga oshirish haqida bilib olishadi. Looplardan foydalanish dasturlashda muhim mahorat hisoblanadi, chunki buyruqlarni qo'lda takrorlash zerikarli va samarasizdir. Code.org jumboqlari yordamida talabalar mavjud tsikllarga ko'rsatmalar qo'shishni, takroriy kodlarni tsikllarga to'plashni va aylanish kerak bo'lgan naqshlarni tan olishni o'rganadilar. Shuni ta'kidlash kerakki, talabalar turli xil echimlarga ega bo'lgan jumboqlarga duch kelishadi. Bu har bir yondashuvning afzalliklari va kamchiliklari bilan jumboqlarni hal qilishning turli usullari bo'yicha munozaralarni ochadi.",
          "student_overview": "Sikllardan foydalanib BB-8 ga labirint bo‘ylab harakatlanishida yordam bering! "
        },
        "express-2022/Mini-Project: Sticker Art": {
          "overview": "Watch student faces light up as they make their own gorgeous designs using a small number of blocks and digital stickers! This lesson builds on the understanding of loops from previous lessons and gives students a chance to be truly creative.  This activity is fantastic for producing artifacts for portfolios or parent/teacher conferences.",
          "purpose": "Bu to‘plamlar sikllarning ahammiyatini yaratuvchan va shaxsiy dizaynlar bilan ta’kidlab ko‘rsatadi.\n\n Loyiha ortidagi ketma-ketlik sifatida taklif qilinib, bu o‘sish talabalarga o‘z ishining ustasi bo‘lishga va ajoyib asarlar yaratishga imkon beradi.",
          "student_overview": "In this lesson, loops make it easy to make even cooler images with Artist!"
        },
        "express-2022/Nested Loops in Maze": {
          "name": "Nested Loops in Maze",
          "overview": "Bu onlayn mashg‘ulotda, talabalarda o‘zlarining sikllar haqidagi tushunchalarini butun yangi darajaga olib o‘tish imkoni tug‘iladi. Asalari va O‘simliklar vs Zombilar bilan o‘ynab, talabalar boshqa sikl ichida bo‘ladigan boshqa bir siklni qanday dasturlashni o‘rganishadi. Ular yana 'Run' bosilganda sikllardagi kichik o‘zgarishlar ularning dasturiga qanday ta’sir ko‘rsatishini aniqlash uchun ruhlantiriladi.",
          "student_overview": "Loops inside loops inside loops. What does this mean? This lesson will teach you what happens when you create a nested loop."
        },
        "express-2022/Snowflakes with Anna and Elsa": {
          "name": "Snowflakes with Anna and Elsa",
          "overview": "Endi talabalar o‘z siklarini qatlamlarga ajratishni bilib olishadi, ular ko‘plab chiroyli narsalar yarata olishadi.  Ushbu dars talabalarni Anna va Elzaning muzda uchish bo'yicha mukammal qobiliyatlaridan foydalangan holda o'zlarining portfoliosi uchun tayyor tasvirlarini yaratishda yordam beradigan bir qator mashqlarni bajaradi!",
          "purpose": "#### Bepul o'yin (10 daqiqa)\n\nDarsning yakuniy bosqichida o'quvchilar o'z loyihasini tuzish mumkin.",
          "student_overview": "Anna va Elsaning ajoyib muzda uchish qobiliyati bor, ammo muzda shakllar yaratish uchun ularga yordamingiz kerak. AJOYIB nimadir yaratish uchun ichma-ich sikllardan foydalaning. "
        },
        "express-2022/Looking Ahead with Minecraft": {
          "name": "Minecraft bilan oldinga qarab",
          "overview": "Bu dars aslida, Minecraft jamoasi bilan birgalikda Hour of Code uchun yaratilgan. Talabalar shu paytgacha o‘rgangan g‘oyalarini amalda sinab ko‘rish, shuningdek, shartli bayonotlarning yashirin jihatlarini ko‘rib chiqish imkoniyatiga ham ega bo‘ladilar!",
          "purpose": "Boshqotirmalarning bu to‘plami sikllar bo‘yicha bilimga ega bo‘lish va uni kengaytirish uchun juda foydali va shartli bayonotlar bilan tanishtiradi. Bu tushunchalarni birga ishlatgan holda, talabalar yangi va hayajonli muhitda qiziqarli va zamonaviy dastur yaratish salohiyatiga ega bo‘ladilar.",
          "student_overview": "Lavadan saqlaning! Bu yerda siz Minecraft dunyosidagi shartli bayonotlar haqida o‘rgana boshlaysiz."
        },
        "express-2022/If/Else with Bee": {
          "name": "Asalari bilan If/Else",
          "overview": "Shu paytgacha talabalar har safar ishlatib ko‘rilganda aynan bir xil tarzda ijro etiladigan -ishonchli, ammo moslashuvchan bo‘lmagan kod yozib kelishayotgan edi. Bu darsda, sinfingiz dasturingiz turli xil maxsus holatlarga duch kelishiga qarab turli xil vazifalarni bajaradigan funksiyalarni yozishga imkon beradigan shartli boyonotlar bilan kod yozishni boshlashadi.",
          "student_overview": "Siz hozir shartli boyonotlarni tushunib oldingiz, endi asal va gul shirasini yig‘adigan Asalari dasturini tuzishda ulardan foydalansak bo‘ladi. "
        },
        "express-2022/While Loops in Farmer": {
          "name": "While Loops in Farmer",
          "student_overview": "Sikllar kod yozishda juda foydali. Bu dars sizga siklning yangi turini o‘rgatadi: while sikllari!"
        },
        "express-2022/Conditionals in Minecraft: Voyage Aquatic": {
          "name": "Minecraftda shartli bayonotlar: Suv sayohati",
          "overview": "Bu dars aslida, Minecraft jamoasi bilan birgalikda Hour of Code uchun yaratilgan. Talabalar shu paytgacha o‘rgangan g‘oyalarini amalda sinab ko‘rish, shuningdek, shartli bayonotlarning yashirin jihatlarini ko‘rib chiqish imkoniyatiga ham ega bo‘ladilar!",
          "preparation": "-   Sinfingiz uchun potentsial muammoli joylarni topish uchun ushbu dars bilan bog'liq jumboqlarni o'ynang.\n-   Har bir talabada Reflection Journal borligiga ishonch hosil qiling.",
          "purpose": "Ushbu jumboqlar to'plami ilmoqlar va shartlar haqidagi bilimlarni mustahkamlash va mustahkamlash uchun ishlaydi. Ushbu ikki tushunchani birlashtirib, talabalar yangi va qiziqarli muhitda qiziqarli va innovatsion dasturlarni yaratish imkoniyatlarini o'rganishlari mumkin.",
          "student_overview": "Bu yerda siz Minecreaft dunyosidagi shartli bayonotlar haqida o‘rganasiz."
        },
        "express-2022/Until Loops in Maze": {
          "name": "Until Loops in Maze",
          "overview": "Bu darsda, talabalar `until` sikllari haqida o‘rganishadi. Talabalar o‘zlari xohlagan nuqtagacha qaytarilaveradigan harakatlarni ijro etuvchi obrazga ega bo‘lgan dastur yaratishadi.",
          "preparation": "-   Sinfingiz uchun mumkin bo'lgan muammoli joylarni topish uchun jumboqlarni o'ynang.\n-   Har bir talabada Reflection Journal borligiga ishonch hosil qiling.",
          "purpose": "Ushbu jumboqlar to'plami shartligacha qo'shish orqali ilmoqlar haqidagi bilimlarni mustahkamlash va mustahkamlash uchun ishlaydi. Ushbu tushunchalarni birlashtirib, talabalar murakkab va innovatsion dasturlarni yaratish imkoniyatlarini o'rganishlari mumkin.",
          "student_overview": "`Until` sikli bilan siz ba’zi bir ajoyib narsalarni amalga oshira olasiz!"
        },
        "express-2022/Harvesting with Conditionals": {
          "name": "Harvesting with Conditionals",
          "overview": "Talabalar `while` sikllarini, `until` sikllarini va `if / else` bayonotlarini amalda ishlatib ko‘rishadi. Bu bo‘limlarning barchasi shartli bayonotlardan foydalanishadi. Bu uchchalasini ham amalda bajarib ko‘rish orqali, talabalar mukammal va moslashuvchan kod yozishni o‘rganishadi.",
          "preparation": "-   Sinfingiz uchun har qanday muammoli joylarni topish uchun dars davomida o'ynang.\n-   Har bir talabada Reflection Journal borligiga ishonch hosil qiling.",
          "purpose": "Shartli boyonotlardan foydalanishni turli xil ssenariylarda bajarib ko‘rish talabalarning shartli boyonotlar nima qila olishi haqidagi tushunchalarini rivojlantirishga yordam beradi. Oldingi darsda, talabalar shartli boyonotlardan faqatgina labirint bo‘ylab harakatlanish uchun foydalanishgan. Bu darsda, talabalar fermer hosilni qachon yig‘ib olinishi kerakligini bilishiga yordam berish uchun sharrtli boyonotlardan foydalanishadi. Yangi ko‘rinishlar paydo bo‘ladi va talabalar kod qayerda ishlatilishi va takrorlanishi kerakligini aniqlash uchun ijodiy va mantiqiy fikrlashdan foydalanishadi.",
          "student_overview": "Har bir shartli bayonotni qachon ishlatish kerakligini har doim ham aniq bilib bo‘lmaydi. Bu dars sizga nima qilish kerakligini hal qilishingizga yordam beradi."
        },
        "express-2022/Functions in Minecraft": {
          "name": "Minecraftdagi funksiyalar",
          "overview": "Students will begin to understand how functions can be helpful in this fun and interactive Minecraft adventure!",
          "preparation": "-   Sinfingiz uchun mumkin bo'lgan muammoli joylarni topish uchun jumboqlarni o'ynang.\n-   Har bir talabada Reflection Journal borligiga ishonch hosil qiling.",
          "purpose": "Talabalar turli xil muhitda funksiyalarni bajarish orqali dasturlashning ko'p qirraliligini kashf etadilar. Bu yerda talabalar qayta ishlatilishi mumkin bo'lgan naqshlarni tanib oladilar va oldindan belgilangan funksiyalarni chaqirish uchun nomlangan bloklarni birlashtira oladilar.",
          "student_overview": "Can you figure out how to use functions for the most efficient code?"
        },
        "express-2022/Functions with Harvester": {
          "name": "Terimchi bilan funksiyalar",
          "overview": "Talabalar Rassom loyihasida ta’sirchan dizaynlar yaratishni va Asalarini labirintda yo‘naltirishni mashq qilib ko‘rishgan, ammo bugun ular funksiyalardan dehqondagi hosilni yig‘ish uchun ishlatadilar. Bu dars talabalarni funksiyalardan 'while' sikli va 'if/else' bayononotlari bilan birlashtirgan holda foydalanishga undaydi.",
          "preparation": "-   Sinfingiz uchun mumkin bo'lgan muammoli joylarni topish uchun jumboqlarni o'ynang.\n-   Talabada Reflection Journal borligiga ishonch hosil qiling.",
          "purpose": "Ushbu dars o'quvchilarni funktsiyalardan ijodiyroq foydalanishga undash uchun mo'ljallangan. Talabalar muammoga yondashishning ko'plab usullari borligini bilib oladilar, ammo ba'zilari boshqalarga qaraganda samaraliroqdir. Ushbu boshqotirmalar muammoni hal qilish va tanqidiy fikrlash qobiliyatlarini oshirishga qaratilgan.",
          "student_overview": "Fermerga yordam berayotganingizda, funksiyalar sizni ko‘p ishlar qilishdan saqlab qoladi!"
        },
        "express-2022/Functions with Artist": {
          "name": "Rassom bilan funksiyalar",
          "overview": "Talabalar Rassom bilan funksiyalarni ishlatishga kirishadi. Jozibali rasmlar yaratiladi va o‘zgartiriladi. Yanada murakkabroq ko‘rinishlar uchun, talabalar biron funksiya ichida boshqa birini chaqirish orqali ichma-ich funksiyalar haqida o‘rganishadi.",
          "preparation": "-   Sinfingiz uchun mumkin bo'lgan muammoli joylarni topish uchun jumboqlarni o'ynang.\n-   Har bir talabada Reflection Journal borligiga ishonch hosil qiling.",
          "purpose": "Ushbu darsning eng muhim tarkibiy qismlaridan biri talabalarga ular bilan faxrlanadigan narsalarni yaratish uchun joy berishdir. Bu jumboqlar tobora murakkabroq tasvirlarga aylanadi, lekin har bir yangi jumboq faqat oldingi jumboqni yaratadi. Ushbu dars oxirida o'quvchilar o'zlarining mashaqqatli mehnatlari uchun ishonch va faxrlanishni his qilishadi.",
          "student_overview": "Funksiyalar bilan murakkab chizmalarni osonlashtiring!"
        },
        "express-2022/Text and Prompts": {
          "name": "Matn va takliflar",
          "overview": "Ushbu **malaka oshirish** darsida talabalar Sprite Lab-da o'zgaruvchilar bilan mashq qiladilar.",
          "preparation": "Darajalar bo'ylab o'ynang va dars slaydlarini ko'rib chiqing.",
          "purpose": "O'zgaruvchilar ushbu kursda ma'lumotlarni saqlash va o'zgartirish uchun ishlatiladi. Bu vaqtda o'quvchilar qiymatlarni o'zgartirmagan holda saqlash va olish bilan shug'ullanadilar. Keyingi darslarda talabalar raqamli qiymatlarni saqlaydi va vaqt o'tishi bilan o'yinchining o'yindagi balli kabi narsalarni kuzatib borish uchun ularni o'zgartiradi.",
          "student_overview": "Ushbu darsda siz Sprite Lab-da o'zgaruvchilar bilan mashq qilasiz."
        },
        "express-2022/[New] Counting with Variables": {
          "name": "O'zgaruvchilarni sanash",
          "overview": "Ushbu **malaka oshirish** darsida talabalar hisoblagich kabi vaqt o‘tishi bilan o‘zgarib turadigan qiymatni kuzatish uchun o‘zgaruvchilardan foydalanadilar. Ushbu darsda talabalar oddiy o'yin yaratadigan qisqa **mini-loyiha** ham mavjud.",
          "preparation": "Darajalar bo'yicha o'ynang va dars rejasini ko'rib chiqing.",
          "purpose": "Oldingi darslarda talabalar keyinroq olinishi mumkin bo'lgan ma'lumotlarni saqlash uchun o'zgaruvchilardan foydalanishni o'rganadilar. Ushbu darsda talabalar o'zgaruvchida saqlangan ma'lumotlarni o'zgartirishni o'rganishni boshlaydilar. O'zgaruvchilar qanday ishlashini tushunish, ularga yanada ilg'or loyihalarni yaratishga imkon beradi.",
          "student_overview": "Hisoblagich yaratish yoki o'yinda hisobni kuzatish uchun o'zgaruvchilardan foydalanishni o'rganasiz."
        },
        "express-2022/Using Variables with the Artist": {
          "overview": "Ushbu darsda talabalar Artist  muhitida o'zgaruvchilar yordamida takrorlanadigan dizaynlarni yaratishni o'rganadilar. Talabalar o'zgaruvchilar yordamida qanday qilib kodni yozishni va o'qishni osonlashtirish uchun qanday foydalanish mumkinligini bilib oladilar. Yonaltirilgan jumboqlar tugagandan  so'ng talabalar freeplay darajasida o'zlarining o'rgangan narsalarini namoyish etish va o'z dizaynlarini yaratishni o’rganadilar ",
          "purpose": "O'zgaruvchilar asosan dasturni ishga tushirishda noma'lum bo'lishi mumkin bo'lgan qiymatlarni yoki dasturni bajarish paytida o'zgarishi mumkin bo'lgan qiymatlarni to'ldiruvchidir. Bular dinamik kod yaratish uchun juda muhimdir, chunki ular sizning dasturingizni o'zgartirishga imkon beradi va har qanday potentsial modifikatsiyaga asoslangan holda o'sishi mumkin. Ushbu bosqich o'zgaruvchilarni ishlatishni kuchaytiradi, ularni o'rnatish va ulardan foydalanishning eng oddiy imkoniyatlaridan foydalanadi. ",
          "student_overview": "In this lesson, you'll make drawings using variables that change as the program runs."
        },
        "express-2022/Variables with the Bee": {
          "name": "Changing Variables with Bee",
          "overview": "This lesson will help illustrate how variables can make programs more powerful by allowing values to change while the code is running. ",
          "student_overview": "This bee loves variables!"
        },
        "express-2022/For Loops with Bee": {
          "name": "Asalari bilan for sikllari",
          "overview": "Featuring Bee, this lesson focuses on `for` loops and using an incrementing variable to solve more complicated puzzles. Students will begin by reviewing loops from previous lessons, then they'll walk through an introduction to `for` loops so they can more effectively solve complicated problems.",
          "student_overview": "Buzz buzz. Ushbu jumboqlarda siz asalarini for sikllari yordamida gul shirasi va asalga yo'naltirasiz."
        },
        "express-2022/For Loops with Artist": {
          "name": "Rassom bilan For Sikllarini ishlatish",
          "overview": "In this lesson, students continue to practice `for` loops, but this time with Artist. Students will complete puzzles combining the ideas of variables, loops, and `for` loops to create complex designs. At the end, they will have a chance to create their own art in a freeplay level.",
          "student_overview": "Keyingi asaringizni yaratishga tayyorlaning. Bu yerda siz 'for' sikllari yordamida hayratlantiruvchi rasmlarni yaratasiz."
        },
        "express-2022/End of Course Project": {
          "name": "End of Course Project",
          "overview": "Ushbu yakunlovchi dars o‘quvchilarni o‘zlarining loyihalarini loyihalashtirish, ishlab chiqish va namoyish etish jarayonidan o‘tadi!",
          "preparation": "-   Talabalar uchun mavjud bo'lgan ikkala loyiha vositalari bilan o'z loyihangizni yaratishga vaqt ajrating. Har bir vositaning imkoniyatlari va cheklovlari bilan tanishib chiqing.\n-   **\\*rubrikani** sinf maqsadlaringizga mos ravishda o'zgartiring va har bir talaba yoki guruh uchun bitta nusxani chop eting.\n-   **\\*loyihani rejalashtirish boʻyicha qoʻllanmani** sinfingizga mos keladigan tarzda oʻzgartiring va har bir talaba yoki guruh uchun bittadan chop eting.",
          "purpose": "Ushbu dars o'quvchilarga rejalashtirishni talab qiladigan bosqichma-bosqich jarayondan foydalangan holda o'z dizayni bo'yicha loyiha yaratish uchun joy beradi, lekin keng ijodkorlik uchun ham imkon beradi.",
          "student_overview": "Ushbu qo‘llarni bir dunyo kod yozish uchun tayyorlang! Loyihangizni yaratishni boshlashning vaqti keldi."
        },
        "coursec-2022/Putting a STOP to Online Meanness": {
          "student_overview": "Ushbu darsda siz ma'nosizlik haqida va agar Internetda duch kelganda nima qilish kerakligi haqida bilib olasiz."
        },
        "coursec-2022/My Robotic Friends Jr": {
          "name": "Mening robot do‘stlarim Jr.",
          "overview": "Ushbu **sozlash konteksti** darsida o‘quvchilar “robot”ga stakanlarni turli naqshlarda yigish uchun ko‘rsatma berish  belgilar to‘plamidan foydalanadilar. Talabalar navbatma-navbat robot sifatida qatnashadilar, faqat tengdoshlari tomonidan belgilangan algoritmga javob berishadi.",
          "preparation": "-   Har bir 2-3 o‘quvchidan iborat guruh uchun 20 ta qog‘oz stakan (yoki qog‘oz trapesiya) dastasini tayyorlang.\n-   Talabalar dars davomida murojaat qilishlari mumkin bo'lgan **\\*Symbol Key** dan belgilarni ko'rsating.\n-   (Ixtiyoriy) 2-3 nafar talabadan iborat guruhga bittadan **\\*Cup Stacking tartibga solish g‘oyalari**ni chop eting.",
          "purpose": "Bu tarmoqsiz olib boriladigan dars sinfni birgalikda jamoa bo‘lib biron oddiy vazifani bajarishga o‘rgatadi: stakanlarni maxsus dizaynda taxlash uchun biron \"robot\" dan foydalanishadi. Bu mashg‘ulot kurs davomida talabalar dasturlash bo‘yicha algoritmlarning aniqlikda bog‘langanlishlarining ahamiyatini o‘zlashtirish uchun poydevor yaratadi.",
          "student_overview": "In this lesson, you'll pretend your classmates are robots and program them to build patterns of stacked cups."
        },
        "coursec-2022/Programming with Angry Birds": {
          "name": "Jahldor qushlar bilan dasturlash",
          "overview": "Jahldor qushlar o‘yinidagi obrazlardan foydalanib, talabalar qushni labirintning bir tomonidan boshqa tomonidagi cho‘chqaga qaratib harakatlantirish uchun ketma-ket algoritmlarni tuzib chiqadilar. Buni qilish uchun ular to‘g‘riga, chapga va keyin o‘ngga harakatlanadigan qilib kod bo‘limlarini chiziqli ketma-ketlikda taxlab chiqishadi.",
          "preparation": "-   Sinfingiz da paydo bo'lgan muammolarni topish uchun jumboqlarni yeching.\n-   (ixtiyoriy) Sinfingiz bilan hal qilish uchun bir juft jumboq tanlang.",
          "purpose": "Bu darsda, talabalar biron komputer platformasida o‘zlarining debug qilish va dasturlash mahoratlarini oshiradilar. Bu boshqotirmalarning bo‘limlarga asoslangan shakli talabalarga sintaksisni mukammallashtirish haqida o‘ylamasdan ketma-ketlik va tushunchalar haqida o‘rganishga yordam beradi.",
          "student_overview": "Angry Birds bilan ketma-ketlik va algoritmlar haqida o‘rganing."
        },
        "coursec-2022/Debugging in Maze": {
          "name": "Debugging in Maze",
          "overview": "Debug qilish dasturlashni o‘rganishning muhim elementidir. Bu darsda, talabalar noto‘g‘ri yechilgan boshqotirmalarga duch kelishadi. Ular xatolikni topish uchun mavjud kodni qatorma-qator tekshirib chiqishadi, jumladan, noto‘g‘ri ishlatilgan sikllar, unutib qoldirilgan bo‘limlar, ortiqcha bo‘limlar va tartibdan tashqaridagi bo‘limlarni.",
          "preparation": "-   Sinfingizda paydo bo'lgan muammolarni topish uchun jumboqlarni yeching.\n-   (ixtiyoriy) Sinfingiz bilan hal qilish uchun bir juft jumboq tanlang.\n-   Umumiy ko'rinish **\\*CS asoslari asosiy dars maslahatlari - Dars bo'yicha takliflar**\n-   Har bir o'quvchining o'ylashi uchun kundaligi borligiga ishonch hosil qiling.",
          "student_overview": "Boshqotirmalardagi muammolarni toping va debug qilish mahoratingizni amalda sinab ko‘ring."
        },
        "coursec-2022/Collecting Treasure with Laurel": {
          "name": "Laurel bilan xazina yig‘ish",
          "overview": "Boshqotirmalar to‘plamida, talabalar algoritmlar va debug qilish bo‘yicha o‘zlarining tushunchalarini rivojlantirishda davom etishadi. Yangi obraz, sarguzashtchi Laurel bilan talabalar Laurelni u yo‘lak bo‘ylab harakatlanganda xazinalar cho‘qqisiga olib chiqish uchun algoritmlar ketma-ketligini yaratishadi.",
          "preparation": "-   Sinfingizda paydo bo'lgan muammolarni yechish uchun jumboqlarni yeching",
          "student_overview": "Sarguzashtchi Laurelga ko‘plab marvaridlar yig‘ishda yordam berish uchun algoritm yozing!"
        },
        "coursec-2022/Creating Art with Code": {
          "name": "Kod bilan san’at yaratish",
          "overview": "Bu darsda talabalar ekrandagi chizmalarni tugatish uchun Rassomni boshqarishadi. Bu Rassom bosqichi talabalarga yangi bo‘limlar, masalan, `move forward by 100 pixels` va `turn right by 90 degrees` kabilardan foydalangan holda yuqori mukammallikdagi rasmlar yaratish imkonini beradi.",
          "purpose": "Talabalar oldingi tajribalarini ketma-ketlik bilan boshlagan bo‘lsa, bu dars kod yozishni ko‘proq ijodkorlik bilan ilhomlantirish uchun ishlaydi. Bu darsning maqsadi yangi bo‘limlar va maqsadlarni tanishtirish orqali ketma-ketlik bo‘yicha bilimlarni mustahkamlash uchun. Bu holda, talabalar hamon o‘zlarining ketma-ketlik bo‘yicha ko‘nikmalarini amalda sinash bilan bir vaqtda yangi bo‘limlardan foydalanib, ko‘proq piksellar va burchaklar haqida ham o‘rganishadi. Shuningdek, talabalar yangi maqsadlar, masalan, biron kvadrat chizish uchun ushbu San’atkorni kodini yozishni tasavvur qilishga qodir bo‘ladi.",
          "student_overview": "Rassomni dasturlash orqali chiroyli rasmlar yarating."
        },
        "coursec-2022/My Loopy Robotic Friends Jr": {
          "name": "Mening sikllashtirilgan robot do‘stlarim Jr.",
          "overview": "\"Mening Robot Do‘stlarim\" mashg‘ulotiga asoslangan holda, talabalar kattaroq va yanada mukammalroq dizaynlarni ham yecha olishadi. Bu mukammalroq dizaynlarni yaratish jarayonida o‘z robotlarini dasturlash maqsadida talabalar o‘z ko‘rsatmalaridagi biron sikl bilan almashtirsa bo‘ladigan takrorlanuvchi ko‘rinishlarni aniqlashi kerak bo‘ladi.",
          "preparation": "-   Har bir 4 nafar o‘quvchidan iborat guruh uchun 20 ta qog‘oz stakan (yoki **\\*qog‘oz trapesiya**)dan iborat to‘plam tayyorlang.\n-   Talabalar dars davomida murojaat qilishlari mumkin bo'lgan **\\*belgilarni** ko'rsating.\n-   (Ixtiyoriy) 4 nafar talabadan iborat guruhga bittadan **\\*Tartibga solish g‘oyalari**ni chop eting.",
          "purpose": "Bu dars hozirda tanish bo'lgan \"robot \" dasturlash ko'rsatmalaridan foydalangan holda sikllar uchun qayta tanishtiruv sifatida xizmat qiladi. Talabalar sinfdoshlarining harakatlaridagi takrorlanuvchi ko‘rinishlarni izlash va sikllardan foydalanib ushbu takroriy ko‘rinishlarni qanday soddalashtirsh orqali tanqidiy fikrlash mahoratlarini rivojlantiradilar.",
          "student_overview": "In this lesson, you'll program your classmates again, but using loops you'll be able to solve bigger and more complicated problems."
        },
        "coursec-2022/Loops with Rey and BB-8": {
          "name": "Loops with Rey and BB-8",
          "overview": "\"Getting loopy\"dagi takrorlanuvchi ko‘rsatmalar tushunchalari asosida yaratilib, bu bosqichda talabalar BB-8ga labirintdan oldingiga qaraganda samaraliroq o‘tishiga yordam berish uchun sikllardan foydalanishadi.",
          "preparation": "-   Sinfingizda paydo bo'lgan muammolarni yechish uchun jumboqlarni toping.",
          "student_overview": "Sikllardan foydalanib BB-8 ga labirint bo‘ylab harakatlanishida yordam bering! "
        },
        "coursec-2022/Harvesting Crops with Loops": {
          "name": "Harvesting Crops with Loops",
          "student_overview": "Keling, dehqonga ba’zi sabzavotlarni yig‘ishda sikllardan foydalanib yordam beramiz!"
        },
        "coursec-2022/Mini-Project: Sticker Art": {
          "preparation": "-   O'z dizayningizni yaratishda mashq qiling. Bu darajalar avvalgilaridan qanday farq qilishiga e'tibor bering.",
          "purpose": "Bu to‘plamlar sikllarning ahammiyatini yaratuvchan va shaxsiy dizaynlar bilan ta’kidlab ko‘rsatadi.\n\n Loyiha ortidagi ketma-ketlik sifatida taklif qilinib, bu o‘sish talabalarga o‘z ishining ustasi bo‘lishga va ajoyib asarlar yaratishga imkon beradi.",
          "student_overview": "In this lesson, loops make it easy to make even cooler images with Artist!"
        },
        "coursec-2022/The Big Event": {
          "name": "Katta hodisa",
          "overview": "Talabalar tez orada hodisalar oldindan yozib qo‘yilgan algoritmlarga qulaylik qo‘shishning eng yaxshi yo‘li ekanligini bilib olishadi. Ba’zida siz dasturingiz foydalanuvchi aynan xohlagan paytda unga javob qaytarishini xohlaysiz. Hodisalar dasturingizni yanada qiziqarli va interfaol qiladi.",
          "preparation": "-   Chop etish yoki ko'rsatish **\\*Voqealar boshqaruvchisi**.\n-   Har bir talaba uchun bitta **\\*baho** chop eting.",
          "student_overview": "Hodisalar haqida o‘rganish uchun biron qiziqarli o‘yin o‘ynang."
        },
        "coursec-2022/Build a Flappy Game": {
          "name": "Build a Flappy Game",
          "overview": "Bu maxsus bosqichda, talabalar obyektlar to‘qnashuvi va sichqoncha bosilishini taniy oladigan hodisa tinglovchilaridan foydalangan holda o‘zlarining Flappy Bird o‘yinini yaratishadi. Bu bosqichning oxirida talabalar tasvirlar yoki qoidalarni o‘zgartirgan holda o‘z o‘yinlarini yarata oladilar.",
          "student_overview": "O‘zingizning Flappy Bird o‘yiningizni yarating, agar xohlasangiz keyin uni do‘stlaringiz bilan ulashishingiz mumkin!"
        },
        "coursec-2022/Mini-Project: Chase Game": {
          "overview": "Bu onlayn mashg‘ulotda, talabalalarda Play Labda hodisalardan qanday foydalanishni o‘rganishga va biron animatsiyalashtirilgan o‘yin yaratish uchun ular o‘rgangan barcha ko‘nikmalarini qo‘llab ko‘rishga imkoniyat bo‘ladi. Yaratuvchan bo‘lishning vaqti keldi! Play Labda o‘yin yarating!",
          "purpose": "Mana bu yerda, talabalar Play Labdan foydalangan holda o‘zlarining hodisalar haqidagi tushunchalarini rivojlantiradilar. Talabalar obrazlarni ekran bo‘ylab harakatlantirishda, shovqin solishda va foydalanuvchining kiritgan ma’lumotiga asoslanib orqa fonni o‘zgartirishda hodisalardan foydalanishadi. ",
          "student_overview": "Yaratuvchan bo‘lishning ayni vaqti va Play Labda biron o‘yin yarating!"
        },
        "coursec-2022/Picturing Data": {
          "name": "Ma'lumotlarni tasvirlash",
          "overview": "Ushbu ma'lumotlardan o‘quvchilarga o‘z dunyolarini tushunishda va qiziqarli savollarga javob berishda foydalanish mumkin. Ushbu darsda o‘quvchilar Play Lab loyihasidan ma'lumotlarni olishadi va ularni turli xil grafik ko‘rinishlarda vizuallashtirishadi.",
          "student_overview": "Ushbu ma'lumotlardan o‘quvchilarga o‘z dunyolarini tushunishda va qiziqarli savollarga javob berishda foydalanish mumkin. Ushbu darsda o‘quvchilar Play Lab loyihasidan ma'lumotlarni olishadi va ularni turli xil grafik ko‘rinishlarda vizuallashtirishadi."
        },
        "coursec-2022/Binary Bracelets": {
          "name": "Ikkilik bilakuzuklar",
          "overview": "Ikkilik sanoq tizimi komputerlar dunyosida juda muhim ahamiyatga ega. Bugungi kunda, komputerlarning ko‘pchiligi barcha turdagi ma’lumotni ikkilik ko‘rinishida saqlaydi. Bu dars haqiqiy hayotdan nimadirni olib uni birlar va nollar to‘plamiga tarjima qilishni ko‘rsatishga yordam beradi.",
          "student_overview": "O‘zingizning ikkilik bilakuzugingizni yarating va komputerlar qanday qilib ma’lumotni eslab qolishini o‘rganing!"
        },
        "coursec-2022/End of Course Project": {
          "name": "End of Course Project",
          "overview": "Ushbu yakunlovchi dars o‘quvchilarni o‘z Play Lab loyihalarini loyihalashtirish, ishlab chiqish va namoyish etish jarayonidan o‘tadi! Ushbu jarayon muammosiz o‘tishini ta'minlash uchun biz o‘quvchilarga qog‘ozda rejalashtirishdan boshlab veb-saytimizdagi kodlashgacha bosqichma-bosqich o‘tish tuzilmasini ta'minladik. Bundan tashqari, biz o'qituvchilarga taqdimotli finalni engillashtirishda yordam beradigan g'oyalarni taklif etamiz! ",
          "student_overview": "Ushbu qo‘llarni bir dunyo kod yozish uchun tayyorlang! Loyihangizni yaratishni boshlashning vaqti keldi."
        }
      }
    }
  }
}