{
  "es-MX": {
    "data": {
      "objectives": {
        "078fec6a-9fc8-4d1c-be3b-145bbe8c44c9": {
          "description": "Escoger la mejor forma de representar la información en función de su uso."
        },
        "9cd5c970-3a55-4940-958d-61605147d5c2": {
          "description": "Brindar ejemplos de cómo las distintas formas de representar los datos puede afectar la forma en cómo se resuelven los problemas."
        },
        "0d580f25-ee71-432a-8b69-7349fa960674": {
          "description": "Describir las características necesarias de un sistema para representar la información."
        },
        "ffc8e923-dff2-40b1-8b1d-f0a09ab29a62": {
          "description": "Crear y utilizar un sistema para representar información."
        },
        "d3b5237e-6e10-4047-be27-c0cd12d356aa": {
          "description": "Definir un sistema binario como uno que utiliza dos estados posibles para representar información"
        },
        "d77690f8-afd2-4ca0-9be0-3ed08c2bdd1d": {
          "description": "Utilizar el sistema ASCII para codificar y decodificar información de texto en sistema binario"
        },
        "74b683c5-113c-4d05-9da5-38329409e4f9": {
          "description": "Describir características comunes de los sistemas utilizados para representar información en binario"
        },
        "c86aff12-2dbd-49dd-9b2c-1533d2b6b67d": {
          "description": "Crear y manipular patrones binarios para representar imágenes en blanco y negro"
        },
        "ba4227d1-66ee-4d5d-a9dd-bebbf43088eb": {
          "description": "Extender un sistema de representación basado en patrones."
        },
        "d658e76c-fefe-4d39-a6de-f3226d759b35": {
          "description": "Utilizar un sistema binario para representar números."
        },
        "0fa20ec4-0324-43f0-9258-a26552fe029e": {
          "description": "Determinar el sistema de codificación más apropiado para una determinada pieza de información. "
        },
        "3af536f4-0410-4a24-827f-d97d292f7e7b": {
          "description": "Utilizar múltiples sistemas binarios para decodificar la información."
        },
        "37c70730-7a01-444c-9652-c7977d5545ca": {
          "description": "Aplicar métodos de encriptación para garantizar el traspaso seguro de datos."
        },
        "8f275062-9b81-4771-b7be-bae454b7d673": {
          "description": "Describir las razones por las cuales el encriptado es necesario para proteger datos personales"
        },
        "ade3062a-fb55-40e3-937d-e6060b55b9ed": {
          "description": "Codificar y decodificar información representada en números binarios y texto ASCII"
        },
        "b2f72fa5-d58c-4d89-bc49-3b03872eeaf6": {
          "description": "Escoger y justificar el uso de distintos sistemas de representación binaria dependiendo de la información que esté siendo representada"
        },
        "e26a79b0-b4bf-4341-88b5-4bf959cd3ffc": {
          "description": "Crear un sistema de representación generalizado para una variedad de instancias de un tipo de información compleja"
        },
        "1d4673ca-199b-46a4-84a7-656b123b00d3": {
          "description": "Utilizar datos para sacar conclusiones."
        },
        "4ecdb927-3f50-4cae-a8b5-43e5cb6d594c": {
          "description": "Usar el proceso de resolución de problemas para responder una pregunta utilizando datos."
        },
        "559a197c-3703-47ac-b7a7-76ea51af2c9f": {
          "description": "Identificar y recolectar datos relevantes para ayudar a resolver el problema."
        },
        "d472eb7c-0cf3-4772-9597-5f80e2a1e57d": {
          "description": "Identificar y eliminar datos irrelevantes de un conjunto de datos."
        },
        "ecae7b1f-43e4-49d3-8b7f-4949c2279978": {
          "description": "Crear un gráfico de barras basado en un conjunto de datos."
        },
        "fb8a7a54-344f-4990-b622-9c7d312d5ae9": {
          "description": "Explicar por qué un conjunto de datos debe limpiarse antes de que una computadora pueda utilizarlo."
        },
        "bc5753cb-a584-452e-8a07-a6df74b2b3d8": {
          "description": "Utilizar tabulación cruzada para encontrar patrones y relaciones en los datos"
        },
        "f1234be5-c0ff-4acd-b223-b2e37e10d93b": {
          "description": "Organizar datos visualmente para destacar las relaciones y respaldar una declaración."
        },
        "6b598741-bb69-4f2e-b101-d9b7d8c23054": {
          "description": "Utilizar tablas y visualizaciones que resuman los datos para respaldar una decisión"
        },
        "81cbe752-e505-4226-875f-a03ab4671fd7": {
          "description": "Identificar datos adicionales que pueden ser recolectados para mejorar una decisión"
        },
        "1f2032fb-aef8-4f29-9e73-cb39ae0b7753": {
          "description": "Diseñar e implementar un algoritmo para tomar decisiones utilizando datos como entradas."
        },
        "7ae34966-a319-42bc-8e4f-dca8a5beabe3": {
          "description": "Interpretar datos recolectados para identificar patrones"
        },
        "a64a27fc-47e4-4320-9506-7f8d3d23821d": {
          "description": "Explicar las ventajas y desventajas de utilizar computadoras para la toma de decisiones automática."
        },
        "21f43f7a-5166-4972-9076-1a0e9dd75258": {
          "description": "Determinar datos que pueden ser útiles para resolver un problema y cómo esos datos pueden ser recolectados."
        },
        "979f3a49-ce48-440b-8dc4-4f0a478cd962": {
          "description": "Distinguir entre datos que los usuarios aportaron ya sea voluntaria o involuntariamente."
        },
        "eca67119-27ce-42b2-8e6e-d7bc14095248": {
          "description": "Dar ejemplos de cómo se recolectan los datos por sensores y seguimiento de comportamientos de usuario."
        },
        "214e78cd-feb0-4235-a076-0fe81d14d95a": {
          "description": "Entrena y prueba un modelo de aprendizaje automático."
        },
        "db7f5c46-7cbc-477f-a325-dac7168fd719": {
          "description": "Piensa acerca de cómo el prejuicio humano juega un papel en el aprendizaje automático."
        },
        "1380eb65-627f-46bd-9d89-e1d75dfc45b7": {
          "description": "Aplicar el proceso de Resolución de Problemas de datos a un tema de relevancia personal"
        },
        "5e1cfa5a-c056-4b90-b2b8-886263dab73b": {
          "description": "Determinar las fuentes de datos apropiadas que necesitarán para resolver un problema"
        },
        "216cb133-b606-43be-adb9-6cf77faa357f": {
          "description": "Identificar cómo se utilizan las ciencias de la computación en el ámbito del entretenimiento"
        },
        "39ea0ee9-0bed-4684-b37f-78fb7585a784": {
          "description": "Expresar cómo dibujar una imagen en el Game Lab, tomando en cuenta la posición de la forma, el color y el orden"
        },
        "772d2b7c-9863-42d1-8eb6-ec0520b19441": {
          "description": "Razonar acerca de las ubicaciones en la cuadrícula de coordenadas del Game Lab"
        },
        "530ec96a-34f8-4ebd-9ba3-13c2ba0926cd": {
          "description": "Secuenciar el código correctamente para sobreponer las formas."
        },
        "a2eaee21-e82f-4b0d-aae4-dc6ebc2280c0": {
          "description": "Usar un sistema de coordenadas para ubicar elementos en la pantalla."
        },
        "43fc52a2-e27f-40b0-8b9b-77f757f6f764": {
          "description": "Usar y analizar comandos de dibujo con parámetros múltiples."
        },
        "9d3158aa-110b-43d2-89c9-6510524bd9bb": {
          "description": "Identificar una variable como una forma de etiquetar y referenciar un valor en un programa"
        },
        "c25b3f0d-dcfb-415a-a97f-89b4e89311a5": {
          "description": "Usar variables en un programa para almacenar información que pueda utilizarse varias veces"
        },
        "1a871ec6-8ec4-4a65-b036-2482e0b07269": {
          "description": "Actualizar un valor almacenado en una variable"
        },
        "8de745f1-fb9a-4fc6-b98b-dc2806d7f4f2": {
          "description": "Generar y utilizar números aleatorios en un programa"
        },
        "f94d8eca-cf05-40a8-acf0-8c5b1ed3868f": {
          "description": "Crear y utilizar un sprite"
        },
        "9d865e75-6b5a-43d4-a145-17de9aee4ad3": {
          "description": "Utiliza la notación de puntos para actualizar las propiedades de un sprite."
        },
        "411f894a-c802-41df-822e-41c4b8dd9a9d": {
          "description": "Coloca el texto en la pantalla usando un plano de coordenadas."
        },
        "72496109-18f7-4a09-84eb-3aabcc22ae92": {
          "description": "Utilizar argumentos para controlar el texto que se muestra en la pantalla."
        },
        "36566c25-03d9-4b33-9269-bf4155649445": {
          "description": "Utilizar un proceso estructurado para planificar y desarrollar un programa."
        },
        "b18a4c06-e791-4aed-8ce9-8373bdfb8352": {
          "description": "Explicar cómo el ciclo de dibujo permite la creación de animaciones en el Game Lab"
        },
        "f792a4b7-46e7-4887-871b-bf2f921bc44d": {
          "description": "Utilizar el ciclo de dibujo en conjunto con el comando de números aleatorios randomNumber(), formas, y sprites para elaborar animaciones simples."
        },
        "12844473-89b5-4157-82c2-801b4aca52fb": {
          "description": "Identificar qué propiedades de sprite deberían cambiarse, y de qué manera, para lograr un movimiento específico"
        },
        "2ad3c9f2-28d0-461b-8a75-15b8a69d2f53": {
          "description": "Utilizar el patrón de contador para incrementar o reducir las propiedades de los sprite"
        },
        "522df320-9b1b-42e5-b997-09f45759d2d3": {
          "description": "Utilizar condicionales para reaccionar a los cambios en las variables y propiedades de sprite"
        },
        "b96eecbc-f152-4b13-87bb-5c2bd71bafcf": {
          "description": "Mover sprites en respuesta a la entrada de teclado"
        },
        "e1012bc2-2e9b-4066-9ec8-b1c2a10c72e0": {
          "description": "Utilizar condicionales para reaccionar a la entrada de teclado"
        },
        "154510cf-774c-49e2-ac44-97f8b358f987": {
          "description": "Responder a varios tipos de entrada de usuario."
        },
        "d104dffd-48d0-491e-813e-6d2867de294f": {
          "description": "Utilizar una sentencia if-else para controlar el flujo del programa."
        },
        "98ef15a4-cec5-4410-941f-e493978cbdb2": {
          "description": "Utilizar las condicionales para reaccionar a las entradas de teclado o a los cambios en las variables o propiedades"
        },
        "a92a3ce6-e432-4a5e-a484-5f4ca110b2b5": {
          "description": "Aplicar un patrón iterador a las variables o propiedades en un ciclo"
        },
        "ecd2dd66-5ac2-4cba-a3db-e86eeb93644f": {
          "description": "Secuenciar comandos para dibujar en un orden correcto"
        },
        "0a362b6b-eb99-4648-abaf-609f15ac0948": {
          "description": "Utilizar los bloques de velocidad y la velocidad de rotación para crear y cambiar los movimientos de un sprite."
        },
        "561329f0-2d51-44e0-a761-89467f39b783": {
          "description": "Describir las ventajas y desventajas de simplificar el código utilizando los bloques de alto nivel"
        },
        "111ced6d-7a03-4f25-bc84-e9ea52a15f4f": {
          "description": "Detectar cuándo los sprites se tocan o superponen y cambian el programa en respuesta. "
        },
        "7b9ca082-7b03-4e09-b0bf-d33a70502d6a": {
          "description": "Describir cómo las abstracciones ayudan a gestionar la complejidad del código"
        },
        "4ab9fb5b-e4f9-402c-87fd-f8c67e95f854": {
          "description": "Explicar cómo las construcciones de programación individuales pueden combinarse para crear comportamientos más complejos"
        },
        "8291b013-88a0-4bcf-8815-dcd127b899f8": {
          "description": "Utilizar la velocidad de un sprite con el patrón de contador para crear distintos tipos de movimientos."
        },
        "3655a84f-baf8-4feb-8296-a45434158ef4": {
          "description": "Modelar distintos tipos de interacciones entre sprites."
        },
        "8a256d5f-e9c0-4f08-96be-6ce4acffadfc": {
          "description": "Describir cómo las abstracciones pueden construirse para desarrollar nuevas abstracciones"
        },
        "6937cac3-eee0-4c3c-9fdc-49a7378013c2": {
          "description": "Crear y utilizar funciones para bloques de código que realicen una sola tarea de alto nivel dentro de un programa."
        },
        "c5133459-f185-40c2-ab71-fae84e1044ad": {
          "description": "Explicar las ventajas de utilizar funciones en un programa"
        },
        "ce0887ae-3904-4475-9d03-923199a851b1": {
          "description": "Explicar de qué forma las funciones permiten a los programadores razonar sobre un programa en un alto nivel"
        },
        "13503201-2764-45e3-b644-2f5fd993f710": {
          "description": "Implementar distintas funciones de un programa siguiendo una guía de proyecto estructurada"
        },
        "149a90c7-273f-4c73-8273-2799340bf90d": {
          "description": " Implementar distintas funciones de un programa siguiendo una guía de proyecto estructurada."
        },
        "be3ca496-7d99-4db9-8ca3-2844688ce210": {
          "description": "Identificar las principales construcciones necesarias para construir distintos componentes de un juego"
        },
        "15bd7a23-5d71-46fc-9534-112241fcb7c4": {
          "description": "Implementar un plan para crear una pieza de software"
        },
        "1a615e1a-3506-461f-ae16-433abddd2fa4": {
          "description": "Explorar las características de una pieza de programa de forma independiente."
        },
        "24b3d2c9-3a7b-4232-80fa-8272f0bfd7fb": {
          "description": "Crear un plan para construir una pieza de software describiendo sus componentes principales"
        },
        "f7ff9c67-ed9a-40c2-8082-1ebb78dae095": {
          "description": "Identificar las innovaciones en computación dentro de un ámbito específico"
        },
        "494a4afe-5479-4e4f-b656-99ddc4781740": {
          "description": "Expresar las entradas y salidas posibles de un artefacto determinado"
        },
        "c06e8dad-fa68-43cd-a53a-ed66bd90cee4": {
          "description": "Sugerir mejoras para ayudar al artefacto a solucionar mejor un problema específico"
        },
        "a49c45e6-6dd1-4a47-8b8b-23f63139beef": {
          "description": "Establecer las propiedades de los elementos de interfaz de usuario utilizando código"
        },
        "04724c46-add4-4ec1-af15-4c44eed0a91b": {
          "description": "Responder a la entrada de usuario utilizando un controlador de eventos"
        },
        "8902d86e-40fd-47c8-92d0-c4a9b766f913": {
          "description": "Escribir programas que cambian los distintos elementos en una sola pantalla en lugar de cambiar pantallas"
        },
        "61fb8052-ffea-4adf-a134-8d730ad54e8b": {
          "description": "Conectar y resolver problemas de dispositivos externos"
        },
        "d69128fd-98d6-4897-966d-76362dbaf0ac": {
          "description": "Encender y apagar un LED utilizando código"
        },
        "617e327c-d4cc-4b6e-b456-7233bb9c845b": {
          "description": "Usar código para controlar un dispositivo físico"
        },
        "2b306542-728e-4848-a27f-c0521831a6f4": {
          "description": "Comparar y contrastar las distintas formas de recibir entradas"
        },
        "c10da89e-729b-4d0f-b376-3e14e931b870": {
          "description": "Modelar distintos métodos para recibir entradas de usuario"
        },
        "37fbfc3d-4e38-4c1c-86bc-6fe3342ba7ff": {
          "description": "Acoplar un controlador de eventos a una entrada de hardware"
        },
        "809dcd9a-f37c-4bfd-9b58-b4024c4fd2ec": {
          "description": "Escoger el evento apropiado para un escenario determinado"
        },
        "21ba6c31-018e-4d23-b652-77d6ef65324d": {
          "description": "Utilizar getters para acceder a las propiedades de elementos en un sistema"
        },
        "bdd6a1a3-5115-4486-8e0e-b61c7041c5ce": {
          "description": "Desarrollar programas que respondan a una entrada análoga"
        },
        "bf9edfe9-1d42-4a71-a6e5-3cda32406544": {
          "description": "Escalar un rango de números para satisfacer una necesidad específica"
        },
        "5b183dd0-2691-4e31-81d2-74139e335e46": {
          "description": "Representar el valor de un sensor de distintas maneras"
        },
        "52c81204-19e3-433f-a6f2-9c7342c37b72": {
          "description": "Implementar distintas funciones de un programa siguiendo una guía de proyecto estructurada"
        },
        "828e50ab-ef2c-41af-987d-6a2c97c0eeda": {
          "description": "Desarrollar un programa que responda a los eventos de la entrada de un hardware"
        },
        "5e15877a-55c0-434e-b794-1277ca716016": {
          "description": "Crear una función que utilice parámetros para generalizar comportamiento"
        },
        "ae74915c-b485-44a1-a60b-a4051c1abca7": {
          "description": "Utilizar controladores de eventos para responder a la interacción del usuario"
        },
        "a36af5cd-1af2-482c-8475-ebd96ef5ebf9": {
          "description": "Diseñar una pieza de software que utilice hardware para las entradas y salidas no tradicionales"
        },
        "84079c5a-326d-4fda-9439-acd6478673b3": {
          "description": "Elaborar el prototipo de un programa que incluya software y hardware"
        },
        "34585635-155a-4032-b653-6cfaa0832b7e": {
          "description": "Acceder a un elemento en un arreglo utilizando su índice"
        },
        "57704d64-7732-445a-a82a-81f3b6955df8": {
          "description": "Usar el arreglo de LED de colores para controlar cada LED de color individualmente"
        },
        "5f30c244-1a5b-4db9-87bf-71b0e651d2f1": {
          "description": "Crear y modificar un arreglo"
        },
        "f739947f-be77-462b-b0ef-3823349016ef": {
          "description": "Utilizar el timbre para elaborar secuencias de notas"
        },
        "4449a257-a6e6-426f-a87b-a1ef39ea777f": {
          "description": "Reconocer un arreglo como una lista de elementos que pueden funcionar de manera secuencial."
        },
        "8a9102e9-704c-452b-b063-62f6b63d2627": {
          "description": "Modificar la condición de salida de un ciclo for para controlar la cantidad de veces que se repite"
        },
        "bb5539ee-e0af-4379-9179-2bebc947c741": {
          "description": "Utilizar un ciclo for para repetir sobre un arreglo"
        },
        "eb28a603-8753-4a84-ad3e-fe5566c8ee76": {
          "description": "Reconocer el uso y la necesidad de la orientación proporcionada por un acelerómetro (inclinación y balanceo)."
        },
        "cbd66e36-6a02-4227-8674-70636d61b455": {
          "description": "Utilizar los datos de eventos para actualizar continuamente las propiedades de un elemento."
        },
        "6db0b0d2-7aa7-4da1-aa47-33581d3b7c8f": {
          "description": "Utilizar parámetros para generalizar el propósito de una función."
        },
        "14b8c405-027c-4aa5-8a31-235dfc98dcc3": {
          "description": "Crear y depurar circuitos simples"
        },
        "f81a856f-07a6-49f0-aab0-f3c6da5d125b": {
          "description": "Desarrollar un prototipo interactivo físico que combine software y hardware"
        },
        "cb58f0fd-2266-48fa-80b7-f584aabbd19a": {
          "description": "Considerar las necesidades de distintos usuarios al diseñar un producto"
        },
        "f574312e-c0f6-4d4c-a52a-10e2874d55ba": {
          "description": "Explorar las características de una pieza de programa de forma independiente."
        },
        "46a593f4-3334-477c-9bac-f1fa12e83979": {
          "description": "Construir el prototipo de un dispositivo computacional físico"
        },
        "5ae2739b-3776-43ba-973f-50fa22302e32": {
          "description": "Implementar un plan para desarrollar una pieza de software que integre las entradas y salidas de hardware"
        },
        "11f42eed-8c8c-4fca-b3ff-8bb800a8fbcd": {
          "description": "Brindar ejemplos de cómo las distintas formas de representar los datos puede afectar la forma en cómo se resuelven los problemas."
        },
        "5d843877-4608-49b0-a6a5-c33fdab204ba": {
          "description": "Escoger la mejor forma de representar la información en función de su uso."
        },
        "80e00862-0fe7-44a4-9e0c-785e6674f0e5": {
          "description": "Describir las características necesarias de un sistema para representar la información."
        },
        "19b5be99-7f7e-42e1-9ce4-6e53d7361d35": {
          "description": "Crear y utilizar un sistema para representar información."
        },
        "6ad62a76-15c2-4ee6-812b-89426ccbaf53": {
          "description": "Definir un sistema binario como uno que utiliza dos estados posibles para representar información"
        },
        "314c3d2c-32d4-4b31-a7b7-bc848001a0ef": {
          "description": "Utilizar el sistema ASCII para codificar y decodificar información de texto en sistema binario"
        },
        "a4a38d49-6a85-4c4e-9e9f-b589bc00b61a": {
          "description": "Crear y manipular patrones binarios para representar imágenes en blanco y negro"
        },
        "607265dd-c7c2-4ef7-bb9d-ea8026f769e3": {
          "description": "Describir características comunes de los sistemas utilizados para representar información en binario"
        },
        "3a37860e-7f85-4921-a622-4c0435783261": {
          "description": "Utilizar un sistema binario para representar números."
        },
        "bddab4e2-74ad-4394-8180-11dde4ab88f9": {
          "description": "Extender un sistema de representación basado en patrones."
        },
        "572e2633-ed9c-4957-9399-4cdd236c9da9": {
          "description": "Utilizar múltiples sistemas binarios para decodificar la información."
        },
        "7db30b84-9106-4f12-9a6b-3d4119423ec7": {
          "description": "Determinar el sistema de codificación más apropiado para una determinada pieza de información. "
        },
        "1eceabc4-6a94-4939-bdb3-a1084c6e6aa4": {
          "description": "Describir las razones por las cuales el encriptado es necesario para proteger datos personales"
        },
        "42021a55-c97c-432b-9420-a62927cc2bba": {
          "description": "Aplicar métodos de encriptación para garantizar el traspaso seguro de datos."
        },
        "e537dea9-f777-4037-8c48-d20298ba53b2": {
          "description": "Escoger y justificar el uso de distintos sistemas de representación binaria dependiendo de la información que esté siendo representada"
        },
        "e4ff5379-6af0-43ba-8611-535630489148": {
          "description": "Codificar y decodificar información representada en números binarios y texto ASCII"
        },
        "8f1a62d6-c1b7-400f-9324-3f7cf5cecc72": {
          "description": "Crear un sistema de representación generalizado para una variedad de instancias de un tipo de información compleja"
        },
        "d7b16ab2-6683-4efa-93d9-d425024858bf": {
          "description": "Usar el proceso de resolución de problemas para responder una pregunta utilizando datos."
        },
        "550ed66e-4795-428a-aee8-9a77e03f667d": {
          "description": "Identificar y recolectar datos relevantes para ayudar a resolver el problema."
        },
        "88327c34-dbb7-4b44-8c32-c76166910b39": {
          "description": "Utilizar datos para sacar conclusiones."
        },
        "87ac4c51-43bc-4219-93ba-29f517c309ef": {
          "description": "Identificar y eliminar datos irrelevantes de un conjunto de datos."
        },
        "98d5856a-9dc5-4d14-bfc1-c79f4d9191d0": {
          "description": "Crear un gráfico de barras basado en un conjunto de datos."
        },
        "5ac58714-911b-460c-b34b-73d1e67c160e": {
          "description": "Explicar por qué un conjunto de datos debe limpiarse antes de que una computadora pueda utilizarlo."
        },
        "fd6610c2-f7c5-4e4a-ac5a-b1e358c8a11d": {
          "description": "Organizar datos visualmente para destacar las relaciones y respaldar una declaración."
        },
        "8d396418-f31f-438e-b9d8-43730f49868f": {
          "description": "Utilizar tabulación cruzada para encontrar patrones y relaciones en los datos"
        },
        "1d63355b-8406-4aba-a3e7-a4a559c67c5f": {
          "description": "Utilizar tablas y visualizaciones que resuman los datos para respaldar una decisión"
        },
        "a656b8a6-b4f4-4014-9c91-ed44f25b2831": {
          "description": "Identificar datos adicionales que pueden ser recolectados para mejorar una decisión"
        },
        "e645e06c-9cb1-479c-91b6-1b81b8961d54": {
          "description": "Diseñar e implementar un algoritmo para tomar decisiones utilizando datos como entradas."
        },
        "b17ebfe7-f8da-40c2-82d1-43b00a7e8364": {
          "description": "Explicar las ventajas y desventajas de utilizar computadoras para la toma de decisiones automática."
        },
        "02c329fa-a4a0-4b23-b77e-788296c2bc7b": {
          "description": "Interpretar datos recolectados para identificar patrones"
        },
        "b8217d7c-960e-42d1-b3f0-1035158a64a0": {
          "description": "Dar ejemplos de cómo se recolectan los datos por sensores y seguimiento de comportamientos de usuario."
        },
        "fd3bf488-7c63-4869-9c48-a97556d39150": {
          "description": "Determinar datos que pueden ser útiles para resolver un problema y cómo esos datos pueden ser recolectados."
        },
        "44bb192f-0e71-405f-b8a6-5757ff7f37e1": {
          "description": "Distinguir entre datos que los usuarios aportaron ya sea voluntaria o involuntariamente."
        },
        "3b95dc76-39ee-44e7-a5b0-b1aa20d51094": {
          "description": "Entrena y prueba un modelo de aprendizaje automático."
        },
        "0c96ded9-a267-4b91-b81a-a45fbdfe32d0": {
          "description": "Piensa acerca de cómo el prejuicio humano juega un papel en el aprendizaje automático."
        },
        "6885b6d1-78d2-4560-8bf5-8f14cfc68bb7": {
          "description": "Aplicar el proceso de Resolución de Problemas de datos a un tema de relevancia personal"
        },
        "b0342e84-056b-46d6-ac84-1d976155c38d": {
          "description": "Determinar las fuentes de datos apropiadas que necesitarán para resolver un problema"
        },
        "b2682f90-e600-48aa-aef4-def3798b261d": {
          "description": "Identificar cómo se utilizan las ciencias de la computación en el ámbito del entretenimiento"
        },
        "27e5577c-a619-4ef6-8f34-b252c18deb58": {
          "description": "Razonar acerca de las ubicaciones en la cuadrícula de coordenadas del Game Lab"
        },
        "e5a564d4-8723-4ee1-92c5-f9262ee8722d": {
          "description": "Expresar cómo dibujar una imagen en el Game Lab, tomando en cuenta la posición de la forma, el color y el orden"
        },
        "92707a88-4d6e-44a5-a1ba-e888e9ea27c8": {
          "description": "Usar un sistema de coordenadas para ubicar elementos en la pantalla."
        },
        "d8f92cff-b148-455d-b1c9-690e0d8c3929": {
          "description": "Secuenciar el código correctamente para sobreponer las formas."
        },
        "1fc6f9a4-a172-4504-a702-e0f6b219e62c": {
          "description": "Usar y analizar comandos de dibujo con parámetros múltiples."
        },
        "5fc17aef-b130-416f-8746-54fe3f0ed390": {
          "description": "Identificar una variable como una forma de etiquetar y referenciar un valor en un programa"
        },
        "e09ca0a1-6d0c-4177-9bcb-b97ab36faeca": {
          "description": "Usar variables en un programa para almacenar información que pueda utilizarse varias veces"
        },
        "557e9ade-ee71-4196-9dce-44f742180fa8": {
          "description": "Generar y utilizar números aleatorios en un programa"
        },
        "71209fa9-4d56-4ced-bb42-b3cf73f523f1": {
          "description": "Actualizar un valor almacenado en una variable"
        },
        "40bde7b5-fc47-455e-9d21-5dc53330e8e8": {
          "description": "Crear y utilizar un sprite"
        },
        "99befbcc-2654-44cc-a2f9-fe0cde1ab146": {
          "description": "Utiliza la notación de puntos para actualizar las propiedades de un sprite."
        },
        "c61f1e5d-d728-499d-9729-a1ff2db8de64": {
          "description": "Coloca el texto en la pantalla usando un plano de coordenadas."
        },
        "b40e994c-3d1e-4ba8-9cf1-8674567bb26c": {
          "description": "Utilizar argumentos para controlar el texto que se muestra en la pantalla."
        },
        "d6709c2c-76b3-495d-bb07-af8a4c772363": {
          "description": "Utilizar un proceso estructurado para planificar y desarrollar un programa."
        },
        "6828e8c6-bde7-4e8f-842d-04bd41a46eb4": {
          "description": "Explicar cómo el ciclo de dibujo permite la creación de animaciones en el Game Lab"
        },
        "9ed14237-271b-4890-b05c-04bde1c706fc": {
          "description": "Utilizar el ciclo de dibujo en conjunto con el comando de números aleatorios randomNumber(), formas, y sprites para elaborar animaciones simples."
        },
        "ef9e41ae-04ee-4b48-a59e-06f87ff5c9d9": {
          "description": "Utilizar el patrón de contador para incrementar o reducir las propiedades de los sprite"
        },
        "32725306-4405-48d1-871c-ce44cd180b0c": {
          "description": "Identificar qué propiedades de sprite deberían cambiarse, y de qué manera, para lograr un movimiento específico"
        },
        "ac9b5e0b-ce84-48f1-8d9e-3957b6d3ac16": {
          "description": "Utilizar condicionales para reaccionar a los cambios en las variables y propiedades de sprite"
        },
        "1bd55841-3a6b-45b8-9a2c-7ad9b9df5102": {
          "description": "Utilizar condicionales para reaccionar a la entrada de teclado"
        },
        "aee02da5-9e5d-4c9b-b43d-7576a405fd5d": {
          "description": "Mover sprites en respuesta a la entrada de teclado"
        },
        "6c2364e6-a17c-4b0c-856e-71ba8ec2b4c7": {
          "description": "Utilizar una sentencia if-else para controlar el flujo del programa."
        },
        "317b8134-0316-46e4-b56c-4adba284eab6": {
          "description": "Responder a varios tipos de entrada de usuario."
        },
        "58e13b51-2fb9-4de3-a547-dfe7bb9e71b0": {
          "description": "Utilizar las condicionales para reaccionar a las entradas de teclado o a los cambios en las variables o propiedades"
        },
        "286ec7b0-0776-4049-9174-3deeb1d80c14": {
          "description": "Secuenciar comandos para dibujar en un orden correcto"
        },
        "899e51b2-2cb8-4948-9987-aaada64c6a85": {
          "description": "Aplicar un patrón iterador a las variables o propiedades en un ciclo"
        },
        "ebf0954f-2190-4e20-8420-f0275aceee0a": {
          "description": "Utilizar los bloques de velocidad y la velocidad de rotación para crear y cambiar los movimientos de un sprite."
        },
        "01426fc9-55b3-41ec-92ec-fb871a4739b1": {
          "description": "Describir las ventajas y desventajas de simplificar el código utilizando los bloques de alto nivel"
        },
        "bb7bce08-c20e-4a8b-8b3e-def24447e33f": {
          "description": "Detectar cuándo los sprites se tocan o superponen y cambian el programa en respuesta. "
        },
        "d3aa02b0-9340-47ab-b258-5446686c77b4": {
          "description": "Describir cómo las abstracciones ayudan a gestionar la complejidad del código"
        },
        "63135326-7d2f-4974-af73-f8d7a801cd04": {
          "description": "Utilizar la velocidad de un sprite con el patrón de contador para crear distintos tipos de movimientos."
        },
        "6ed44bf4-19c7-4fd2-b72d-527e7c1ed3f3": {
          "description": "Explicar cómo las construcciones de programación individuales pueden combinarse para crear comportamientos más complejos"
        },
        "2a7e04b6-f408-4915-a8df-10a590d5b45a": {
          "description": "Modelar distintos tipos de interacciones entre sprites."
        },
        "ba90afe9-19b4-4a19-b7e7-9cc6dcc94b86": {
          "description": "Describir cómo las abstracciones pueden construirse para desarrollar nuevas abstracciones"
        },
        "3572828f-fdf1-4708-bfd1-1a021799e8fd": {
          "description": "Crear y utilizar funciones para bloques de código que realicen una sola tarea de alto nivel dentro de un programa."
        },
        "9d1d61de-4fa4-458f-b11f-aee208854019": {
          "description": "Explicar las ventajas de utilizar funciones en un programa"
        },
        "dd877754-8fc0-4026-9205-385c6a3a2e4e": {
          "description": "Explicar de qué forma las funciones permiten a los programadores razonar sobre un programa en un alto nivel"
        },
        "1cfd94eb-3bdf-4628-b8c5-2caeaa3dc189": {
          "description": "Implementar distintas funciones de un programa siguiendo una guía de proyecto estructurada"
        },
        "87b37b88-d7c7-4ad7-a5bc-f4be00ef3016": {
          "description": "Identificar las principales construcciones necesarias para construir distintos componentes de un juego"
        },
        "cb1a4260-ee88-49c1-abf7-92dfc8d1dc16": {
          "description": " Implementar distintas funciones de un programa siguiendo una guía de proyecto estructurada."
        },
        "0b62d335-144f-495a-971c-fb1ee82f154a": {
          "description": "Explorar las características de una pieza de programa de forma independiente."
        },
        "ea476a5f-3a8d-4c7a-bb2c-c6e58d216ef3": {
          "description": "Crear un plan para construir una pieza de software describiendo sus componentes principales"
        },
        "7f488fda-a480-4f40-814d-6a2810780b38": {
          "description": "Implementar un plan para crear una pieza de software"
        },
        "74126a3c-61fa-40ac-aef5-ffe0bf68a549": {
          "description": " Comunicarse y colaborar con sus compañeros de clase con el fin de buscar soluciones a distintos problemas "
        },
        "8bc02767-3a96-4d13-a946-1e5a0dbcb037": {
          "description": "Mejorar sistemáticamente en la resolución de problemas"
        },
        "1a3a0395-0d25-44f7-9d47-e1c7700c3507": {
          "description": "Identificar las distintas estrategias utilizadas para la resolución de problemas"
        },
        "3c206514-27ee-4c05-a9b7-f84176d23ebe": {
          "description": "Al enfrentar un problema, identifica acciones individuales que pueden ser parte de cada paso del proceso de resolución de problemas"
        },
        "1383b94a-1a14-4579-8da9-47114eec604d": {
          "description": "Identifica estrategias útiles dentro de cada paso del proceso de resolución de problemas"
        },
        "e8cad68d-4922-47bd-9b73-c22e8af10879": {
          "description": "Aplicar el proceso de resolución de problemas en distintas situaciones"
        },
        "34e775e2-0c00-4052-9987-1ea46e705fa0": {
          "description": "Evalúe qué tan bien definido está un problema y utilice estrategias para definirlo con más precisión"
        },
        "ccfcb058-12bd-488b-8356-b22d10c4ea6f": {
          "description": "Identificar a una computadora como una máquina que trabaja con información"
        },
        "bac6e9a1-3d3a-4632-951a-18176be462c8": {
          "description": "Razonar si determinados objetos son o no son computadoras."
        },
        "10f87a6a-1dee-44d3-b8d9-1a8d79891db9": {
          "description": "Elegir problemas que pueden ser resueltos con la computación y justificar sus elecciones."
        },
        "b77ee6ff-2558-4b8a-b835-6cc16409602f": {
          "description": "Seleccionar las entradas y salidas utilizadas para realizar tareas informáticas cotidianas"
        },
        "372ca368-9509-4398-b84c-21ac4c890a1d": {
          "description": "Explique el papel que desempeñan la entrada y la salida cuando se utilizan computadoras para resolver problemas de información."
        },
        "36878c76-5f41-4efb-bba1-e9ca4a2e32fa": {
          "description": "Definir procesamiento como el trabajo realizado (posiblemente por una computadora) para convertir una entrada en una salida"
        },
        "dd98dbf4-2b0d-4d8b-be4e-4807c06de0a0": {
          "description": "Identificar varios tipos comunes de procesamiento utilizados en la informática."
        },
        "434ebdb0-40d0-4a29-bcfb-635ade18fb5e": {
          "description": "Determinar qué tipos de procesamiento son adecuados para un problema informático específico."
        },
        "eecfc6b0-93e7-4a6f-bdc2-fcfe306a3407": {
          "description": "Determinar qué información de un problema computacional debe ser almacenada para su uso posterior"
        },
        "f8ceacee-8c38-4d94-a2f3-35ee71d8b382": {
          "description": "Identificar las directrices respecto a la información que debe y no debe almacenarse como parte del proceso computacional."
        },
        "30f1b582-38d8-402b-83da-c8a7cba4b2aa": {
          "description": "Utilizar el modelo de entrada-salida-almacenamiento-procesamiento para describir un proceso computacional."
        },
        "e543e22d-8270-4eb9-81ad-6de8d5455d59": {
          "description": "Identificar y definir un problema que pueda ser resuelto con la computación"
        },
        "6fa18746-fa9c-4ace-a0e3-fc7936899b64": {
          "description": "Diseñar una aplicación que incluya la entrada, salida, almacenamiento y procesamiento de información para resolver el problema"
        },
        "5caf913a-779e-4174-9e9f-b6a87756263e": {
          "description": "Dar e incorporar opiniones de sus pares para mejorar un artefacto computacional"
        },
        "07998a0e-1ef2-4bc0-af59-5278007a0058": {
          "description": " Comunicarse y colaborar con sus compañeros de clase con el fin de buscar soluciones a distintos problemas "
        },
        "74336c50-eaa5-4dce-a478-27925ce67729": {
          "description": "Mejorar sistemáticamente en la resolución de problemas"
        },
        "30d66e3d-96aa-4b8e-adb5-6f112d41f16d": {
          "description": "Identificar las distintas estrategias utilizadas para la resolución de problemas"
        },
        "71eb384e-9034-406d-a8fc-3e410e869985": {
          "description": " Comunicarse y colaborar con sus compañeros de clase con el fin de buscar soluciones a distintos problemas "
        },
        "eb402ed0-5510-4b3a-bc73-694ddde8bf0f": {
          "description": "Mejorar sistemáticamente en la resolución de problemas"
        },
        "9f5e8294-cf6c-4f28-9f8f-1c0c869a69be": {
          "description": "Identificar las distintas estrategias utilizadas para la resolución de problemas"
        },
        "dd44e0a2-e2a0-46aa-bc51-e0d67dc95491": {
          "description": "Comunicarse y colaborar con sus compañeros de clase con el fin de buscar soluciones a distintos problemas "
        },
        "2c2dc6c4-9a9f-4186-85ba-44882179e48b": {
          "description": "Mejorar sistemáticamente en la resolución de problemas"
        },
        "1829ce9e-4e7e-451f-898e-692c3abb5ad6": {
          "description": "Identificar las distintas estrategias utilizadas para la resolución de problemas"
        },
        "a98e9a65-fe9a-421b-854f-ee5c090c9503": {
          "description": "Aplicar el proceso de resolución de problemas en distintas situaciones"
        },
        "4616a321-c362-4a0e-928a-b1bc642d4010": {
          "description": "Evalúe que tan bien definido está un problema y utilice estrategias para definirlo con más precisión"
        },
        "69a7b9a8-b9be-4d2e-aacc-43805fc5f186": {
          "description": "Aplicar el proceso de resolución de problemas en distintas situaciones"
        },
        "1e8b24b5-f8b6-46a6-b0b1-aba1633a02f0": {
          "description": "Evalúe que tan bien definido está un problema y utilice estrategias para definirlo con más precisión"
        }
      }
    }
  }
}