{
  "ru-RU": {
    "data": {
      "standard_categories": {
        "1": {
          "description": "Учащиеся демонстрируют творческое мышление, овладевают знаниями и разрабатывают инновационные продукты и процессы с помощью технологий."
        },
        "2": {
          "description": "Учащиеся используют цифровые средства и среды для коммуникации и совместной работы, в том числе дистанционно, что одновременно способствует их собственному индивидуальному обучению и обучению других."
        },
        "3": {
          "description": "Студенты применят цифровые инструменты для сбора, оценки и использования информации."
        },
        "3-A-i": {
          "description": "Природа Обучения - люди в сравнении с машинами"
        },
        "3-A-ii": {
          "description": "Природа Обучения — поиск закономерностей в данных"
        },
        "3-A-iii": {
          "description": "Природа Обучения — обучение модели"
        },
        "3-A-iv": {
          "description": "Природа Обучения - построение в сравнении с использованим аргумента"
        },
        "3-A-v": {
          "description": "Природа Обучения — корректировка внутренних представлений"
        },
        "3-A-vi": {
          "description": "Природа Обучения — обучение на основе опыта"
        },
        "3-B-i": {
          "description": "Нейронные Сети — структура нейронной сети"
        },
        "3-B-ii": {
          "description": "Нейронные Сети — регулировка веса"
        },
        "3-C-i": {
          "description": "Наборы данных — наборы объектов"
        },
        "3-C-ii": {
          "description": "Наборы данных — большие наборы данных"
        },
        "3-C-iii": {
          "description": "Наборы данных — смещение"
        },
        "4": {
          "description": "Учащиеся используют навыки критического мышления для планирования и выполнения исследовательской работы, управления проектами, решения задач и принятия информированных решений об использовании цифровых инструментов и ресурсов."
        },
        "5": {
          "description": "Студенты поймут человеческие, культурные и социальные проблемы, связанные с технологией, и попрактикуют правовое и этическое поведение."
        },
        "6": {
          "description": "Учащиеся демонстрируют четкое понимание технологических концепций, систем и операций."
        },
        "AAP-1": {
          "description": "Чтобы найти конкретные решения обобщаемых проблем, программисты представляют и систематизируют данные несколькими способами."
        },
        "AAP-1.A": {
          "description": "Представляйте значение с помощью переменной."
        },
        "AAP-1.B": {
          "description": "Определите значение переменной в результате задания."
        },
        "AAP-1.C": {
          "description": "Представьте список или строку с помощью переменной."
        },
        "AAP-1.D": {
          "description": "Для абстракции данных: \na. Разработайте абстракцию данных с помощью списков для хранения нескольких элементов.\nb. Объясните, как использование абстракции данных позволяет управлять сложностью программного кода."
        },
        "AAP-2": {
          "description": "Способ последовательности и объединения инструкций в программе определяет вычисляемый результат. Программы включают конструкции итерации и выбора для представления повторов и принятия решений для обработки различных входных значений."
        },
        "AAP-2.A": {
          "description": "Выразите алгоритм, использующий секвенирование без использования языка программирования."
        },
        "AAP-2.B": {
          "description": "Представьте пошаговый алгоритмический процесс с использованием последовательных инструкций кода."
        },
        "AAP-2.C": {
          "description": "Вычислите выражения, в которых используются арифметические операторы."
        },
        "AAP-2.D": {
          "description": "Вычислите выражения, которые манипулируют строками."
        },
        "AAP-2.E": {
          "description": "Для отношений между двумя переменными, выражениями или значениями: \na. Представить использование реляционных операторов\nb. Вычислите выражения, в которых используются реляционные операторы."
        },
        "AAP-2.F": {
          "description": "Для отношений между булевыми значениями:\na. Представляют использование логических операторов.\nb. Вычислите выражения, в которых используются логические операторы."
        },
        "AAP-2.G": {
          "description": "Выразите алгоритм, использующий выборку без использования языка программирования."
        },
        "AAP-2.H": {
          "description": "Для выбора:\na. Представляем использование условных выражений.\nb. Определите результат условных выражений."
        },
        "AAP-2.I": {
          "description": "Для вложенного выбора:\na. Представляет собой использование вложенных условных выражений. \nb. Определите результат вложенных условных выражений."
        },
        "AAP-2.J": {
          "description": "Выразите алгоритм, использующий итерацию без использования языка программирования."
        },
        "AAP-2.K": {
          "description": "Для итерации:\na. Представляет собой использование операторов итерации.\nb. Определите результат или побочный эффект итерационных инструкций."
        },
        "AAP-2.L": {
          "description": "Сравните несколько алгоритмов, чтобы определить, дают ли они одинаковый побочный эффект или результат."
        },
        "AAP-2.M": {
          "description": "Для алгоритмов: \na. Создание алгоритмов. \nb. Комбинируйте и модифицируйте существующие алгоритмы."
        },
        "AAP-2.N": {
          "description": "Для операций со списками:\na. Напишите выражения, использующие процедуры индексирования списков и списков.\nb. Оцените выражения, в которых используется индексация списков и процедуры составления списков."
        },
        "AAP-2.O": {
          "description": "Для алгоритмов, включающих элементы списка:\na. Представляет собой использование итеративных выражений для перемещения по списку.\nb. Определите результат алгоритма с обходом списков."
        },
        "AAP-2.P": {
          "description": "Для алгоритмов двоичного поиска:\na. Определите количество итераций, необходимых для поиска значения в наборе данных. \nb. Объясните требования, необходимые для выполнения бинарного поиска."
        },
        "AAP-3": {
          "description": "Программисты разбивают задачи на более мелкие и более управляемые части. Создавая процедуры и используя параметры, программисты обобщают процессы, которые можно использовать повторно. Процедуры позволяют программистам использовать существующий код, который уже протестирован, что позволяет программистам писать программы быстрее и увереннее."
        },
        "AAP-3.A": {
          "description": "Для вызовов по процедурам:\nчасов. Запишите инструкции к процедурам вызова.\nb. Определите результат или эффект вызова процедуры."
        },
        "AAP-3.B": {
          "description": "Для вызовов по процедурам:\nчасов. Запишите инструкции к процедурам вызова.\nb. Определите результат или эффект вызова процедуры."
        },
        "AAP-3.C": {
          "description": "Разработайте процедурные абстракции для управления сложностью программы путем написания процедур."
        },
        "AAP-3.D": {
          "description": "Выберите подходящие библиотеки или существующие сегменты кода для использования при создании новых программ."
        },
        "AAP-3.E": {
          "description": "Для генерации случайных значений: \na. Напишите выражения для генерации возможных значений. \nb. Оцените выражения для определения возможных результатов."
        },
        "AAP-3.F": {
          "description": "Для моделирования:\nа. Объясните, как можно использовать компьютеры для представления реальных явлений или результатов. \nb. Сравните использование моделирования с реальными контекстами."
        },
        "AAP-4": {
          "description": "Существуют проблемы, которые компьютер не может решить, и даже если компьютер может решить проблему, он не сможет решить ее в разумные сроки."
        },
        "AAP-4.A": {
          "description": "Для определения эффективности алгоритма:\nа. Объясните разницу между алгоритмами, которые работают в разумные сроки, и алгоритмами, которые не работают в разумные сроки. \nb. Определите ситуации, в которых эвристическое решение может оказаться более подходящим."
        },
        "AAP-4.B": {
          "description": "Объясните существование неразрешимых проблем в компьютерных науках."
        },
        "AP": {
          "description": "Алгоритмы и программирование"
        },
        "APR": {
          "description": "Арифметика с полиномами и рациональными выражениями"
        },
        "BF": {
          "description": "Функции здания"
        },
        "BI-1": {
          "description": "Компьютеры воспринимают мир с помощью датчиков"
        },
        "BI-2": {
          "description": "Агенты поддерживают представления о мире и используют их для доказательств"
        },
        "BI-3": {
          "description": "Компьютеры могут учиться на данных"
        },
        "BI-4": {
          "description": "Интеллектуальные агенты требуют многих знаний для естественного взаимодействия с людьми."
        },
        "BI-5": {
          "description": "Искусственный интеллект может влиять на общество как позитивно, так и негативно"
        },
        "C": {
          "description": "Туннель"
        },
        "CC": {
          "description": "Подсчет и кардинальность"
        },
        "CD": {
          "description": "Компьютеры и устройства для связи"
        },
        "CED": {
          "description": "Создание уравнений"
        },
        "CI": {
          "description": "Сообщество, глобальное и этническое влияние"
        },
        "CL": {
          "description": "Сотрудничество"
        },
        "CN": {
          "description": "Комплексная система счисления"
        },
        "CO": {
          "description": "Конгруэнтность"
        },
        "CON-1": {
          "description": "Способ последовательности и объединения переменных и операторов в выражении определяет результат вычисления."
        },
        "CON-1.A": {
          "description": "Вычисление арифметических выражений в программном коде"
        },
        "CON-1.B": {
          "description": "Оцените, что хранится в переменной в результате выражения, с помощью оператора присваивания"
        },
        "CON-1.C": {
          "description": "Вычислите арифметические выражения, в которых используется кастинг."
        },
        "CON-1.D": {
          "description": "Вычислите выражения, в которых используются методы класса Math."
        },
        "CON-1.E": {
          "description": "Вычислите булевые выражения, использующие реляционные операторы в программном коде."
        },
        "CON-1.F": {
          "description": "Вычислите сложные булевые выражения в программном коде."
        },
        "CON-1.G": {
          "description": "Сравните и сопоставьте эквивалентные булевые выражения."
        },
        "CON-1.H": {
          "description": "Сравните ссылки на объекты, используя булевые выражения в программном коде."
        },
        "CON-2": {
          "description": "Программисты включают итерацию и выбор в код, чтобы предоставить компьютеру инструкции по обработке каждого из множества возможных входных значений"
        },
        "CON-2.A": {
          "description": "Представляйте разветвленные логические процессы с помощью условных выражений."
        },
        "CON-2.B": {
          "description": "Представляйте разветвленные логические процессы с помощью вложенных условных выражений."
        },
        "CON-2.C": {
          "description": "Представляйте итеративные процессы с помощью whileloop."
        },
        "CON-2.D": {
          "description": "Для алгоритмов в контексте конкретной спецификации, не требующих использования обходов: • Определите стандартные алгоритмы. • Измените стандартные алгоритмы. • Разработайте алгоритм."
        },
        "CON-2.E": {
          "description": "Представляйте итеративные процессы с помощью цикла for."
        },
        "CON-2.F": {
          "description": "Для алгоритмов в контексте конкретной спецификации, включающей объекты String • Определите стандартные алгоритмы. • Измените стандартные алгоритмы. • Разработайте алгоритм."
        },
        "CON-2.G": {
          "description": "Представляют вложенные итеративные процессы"
        },
        "CON-2.H": {
          "description": "Вычислите количество выполненных инструкций и неформальное сравнение итеративных инструкций во время выполнения."
        },
        "CON-2.I": {
          "description": "Для алгоритмов в контексте конкретной спецификации, требующих использования обходов массивов: • Определите стандартные алгоритмы. • Измените стандартные алгоритмы. • Разработайте алгоритм."
        },
        "CON-2.J": {
          "description": "Для алгоритмов в контексте конкретной спецификации, требующих использования обходов ArrayList: • Определите стандартные алгоритмы. • Измените стандартные алгоритмы. • Разработайте алгоритм."
        },
        "CON-2.K": {
          "description": "Применяйте алгоритмы последовательного/линейного поиска для поиска определенной информации в объектах массива или ArrayList."
        },
        "CON-2.L": {
          "description": "Применяйте алгоритмы выборки, сортировки и сортировки по вставке для сортировки элементов объектов массива или ArrayList."
        },
        "CON-2.M": {
          "description": "Вычислите количество выполнения инструкций и неформальное сравнение алгоритмов сортировки во время выполнения."
        },
        "CON-2.N": {
          "description": "Для алгоритмов в контексте конкретной спецификации, требующей использования обходов двумерных массивов: • Определите стандартные алгоритмы. • Измените стандартные алгоритмы. • Разработайте алгоритм."
        },
        "CON-2.O": {
          "description": "Определите результат выполнения рекурсивных методов."
        },
        "CON-2.P": {
          "description": "Применяйте алгоритмы рекурсивного поиска к информации в объектах String, одномерного массива или ArrayList."
        },
        "CON-2.Q": {
          "description": "Применяйте рекурсивные алгоритмы для сортировки элементов объектов массива или ArrayList."
        },
        "CP": {
          "description": "Условная вероятность и правила вероятности"
        },
        "CPP": {
          "description": "Практика вычислений и программирование"
        },
        "CRD-1": {
          "description": "Совместное использование различных точек зрения улучшает разрабатываемые вычислительные инновации."
        },
        "CRD-1.A": {
          "description": "Объясните, как инновации в области вычислительной техники улучшаются благодаря совместной работе."
        },
        "CRD-1.B": {
          "description": "Объясните, как компьютерные инновации разрабатываются группами людей."
        },
        "CRD-1.C": {
          "description": "Продемонстрируйте эффективные навыки межличностного общения во время совместной работы."
        },
        "CRD-2": {
          "description": "Разработчики создают и внедряют инновации, используя итеративный процесс проектирования, ориентированный на пользователей, включающий циклы внедрения и обратной связи, оставляющий достаточно места для экспериментов и принятия рисков."
        },
        "CRD-2.A": {
          "description": "Опишите цель вычислительной инновации."
        },
        "CRD-2.B": {
          "description": "Объясните, как работает программа или сегмент кода."
        },
        "CRD-2.C": {
          "description": "Определите входные данные для программы."
        },
        "CRD-2.D": {
          "description": "Определите выходные данные, полученные программой."
        },
        "CRD-2.E": {
          "description": "Разработайте программу, используя процесс разработки."
        },
        "CRD-2.F": {
          "description": "Разработайте программу и ее пользовательский интерфейс."
        },
        "CRD-2.G": {
          "description": "Опишите назначение сегмента кода или программы, написав документацию."
        },
        "CRD-2.H": {
          "description": "Подтвердите сегменты кода, используемые из других источников."
        },
        "CRD-2.I": {
          "description": "Для ошибок в алгоритме или программе: \na. Укажите ошибку. \nб. Исправьте ошибку."
        },
        "CRD-2.J": {
          "description": "Определите входные данные и соответствующие ожидаемые результаты или поведение, которые можно использовать для проверки правильности алгоритма или программы."
        },
        "CS": {
          "description": "Вычислительные системы"
        },
        "CSN-1": {
          "description": "Компьютерные системы и сети облегчают передачу данных."
        },
        "CSN-1.A": {
          "description": "Объясните, как вычислительные устройства работают вместе в сети."
        },
        "CSN-1.B": {
          "description": "Объясните, как работает Интернет."
        },
        "CSN-1.C": {
          "description": "Объясните, как данные передаются через Интернет пакетами."
        },
        "CSN-1.D": {
          "description": "Опишите различия между Интернетом и Всемирной паутиной."
        },
        "CSN-1.E": {
          "description": "Для отказоустойчивых систем, таких как Интернет:\na. Опишите преимущества отказоустойчивости\nb. Объясните, насколько данная система отказоустойчива\nc. Определите уязвимости в системе."
        },
        "CSN-2": {
          "description": "Параллельные и распределенные вычисления используют несколько компьютеров для более быстрого решения сложных задач или обработки больших наборов данных."
        },
        "CSN-2.A": {
          "description": "Сравните решения проблем, в которых используются последовательные, параллельные и распределенные вычисления."
        },
        "CSN-2.B": {
          "description": "Определите эффективность последовательных и параллельных решений."
        },
        "CSN-2.C": {
          "description": "Опишите преимущества и проблемы параллельных и распределенных вычислений."
        },
        "CT": {
          "description": "Вычислительное мышление"
        },
        "D1": {
          "description": "Разработка вопросов и планирование запросов"
        },
        "D2.Civ": {
          "description": "Гражданское право"
        },
        "D2.Eco": {
          "description": "Экономика"
        },
        "D3.Claims": {
          "description": "Разработка претензий и использование доказательств"
        },
        "D3.Sources": {
          "description": "Сбор и оценка источников"
        },
        "D4.Action": {
          "description": "Принятие обоснованных действий"
        },
        "D4.Conclusions": {
          "description": "Коммуникация и критика выводов"
        },
        "DA": {
          "description": "Данные и анализ"
        },
        "DAT-1": {
          "description": "Способ, которым компьютер представляет данные, отличается от способа, который используется для интерпретации и отображения данных для пользователя. Программы позволяют преобразовать данные в более понятное для людей представление."
        },
        "DAT-1.A": {
          "description": "Объясните, как данные могут быть представлены в битах."
        },
        "DAT-1.B": {
          "description": "Объясните последствия использования битов для представления данных."
        },
        "DAT-1.C": {
          "description": "Для двоичных чисел:\nа. Вычислите двоичный эквивалент (основание 2) целому положительному числу (основание 10) и наоборот. \nb. Сравните и упорядочьте двоичные числа."
        },
        "DAT-1.D": {
          "description": "Сравните алгоритмы сжатия данных, чтобы определить, какой из них лучше всего подходит для конкретного контекста."
        },
        "DAT-2": {
          "description": "Программы могут использоваться для обработки данных, что позволяет пользователям находить информацию и создавать новые знания."
        },
        "DAT-2.A": {
          "description": "Опишите, какую информацию можно извлечь из данных."
        },
        "DAT-2.B": {
          "description": "Опишите, какую информацию можно извлечь из метаданных."
        },
        "DAT-2.C": {
          "description": "Определите проблемы, связанные с обработкой данных."
        },
        "DAT-2.D": {
          "description": "Извлекайте информацию из данных с помощью программы."
        },
        "DAT-2.E": {
          "description": "Объясните, как можно использовать программы для получения информации и знаний из данных."
        },
        "EE": {
          "description": "Выражения и уравнения"
        },
        "ESS": {
          "description": "Наука о Земле и космосе"
        },
        "ESS1": {
          "description": "Место Земли во Вселенной"
        },
        "ESS2": {
          "description": "Системы Земли"
        },
        "ESS3": {
          "description": "Земля и человеческая деятельность"
        },
        "ETS": {
          "description": "Инжиниринг в науке"
        },
        "ETS1": {
          "description": "Инженерный дизайн"
        },
        "F": {
          "description": "функции"
        },
        "G": {
          "description": "Геометрия"
        },
        "GMD": {
          "description": "Геометрическое измерение и размер"
        },
        "GPE": {
          "description": "Выражение геометрических свойств с помощью уравнений"
        },
        "IC": {
          "description": "Воздействие компьютерной техники"
        },
        "ID": {
          "description": "Интерпретация категориальных и количественных данных"
        },
        "IF": {
          "description": "Функции интерпретации"
        },
        "IOC-1": {
          "description": "Хотя компьютерные инновации обычно предназначены для достижения определенной цели, они могут иметь непредвиденные последствия."
        },
        "IOC-1.A": {
          "description": "Объясните, как компьютерные инновации могут быть как полезными, так и вредными."
        },
        "IOC-1.B": {
          "description": "Объясните, как компьютерная инновация может оказать влияние, выходящее за рамки поставленной цели."
        },
        "IOC-1.C": {
          "description": "Опишите проблемы, способствующие преодолению цифрового разрыва."
        },
        "IOC-1.D": {
          "description": "Объясните, почему инновации в вычислительной технике носят предвзятый характер."
        },
        "IOC-1.E": {
          "description": "Объясните, как люди участвуют в масштабных процессах решения проблем."
        },
        "IOC-1.F": {
          "description": "Объясните, как использование компьютеров может вызвать правовые и этические проблемы."
        },
        "IOC-2": {
          "description": "Использование компьютерных инноваций может быть сопряжено с риском для вашей личной безопасности и идентичности."
        },
        "IOC-2.A": {
          "description": "Опишите риски для конфиденциальности, связанные со сбором и хранением персональных данных в компьютерной системе."
        },
        "IOC-2.B": {
          "description": "Объясните, как вычислительные ресурсы могут быть использованы не по назначению и как можно защитить их."
        },
        "IOC-2.C": {
          "description": "Объясните, как происходит несанкционированный доступ к вычислительным ресурсам."
        },
        "L": {
          "description": "Язык"
        },
        "LE": {
          "description": "Линейные, квадратичные и экспоненциальные модели ★"
        },
        "LS": {
          "description": "Наука о жизни"
        },
        "LS1": {
          "description": "От молекул к организмам: структуры и процессы"
        },
        "LS2": {
          "description": "Экосистемы: взаимодействие, энергия и динамика"
        },
        "LS3": {
          "description": "Наследственность: наследование и изменение признаков"
        },
        "LS4": {
          "description": "Биологическая эволюция: единство и разнообразие"
        },
        "MD": {
          "description": "Использование вероятности для принятия решений"
        },
        "MG": {
          "description": "Моделирование с помощью геометрии"
        },
        "MOD-1": {
          "description": "Некоторые объекты или концепции представлены так часто, что программисты могут использовать существующий код, который уже протестирован, что позволяет им писать решения быстрее и с большей степенью уверенности"
        },
        "MOD-1.A": {
          "description": "Вызовите методы класса System для генерации выходных данных на консоль."
        },
        "MOD-1.B": {
          "description": "Объясните взаимосвязь между классом и объектом."
        },
        "MOD-1.C": {
          "description": "Определите, используя его подпись, правильный вызываемый конструктор."
        },
        "MOD-1.D": {
          "description": "Для создания объекта: а. Создавайте объекты, вызывая конструкторы без параметров. б. Создавайте объекты, вызывая конструкторы с параметрами."
        },
        "MOD-1.E": {
          "description": "Вызовите нестатические методы void без параметров."
        },
        "MOD-1.F": {
          "description": "Вызовите нестатические методы void с параметрами"
        },
        "MOD-1.G": {
          "description": "Вызов нестатических недействительных методов с параметрами или без них"
        },
        "MOD-1.H": {
          "description": "Вызовите статические методы."
        },
        "MOD-2": {
          "description": "Программисты используют код для представления физического объекта или нефизической концепции, реальной или воображаемой, путем определения класса на основе атрибутов и/или поведения объекта или концепции"
        },
        "MOD-2.A": {
          "description": "Назначьте ограничения доступа и видимости классов, данных, конструкторов и методов."
        },
        "MOD-2.B": {
          "description": "Определите переменные экземпляра для атрибутов, которые должны быть инициализированы с помощью конструкторов класса."
        },
        "MOD-2.C": {
          "description": "Опишите функциональность и использование программного кода в комментариях."
        },
        "MOD-2.D": {
          "description": "Определите поведение объекта с помощью недействительных методов без параметров, записанных в классе."
        },
        "MOD-2.E": {
          "description": "Определите поведение объекта с помощью методов void с параметрами, записанными в классе или без них."
        },
        "MOD-2.F": {
          "description": "Определите поведение объекта с помощью непустых методов с параметрами, записанными в классе."
        },
        "MOD-2.G": {
          "description": "Определите поведение класса с помощью статических методов."
        },
        "MOD-2.H": {
          "description": "Определите статические переменные, принадлежащие классу."
        },
        "MOD-3": {
          "description": "Когда несколько классов содержат общие атрибуты и поведение, программисты создают новый класс, содержащий общие атрибуты и варианты поведения, образующие иерархию. Изменения, внесенные на самом высоком уровне иерархии, относятся к подклассам."
        },
        "MOD-3.A": {
          "description": "Назначьте частную видимость переменных экземпляра для инкапсуляции атрибутов объекта."
        },
        "MOD-3.B": {
          "description": "Создайте отношения наследования от подкласса к суперклассу."
        },
        "MOD-3.C": {
          "description": "Определите опорные переменные суперкласса, которые будут присвоены объекту подкласса в той же иерархии."
        },
        "MOD-3.D": {
          "description": "Методы вызова в наследственных отношениях."
        },
        "MOD-3.E": {
          "description": "Вызовите методы класса Object с помощью наследования."
        },
        "MP": {
          "description": "Математические методы"
        },
        "NBT": {
          "description": "Числа и операции в десятичной системе"
        },
        "NF": {
          "description": "Числа и операции — дроби"
        },
        "NI": {
          "description": "Сети и Интернет"
        },
        "NS": {
          "description": "Система счисления"
        },
        "OA": {
          "description": "Операции и алгебраическое мышление"
        },
        "PS": {
          "description": "Физическая наука"
        },
        "PS1": {
          "description": "Материя и ее взаимодействия"
        },
        "PS2": {
          "description": "Движение и устойчивость: силы и взаимодействия"
        },
        "PS3": {
          "description": "Энергия"
        },
        "PS4": {
          "description": "Волны и их применение в технологиях передачи информации"
        },
        "Q": {
          "description": "Количества"
        },
        "REI": {
          "description": "Рассуждение с помощью уравнений и неравенств"
        },
        "RF": {
          "description": "Базовые навыки чтения"
        },
        "RH": {
          "description": "История чтения/Социальные исследования"
        },
        "RI": {
          "description": "Чтение информационных текстов"
        },
        "RL": {
          "description": "Чтение литературы"
        },
        "RN": {
          "description": "Система реальных чисел"
        },
        "RP": {
          "description": "Коэффициенты и пропорциональные отношения"
        },
        "RST": {
          "description": "Наука и техника чтения"
        },
        "SL": {
          "description": "Говорение и слушание"
        },
        "SP": {
          "description": "Статистика и вероятность"
        },
        "SRT": {
          "description": "Сходство, прямые треугольники и тригонометрия"
        },
        "SSE": {
          "description": "Видение структуры в выражениях"
        },
        "TF": {
          "description": "Тригонометрические функции"
        },
        "VAR-1": {
          "description": "Чтобы найти конкретные решения обобщаемых задач, программисты включают переменные в свой код, чтобы один и тот же алгоритм работал с разными входными значениями."
        },
        "VAR-1.A": {
          "description": "Создание строковых литералов"
        },
        "VAR-1.B": {
          "description": "Определите категорию типов данных, наиболее подходящую для конкретной спецификации"
        },
        "VAR-1.C": {
          "description": "Объявите переменные правильных типов для представления примитивных данных"
        },
        "VAR-1.D": {
          "description": "Определите переменные правильных типов для представления справочных данных."
        },
        "VAR-1.E": {
          "description": "Для класса String: а. Создание объектов String. б. Вызов методов String."
        },
        "VAR-1.F": {
          "description": "Для классой-оболочек: а. Создание объектов Integer. b. Вызов целочисленных методов. c. Создание двойных объектов. d. Вызов методов Double."
        },
        "VAR-1.G": {
          "description": "Объясните, где можно использовать переменные в программном коде."
        },
        "VAR-1.H": {
          "description": "Оцените ссылочные выражения объектов, в которых используется ключевое слово this."
        },
        "VAR-2": {
          "description": "Для управления большими объемами данных или сложными взаимосвязями в данных программисты пишут код, который группирует данные в единую структуру данных без создания отдельных переменных для каждого значения."
        },
        "VAR-2.A": {
          "description": "Представляйте коллекции связанных примитивных или опорных данных объектов с помощью одномерных (одномерных) объектов массива."
        },
        "VAR-2.B": {
          "description": "Перемещайте элементы в одномерном массиве."
        },
        "VAR-2.C": {
          "description": "Перемещайте элементы в объекте одномерного массива с помощью улучшенного цикла for."
        },
        "VAR-2.D": {
          "description": "Представляйте коллекции справочных данных связанных объектов с помощью объектов ArrayList."
        },
        "VAR-2.E": {
          "description": "Для объектов ArrayList: • Перемещение с использованием цикла for или while; • Перемещение с использованием улучшенного цикла for."
        },
        "VAR-2.F": {
          "description": "Представляйте коллекции связанных примитивных или объектных справочных данных с помощью двумерных (2D) объектов массива."
        },
        "VAR-2.G": {
          "description": "Для объектов двумерного массива: • Перемещение с использованием вложенных циклов; • Перемещение с использованием вложенных, улучшенных для циклов."
        },
        "VM": {
          "description": "Векторные и матричные величины"
        },
        "W": {
          "description": "Письмо"
        },
        "WHST": {
          "description": "Написание HS/S/T"
        }
      }
    }
  }
}