{
  "ur-PK": {
    "data": {
      "standards": {
        "ccela/3.RL.4": {
          "description": "متن میں مخصوص استعمال کے مطابق الفاظ اور جملوں کے معنوں کا تعین کریں، بشمول لغوی اور غیر لغوی زبان میں فرق کر کے۔"
        },
        "ccela/4.RL.7": {
          "description": "کہانی یا ڈرامے کے متن اور متن کی بصری یا زبانی پیشکش کے درمیان رابطہ قائم کریں، اور نشاندہی کریں کہ ہر ورژن میں مخصوص وضاحتیں اور سمتیں کہاں کہاں منعکس ہوئی ہیں."
        },
        "ccela/5.RL.4": {
          "description": "متن میں مخصوص استعمال کے مطابق الفاظ اور جملوں کے معنوں کا تعین کریں، بشمول علامتی زبان جیسے استعارات اور تشبیہات۔"
        },
        "ccela/5.RL.7": {
          "description": "تجزیہ کریں کہ کس طرح بصری اور ملٹی میڈیا عناصر متن کے معنی، لہجے یا خوبصورتی میں حصہ ڈالتے ہیں (مثال کے طور پر، گرافک ناول، افسانے کی ملٹی میڈیا پیشکش، لوک کہانی، افسانہ، نظم)۔"
        },
        "ccela/6.SL.1": {
          "description": "گریڈ 6 کے موضوعات، نصاب، اور مسائل کے حوالے سے متنوع شراکت داروں کے ساتھ مؤثر طریقے سے باہمی تعاون پر مبنی (انفرادی ملاقاتوں، گروپوں کی شکل میں، اور اساتذہ کی قیادت میں) بات چیت کریں، جہاں آپ کے خیالات ایک دوسرے کی حمایت کریں اور سب واضح طور پر اپنے خیالات کا اظہار کریں."
        },
        "ccela/7.SL.1": {
          "description": "گریڈ 7 کے موضوعات، نصاب، اور مسائل کے حوالے سے متنوع شراکت داروں کے ساتھ مؤثر طریقے سے باہمی تعاون پر مبنی (انفرادی ملاقاتوں، گروپوں کی شکل میں، اور اساتذہ کی قیادت میں) بات چیت کریں، جہاں آپ کے خیالات ایک دوسرے کی حمایت کریں اور سب واضح طور پر اپنے خیالات کا اظہار کریں."
        },
        "ccmath/MP.1": {
          "description": "مسائل کا احساس کریں اور ان کو حل کرنے میں ثابت قدم رہیں"
        },
        "ccmath/MP.2": {
          "description": "تجریدی اور مقداری طور پر استدلال کریں"
        },
        "ccmath/MP.5": {
          "description": "حکمت عملی سے مناسب اوزار استعمال کریں"
        },
        "ccmath/MP.6": {
          "description": "درستگی (دقّت) پر توجہ دیں"
        },
        "ccmath/MP.7": {
          "description": "بنیادی ساخت کو تلاش کریں اور اسے استعمال کریں"
        },
        "ccmath/MP.8": {
          "description": "تکراری استدلال میں باقاعدگی تلاش کریں اور اس کا اظہار کریں"
        },
        "csta2011/CPP.L1:6-06": {
          "description": "بلاک پر مبنی بصری پروگرامنگ زبان کا استعمال کرتے ہوئے مسائل کے حل استعمال کریں."
        },
        "csta2011/CT.L2:1": {
          "description": "مسائل کے حل ڈیزائن کرنے (مثال کے طور پر، مسائل کا بیان اور ان پر غور، نمونے کی مثالوں کی جانچ پڑتال، ڈیزائن، حل کے طریقہ کار کا نفاذ، جانچ اور تشخیص) کے لیے الگورتھم کے ذریعے مسائل حل کرنے کے بنیادی اقدامات کا استعمال کریں."
        },
        "csta2011/CT.L2:12": {
          "description": "کسی مسئلے کو ذیلی مسائل میں تحلیل کرنے کے لیے تجریدی انداز فکر کا استعمال کریں."
        },
        "csta2011/CT.L2:6": {
          "description": "ان ہدایات کی وضاحت اور تجزیہ کریں جن کی پیروی کرنی ہے (مثال کے طور پر، ویڈیو گیم میں ایک کردار کے رویے کی وضاحت کریں کہ کیسے قواعد اور الگورتھم سے چلتی ہے)."
        },
        "csta2011/CT.L2:7": {
          "description": "متن، آوازوں، تصاویر اور نمبروں کے متنوع طریقوں سے ڈیٹا کی نمائندگی کریں."
        },
        "csta2011/CT.L2:8": {
          "description": "مسائل کی حالتوں، ڈھانچوں اور ڈیٹا کی بصری نمائندگیوں کا استعمال کریں (مثلاً گراف، چارٹ، نیٹ ورک ڈایاگرام، فلو چارٹس)."
        },
        "iste/1.a": {
          "description": "نئے خیالات، مصنوعات، یا اعمال کے طریقے (پراسسز) بنانے کے لیے موجودہ علم کا اطلاق کریں."
        },
        "iste/1.b": {
          "description": "ذاتی یا گروہی اظہار کے ذریعہ نئے کام انجام دیں."
        },
        "iste/1.c": {
          "description": "پیچیدہ نظاموں اور مسائل کو دریافت کرنے کے لیے ماڈلز اور سیولیشن (آزمائشی حالتیں) استعمال کریں."
        },
        "iste/4.b": {
          "description": "ایک حل تیار کرنے یا کسی پروجیکٹ کو مکمل کرنے کے لیے سرگرمیوں کی منصوبہ بندی اور انتظام کریں."
        },
        "iste/6.a": {
          "description": "ٹیکنالوجی کے نظاموں (سسٹمز) کو سمجھیں اور انہیں استعمال کریں."
        },
        "iste/6.c": {
          "description": "سسٹمز اور ایپلی کیشنز میں مسائل ڈھونڈ کر حل کریں."
        },
        "iste/6.d": {
          "description": "موجودہ علم کو نئی ٹیکنالوجی کے سیکھنے میں استعمال کریں."
        },
        "ccela/1.L.6": {
          "description": "بات چیت، پڑھنے اور سامنے پڑھے جانے، اور پیغامات کے جوابات دینے کے ذریعے حاصل کیے گئے الفاظ اور فقرے استعمال کریں، بشمول سادہ رشتوں کا اشارہ دینے کے لیے اکثر واقع ہونے والے حروف عطف (جیسے، کیونکہ) کا استعمال کریں."
        },
        "ccela/1.SL.1": {
          "description": " ہم عمروں اور بڑوں کے چھوٹے اور بڑے گروپوں میں متنوع شراکت داروں کے ساتھ گریڈ 1 کے موضوعات اور متن کے بارے میں باہمی بات چیت میں حصہ لیں۔"
        },
        "ccela/11-12.RI.4": {
          "description": "الفاظ اور جملے کے معنوں کا تعین کریں جیسا کہ وہ کسی متن میں استعمال ہوتے ہیں، بشمول علامتی، مفہوم، اور تکنیکی معنوں میں ان کے استعمال کے؛ تجزیہ کریں کہ ایک مصنف کس طرح کسی متن کے دوران کلیدی اصطلاح یا اصطلاحات کے معنوں کو استعمال اور بہتر کرتا ہے (مثال کے طور پر، میڈیسن کیسے تعریف کرتے ہیں"
        },
        "ccela/2.L.6": {
          "description": "بات چیت، پڑھنے اور سامنے پڑھے جانے، اور پیغامات کے جوابات دینے کے ذریعے حاصل کیے گئے الفاظ اور فقرے استعمال کریں، بشمول وضاحت دینے کے لیے اسم صفت اور اسم ظریف کا استعمال (جیسے، جب دوسرے بچے خوش ہوتے ہیں تو وہ خو خوش ہو جاتے ہیں)."
        },
        "ccela/2.SL.1": {
          "description": " ہم عمروں اور بڑوں کے چھوٹے اور بڑے گروپوں میں متنوع شراکت داروں کے ساتھ گریڈ 2 کے موضوعات اور متن کے بارے میں باہمی بات چیت میں حصہ لیں۔"
        },
        "ccela/3.L.6": {
          "description": " درجے کے مطابق بات چیت، عمومی تعلیمی، اور ڈومین کے لیے مخصوص الفاظ اور فقرے اکھٹے کریں اور انہیں درست طریقے سے استعمال کریں، بشمول وہ الفاظ جو مقام اور وقت کے تعلقات کا اشارہ دیتے ہیں (مثلاً، اس رات کے کھانے کے بعد ہم ان کی تلاش میں نکل پڑے)۔"
        },
        "ccela/3.SL.1": {
          "description": "گریڈ 3 کے موضوعات اور نصاب کے حوالے سے متنوع شراکت داروں کے ساتھ مؤثر طریقے سے باہمی تعاون پر مبنی (انفرادی ملاقاتوں، گروپوں کی شکل میں، اور اساتذہ کی قیادت میں) بات چیت کریں، جہاں آپ کے خیالات ایک دوسرے کی حمایت کریں اور سب واضح طور پر اپنے خیالات کا اظہار کریں."
        },
        "ccmath/1.OA.1": {
          "description": "جمع اور منفی کا استعمال کر کے 20 کے ہندسے تک کے الفاظ کے مسائل حل کریں جن میں ایسے حالات جیسے جمع کرنا، تفریق کرنا، اکھٹے کرنا، علیحدہ کرنا، اور موازنہ کرنا شامل ہوں اور تمام پوزیشنوں میں غیر معلوم عناصر وجود رکھتے ہوں، مثلا چیزیں، خاکے اور مساواتیں جن میں علامت موجود ہوں برائے"
        },
        "ccmath/2.OA.1": {
          "description": "جمع اور منفی کا استعمال کر کے 100 کے ہندسے تک کے الفاظ کے مسائل، جو ایک یا دو قدم کے حامل ہوں، حل کریں جن میں ایسے حالات جیسے جمع کرنا، تفریق کرنا، اکھٹے کرنا، علیحدہ کرنا، اور موازنہ کرنا شامل ہوں اور تمام پوزیشنوں میں غیر معلوم عناصر وجود رکھتے ہوں، مثلا خاکے اور مساواتیں جن میں علامت موجود ہوں"
        },
        "ccmath/3.OA.3": {
          "description": "ضرب اور تقسیم کا استعمال کر کے 100 کے ہندسے تک کے الفاظ کے مسائل حل کریں جن میں ایسے حالات جیسے مساوی گروپس، صفیں، اور پیمائش کے مقدار شامل ہوں، مثلا جن میں خاکے اور مساوات شامل ہوں اور نامعلوم ہندسے کے لیے ایک علامت استعمال کی گئی ہو۔ 1"
        },
        "csta2011/CD.L1:3-01": {
          "description": "کمپیوٹرز اور متعلقہ ٹیکنالوجیز کو کامیابی سے چلانے کے لیے معیاری ان پٹ اور آؤٹ پٹ ڈیوائسز کا استعمال کریں۔"
        },
        "csta2011/CI.L1:3-01": {
          "description": "ٹیکنالوجی کے نظام اور سافٹ ویئر کے استعمال میں ذمہ دار ڈیجیٹل شہریت (قانونی اور اخلاقی رویے) کی مشق کریں۔"
        },
        "csta2011/CPP.L1:6-01": {
          "description": "مسائل کو حل کرنے اور اپنی مدد آپ سیکھنے کے لیے، ٹیکنالوجی کے وسائل (مثلاً، کیلکولیٹر، ڈیٹا اکٹھا کرنے کی تحقیقات، موبائل آلات، ویڈیوز، تعلیمی سافٹ ویئر اور ویب ٹولز) کا استعمال  کریں۔"
        },
        "ccela/11-12.L.6": {
          "description": "کالج اور کیریئر کی تیاری کی سطح پر پڑھنے، لکھنے، بولنے اور سننے کے لیے کافی عام تعلیمی اور ڈومین کے لیے مخصوص الفاظ اور فقرے حاصل اور استعمال کریں؛ جب غور کیا جائے تو الفاظ کے علم کو جمع کرنے میں آزادی کا مظاہرہ کریں۔"
        },
        "ccela/4.L.6": {
          "description": "درجے کے مطابق عمومی تعلیمی اور ڈومین کے لیے مخصوص الفاظ اور فقرے اکھٹے کریں اور انہیں درست طریقے سے استعمال کریں، بشمول وہ جو عین اعمال، جذبات، یا وجود کی حالتوں کا اشارہ دیتے ہیں (مثلاً، quizzed, whined, stammered) اور وہ الفاظ اور فقرے جو کسی خاص موضوع کے لیے بنیادی ہوں (مثلاً"
        },
        "ccela/5.L.6": {
          "description": "درجے کے مطابق عمومی تعلیمی اور ڈومین کے لیے مخصوص الفاظ اور فقرے اکھٹے کریں اور انہیں درست طریقے سے استعمال کریں، بشمول وہ جو تضاد، اضافے، اور دیگر منطقی تعلقات کا اشارہ دیتے ہیں (مثلاً، however (تاہم)، although (اگرچہ)، nevertheless (اس کے باوجود)، similarly (اسی طرح)، moreover (اس کے علاوہ)، in addition (اس کے علاوہ))۔"
        },
        "ccmath/4.MD.6": {
          "description": "ایک پروٹریکٹر کا استعمال کرتے ہوئے اعداد کامل (whole numbers) کی ڈگریوں میں زاویوں کی پیمائش کریں. مخصوص پیمائش کے زاویوں کا خاکہ بنائیں."
        },
        "ccmath/4.NBT.4": {
          "description": "معیاری الگورتھم کا استعمال کرتے ہوئے روانی سے کثیر ہندسوں کے کامل اعداد کو جمع اور تفریق کریں."
        },
        "ccmath/4.NBT.5": {
          "description": "جگہ کی قدر (place value) اور آپریشنز کی خصوصیات پر مبنی حکمت عملیوں کا استعمال کرتے ہوئے، چار اعداد کے ایک کامل ہندسے کو کسی ایک عدد والے کامل ہندسے سے ضرب دیں، اور دو اعداد کے دو کامل ہندسوں کو آپس میں ضرب کریں. مساواتوں، مستطیلی سلسلوں (rectangular arrays) کا استعمال کرتے ہوئے خاکے بنا کر حساب کتاب کی وضاحت کریں."
        },
        "ccmath/7.G.2": {
          "description": " (فری ہینڈ، پیمانے اور پروٹریکٹر، اور ٹیکنالوجی کا استعمال کرتے ہوئے) دی گئی شرائط کے مطابق جیومیٹرک شکلیں کھینچیں. زاویوں یا اطراف کے تین پیمائشوں سے مثلث بنانے پر توجہ مرکوز کریں، یہ دیکھتے ہوئے کہ حالات کب ایک منفرد مثلث کا تعین کرتے ہیں، ایک سے زیادہ مثلث"
        },
        "csta2011/CPP.L1:3-02": {
          "description": "پوری نصاب میں سیکھنے میں مدد کے لیے ترقیاتی طور پر مناسب ملٹی میڈیا وسائل (مثلاً انٹرایکٹو کتابیں اور تعلیمی سافٹ ویئر) استعمال کریں."
        },
        "csta2011/CPP.L1:3-04": {
          "description": "ایک سادہ کام کو پورا کرنے کے لیے بیانات کا ایک سیٹ بنائیں (مثال کے طور پر، کچھوے کی ہدایات)."
        },
        "ccela/11-12.W.6": {
          "description": "انفرادی یا مشترک تحریری محصولات بنانے، جھاپنے اور اپڈیٹ کرنے کے لیے ٹیکنالوجی، بشمول انٹرنٹ، کا استعمال کرتے ہوئے نئی معلومات اور دلائل کے ہمراہ مسلسل فیڈبیک حاصل کریں."
        },
        "ccela/4.W.3": {
          "description": "مؤثر تکنیک، وضاحتی تفصیلات، اور واضح واقعات کی ترتیب کا استعمال کرتے ہوئے حقیقی یا تصوراتی تجربات یا واقعات بنانے کے لیے بیانیے لکھیں۔"
        },
        "ccela/6.W.6": {
          "description": "تحریر تیار کرنے اور شائع کرنے کے ساتھ ساتھ دوسروں کے ساتھ بات چیت اور تعاون کرنے کے لیے، انٹرنیٹ سمیت ٹیکنالوجی کا استعمال کریں؛ کیبورڈ استعمال کرنے کی اتنی مہارت کا مظاہرہ کرے کہ ایک ہی نشست میں کم از کم تین صفحات لکھ سکیں."
        },
        "ccela/7.W.3": {
          "description": "مؤثر تکنیک، متعلقہ وضاحتی تفصیلات، اور اچھی طرح سے منظم واقعات کی ترتیب کا استعمال کرتے ہوئے حقیقی یا تصوراتی تجربات یا واقعات بنانے کے لیے بیانیے لکھیں۔"
        },
        "ccela/7.W.6": {
          "description": " تحریر تیار کرنے اور شائع کرنے اور ذرائع سے لنک کرنے اور ان کا حوالہ دینے کے ساتھ ساتھ دوسروں کے ساتھ تعامل اور تعاون کرنے کے لیے، ٹکنالوجی کا استعمال کریں، بشمول انٹرنیٹ کا استعمال، ذرائع کو لنک کرنے اور حوالہ دینے کے۔"
        },
        "ccela/8.W.6": {
          "description": "تحریر تیار کرنے اور شائع کرنے کے ساتھ ساتھ، موثر انداز میں معلومات اور خیالات کے درمیان تعلق پیش کرنے، دوسروں کے ساتھ بات چیت اور تعاون کرنے کے لیے، انٹرنیٹ سمیت ٹیکنالوجی کا استعمال کریں."
        },
        "ccela/9-10.W.6": {
          "description": "دیگر معلومات سے منسلک کرنے اور معلومات کو لچکدار اور متحرک طور پر ظاہر کرنے کے لیے ٹیکنالوجی کی صلاحیت کا فائدہ اٹھاتے ہوئے انفرادی یا مشترکہ تحریری مصنوعات تیار کرنے، شائع کرنے اور اپ ڈیٹ کرنے کے لیے، انٹرنیٹ سمیت ٹیکنالوجی کا استعمال کریں۔"
        },
        "ccmath/MP.4": {
          "description": "ریاضی کے ساتھ ماڈل بنائیں"
        },
        "csta2011/CL.L1:6-02": {
          "description": "حل یا مصنوعات تیار کرنے کے مقصد سے باہمی طور پر مسائل حل کرنے کی سرگرمیوں میں حصہ لینے کے لیے آن لائن وسائل (مثلاً ای میل، آن لائن مباحثے، باہمی تعاون کے ویب ماحول) استعمال کریں۔"
        },
        "csta2011/CPP.L1:3-01": {
          "description": "عمر کے مطابق تحقیق کرنے کے لیے ٹیکنالوجی کے وسائل کا استعمال کریں۔"
        },
        "csta2011/CPP.L2:3": {
          "description": "ٹکنالوجی کے وسائل کا استعمال کرتے ہوئے پروڈکٹس (مثلاً ویب پیجز، موبائل ایپلیکیشنز، اینیمیشن) کو ڈیزائن، تیار، شائع اور پیش کریں جو نصاب کے تصورات ظاہر کرتی اور سمجھاتے ہوں."
        },
        "iste/2.a": {
          "description": "مختلف قسم کے ڈیجیٹل ماحول اور میڈیا استعمال کرتے ہوئے ساتھیوں، ماہرین، یا دوسروں کے ساتھ تعامل، تعاون، اور شائع کریں۔"
        },
        "iste/2.b": {
          "description": "مختلف قسم کے میڈیا اور فارمیٹس کا استعمال کرتے ہوئے متعدد سامعین تک مؤثر طریقے سے معلومات پہنچائیں اور ان کے ساتھ خیالات کا تبادلہ کریں۔"
        },
        "iste/4.d": {
          "description": "متبادل حل تلاش کرنے کے لیے متعدد عمل اور متنوع نقطہ نظر کا استعمال کریں۔"
        },
        "csp2021/IOC-2.B.5": {
          "description": "انکرپشن غیر مجاز رسائی کو روکنے کے لیے ڈیٹا کو انکوڈ کرنے کا عمل ہے. ڈیکرپشن ڈیٹا کو ڈیکوڈ کرنے کا عمل ہے۔ انکرپشن کے دو عام طریقے یہ ہیں: ● ہم آہنگ کلید کی خفیہ کاری (Symmetric key encryption) میں انکرپشن اور ڈیکرپشن دونوں کے لیے ایک کلید شامل ہوتی ہے. ● عوامی کلید کی خفیہ کاری (Public key encryption) میں انکرپشن کے لیے ایک عوامی کلید کو ڈیکرپشن کے لیے ایک نجی کلید سے جوڑا جاتا ہے. بھیجنے والے کو پیغا خفیہ کرنے کے لیے وصول کنندہ کی نجی کلید کی ضرورت نہیں ہوتی، لیکن پیغام کو ڈیکرپٹ کرنے کے لیے وصول کنندہ کی نجی کلید کی ضرورت ہوتی ہے. استثناء کا بیان (EKIOC-2.B.5): انکرپشن اور ڈکرپشن کے لیے مخصوص ریاضیاتی طریقہ کار اس کورس اور مقدم داخولوں (Advanced Placement) کے امتحان کے دائرہ کار سے باہر ہیں."
        },
        "csta/3A-NI-06": {
          "description": "کارکردگی، فزیبلٹی، اور اخلاقی اثرات جیسے عوامل کی بنیاد پر مختلف منظرناموں سے نمٹنے کے لیے حفاظتی اقدامات تجویز کریں۔"
        },
        "csta/3A-NI-07": {
          "description": "کمپیوٹر سسٹم کے استعمال اور حفاظت کے درمیان تعاملات کو مدنظر رکھتے ہوئے مختلف حفاظتی اقدامات کا موازنہ کریں۔"
        },
        "csta/3B-NI-04": {
          "description": "سافٹ ویئر ڈویلپرز کے آلات اور معلومات کو غیر مجاز رسائی سے بچانے کے طریقوں کا موازنہ کریں۔"
        },
        "csp2021/DAT-1.D.1": {
          "description": "ڈیٹا کمپریشن منتقل یا ذخیرہ شدہ ڈیٹا کے سائز (بٹس کی تعداد) کو کم کر سکتا ہے۔"
        },
        "csp2021/DAT-1.D.2": {
          "description": "کم بٹس کا مطلب ضروری نہیں کہ کم معلومات ہوں۔"
        },
        "csp2021/DAT-1.D.3": {
          "description": "کمپریشن سے سائز میں کمی کی مقدار کا انحصار اصل ڈیٹا کی نمائندگی میں فالتو پن (redundancy) کی مقدار اور لاگو کردہ کمپریشن الگورتھم دونوں پر ہوتا ہے۔"
        },
        "csp2021/DAT-1.D.4": {
          "description": "ضیاع کے بغیر ڈیٹا کمپریشن الگورتھم عام طور پر اصل ڈیٹا کی مکمل تعمیر نو کی ضمانت دیتے ہوئے ذخیرہ شدہ یا منتقل ہونے والے بٹس کی تعداد کو کم کر سکتے ہیں۔"
        },
        "csta/3A-DA-10": {
          "description": "ڈیٹا کے عناصر کے انت‍ظام اور ڈیٹا کو محفوظ کرنے کی جگہ کے درمیان ٹریڈآف کا اندازہ لگائیں."
        },
        "csta/1B-IC-18": {
          "description": "کمپیوٹنگ ٹیکنالوجیز جنہوں نے دنیا کو بدل دیا ہے پر بحث کریں اور اس بات کا اظہار کریں کہ وہ ٹیکنالوجیز ثقافتی طور طریقوں پر کس طرح اثر انداز ہوتی ہیں اور کیسے ان سے متاثر ہوتی ہیں۔"
        },
        "csta/1B-DA-07": {
          "description": "وجہ اور اثر کے تعلقات کو اجاگر کرنے یا تجویز کرنے، نتائج کی پیشن گوئی کرنے، یا کسی خیال کو بیان کرنے کے لیے ڈیٹا کا استعمال کریں."
        },
        "1B-DA-07": {
          "description": "وجہ اور اثر کے تعلقات کو اجاگر کرنے یا تجویز کرنے، نتائج کی پیشن گوئی کرنے، یا کسی خیال کو بیان کرنے کے لیے ڈیٹا کا استعمال کریں."
        },
        "1B-IC-18": {
          "description": "کمپیوٹنگ ٹیکنالوجیز جنہوں نے دنیا کو بدل دیا ہے پر بحث کریں اور اس بات کا اظہار کریں کہ وہ ٹیکنالوجیز ثقافتی طور طریقوں پر کس طرح اثر انداز ہوتی ہیں اور کیسے ان سے متاثر ہوتی ہیں۔"
        },
        "3A-DA-10": {
          "description": "ڈیٹا کے عناصر کے انت‍ظام اور ڈیٹا کو محفوظ کرنے کی جگہ کے درمیان ٹریڈآف کا اندازہ لگائیں."
        },
        "3A-NI-06": {
          "description": "کارکردگی، فزیبلٹی، اور اخلاقی اثرات جیسے عوامل کی بنیاد پر مختلف منظرناموں سے نمٹنے کے لیے حفاظتی اقدامات تجویز کریں۔"
        },
        "3A-NI-07": {
          "description": "کمپیوٹر سسٹم کے استعمال اور حفاظت کے درمیان تعاملات کو مدنظر رکھتے ہوئے مختلف حفاظتی اقدامات کا موازنہ کریں۔"
        },
        "3B-NI-04": {
          "description": "سافٹ ویئر ڈویلپرز کے آلات اور معلومات کو غیر مجاز رسائی سے بچانے کے طریقوں کا موازنہ کریں۔"
        },
        "DAT-1.D.1": {
          "description": "ڈیٹا کمپریشن منتقل یا ذخیرہ شدہ ڈیٹا کے سائز (بٹس کی تعداد) کو کم کر سکتا ہے۔"
        },
        "DAT-1.D.2": {
          "description": "کم بٹس کا مطلب ضروری نہیں کہ کم معلومات ہوں۔"
        },
        "DAT-1.D.3": {
          "description": "کمپریشن سے سائز میں کمی کی مقدار کا انحصار اصل ڈیٹا کی نمائندگی میں فالتو پن (redundancy) کی مقدار اور لاگو کردہ کمپریشن الگورتھم دونوں پر ہوتا ہے۔"
        },
        "DAT-1.D.4": {
          "description": "ضیاع کے بغیر ڈیٹا کمپریشن الگورتھم عام طور پر اصل ڈیٹا کی مکمل تعمیر نو کی ضمانت دیتے ہوئے ذخیرہ شدہ یا منتقل ہونے والے بٹس کی تعداد کو کم کر سکتے ہیں۔"
        },
        "IOC-2.B.5": {
          "description": "انکرپشن غیر مجاز رسائی کو روکنے کے لیے ڈیٹا کو انکوڈ کرنے کا عمل ہے. ڈیکرپشن ڈیٹا کو ڈیکوڈ کرنے کا عمل ہے۔ انکرپشن کے دو عام طریقے یہ ہیں: ● ہم آہنگ کلید کی خفیہ کاری (Symmetric key encryption) میں انکرپشن اور ڈیکرپشن دونوں کے لیے ایک کلید شامل ہوتی ہے. ● عوامی کلید کی خفیہ کاری (Public key encryption) میں انکرپشن کے لیے ایک عوامی کلید کو ڈیکرپشن کے لیے ایک نجی کلید سے جوڑا جاتا ہے. بھیجنے والے کو پیغا خفیہ کرنے کے لیے وصول کنندہ کی نجی کلید کی ضرورت نہیں ہوتی، لیکن پیغام کو ڈیکرپٹ کرنے کے لیے وصول کنندہ کی نجی کلید کی ضرورت ہوتی ہے. استثناء کا بیان (EKIOC-2.B.5): انکرپشن اور ڈکرپشن کے لیے مخصوص ریاضیاتی طریقہ کار اس کورس اور مقدم داخولوں (Advanced Placement) کے امتحان کے دائرہ کار سے باہر ہیں."
        },
        "CD.L1:3-01": {
          "description": "کمپیوٹرز اور متعلقہ ٹیکنالوجیز کو کامیابی سے چلانے کے لیے معیاری ان پٹ اور آؤٹ پٹ ڈیوائسز کا استعمال کریں۔"
        },
        "CI.L1:3-01": {
          "description": "ٹیکنالوجی کے نظام اور سافٹ ویئر کے استعمال میں ذمہ دار ڈیجیٹل شہریت (قانونی اور اخلاقی رویے) کی مشق کریں۔"
        },
        "CL.L1:6-02": {
          "description": "حل یا مصنوعات تیار کرنے کے مقصد سے باہمی طور پر مسائل حل کرنے کی سرگرمیوں میں حصہ لینے کے لیے آن لائن وسائل (مثلاً ای میل، آن لائن مباحثے، باہمی تعاون کے ویب ماحول) استعمال کریں۔"
        },
        "CPP.L1:3-01": {
          "description": "عمر کے مطابق تحقیق کرنے کے لیے ٹیکنالوجی کے وسائل کا استعمال کریں۔"
        },
        "CPP.L1:3-02": {
          "description": "پوری نصاب میں سیکھنے میں مدد کے لیے ترقیاتی طور پر مناسب ملٹی میڈیا وسائل (مثلاً انٹرایکٹو کتابیں اور تعلیمی سافٹ ویئر) استعمال کریں."
        },
        "CPP.L1:3-04": {
          "description": "ایک سادہ کام کو پورا کرنے کے لیے بیانات کا ایک سیٹ بنائیں (مثال کے طور پر، کچھوے کی ہدایات)."
        },
        "CPP.L1:6-01": {
          "description": "مسائل کو حل کرنے اور اپنی مدد آپ سیکھنے کے لیے، ٹیکنالوجی کے وسائل (مثلاً، کیلکولیٹر، ڈیٹا اکٹھا کرنے کی تحقیقات، موبائل آلات، ویڈیوز، تعلیمی سافٹ ویئر اور ویب ٹولز) کا استعمال  کریں۔"
        },
        "CPP.L1:6-06": {
          "description": "بلاک پر مبنی بصری پروگرامنگ زبان کا استعمال کرتے ہوئے مسائل کے حل استعمال کریں."
        },
        "CPP.L2:3": {
          "description": "ٹکنالوجی کے وسائل کا استعمال کرتے ہوئے پروڈکٹس (مثلاً ویب پیجز، موبائل ایپلیکیشنز، اینیمیشن) کو ڈیزائن، تیار، شائع اور پیش کریں جو نصاب کے تصورات ظاہر کرتی اور سمجھاتے ہوں."
        },
        "CT.L2:1": {
          "description": "مسائل کے حل ڈیزائن کرنے (مثال کے طور پر، مسائل کا بیان اور ان پر غور، نمونے کی مثالوں کی جانچ پڑتال، ڈیزائن، حل کے طریقہ کار کا نفاذ، جانچ اور تشخیص) کے لیے الگورتھم کے ذریعے مسائل حل کرنے کے بنیادی اقدامات کا استعمال کریں."
        },
        "CT.L2:12": {
          "description": "کسی مسئلے کو ذیلی مسائل میں تحلیل کرنے کے لیے تجریدی انداز فکر کا استعمال کریں."
        },
        "CT.L2:6": {
          "description": "ان ہدایات کی وضاحت اور تجزیہ کریں جن کی پیروی کرنی ہے (مثال کے طور پر، ویڈیو گیم میں ایک کردار کے رویے کی وضاحت کریں کہ کیسے قواعد اور الگورتھم سے چلتی ہے)."
        },
        "CT.L2:7": {
          "description": "متن، آوازوں، تصاویر اور نمبروں کے متنوع طریقوں سے ڈیٹا کی نمائندگی کریں."
        },
        "CT.L2:8": {
          "description": "مسائل کی حالتوں، ڈھانچوں اور ڈیٹا کی بصری نمائندگیوں کا استعمال کریں (مثلاً گراف، چارٹ، نیٹ ورک ڈایاگرام، فلو چارٹس)."
        },
        "1.L.6": {
          "description": "بات چیت، پڑھنے اور سامنے پڑھے جانے، اور پیغامات کے جوابات دینے کے ذریعے حاصل کیے گئے الفاظ اور فقرے استعمال کریں، بشمول سادہ رشتوں کا اشارہ دینے کے لیے اکثر واقع ہونے والے حروف عطف (جیسے، کیونکہ) کا استعمال کریں."
        },
        "11-12.L.6": {
          "description": "کالج اور کیریئر کی تیاری کی سطح پر پڑھنے، لکھنے، بولنے اور سننے کے لیے کافی عام تعلیمی اور ڈومین کے لیے مخصوص الفاظ اور فقرے حاصل اور استعمال کریں؛ جب غور کیا جائے تو الفاظ کے علم کو جمع کرنے میں آزادی کا مظاہرہ کریں۔"
        },
        "2.L.6": {
          "description": "بات چیت، پڑھنے اور سامنے پڑھے جانے، اور پیغامات کے جوابات دینے کے ذریعے حاصل کیے گئے الفاظ اور فقرے استعمال کریں، بشمول وضاحت دینے کے لیے اسم صفت اور اسم ظریف کا استعمال (جیسے، جب دوسرے بچے خوش ہوتے ہیں تو وہ خو خوش ہو جاتے ہیں)."
        },
        "3.L.6": {
          "description": " درجے کے مطابق بات چیت، عمومی تعلیمی، اور ڈومین کے لیے مخصوص الفاظ اور فقرے اکھٹے کریں اور انہیں درست طریقے سے استعمال کریں، بشمول وہ الفاظ جو مقام اور وقت کے تعلقات کا اشارہ دیتے ہیں (مثلاً، اس رات کے کھانے کے بعد ہم ان کی تلاش میں نکل پڑے)۔"
        },
        "4.L.6": {
          "description": "درجے کے مطابق عمومی تعلیمی اور ڈومین کے لیے مخصوص الفاظ اور فقرے اکھٹے کریں اور انہیں درست طریقے سے استعمال کریں، بشمول وہ جو عین اعمال، جذبات، یا وجود کی حالتوں کا اشارہ دیتے ہیں (مثلاً، quizzed, whined, stammered) اور وہ الفاظ اور فقرے جو کسی خاص موضوع کے لیے بنیادی ہوں (مثلاً"
        },
        "5.L.6": {
          "description": "درجے کے مطابق عمومی تعلیمی اور ڈومین کے لیے مخصوص الفاظ اور فقرے اکھٹے کریں اور انہیں درست طریقے سے استعمال کریں، بشمول وہ جو تضاد، اضافے، اور دیگر منطقی تعلقات کا اشارہ دیتے ہیں (مثلاً، however (تاہم)، although (اگرچہ)، nevertheless (اس کے باوجود)، similarly (اسی طرح)، moreover (اس کے علاوہ)، in addition (اس کے علاوہ))۔"
        },
        "9-10.L.6": {
          "description": "کالج اور کیریئر کی تیاری کی سطح پر پڑھنے، لکھنے، بولنے اور سننے کے لیے کافی عام تعلیمی اور ڈومین کے لیے مخصوص الفاظ اور فقرے حاصل اور استعمال کریں؛ جب غور کیا جائے تو الفاظ کے علم کو جمع کرنے میں آزادی کا مظاہرہ کریں۔"
        },
        "11-12.RI.4": {
          "description": "الفاظ اور جملے کے معنوں کا تعین کریں جیسا کہ وہ کسی متن میں استعمال ہوتے ہیں، بشمول علامتی، مفہوم، اور تکنیکی معنوں میں ان کے استعمال کے؛ تجزیہ کریں کہ ایک مصنف کس طرح کسی متن کے دوران کلیدی اصطلاح یا اصطلاحات کے معنوں کو استعمال اور بہتر کرتا ہے (مثال کے طور پر، میڈیسن کیسے تعریف کرتے ہیں"
        },
        "3.RL.4": {
          "description": "متن میں مخصوص استعمال کے مطابق الفاظ اور جملوں کے معنوں کا تعین کریں، بشمول لغوی اور غیر لغوی زبان میں فرق کر کے۔"
        },
        "4.RL.7": {
          "description": "کہانی یا ڈرامے کے متن اور متن کی بصری یا زبانی پیشکش کے درمیان رابطہ قائم کریں، اور نشاندہی کریں کہ ہر ورژن میں مخصوص وضاحتیں اور سمتیں کہاں کہاں منعکس ہوئی ہیں."
        },
        "5.RL.4": {
          "description": "متن میں مخصوص استعمال کے مطابق الفاظ اور جملوں کے معنوں کا تعین کریں، بشمول علامتی زبان جیسے استعارات اور تشبیہات۔"
        },
        "5.RL.7": {
          "description": "تجزیہ کریں کہ کس طرح بصری اور ملٹی میڈیا عناصر متن کے معنی، لہجے یا خوبصورتی میں حصہ ڈالتے ہیں (مثال کے طور پر، گرافک ناول، افسانے کی ملٹی میڈیا پیشکش، لوک کہانی، افسانہ، نظم)۔"
        },
        "1.SL.1": {
          "description": " ہم عمروں اور بڑوں کے چھوٹے اور بڑے گروپوں میں متنوع شراکت داروں کے ساتھ گریڈ 1 کے موضوعات اور متن کے بارے میں باہمی بات چیت میں حصہ لیں۔"
        },
        "2.SL.1": {
          "description": " ہم عمروں اور بڑوں کے چھوٹے اور بڑے گروپوں میں متنوع شراکت داروں کے ساتھ گریڈ 2 کے موضوعات اور متن کے بارے میں باہمی بات چیت میں حصہ لیں۔"
        },
        "3.SL.1": {
          "description": "گریڈ 3 کے موضوعات اور نصاب کے حوالے سے متنوع شراکت داروں کے ساتھ مؤثر طریقے سے باہمی تعاون پر مبنی (انفرادی ملاقاتوں، گروپوں کی شکل میں، اور اساتذہ کی قیادت میں) بات چیت کریں، جہاں آپ کے خیالات ایک دوسرے کی حمایت کریں اور سب واضح طور پر اپنے خیالات کا اظہار کریں."
        },
        "6.SL.1": {
          "description": "گریڈ 6 کے موضوعات، نصاب، اور مسائل کے حوالے سے متنوع شراکت داروں کے ساتھ مؤثر طریقے سے باہمی تعاون پر مبنی (انفرادی ملاقاتوں، گروپوں کی شکل میں، اور اساتذہ کی قیادت میں) بات چیت کریں، جہاں آپ کے خیالات ایک دوسرے کی حمایت کریں اور سب واضح طور پر اپنے خیالات کا اظہار کریں."
        },
        "7.SL.1": {
          "description": "گریڈ 7 کے موضوعات، نصاب، اور مسائل کے حوالے سے متنوع شراکت داروں کے ساتھ مؤثر طریقے سے باہمی تعاون پر مبنی (انفرادی ملاقاتوں، گروپوں کی شکل میں، اور اساتذہ کی قیادت میں) بات چیت کریں، جہاں آپ کے خیالات ایک دوسرے کی حمایت کریں اور سب واضح طور پر اپنے خیالات کا اظہار کریں."
        },
        "11-12.W.6": {
          "description": "انفرادی یا مشترک تحریری محصولات بنانے، جھاپنے اور اپڈیٹ کرنے کے لیے ٹیکنالوجی، بشمول انٹرنٹ، کا استعمال کرتے ہوئے نئی معلومات اور دلائل کے ہمراہ مسلسل فیڈبیک حاصل کریں."
        },
        "3.W.3": {
          "description": "مؤثر تکنیک، وضاحتی تفصیلات، اور واضح واقعات کی ترتیب کا استعمال کرتے ہوئے حقیقی یا تصوراتی تجربات یا واقعات بنانے کے لیے بیانیے لکھیں۔"
        },
        "4.W.3": {
          "description": "مؤثر تکنیک، وضاحتی تفصیلات، اور واضح واقعات کی ترتیب کا استعمال کرتے ہوئے حقیقی یا تصوراتی تجربات یا واقعات بنانے کے لیے بیانیے لکھیں۔"
        },
        "5.W.3": {
          "description": "مؤثر تکنیک، وضاحتی تفصیلات، اور واضح واقعات کی ترتیب کا استعمال کرتے ہوئے حقیقی یا تصوراتی تجربات یا واقعات بنانے کے لیے بیانیے لکھیں۔"
        },
        "6.W.3": {
          "description": "مؤثر تکنیک، متعلقہ وضاحتی تفصیلات، اور اچھی طرح سے منظم واقعات کی ترتیب کا استعمال کرتے ہوئے حقیقی یا تصوراتی تجربات یا واقعات بنانے کے لیے بیانیے لکھیں۔"
        },
        "6.W.6": {
          "description": "تحریر تیار کرنے اور شائع کرنے کے ساتھ ساتھ دوسروں کے ساتھ بات چیت اور تعاون کرنے کے لیے، انٹرنیٹ سمیت ٹیکنالوجی کا استعمال کریں؛ کیبورڈ استعمال کرنے کی اتنی مہارت کا مظاہرہ کرے کہ ایک ہی نشست میں کم از کم تین صفحات لکھ سکیں."
        },
        "7.W.3": {
          "description": "مؤثر تکنیک، متعلقہ وضاحتی تفصیلات، اور اچھی طرح سے منظم واقعات کی ترتیب کا استعمال کرتے ہوئے حقیقی یا تصوراتی تجربات یا واقعات بنانے کے لیے بیانیے لکھیں۔"
        },
        "7.W.6": {
          "description": " تحریر تیار کرنے اور شائع کرنے اور ذرائع سے لنک کرنے اور ان کا حوالہ دینے کے ساتھ ساتھ دوسروں کے ساتھ تعامل اور تعاون کرنے کے لیے، ٹکنالوجی کا استعمال کریں، بشمول انٹرنیٹ کا استعمال، ذرائع کو لنک کرنے اور حوالہ دینے کے۔"
        },
        "8.W.3": {
          "description": "مؤثر تکنیک، متعلقہ وضاحتی تفصیلات، اور اچھی طرح سے منظم واقعات کی ترتیب کا استعمال کرتے ہوئے حقیقی یا تصوراتی تجربات یا واقعات بنانے کے لیے بیانیے لکھیں۔"
        },
        "8.W.6": {
          "description": "تحریر تیار کرنے اور شائع کرنے کے ساتھ ساتھ، موثر انداز میں معلومات اور خیالات کے درمیان تعلق پیش کرنے، دوسروں کے ساتھ بات چیت اور تعاون کرنے کے لیے، انٹرنیٹ سمیت ٹیکنالوجی کا استعمال کریں."
        },
        "9-10.W.6": {
          "description": "دیگر معلومات سے منسلک کرنے اور معلومات کو لچکدار اور متحرک طور پر ظاہر کرنے کے لیے ٹیکنالوجی کی صلاحیت کا فائدہ اٹھاتے ہوئے انفرادی یا مشترکہ تحریری مصنوعات تیار کرنے، شائع کرنے اور اپ ڈیٹ کرنے کے لیے، انٹرنیٹ سمیت ٹیکنالوجی کا استعمال کریں۔"
        },
        "11-12.WHST.6": {
          "description": "انفرادی یا مشترک تحریری محصولات بنانے، جھاپنے اور اپڈیٹ کرنے کے لیے ٹیکنالوجی، بشمول انٹرنٹ، کا استعمال کرتے ہوئے نئی معلومات اور دلائل کے ہمراہ مسلسل فیڈبیک حاصل کریں."
        },
        "9-10.WHST.6": {
          "description": "دیگر معلومات سے منسلک کرنے اور معلومات کو لچکدار اور متحرک طور پر ظاہر کرنے کے لیے ٹیکنالوجی کی صلاحیت کا فائدہ اٹھاتے ہوئے انفرادی یا مشترکہ تحریری مصنوعات تیار کرنے، شائع کرنے اور اپ ڈیٹ کرنے کے لیے، انٹرنیٹ سمیت ٹیکنالوجی کا استعمال کریں۔"
        },
        "K-2-ETS1-1": {
          "description": "سوالات پوچھیں، مشاہدات کریں، اور اس صورتحال کے بارے میں معلومات اکٹھی کریں جسے لوگ تبدیل کرنا چاہتے ہیں تاکہ ایک سادہ مسئلہ کی وضاحت کی جا سکے جسے کسی نئی یا بہتر چیز یا آلے کی ترقی کی جانب سے حل کیا جا سکتا ہے۔"
        },
        "K-2-ETS1-2": {
          "description": "ایک سادہ خاکہ، ڈرائنگ، یا مادی ماڈل تیار کریں تاکہ یہ واضح کیا جا سکے کہ کسی چیز کی شکل کسی مسئلے کو حل کرنے کے لیے ضرورت کے مطابق کام کرنے میں کس طرح مدد کرتی ہے۔"
        },
        "7.G.2": {
          "description": " (فری ہینڈ، پیمانے اور پروٹریکٹر، اور ٹیکنالوجی کا استعمال کرتے ہوئے) دی گئی شرائط کے مطابق جیومیٹرک شکلیں کھینچیں. زاویوں یا اطراف کے تین پیمائشوں سے مثلث بنانے پر توجہ مرکوز کریں، یہ دیکھتے ہوئے کہ حالات کب ایک منفرد مثلث کا تعین کرتے ہیں، ایک سے زیادہ مثلث"
        },
        "4.MD.5.b": {
          "description": "ایک زاویہ جو n ایک ڈگری کے زاویوں سے گھومتا ہے اسے کہا جاتا ہے کہ ایک زاویہ کی پیمائش n ڈگری ہے۔"
        },
        "4.MD.6": {
          "description": "ایک پروٹریکٹر کا استعمال کرتے ہوئے اعداد کامل (whole numbers) کی ڈگریوں میں زاویوں کی پیمائش کریں. مخصوص پیمائش کے زاویوں کا خاکہ بنائیں."
        },
        "MP.1": {
          "description": "مسائل کا احساس کریں اور ان کو حل کرنے میں ثابت قدم رہیں"
        },
        "MP.2": {
          "description": "تجریدی اور مقداری طور پر استدلال کریں"
        },
        "MP.4": {
          "description": "ریاضی کے ساتھ ماڈل بنائیں"
        },
        "MP.5": {
          "description": "حکمت عملی سے مناسب اوزار استعمال کریں"
        },
        "MP.6": {
          "description": "درستگی (دقّت) پر توجہ دیں"
        },
        "MP.7": {
          "description": "بنیادی ساخت کو تلاش کریں اور اسے استعمال کریں"
        },
        "MP.8": {
          "description": "تکراری استدلال میں باقاعدگی تلاش کریں اور اس کا اظہار کریں"
        },
        "4.NBT.4": {
          "description": "معیاری الگورتھم کا استعمال کرتے ہوئے روانی سے کثیر ہندسوں کے کامل اعداد کو جمع اور تفریق کریں."
        },
        "4.NBT.5": {
          "description": "جگہ کی قدر (place value) اور آپریشنز کی خصوصیات پر مبنی حکمت عملیوں کا استعمال کرتے ہوئے، چار اعداد کے ایک کامل ہندسے کو کسی ایک عدد والے کامل ہندسے سے ضرب دیں، اور دو اعداد کے دو کامل ہندسوں کو آپس میں ضرب کریں. مساواتوں، مستطیلی سلسلوں (rectangular arrays) کا استعمال کرتے ہوئے خاکے بنا کر حساب کتاب کی وضاحت کریں."
        },
        "1.OA.1": {
          "description": "جمع اور منفی کا استعمال کر کے 20 کے ہندسے تک کے الفاظ کے مسائل حل کریں جن میں ایسے حالات جیسے جمع کرنا، تفریق کرنا، اکھٹے کرنا، علیحدہ کرنا، اور موازنہ کرنا شامل ہوں اور تمام پوزیشنوں میں غیر معلوم عناصر وجود رکھتے ہوں، مثلا چیزیں، خاکے اور مساواتیں جن میں علامت موجود ہوں برائے"
        },
        "2.OA.1": {
          "description": "جمع اور منفی کا استعمال کر کے 100 کے ہندسے تک کے الفاظ کے مسائل، جو ایک یا دو قدم کے حامل ہوں، حل کریں جن میں ایسے حالات جیسے جمع کرنا، تفریق کرنا، اکھٹے کرنا، علیحدہ کرنا، اور موازنہ کرنا شامل ہوں اور تمام پوزیشنوں میں غیر معلوم عناصر وجود رکھتے ہوں، مثلا خاکے اور مساواتیں جن میں علامت موجود ہوں"
        },
        "3.OA.3": {
          "description": "ضرب اور تقسیم کا استعمال کر کے 100 کے ہندسے تک کے الفاظ کے مسائل حل کریں جن میں ایسے حالات جیسے مساوی گروپس، صفیں، اور پیمائش کے مقدار شامل ہوں، مثلا جن میں خاکے اور مساوات شامل ہوں اور نامعلوم ہندسے کے لیے ایک علامت استعمال کی گئی ہو۔ 1"
        },
        "1.a": {
          "description": "نئے خیالات، مصنوعات، یا اعمال کے طریقے (پراسسز) بنانے کے لیے موجودہ علم کا اطلاق کریں."
        },
        "1.b": {
          "description": "ذاتی یا گروہی اظہار کے ذریعہ نئے کام انجام دیں."
        },
        "1.c": {
          "description": "پیچیدہ نظاموں اور مسائل کو دریافت کرنے کے لیے ماڈلز اور سیولیشن (آزمائشی حالتیں) استعمال کریں."
        },
        "2.a": {
          "description": "مختلف قسم کے ڈیجیٹل ماحول اور میڈیا استعمال کرتے ہوئے ساتھیوں، ماہرین، یا دوسروں کے ساتھ تعامل، تعاون، اور شائع کریں۔"
        },
        "2.b": {
          "description": "مختلف قسم کے میڈیا اور فارمیٹس کا استعمال کرتے ہوئے متعدد سامعین تک مؤثر طریقے سے معلومات پہنچائیں اور ان کے ساتھ خیالات کا تبادلہ کریں۔"
        },
        "4.b": {
          "description": "ایک حل تیار کرنے یا کسی پروجیکٹ کو مکمل کرنے کے لیے سرگرمیوں کی منصوبہ بندی اور انتظام کریں."
        },
        "4.d": {
          "description": "متبادل حل تلاش کرنے کے لیے متعدد عمل اور متنوع نقطہ نظر کا استعمال کریں۔"
        },
        "6.a": {
          "description": "ٹیکنالوجی کے نظاموں (سسٹمز) کو سمجھیں اور انہیں استعمال کریں."
        },
        "6.c": {
          "description": "سسٹمز اور ایپلی کیشنز میں مسائل ڈھونڈ کر حل کریں."
        },
        "6.d": {
          "description": "موجودہ علم کو نئی ٹیکنالوجی کے سیکھنے میں استعمال کریں."
        }
      }
    }
  }
}