{
  "hi-IN": {
    "data": {
      "standard_categories": {
        "DAT-1": {
          "description": "जिस तरह से कंप्यूटर डेटा का प्रतिनिधित्व करता है वह उस तरीके से भिन्न होता है जिस तरह से उपयोगकर्ता के लिए डेटा की व्याख्या और प्रदर्शित किया जाता है। डेटा को एक ऐसे प्रतिनिधित्व में अनुवाद करने के लिए प्रोग्राम का उपयोग किया जाता है जिसे लोग आसानी से समझ सकें।"
        },
        "IOC-2": {
          "description": "कंप्यूटिंग नवाचारों के उपयोग से आपकी व्यक्तिगत सुरक्षा और पहचान के लिए जोखिम शामिल हो सकते हैं।"
        },
        "DAT-1.D": {
          "description": "किसी विशेष संदर्भ में सबसे उत्तम कौन सा है यह निर्धारित करने के लिए डेटा संक्षिप्तीकरण एल्गोरिदम की तुलना करें।"
        },
        "IOC-2.B": {
          "description": "समझाएं कि कैसे कंप्यूटिंग संसाधनों को संरक्षित किया जा सकता है और उनका दुरुपयोग किया जा सकता है।"
        },
        "CD": {
          "description": "कंप्यूटर और संचार उपकरण"
        },
        "CI": {
          "description": "समुदाय, वैश्विक और नैतिक प्रभाव"
        },
        "CL": {
          "description": "सहयोग"
        },
        "CPP": {
          "description": "कंप्यूटिंग अभ्यास और प्रोग्रामिंग"
        },
        "CT": {
          "description": "अभिकलनात्मक चिंतन"
        },
        "L": {
          "description": "भाषा"
        },
        "RI": {
          "description": "सूचनात्मक पढ़ना"
        },
        "RL": {
          "description": "साहित्य पढ़ना"
        },
        "SL": {
          "description": "बोलना व सुनना"
        },
        "W": {
          "description": "लिखना"
        },
        "C": {
          "description": "चक्र"
        },
        "F": {
          "description": "कार्य"
        },
        "G": {
          "description": "ज्यामिति"
        },
        "MP": {
          "description": "गणित के अभ्यास"
        },
        "NBT": {
          "description": "मूल दस में संख्या व कार्य प्रणालियां"
        },
        "OA": {
          "description": "कार्य प्रणालियां व बीजगणितीय चिंतन"
        },
        "1": {
          "description": "छात्र रचनात्मक सोच का प्रदर्शन करते हैं, ज्ञान का निर्माण करते हैं, और प्रौद्योगिकी का उपयोग करके नवीन उत्पादों और प्रक्रियाओं का विकास करते हैं।"
        },
        "2": {
          "description": "छात्र डिजिटल मीडिया और माहौल का उपयोग संवाद करने और सहयोगात्मक रूप से काम करने के लिए करते हैं, जिसमें दूरी भी शामिल है, व्यक्तिगत सीखने का समर्थन करना और दूसरों के सीखने में योगदान करना शामिल है।"
        },
        "4": {
          "description": "छात्र खोज की योजना बनाने और संचालित करने, परियोजनाओं का प्रबंधन करने, समस्याओं का समाधान करने और उपयुक्त डिजिटल उपकरणों और संसाधनों का उपयोग करके सूचित निर्णय लेने के लिए महत्वपूर्ण सोच कौशल का उपयोग करते हैं।"
        },
        "6": {
          "description": "छात्र प्रौद्योगिकी अवधारणाओं, प्रणालियों और संचालन की एक अच्छी समझ प्रदर्शित करते हैं।"
        }
      }
    }
  }
}