{
  "ta-IN": {
    "data": {
      "standards": {
        "ccela/3.RL.4": {
          "description": "சொற்கள் மற்றும் சொற்றொடர்கள் ஒரு உரையில் பயன்படுத்தப்படும்போது அவற்றின் பொருளைத் தீர்மானிக்கவும்."
        },
        "ccela/4.RL.7": {
          "description": "ஒரு கதை அல்லது நாடகத்தின் உரை மற்றும் உரையின் காட்சி அல்லது வாய்வழி விளக்கக்காட்சிக்கு இடையே இணைப்புகளை உருவாக்கவும், ஒவ்வொரு பதிப்பும் உரையில் குறிப்பிட்ட விளக்கங்கள் மற்றும் திசைகளை எங்கு பிரதிபலிக்கிறது என்பதைக் கண்டறியவும்."
        },
        "ccela/5.RL.4": {
          "description": "உருவகங்கள் மற்றும் உருவகங்கள் போன்ற உருவ மொழி உட்பட, ஒரு உரையில் பயன்படுத்தப்படும் சொற்கள் மற்றும் சொற்றொடர்களின் பொருளைத் தீர்மானிக்கவும்."
        },
        "ccela/5.RL.7": {
          "description": "ஒரு உரையின் பொருள், தொனி அல்லது அழகுக்கு காட்சி மற்றும் மல்டிமீடியா கூறுகள் எவ்வாறு பங்களிக்கின்றன என்பதை பகுப்பாய்வு செய்யுங்கள் (எ.கா., கிராஃபிக் நாவல், புனைகதை, நாட்டுப்புறக்கதை, புராணம், கவிதையின் மல்டிமீடியா விளக்கக்காட்சி)."
        },
        "ccela/6.SL.1": {
          "description": "பலதரப்பட்ட கூட்டாளர்களுடன் கூட்டு விவாதங்களில் (ஒருவருக்கொருவர், குழுக்களில், மற்றும் ஆசிரியர் தலைமையில்) தரம் 6 தலைப்புகளில் உரைகள் மற்றும் சிக்கல்கள், மற்றவர்களின் யோசனைகளை உருவாக்குதல் மற்றும் அவர்களின் சொந்த கருத்துக்களை தெளிவாக வெளிப்படுத்துதல் ஆகியவற்றில்"
        },
        "ccela/7.SL.1": {
          "description": "பலதரப்பட்ட கூட்டாளர்களுடன் கூட்டு விவாதங்களில் (ஒருவருக்கொருவர், குழுக்களில், மற்றும் ஆசிரியர் தலைமையில்) தரம் 7 தலைப்புகளில் உரைகள் மற்றும் சிக்கல்கள், மற்றவர்களின் யோசனைகளை உருவாக்குதல் மற்றும் அவர்களின் சொந்த கருத்துக்களை தெளிவாக வெளிப்படுத்துதல் ஆகியவற்றில்"
        },
        "ccmath/MP.1": {
          "description": "சிக்கல்களைப் புரிந்துகொண்டு அவற்றைத் தீர்ப்பதில் விடாமுயற்சியுடன் இருங்கள்"
        },
        "ccmath/MP.2": {
          "description": "சுருக்கமாகவும் அளவிலும் காரணம்"
        },
        "ccmath/MP.5": {
          "description": "பொருத்தமான கருவிகளை மூலோபாய ரீதியாகப் பயன்படுத்துங்கள்"
        },
        "ccmath/MP.6": {
          "description": "துல்லியமாக கலந்து கொள்ளுங்கள்"
        },
        "ccmath/MP.7": {
          "description": "கட்டமைப்பைப் பார்த்து பயன்படுத்திக் கொள்ளுங்கள்"
        },
        "ccmath/MP.8": {
          "description": "மீண்டும் மீண்டும் பகுத்தறிவதில் வழக்கமான தன்மையைத் தேடுங்கள் மற்றும் வெளிப்படுத்துங்கள்"
        },
        "csta2011/CPP.L1:6-06": {
          "description": "தொகுதி அடிப்படையிலான காட்சி நிரலாக்க மொழியைப் பயன்படுத்தி சிக்கல் தீர்வுகளைச் செயல்படுத்தவும்."
        },
        "csta2011/CT.L2:1": {
          "description": "தீர்வுகளை வடிவமைக்க அல்காரிதம் சிக்கலைத் தீர்க்கும் அடிப்படை படிகளைப் பயன்படுத்தவும் (எ.கா., சிக்கல் அறிக்கை மற்றும் ஆய்வு, மாதிரி நிகழ்வுகளின் ஆய்வு, வடிவமைப்பு, தீர்வைச் செயல்படுத்துதல், சோதனை மற்றும் மதிப்பீடு)."
        },
        "csta2011/CT.L2:12": {
          "description": "ஒரு சிக்கலை துணை சிக்கல்களாக சிதைக்க சுருக்கத்தைப் பயன்படுத்தவும்."
        },
        "csta2011/CT.L2:6": {
          "description": "பின்பற்றப்படும் வழிமுறைகளின் வரிசையை விவரிக்கவும் பகுப்பாய்வு செய்யவும் (எ.கா., வீடியோ கேமில் ஒரு கதாபாத்திரத்தின் நடத்தை விதிகள் மற்றும் வழிமுறைகளால் இயக்கப்படுவதை விவரிக்கவும்)."
        },
        "csta2011/CT.L2:7": {
          "description": "உரை, ஒலிகள், படங்கள் மற்றும் எண்கள் உட்பட பல்வேறு வழிகளில் தரவைப் பிரதிநிதித்துவப்படுத்துங்கள்."
        },
        "csta2011/CT.L2:8": {
          "description": "சிக்கல் நிலைகள், கட்டமைப்புகள் மற்றும் தரவுகளின் காட்சிப் பிரதிநிதித்துவங்களைப் பயன்படுத்தவும் (எ.கா. வரைபடங்கள், விளக்கப்படங்கள், பிணைய வரைபடங்கள், பாய்வு விளக்கப்படங்கள்)."
        },
        "iste/1.a": {
          "description": "புதிய யோசனைகள், தயாரிப்புகள் அல்லது செயல்முறைகளை உருவாக்க ஏற்கனவே உள்ள அறிவைப் பயன்படுத்துங்கள்."
        },
        "iste/1.b": {
          "description": "தனிப்பட்ட அல்லது குழு வெளிப்பாட்டின் வழிமுறையாக அசல் படைப்புகளை உருவாக்கவும்."
        },
        "iste/1.c": {
          "description": "சிக்கலான அமைப்புகள் மற்றும் சிக்கல்களை ஆராய மாதிரிகள் மற்றும் உருவகப்படுத்துதல்களைப் பயன்படுத்தவும்."
        },
        "iste/4.b": {
          "description": "ஒரு தீர்வை உருவாக்க அல்லது ஒரு திட்டத்தை முடிக்க நடவடிக்கைகளை திட்டமிட்டு நிர்வகிக்கவும்."
        },
        "iste/6.a": {
          "description": "தொழில்நுட்ப அமைப்புகளைப் புரிந்துகொண்டு பயன்படுத்தவும்."
        },
        "iste/6.c": {
          "description": "சிஸ்டம்ஸ் மற்றும் அப்ளிகேஷன்களை சரிசெய்தல்."
        },
        "iste/6.d": {
          "description": "தற்போதைய அறிவை புதிய தொழில்நுட்பங்களைக் கற்றுக்கொள்வதற்கு மாற்றவும்."
        },
        "ccela/1.L.6": {
          "description": "உரையாடல்கள் மூலம் பெறப்பட்ட சொற்கள் மற்றும் சொற்றொடர்களைப் பயன்படுத்துதல், படித்தல் மற்றும் படிக்கப்படுதல் மற்றும் உரைகளுக்குப் பதிலளிப்பது, எளிமையான உறவுகளைக் குறிக்க அடிக்கடி நிகழும் இணைப்புகளைப் பயன்படுத்துவது உட்பட (எ.கா., ஏனெனில்)."
        },
        "ccela/1.SL.1": {
          "description": "தரம் 1 தலைப்புகள் மற்றும் சிறிய மற்றும் பெரிய குழுக்களில் சகாக்கள் மற்றும் பெரியவர்களுடன் உரைகள் பற்றிய பல்வேறு கூட்டாளர்களுடன் கூட்டு உரையாடல்களில் பங்கேற்கவும்."
        },
        "ccela/11-12.RI.4": {
          "description": "சொற்கள் மற்றும் சொற்றொடர்கள் ஒரு உரையில் பயன்படுத்தப்படுவதால், உருவ, அர்த்தமுள்ள மற்றும் தொழில்நுட்ப அர்த்தங்கள் உட்பட அவற்றின் பொருளைத் தீர்மானித்தல்; ஒரு உரையின் போது ஒரு முக்கிய சொல் அல்லது சொற்களின் அர்த்தத்தை ஒரு ஆசிரியர் எவ்வாறு பயன்படுத்துகிறார் மற்றும் செம்மைப்படுத்துகிறார் என்பதை பகுப்பாய்வு செய்யவும் (எ.கா., மேடிசன் எவ்வாறு வரையறுக்கிறார்"
        },
        "ccela/2.L.6": {
          "description": "உரையாடல்களின் மூலம் பெறப்பட்ட சொற்கள் மற்றும் சொற்றொடர்களைப் பயன்படுத்துதல், படித்தல் மற்றும் படிக்கப்படுதல் மற்றும் உரைகளுக்குப் பதிலளிப்பது, விவரிக்க உரிச்சொற்கள் மற்றும் வினையுரிச்சொற்களைப் பயன்படுத்துவது உட்பட (எ.கா. மற்ற குழந்தைகள் மகிழ்ச்சியாக இருக்கும்போது அது எனக்கு மகிழ்ச்சியைத் தருகிறது)."
        },
        "ccela/2.SL.1": {
          "description": "தரம் 2 தலைப்புகள் மற்றும் சிறிய மற்றும் பெரிய குழுக்களில் சகாக்கள் மற்றும் பெரியவர்களுடன் உரைகள் பற்றிய பல்வேறு கூட்டாளர்களுடன் கூட்டு உரையாடல்களில் பங்கேற்கவும்."
        },
        "ccela/3.L.6": {
          "description": "இடஞ்சார்ந்த மற்றும் தற்காலிக உறவுகளைக் குறிக்கும் (எ.கா., இரவு உணவிற்குப் பிறகு நாங்கள் அவர்களைத் தேடிச் சென்றோம்) உட்பட, தரம்-பொருத்தமான உரையாடல், பொது கல்வி மற்றும் டொமைன் சார்ந்த சொற்கள் மற்றும் சொற்றொடர்களை துல்லியமாகப் பெற்று பயன்படுத்தவும்."
        },
        "ccela/3.SL.1": {
          "description": "தரம் 3 தலைப்புகள் மற்றும் உரைகளில் பலதரப்பட்ட கூட்டாளர்களுடன் கூட்டு விவாதங்களில் (ஒருவருக்கொருவர், குழுக்களில், மற்றும் ஆசிரியர் தலைமையில்) திறம்பட ஈடுபடுங்கள், மற்றவர்களின் யோசனைகளை உருவாக்குங்கள் மற்றும் அவர்களின் சொந்த கருத்துக்களை தெளிவாக வெளிப்படுத்துங்கள்."
        },
        "ccmath/1.OA.1": {
          "description": "எல்லா நிலைகளிலும் தெரியாதவர்களுடன் சேர்ப்பது, எடுப்பது, ஒன்றாக இணைப்பது, ஒதுக்கி வைப்பது மற்றும் ஒப்பிடுவது போன்ற சூழ்நிலைகளை உள்ளடக்கிய சொல் சிக்கல்களைத் தீர்க்க 20 க்குள் எ.கா.கூட்டல் மற்றும் கழித்தல் ஆகியவற்றைப் பயன்படுத்தவும்"
        },
        "ccmath/2.OA.1": {
          "description": "எல்லா நிலைகளிலும் தெரியாதவர்களுடன், எ.கா., வரைபடங்கள் மற்றும் சமன்பாடுகளைப் பயன்படுத்துவதன் மூலம், சேர்ப்பது, எடுப்பது, ஒன்றாக இணைப்பது, ஒதுக்கி வைப்பது மற்றும் ஒப்பிடுவது போன்ற சூழ்நிலைகளை உள்ளடக்கிய ஒன்று மற்றும் இரண்டு-படி சொல் சிக்கல்களைத் தீர்க்க 100 க்குள் கூட்டல் மற்றும் கழித்தல் ஆகியவற்றைப் பயன்படுத்தவும்."
        },
        "ccmath/3.OA.3": {
          "description": "சமமான குழுக்கள், அணிவரிசைகள் மற்றும் அளவீட்டு அளவுகள் உள்ளடங்கிய சூழ்நிலைகளில் வார்த்தைச் சிக்கல்களைத் தீர்க்க 100க்குள் பெருக்கல் மற்றும் வகுத்தல் பயன்படுத்தவும்"
        },
        "csta2011/CD.L1:3-01": {
          "description": "கணினிகள் மற்றும் தொடர்புடைய தொழில்நுட்பங்களை வெற்றிகரமாக இயக்க நிலையான உள்ளீடு மற்றும் வெளியீட்டு சாதனங்களைப் பயன்படுத்தவும்."
        },
        "csta2011/CI.L1:3-01": {
          "description": "தொழில்நுட்ப அமைப்புகள் மற்றும் மென்பொருளைப் பயன்படுத்துவதில் பொறுப்பான டிஜிட்டல் குடியுரிமையை (சட்ட மற்றும் நெறிமுறை நடத்தைகள்) பயிற்சி செய்யுங்கள்."
        },
        "csta2011/CPP.L1:6-01": {
          "description": "சிக்கலைத் தீர்ப்பதற்கும் சுயமாக கற்றலுக்கும் தொழில்நுட்ப ஆதாரங்களைப் (எ.கா., கால்குலேட்டர்கள், தரவு சேகரிப்பு ஆய்வுகள், மொபைல் சாதனங்கள், வீடியோக்கள், கல்வி மென்பொருள் மற்றும் இணையக் கருவிகள்) பயன்படுத்தவும்."
        },
        "ccela/11-12.L.6": {
          "description": "கல்லூரி மற்றும் தொழில் ஆயத்த நிலையில் படிக்க, எழுத, பேச, மற்றும் கேட்பதற்குப் போதுமான பொதுக் கல்வி மற்றும் டொமைன் சார்ந்த சொற்கள் மற்றும் சொற்றொடர்களைத் துல்லியமாகப் பெறுதல் மற்றும் பயன்படுத்துதல்; கருத்தில் கொள்ளும்போது சொல்லகராதி அறிவைச் சேகரிப்பதில் சுதந்திரத்தை நிரூபிக்கவும்"
        },
        "ccela/4.L.6": {
          "description": "துல்லியமான செயல்கள், உணர்ச்சிகள் அல்லது நிலைகள் (எ.கா., வினாடி வினா, சிணுங்குதல், தடுமாறியது) மற்றும் ஒரு குறிப்பிட்ட தலைப்புக்கு அடிப்படையானவை."
        },
        "ccela/5.L.6": {
          "description": "மாறுபாடு, கூட்டல் மற்றும் பிற தர்க்கரீதியான உறவுகளைக் குறிக்கும் (எ.கா., இருப்பினும், இருப்பினும், இதேபோல், மேலும், கூடுதலாக) தரம்-பொருத்தமான பொதுக் கல்வி மற்றும் டொமைன்-குறிப்பிட்ட சொற்கள் மற்றும் சொற்றொடர்களை துல்லியமாகப் பெற்று பயன்படுத்தவும்."
        },
        "ccmath/4.MD.6": {
          "description": "ஒரு புரோட்ராக்டரைப் பயன்படுத்தி முழு எண் டிகிரிகளில் கோணங்களை அளவிடவும். குறிப்பிட்ட அளவின் கோணங்களை வரையவும்."
        },
        "ccmath/4.NBT.4": {
          "description": "நிலையான அல்காரிதத்தைப் பயன்படுத்தி பல இலக்க முழு எண்களை சரளமாகச் சேர்க்கவும் மற்றும் கழிக்கவும்."
        },
        "ccmath/4.NBT.5": {
          "description": "மொத்த இலக்கத்தை நான்கு இலக்கங்கள் வரை ஒரு இலக்க முழு எண்ணால் பெருக்கி, இரண்டு இரண்டு இலக்க எண்களைப் பெருக்கி, இட மதிப்பு மற்றும் செயல்பாடுகளின் பண்புகளின் அடிப்படையில் உத்திகளைப் பயன்படுத்துங்கள். சமன்பாடுகளைப் பயன்படுத்தி கணக்கீட்டை விளக்கி விளக்கவும், செவ்வக ar"
        },
        "ccmath/7.G.2": {
          "description": "கொடுக்கப்பட்ட நிபந்தனைகளுடன் வடிவியல் வடிவங்களை வரையவும் (ஃப்ரீஹேண்ட், ஆட்சியாளர் மற்றும் புரோட்டாக்டர் மற்றும் தொழில்நுட்பத்துடன்). கோணங்கள் அல்லது பக்கங்களின் மூன்று நடவடிக்கைகளிலிருந்து முக்கோணங்களை உருவாக்குவதில் கவனம் செலுத்துங்கள், நிலைமைகள் ஒரு தனித்துவமான முக்கோணத்தை தீர்மானிக்கும்போது, ஒன்றுக்கு மேற்பட்ட முக்கோணங்கள்"
        },
        "csta2011/CPP.L1:3-02": {
          "description": "பாடத்திட்டம் முழுவதும் கற்றலை ஆதரிக்க, வளர்ச்சிக்கு பொருத்தமான மல்டிமீடியா ஆதாரங்களைப் பயன்படுத்தவும் (எ.கா., ஊடாடும் புத்தகங்கள் மற்றும் கல்வி மென்பொருள்)."
        },
        "csta2011/CPP.L1:3-04": {
          "description": "ஒரு எளிய பணியை (எ.கா., ஆமை அறிவுறுத்தல்கள்) நிறைவேற்ற செயல்பட வேண்டிய அறிக்கைகளின் தொகுப்பை உருவாக்கவும்."
        },
        "ccela/11-12.W.6": {
          "description": "புதிய வாதங்கள் அல்லது தகவல் உட்பட தற்போதைய கருத்துகளுக்கு பதிலளிக்கும் வகையில் தனிப்பட்ட அல்லது பகிரப்பட்ட எழுத்துத் தயாரிப்புகளை உருவாக்க, வெளியிட மற்றும் புதுப்பிக்க இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தவும்."
        },
        "ccela/4.W.3": {
          "description": "பயனுள்ள நுட்பம், விளக்கமான விவரங்கள் மற்றும் தெளிவான நிகழ்வு வரிசைகளைப் பயன்படுத்தி உண்மையான அல்லது கற்பனையான அனுபவங்கள் அல்லது நிகழ்வுகளை உருவாக்க கதைகளை எழுதுங்கள்."
        },
        "ccela/6.W.6": {
          "description": "இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தி, எழுத்தைத் தயாரிக்கவும் வெளியிடவும், மற்றவர்களுடன் தொடர்பு கொள்ளவும் ஒத்துழைக்கவும்; ஒரே அமர்வில் குறைந்தபட்சம் மூன்று பக்கங்களை தட்டச்சு செய்ய போதுமான விசைப்பலகை திறன்களை நிரூபிக்கவும்."
        },
        "ccela/7.W.3": {
          "description": "பயனுள்ள நுட்பம், தொடர்புடைய விளக்க விவரங்கள் மற்றும் நன்கு கட்டமைக்கப்பட்ட நிகழ்வு வரிசைகளைப் பயன்படுத்தி உண்மையான அல்லது கற்பனையான அனுபவங்கள் அல்லது நிகழ்வுகளை உருவாக்க கதைகளை எழுதுங்கள்."
        },
        "ccela/7.W.6": {
          "description": "இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தி, எழுதுதல் மற்றும் வெளியிடுதல் மற்றும் ஆதாரங்களை இணைத்தல் மற்றும் மேற்கோள் காட்டுதல், அத்துடன் பிறருடன் தொடர்புகொள்வது மற்றும் ஒத்துழைப்பது, ஆதாரங்களை இணைப்பது மற்றும் மேற்கோள் காட்டுவது உட்பட."
        },
        "ccela/8.W.6": {
          "description": "இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தி, எழுத்தை உருவாக்கவும் வெளியிடவும் மற்றும் தகவல் மற்றும் யோசனைகளுக்கு இடையிலான உறவுகளை திறமையாக முன்வைக்கவும், மற்றவர்களுடன் தொடர்பு கொள்ளவும் ஒத்துழைக்கவும்."
        },
        "ccela/9-10.W.6": {
          "description": "தனிப்பட்ட அல்லது பகிரப்பட்ட எழுத்துத் தயாரிப்புகளைத் தயாரிக்கவும், வெளியிடவும், புதுப்பிக்கவும், மற்ற தகவல்களுடன் இணைக்கும் தொழில்நுட்பத்தின் திறனைப் பயன்படுத்தி, தகவல்களை நெகிழ்வாகவும் மாறும் தன்மையுடனும் காட்ட, இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தவும்."
        },
        "ccmath/MP.4": {
          "description": "கணிதத்துடன் மாதிரி"
        },
        "csta2011/CL.L1:6-02": {
          "description": "தீர்வுகள் அல்லது தயாரிப்புகளை உருவாக்கும் நோக்கத்திற்காக கூட்டுச் சிக்கல் தீர்க்கும் நடவடிக்கைகளில் பங்கேற்க ஆன்லைன் ஆதாரங்களைப் பயன்படுத்தவும் (எ.கா. மின்னஞ்சல், ஆன்லைன் விவாதங்கள், கூட்டு இணைய சூழல்கள்)."
        },
        "csta2011/CPP.L1:3-01": {
          "description": "வயதுக்கு ஏற்ற ஆராய்ச்சி நடத்த தொழில்நுட்ப வளங்களைப் பயன்படுத்தவும்."
        },
        "csta2011/CPP.L2:3": {
          "description": "பாடத்திட்டக் கருத்துகளை வெளிப்படுத்தும் மற்றும் தொடர்புபடுத்தும் தொழில்நுட்ப ஆதாரங்களைப் பயன்படுத்தி தயாரிப்புகளை (எ.கா., வலைப்பக்கங்கள், மொபைல் பயன்பாடுகள், அனிமேஷன்கள்) வடிவமைத்தல், உருவாக்குதல், வெளியிடுதல் மற்றும் வழங்குதல்."
        },
        "iste/2.a": {
          "description": "பலவிதமான டிஜிட்டல் சூழல்கள் மற்றும் ஊடகங்களைப் பயன்படுத்தும் சகாக்கள், வல்லுநர்கள் அல்லது மற்றவர்களுடன் தொடர்புகொள்ளவும், ஒத்துழைக்கவும் மற்றும் வெளியிடவும்."
        },
        "iste/2.b": {
          "description": "பல்வேறு ஊடகங்கள் மற்றும் வடிவங்களைப் பயன்படுத்தி பல பார்வையாளர்களுக்கு தகவல் மற்றும் யோசனைகளை திறம்பட தொடர்புபடுத்துங்கள்."
        },
        "iste/4.d": {
          "description": "மாற்று தீர்வுகளை ஆராய பல செயல்முறைகள் மற்றும் பலதரப்பட்ட முன்னோக்குகளைப் பயன்படுத்தவும்."
        },
        "csp2021/IOC-2.B.5": {
          "description": "குறியாக்கம் என்பது அங்கீகரிக்கப்படாத அணுகலைத் தடுக்கும் தரவை குறியாக்கம் செய்யும் செயல்முறையாகும். டிக்ரிப்ஷன் என்பது தரவை டிகோட் செய்யும் செயல்முறையாகும். இரண்டு பொதுவான குறியாக்க அணுகுமுறைகள்: ● சமச்சீர் விசை குறியாக்கமானது குறியாக்கம் மற்றும் மறைகுறியாக்கம் ஆகிய இரண்டிற்கும் ஒரு விசையை உள்ளடக்கியது. செய்தியை குறியாக்க அனுப்புநருக்கு பெறுநரின் தனிப்பட்ட விசை தேவையில்லை, ஆனால் செய்தியை மறைகுறியாக்க பெறுநரின் தனிப்பட்ட விசை தேவை. விலக்கு அறிக்கை(EKIOC-2.B.5): குறியாக்கம் மற்றும் மறைகுறியாக்கத்திற்கான குறிப்பிட்ட கணித நடைமுறைகள் இந்தப் பாடநெறி மற்றும் AP தேர்வின் எல்லைக்கு அப்பாற்பட்டவை."
        },
        "csta/3A-NI-06": {
          "description": "செயல்திறன், சாத்தியக்கூறு மற்றும் நெறிமுறை தாக்கங்கள் போன்ற காரணிகளின் அடிப்படையில் பல்வேறு சூழ்நிலைகளை எதிர்கொள்ள பாதுகாப்பு நடவடிக்கைகளை பரிந்துரைக்கவும்."
        },
        "csta/3A-NI-07": {
          "description": "கணினி அமைப்பின் பயன்பாட்டிற்கும் பாதுகாப்பிற்கும் இடையிலான பரிமாற்றங்களைக் கருத்தில் கொண்டு, பல்வேறு பாதுகாப்பு நடவடிக்கைகளை ஒப்பிடுக."
        },
        "csta/3B-NI-04": {
          "description": "மென்பொருள் உருவாக்குநர்கள் சாதனங்கள் மற்றும் தகவல்களை அங்கீகரிக்கப்படாத அணுகலில் இருந்து பாதுகாக்கும் வழிகளை ஒப்பிடுக."
        },
        "csp2021/DAT-1.D.1": {
          "description": "தரவு சுருக்கமானது கடத்தப்பட்ட அல்லது சேமிக்கப்பட்ட தரவின் அளவை (பிட்களின் எண்ணிக்கை) குறைக்கலாம்."
        },
        "csp2021/DAT-1.D.2": {
          "description": "குறைவான பிட்கள் என்பது குறைவான தகவலைக் குறிக்காது."
        },
        "csp2021/DAT-1.D.3": {
          "description": "சுருக்கத்திலிருந்து அளவைக் குறைப்பதற்கான அளவு, அசல் தரவுப் பிரதிநிதித்துவத்தில் உள்ள பணிநீக்கத்தின் அளவு மற்றும் பயன்படுத்தப்படும் சுருக்க வழிமுறை இரண்டையும் சார்ந்துள்ளது."
        },
        "csp2021/DAT-1.D.4": {
          "description": "இழப்பற்ற தரவு சுருக்க வழிமுறைகள் பொதுவாக அசல் தரவின் முழுமையான புனரமைப்புக்கு உத்தரவாதம் அளிக்கும் போது சேமிக்கப்படும் அல்லது கடத்தப்படும் பிட்களின் எண்ணிக்கையைக் குறைக்கலாம்."
        },
        "csta/3A-DA-10": {
          "description": "தரவு கூறுகள் எவ்வாறு ஒழுங்கமைக்கப்படுகின்றன மற்றும் தரவு எங்கே சேமிக்கப்படுகிறது என்பதில் பரிமாற்றங்களை மதிப்பீடு செய்யவும்."
        },
        "csta/1B-IC-18": {
          "description": "உலகை மாற்றிய கணினி தொழில்நுட்பங்களைப் பற்றி விவாதிக்கவும் மற்றும் அந்த தொழில்நுட்பங்கள் கலாச்சார நடைமுறைகளை எவ்வாறு பாதிக்கின்றன மற்றும் பாதிக்கப்படுகின்றன என்பதை வெளிப்படுத்தவும்."
        },
        "csta/1B-DA-07": {
          "description": "காரணம் மற்றும் விளைவு உறவுகளை முன்னிலைப்படுத்த அல்லது முன்மொழிய, விளைவுகளை கணிக்க அல்லது ஒரு யோசனையைத் தெரிவிக்க தரவைப் பயன்படுத்தவும்."
        },
        "1B-DA-07": {
          "description": "காரணம் மற்றும் விளைவு உறவுகளை முன்னிலைப்படுத்த அல்லது முன்மொழிய, விளைவுகளை கணிக்க அல்லது ஒரு யோசனையைத் தெரிவிக்க தரவைப் பயன்படுத்தவும்."
        },
        "1B-IC-18": {
          "description": "உலகை மாற்றிய கணினி தொழில்நுட்பங்களைப் பற்றி விவாதிக்கவும் மற்றும் அந்த தொழில்நுட்பங்கள் கலாச்சார நடைமுறைகளை எவ்வாறு பாதிக்கின்றன மற்றும் பாதிக்கப்படுகின்றன என்பதை வெளிப்படுத்தவும்."
        },
        "3A-DA-10": {
          "description": "தரவு கூறுகள் எவ்வாறு ஒழுங்கமைக்கப்படுகின்றன மற்றும் தரவு எங்கே சேமிக்கப்படுகிறது என்பதில் பரிமாற்றங்களை மதிப்பீடு செய்யவும்."
        },
        "3A-NI-06": {
          "description": "செயல்திறன், சாத்தியக்கூறு மற்றும் நெறிமுறை தாக்கங்கள் போன்ற காரணிகளின் அடிப்படையில் பல்வேறு சூழ்நிலைகளை எதிர்கொள்ள பாதுகாப்பு நடவடிக்கைகளை பரிந்துரைக்கவும்."
        },
        "3A-NI-07": {
          "description": "கணினி அமைப்பின் பயன்பாட்டிற்கும் பாதுகாப்பிற்கும் இடையிலான பரிமாற்றங்களைக் கருத்தில் கொண்டு, பல்வேறு பாதுகாப்பு நடவடிக்கைகளை ஒப்பிடுக."
        },
        "3B-NI-04": {
          "description": "மென்பொருள் உருவாக்குநர்கள் சாதனங்கள் மற்றும் தகவல்களை அங்கீகரிக்கப்படாத அணுகலில் இருந்து பாதுகாக்கும் வழிகளை ஒப்பிடுக."
        },
        "DAT-1.D.1": {
          "description": "தரவு சுருக்கமானது கடத்தப்பட்ட அல்லது சேமிக்கப்பட்ட தரவின் அளவை (பிட்களின் எண்ணிக்கை) குறைக்கலாம்."
        },
        "DAT-1.D.2": {
          "description": "குறைவான பிட்கள் என்பது குறைவான தகவலைக் குறிக்காது."
        },
        "DAT-1.D.3": {
          "description": "சுருக்கத்திலிருந்து அளவைக் குறைப்பதற்கான அளவு, அசல் தரவுப் பிரதிநிதித்துவத்தில் உள்ள பணிநீக்கத்தின் அளவு மற்றும் பயன்படுத்தப்படும் சுருக்க வழிமுறை இரண்டையும் சார்ந்துள்ளது."
        },
        "DAT-1.D.4": {
          "description": "இழப்பற்ற தரவு சுருக்க வழிமுறைகள் பொதுவாக அசல் தரவின் முழுமையான புனரமைப்புக்கு உத்தரவாதம் அளிக்கும் போது சேமிக்கப்படும் அல்லது கடத்தப்படும் பிட்களின் எண்ணிக்கையைக் குறைக்கலாம்."
        },
        "IOC-2.B.5": {
          "description": "குறியாக்கம் என்பது அங்கீகரிக்கப்படாத அணுகலைத் தடுக்கும் தரவை குறியாக்கம் செய்யும் செயல்முறையாகும். டிக்ரிப்ஷன் என்பது தரவை டிகோட் செய்யும் செயல்முறையாகும். இரண்டு பொதுவான குறியாக்க அணுகுமுறைகள்: ● சமச்சீர் விசை குறியாக்கமானது குறியாக்கம் மற்றும் மறைகுறியாக்கம் ஆகிய இரண்டிற்கும் ஒரு விசையை உள்ளடக்கியது. செய்தியை குறியாக்க அனுப்புநருக்கு பெறுநரின் தனிப்பட்ட விசை தேவையில்லை, ஆனால் செய்தியை மறைகுறியாக்க பெறுநரின் தனிப்பட்ட விசை தேவை. விலக்கு அறிக்கை(EKIOC-2.B.5): குறியாக்கம் மற்றும் மறைகுறியாக்கத்திற்கான குறிப்பிட்ட கணித நடைமுறைகள் இந்தப் பாடநெறி மற்றும் AP தேர்வின் எல்லைக்கு அப்பாற்பட்டவை."
        },
        "CD.L1:3-01": {
          "description": "கணினிகள் மற்றும் தொடர்புடைய தொழில்நுட்பங்களை வெற்றிகரமாக இயக்க நிலையான உள்ளீடு மற்றும் வெளியீட்டு சாதனங்களைப் பயன்படுத்தவும்."
        },
        "CI.L1:3-01": {
          "description": "தொழில்நுட்ப அமைப்புகள் மற்றும் மென்பொருளைப் பயன்படுத்துவதில் பொறுப்பான டிஜிட்டல் குடியுரிமையை (சட்ட மற்றும் நெறிமுறை நடத்தைகள்) பயிற்சி செய்யுங்கள்."
        },
        "CL.L1:6-02": {
          "description": "தீர்வுகள் அல்லது தயாரிப்புகளை உருவாக்கும் நோக்கத்திற்காக கூட்டுச் சிக்கல் தீர்க்கும் நடவடிக்கைகளில் பங்கேற்க ஆன்லைன் ஆதாரங்களைப் பயன்படுத்தவும் (எ.கா. மின்னஞ்சல், ஆன்லைன் விவாதங்கள், கூட்டு இணைய சூழல்கள்)."
        },
        "CPP.L1:3-01": {
          "description": "வயதுக்கு ஏற்ற ஆராய்ச்சி நடத்த தொழில்நுட்ப வளங்களைப் பயன்படுத்தவும்."
        },
        "CPP.L1:3-02": {
          "description": "பாடத்திட்டம் முழுவதும் கற்றலை ஆதரிக்க, வளர்ச்சிக்கு பொருத்தமான மல்டிமீடியா ஆதாரங்களைப் பயன்படுத்தவும் (எ.கா., ஊடாடும் புத்தகங்கள் மற்றும் கல்வி மென்பொருள்)."
        },
        "CPP.L1:3-04": {
          "description": "ஒரு எளிய பணியை (எ.கா., ஆமை அறிவுறுத்தல்கள்) நிறைவேற்ற செயல்பட வேண்டிய அறிக்கைகளின் தொகுப்பை உருவாக்கவும்."
        },
        "CPP.L1:6-01": {
          "description": "சிக்கலைத் தீர்ப்பதற்கும் சுயமாக கற்றலுக்கும் தொழில்நுட்ப ஆதாரங்களைப் (எ.கா., கால்குலேட்டர்கள், தரவு சேகரிப்பு ஆய்வுகள், மொபைல் சாதனங்கள், வீடியோக்கள், கல்வி மென்பொருள் மற்றும் இணையக் கருவிகள்) பயன்படுத்தவும்."
        },
        "CPP.L1:6-06": {
          "description": "தொகுதி அடிப்படையிலான காட்சி நிரலாக்க மொழியைப் பயன்படுத்தி சிக்கல் தீர்வுகளைச் செயல்படுத்தவும்."
        },
        "CPP.L2:3": {
          "description": "பாடத்திட்டக் கருத்துகளை வெளிப்படுத்தும் மற்றும் தொடர்புபடுத்தும் தொழில்நுட்ப ஆதாரங்களைப் பயன்படுத்தி தயாரிப்புகளை (எ.கா., வலைப்பக்கங்கள், மொபைல் பயன்பாடுகள், அனிமேஷன்கள்) வடிவமைத்தல், உருவாக்குதல், வெளியிடுதல் மற்றும் வழங்குதல்."
        },
        "CT.L2:1": {
          "description": "தீர்வுகளை வடிவமைக்க அல்காரிதம் சிக்கலைத் தீர்க்கும் அடிப்படை படிகளைப் பயன்படுத்தவும் (எ.கா., சிக்கல் அறிக்கை மற்றும் ஆய்வு, மாதிரி நிகழ்வுகளின் ஆய்வு, வடிவமைப்பு, தீர்வைச் செயல்படுத்துதல், சோதனை மற்றும் மதிப்பீடு)."
        },
        "CT.L2:12": {
          "description": "ஒரு சிக்கலை துணை சிக்கல்களாக சிதைக்க சுருக்கத்தைப் பயன்படுத்தவும்."
        },
        "CT.L2:6": {
          "description": "பின்பற்றப்படும் வழிமுறைகளின் வரிசையை விவரிக்கவும் பகுப்பாய்வு செய்யவும் (எ.கா., வீடியோ கேமில் ஒரு கதாபாத்திரத்தின் நடத்தை விதிகள் மற்றும் வழிமுறைகளால் இயக்கப்படுவதை விவரிக்கவும்)."
        },
        "CT.L2:7": {
          "description": "உரை, ஒலிகள், படங்கள் மற்றும் எண்கள் உட்பட பல்வேறு வழிகளில் தரவைப் பிரதிநிதித்துவப்படுத்துங்கள்."
        },
        "CT.L2:8": {
          "description": "சிக்கல் நிலைகள், கட்டமைப்புகள் மற்றும் தரவுகளின் காட்சிப் பிரதிநிதித்துவங்களைப் பயன்படுத்தவும் (எ.கா. வரைபடங்கள், விளக்கப்படங்கள், பிணைய வரைபடங்கள், பாய்வு விளக்கப்படங்கள்)."
        },
        "1.L.6": {
          "description": "உரையாடல்கள் மூலம் பெறப்பட்ட சொற்கள் மற்றும் சொற்றொடர்களைப் பயன்படுத்துதல், படித்தல் மற்றும் படிக்கப்படுதல் மற்றும் உரைகளுக்குப் பதிலளிப்பது, எளிமையான உறவுகளைக் குறிக்க அடிக்கடி நிகழும் இணைப்புகளைப் பயன்படுத்துவது உட்பட (எ.கா., ஏனெனில்)."
        },
        "11-12.L.6": {
          "description": "கல்லூரி மற்றும் தொழில் ஆயத்த நிலையில் படிக்க, எழுத, பேச, மற்றும் கேட்பதற்குப் போதுமான பொதுக் கல்வி மற்றும் டொமைன் சார்ந்த சொற்கள் மற்றும் சொற்றொடர்களைத் துல்லியமாகப் பெறுதல் மற்றும் பயன்படுத்துதல்; கருத்தில் கொள்ளும்போது சொல்லகராதி அறிவைச் சேகரிப்பதில் சுதந்திரத்தை நிரூபிக்கவும்"
        },
        "2.L.6": {
          "description": "உரையாடல்களின் மூலம் பெறப்பட்ட சொற்கள் மற்றும் சொற்றொடர்களைப் பயன்படுத்துதல், படித்தல் மற்றும் படிக்கப்படுதல் மற்றும் உரைகளுக்குப் பதிலளிப்பது, விவரிக்க உரிச்சொற்கள் மற்றும் வினையுரிச்சொற்களைப் பயன்படுத்துவது உட்பட (எ.கா. மற்ற குழந்தைகள் மகிழ்ச்சியாக இருக்கும்போது அது எனக்கு மகிழ்ச்சியைத் தருகிறது)."
        },
        "3.L.6": {
          "description": "இடஞ்சார்ந்த மற்றும் தற்காலிக உறவுகளைக் குறிக்கும் (எ.கா., இரவு உணவிற்குப் பிறகு நாங்கள் அவர்களைத் தேடிச் சென்றோம்) உட்பட, தரம்-பொருத்தமான உரையாடல், பொது கல்வி மற்றும் டொமைன் சார்ந்த சொற்கள் மற்றும் சொற்றொடர்களை துல்லியமாகப் பெற்று பயன்படுத்தவும்."
        },
        "4.L.6": {
          "description": "துல்லியமான செயல்கள், உணர்ச்சிகள் அல்லது நிலைகள் (எ.கா., வினாடி வினா, சிணுங்குதல், தடுமாறியது) மற்றும் ஒரு குறிப்பிட்ட தலைப்புக்கு அடிப்படையானவை."
        },
        "5.L.6": {
          "description": "மாறுபாடு, கூட்டல் மற்றும் பிற தர்க்கரீதியான உறவுகளைக் குறிக்கும் (எ.கா., இருப்பினும், இருப்பினும், இதேபோல், மேலும், கூடுதலாக) தரம்-பொருத்தமான பொதுக் கல்வி மற்றும் டொமைன்-குறிப்பிட்ட சொற்கள் மற்றும் சொற்றொடர்களை துல்லியமாகப் பெற்று பயன்படுத்தவும்."
        },
        "9-10.L.6": {
          "description": "கல்லூரி மற்றும் தொழில் ஆயத்த நிலையில் படிக்க, எழுத, பேச, மற்றும் கேட்பதற்குப் போதுமான பொதுக் கல்வி மற்றும் டொமைன் சார்ந்த சொற்கள் மற்றும் சொற்றொடர்களைத் துல்லியமாகப் பெறுதல் மற்றும் பயன்படுத்துதல்; கருத்தில் கொள்ளும்போது சொல்லகராதி அறிவைச் சேகரிப்பதில் சுதந்திரத்தை நிரூபிக்கவும்"
        },
        "11-12.RI.4": {
          "description": "சொற்கள் மற்றும் சொற்றொடர்கள் ஒரு உரையில் பயன்படுத்தப்படுவதால், உருவ, அர்த்தமுள்ள மற்றும் தொழில்நுட்ப அர்த்தங்கள் உட்பட அவற்றின் பொருளைத் தீர்மானித்தல்; ஒரு உரையின் போது ஒரு முக்கிய சொல் அல்லது சொற்களின் அர்த்தத்தை ஒரு ஆசிரியர் எவ்வாறு பயன்படுத்துகிறார் மற்றும் செம்மைப்படுத்துகிறார் என்பதை பகுப்பாய்வு செய்யவும் (எ.கா., மேடிசன் எவ்வாறு வரையறுக்கிறார்"
        },
        "3.RL.4": {
          "description": "சொற்கள் மற்றும் சொற்றொடர்கள் ஒரு உரையில் பயன்படுத்தப்படும்போது அவற்றின் பொருளைத் தீர்மானிக்கவும்."
        },
        "4.RL.7": {
          "description": "ஒரு கதை அல்லது நாடகத்தின் உரை மற்றும் உரையின் காட்சி அல்லது வாய்வழி விளக்கக்காட்சிக்கு இடையே இணைப்புகளை உருவாக்கவும், ஒவ்வொரு பதிப்பும் உரையில் குறிப்பிட்ட விளக்கங்கள் மற்றும் திசைகளை எங்கு பிரதிபலிக்கிறது என்பதைக் கண்டறியவும்."
        },
        "5.RL.4": {
          "description": "உருவகங்கள் மற்றும் உருவகங்கள் போன்ற உருவ மொழி உட்பட, ஒரு உரையில் பயன்படுத்தப்படும் சொற்கள் மற்றும் சொற்றொடர்களின் பொருளைத் தீர்மானிக்கவும்."
        },
        "5.RL.7": {
          "description": "ஒரு உரையின் பொருள், தொனி அல்லது அழகுக்கு காட்சி மற்றும் மல்டிமீடியா கூறுகள் எவ்வாறு பங்களிக்கின்றன என்பதை பகுப்பாய்வு செய்யுங்கள் (எ.கா., கிராஃபிக் நாவல், புனைகதை, நாட்டுப்புறக்கதை, புராணம், கவிதையின் மல்டிமீடியா விளக்கக்காட்சி)."
        },
        "1.SL.1": {
          "description": "தரம் 1 தலைப்புகள் மற்றும் சிறிய மற்றும் பெரிய குழுக்களில் சகாக்கள் மற்றும் பெரியவர்களுடன் உரைகள் பற்றிய பல்வேறு கூட்டாளர்களுடன் கூட்டு உரையாடல்களில் பங்கேற்கவும்."
        },
        "2.SL.1": {
          "description": "தரம் 2 தலைப்புகள் மற்றும் சிறிய மற்றும் பெரிய குழுக்களில் சகாக்கள் மற்றும் பெரியவர்களுடன் உரைகள் பற்றிய பல்வேறு கூட்டாளர்களுடன் கூட்டு உரையாடல்களில் பங்கேற்கவும்."
        },
        "3.SL.1": {
          "description": "தரம் 3 தலைப்புகள் மற்றும் உரைகளில் பலதரப்பட்ட கூட்டாளர்களுடன் கூட்டு விவாதங்களில் (ஒருவருக்கொருவர், குழுக்களில், மற்றும் ஆசிரியர் தலைமையில்) திறம்பட ஈடுபடுங்கள், மற்றவர்களின் யோசனைகளை உருவாக்குங்கள் மற்றும் அவர்களின் சொந்த கருத்துக்களை தெளிவாக வெளிப்படுத்துங்கள்."
        },
        "6.SL.1": {
          "description": "பலதரப்பட்ட கூட்டாளர்களுடன் கூட்டு விவாதங்களில் (ஒருவருக்கொருவர், குழுக்களில், மற்றும் ஆசிரியர் தலைமையில்) தரம் 6 தலைப்புகளில் உரைகள் மற்றும் சிக்கல்கள், மற்றவர்களின் யோசனைகளை உருவாக்குதல் மற்றும் அவர்களின் சொந்த கருத்துக்களை தெளிவாக வெளிப்படுத்துதல் ஆகியவற்றில்"
        },
        "7.SL.1": {
          "description": "பலதரப்பட்ட கூட்டாளர்களுடன் கூட்டு விவாதங்களில் (ஒருவருக்கொருவர், குழுக்களில், மற்றும் ஆசிரியர் தலைமையில்) தரம் 7 தலைப்புகளில் உரைகள் மற்றும் சிக்கல்கள், மற்றவர்களின் யோசனைகளை உருவாக்குதல் மற்றும் அவர்களின் சொந்த கருத்துக்களை தெளிவாக வெளிப்படுத்துதல் ஆகியவற்றில்"
        },
        "11-12.W.6": {
          "description": "புதிய வாதங்கள் அல்லது தகவல் உட்பட தற்போதைய கருத்துகளுக்கு பதிலளிக்கும் வகையில் தனிப்பட்ட அல்லது பகிரப்பட்ட எழுத்துத் தயாரிப்புகளை உருவாக்க, வெளியிட மற்றும் புதுப்பிக்க இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தவும்."
        },
        "3.W.3": {
          "description": "பயனுள்ள நுட்பம், விளக்கமான விவரங்கள் மற்றும் தெளிவான நிகழ்வு வரிசைகளைப் பயன்படுத்தி உண்மையான அல்லது கற்பனையான அனுபவங்கள் அல்லது நிகழ்வுகளை உருவாக்க கதைகளை எழுதுங்கள்."
        },
        "4.W.3": {
          "description": "பயனுள்ள நுட்பம், விளக்கமான விவரங்கள் மற்றும் தெளிவான நிகழ்வு வரிசைகளைப் பயன்படுத்தி உண்மையான அல்லது கற்பனையான அனுபவங்கள் அல்லது நிகழ்வுகளை உருவாக்க கதைகளை எழுதுங்கள்."
        },
        "5.W.3": {
          "description": "பயனுள்ள நுட்பம், விளக்கமான விவரங்கள் மற்றும் தெளிவான நிகழ்வு வரிசைகளைப் பயன்படுத்தி உண்மையான அல்லது கற்பனையான அனுபவங்கள் அல்லது நிகழ்வுகளை உருவாக்க கதைகளை எழுதுங்கள்."
        },
        "6.W.3": {
          "description": "பயனுள்ள நுட்பம், தொடர்புடைய விளக்க விவரங்கள் மற்றும் நன்கு கட்டமைக்கப்பட்ட நிகழ்வு வரிசைகளைப் பயன்படுத்தி உண்மையான அல்லது கற்பனையான அனுபவங்கள் அல்லது நிகழ்வுகளை உருவாக்க கதைகளை எழுதுங்கள்."
        },
        "6.W.6": {
          "description": "இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தி, எழுத்தைத் தயாரிக்கவும் வெளியிடவும், மற்றவர்களுடன் தொடர்பு கொள்ளவும் ஒத்துழைக்கவும்; ஒரே அமர்வில் குறைந்தபட்சம் மூன்று பக்கங்களை தட்டச்சு செய்ய போதுமான விசைப்பலகை திறன்களை நிரூபிக்கவும்."
        },
        "7.W.3": {
          "description": "பயனுள்ள நுட்பம், தொடர்புடைய விளக்க விவரங்கள் மற்றும் நன்கு கட்டமைக்கப்பட்ட நிகழ்வு வரிசைகளைப் பயன்படுத்தி உண்மையான அல்லது கற்பனையான அனுபவங்கள் அல்லது நிகழ்வுகளை உருவாக்க கதைகளை எழுதுங்கள்."
        },
        "7.W.6": {
          "description": "இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தி, எழுதுதல் மற்றும் வெளியிடுதல் மற்றும் ஆதாரங்களை இணைத்தல் மற்றும் மேற்கோள் காட்டுதல், அத்துடன் பிறருடன் தொடர்புகொள்வது மற்றும் ஒத்துழைப்பது, ஆதாரங்களை இணைப்பது மற்றும் மேற்கோள் காட்டுவது உட்பட."
        },
        "8.W.3": {
          "description": "பயனுள்ள நுட்பம், தொடர்புடைய விளக்க விவரங்கள் மற்றும் நன்கு கட்டமைக்கப்பட்ட நிகழ்வு வரிசைகளைப் பயன்படுத்தி உண்மையான அல்லது கற்பனையான அனுபவங்கள் அல்லது நிகழ்வுகளை உருவாக்க கதைகளை எழுதுங்கள்."
        },
        "8.W.6": {
          "description": "இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தி, எழுத்தை உருவாக்கவும் வெளியிடவும் மற்றும் தகவல் மற்றும் யோசனைகளுக்கு இடையிலான உறவுகளை திறமையாக முன்வைக்கவும், மற்றவர்களுடன் தொடர்பு கொள்ளவும் ஒத்துழைக்கவும்."
        },
        "9-10.W.6": {
          "description": "தனிப்பட்ட அல்லது பகிரப்பட்ட எழுத்துத் தயாரிப்புகளைத் தயாரிக்கவும், வெளியிடவும், புதுப்பிக்கவும், மற்ற தகவல்களுடன் இணைக்கும் தொழில்நுட்பத்தின் திறனைப் பயன்படுத்தி, தகவல்களை நெகிழ்வாகவும் மாறும் தன்மையுடனும் காட்ட, இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தவும்."
        },
        "11-12.WHST.6": {
          "description": "புதிய வாதங்கள் அல்லது தகவல் உட்பட தற்போதைய கருத்துகளுக்கு பதிலளிக்கும் வகையில் தனிப்பட்ட அல்லது பகிரப்பட்ட எழுத்துத் தயாரிப்புகளை உருவாக்க, வெளியிட மற்றும் புதுப்பிக்க இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தவும்."
        },
        "9-10.WHST.6": {
          "description": "தனிப்பட்ட அல்லது பகிரப்பட்ட எழுத்துத் தயாரிப்புகளைத் தயாரிக்கவும், வெளியிடவும், புதுப்பிக்கவும், மற்ற தகவல்களுடன் இணைக்கும் தொழில்நுட்பத்தின் திறனைப் பயன்படுத்தி, தகவல்களை நெகிழ்வாகவும் மாறும் தன்மையுடனும் காட்ட, இணையம் உள்ளிட்ட தொழில்நுட்பத்தைப் பயன்படுத்தவும்."
        },
        "7.G.2": {
          "description": "கொடுக்கப்பட்ட நிபந்தனைகளுடன் வடிவியல் வடிவங்களை வரையவும் (ஃப்ரீஹேண்ட், ஆட்சியாளர் மற்றும் புரோட்டாக்டர் மற்றும் தொழில்நுட்பத்துடன்). கோணங்கள் அல்லது பக்கங்களின் மூன்று நடவடிக்கைகளிலிருந்து முக்கோணங்களை உருவாக்குவதில் கவனம் செலுத்துங்கள், நிலைமைகள் ஒரு தனித்துவமான முக்கோணத்தை தீர்மானிக்கும்போது, ஒன்றுக்கு மேற்பட்ட முக்கோணங்கள்"
        },
        "4.MD.6": {
          "description": "ஒரு புரோட்ராக்டரைப் பயன்படுத்தி முழு எண் டிகிரிகளில் கோணங்களை அளவிடவும். குறிப்பிட்ட அளவின் கோணங்களை வரையவும்."
        },
        "MP.1": {
          "description": "சிக்கல்களைப் புரிந்துகொண்டு அவற்றைத் தீர்ப்பதில் விடாமுயற்சியுடன் இருங்கள்"
        },
        "MP.2": {
          "description": "சுருக்கமாகவும் அளவிலும் காரணம்"
        },
        "MP.4": {
          "description": "கணிதத்துடன் மாதிரி"
        },
        "MP.5": {
          "description": "பொருத்தமான கருவிகளை மூலோபாய ரீதியாகப் பயன்படுத்துங்கள்"
        },
        "MP.6": {
          "description": "துல்லியமாக கலந்து கொள்ளுங்கள்"
        },
        "MP.7": {
          "description": "கட்டமைப்பைப் பார்த்து பயன்படுத்திக் கொள்ளுங்கள்"
        },
        "MP.8": {
          "description": "மீண்டும் மீண்டும் பகுத்தறிவதில் வழக்கமான தன்மையைத் தேடுங்கள் மற்றும் வெளிப்படுத்துங்கள்"
        },
        "4.NBT.4": {
          "description": "நிலையான அல்காரிதத்தைப் பயன்படுத்தி பல இலக்க முழு எண்களை சரளமாகச் சேர்க்கவும் மற்றும் கழிக்கவும்."
        },
        "4.NBT.5": {
          "description": "மொத்த இலக்கத்தை நான்கு இலக்கங்கள் வரை ஒரு இலக்க முழு எண்ணால் பெருக்கி, இரண்டு இரண்டு இலக்க எண்களைப் பெருக்கி, இட மதிப்பு மற்றும் செயல்பாடுகளின் பண்புகளின் அடிப்படையில் உத்திகளைப் பயன்படுத்துங்கள். சமன்பாடுகளைப் பயன்படுத்தி கணக்கீட்டை விளக்கி விளக்கவும், செவ்வக ar"
        },
        "1.OA.1": {
          "description": "எல்லா நிலைகளிலும் தெரியாதவர்களுடன் சேர்ப்பது, எடுப்பது, ஒன்றாக இணைப்பது, ஒதுக்கி வைப்பது மற்றும் ஒப்பிடுவது போன்ற சூழ்நிலைகளை உள்ளடக்கிய சொல் சிக்கல்களைத் தீர்க்க 20 க்குள் எ.கா.கூட்டல் மற்றும் கழித்தல் ஆகியவற்றைப் பயன்படுத்தவும்"
        },
        "2.OA.1": {
          "description": "எல்லா நிலைகளிலும் தெரியாதவர்களுடன், எ.கா., வரைபடங்கள் மற்றும் சமன்பாடுகளைப் பயன்படுத்துவதன் மூலம், சேர்ப்பது, எடுப்பது, ஒன்றாக இணைப்பது, ஒதுக்கி வைப்பது மற்றும் ஒப்பிடுவது போன்ற சூழ்நிலைகளை உள்ளடக்கிய ஒன்று மற்றும் இரண்டு-படி சொல் சிக்கல்களைத் தீர்க்க 100 க்குள் கூட்டல் மற்றும் கழித்தல் ஆகியவற்றைப் பயன்படுத்தவும்."
        },
        "3.OA.3": {
          "description": "சமமான குழுக்கள், அணிவரிசைகள் மற்றும் அளவீட்டு அளவுகள் உள்ளடங்கிய சூழ்நிலைகளில் வார்த்தைச் சிக்கல்களைத் தீர்க்க 100க்குள் பெருக்கல் மற்றும் வகுத்தல் பயன்படுத்தவும்"
        },
        "1.a": {
          "description": "புதிய யோசனைகள், தயாரிப்புகள் அல்லது செயல்முறைகளை உருவாக்க ஏற்கனவே உள்ள அறிவைப் பயன்படுத்துங்கள்."
        },
        "1.b": {
          "description": "தனிப்பட்ட அல்லது குழு வெளிப்பாட்டின் வழிமுறையாக அசல் படைப்புகளை உருவாக்கவும்."
        },
        "1.c": {
          "description": "சிக்கலான அமைப்புகள் மற்றும் சிக்கல்களை ஆராய மாதிரிகள் மற்றும் உருவகப்படுத்துதல்களைப் பயன்படுத்தவும்."
        },
        "2.a": {
          "description": "பலவிதமான டிஜிட்டல் சூழல்கள் மற்றும் ஊடகங்களைப் பயன்படுத்தும் சகாக்கள், வல்லுநர்கள் அல்லது மற்றவர்களுடன் தொடர்புகொள்ளவும், ஒத்துழைக்கவும் மற்றும் வெளியிடவும்."
        },
        "2.b": {
          "description": "பல்வேறு ஊடகங்கள் மற்றும் வடிவங்களைப் பயன்படுத்தி பல பார்வையாளர்களுக்கு தகவல் மற்றும் யோசனைகளை திறம்பட தொடர்புபடுத்துங்கள்."
        },
        "4.b": {
          "description": "ஒரு தீர்வை உருவாக்க அல்லது ஒரு திட்டத்தை முடிக்க நடவடிக்கைகளை திட்டமிட்டு நிர்வகிக்கவும்."
        },
        "4.d": {
          "description": "மாற்று தீர்வுகளை ஆராய பல செயல்முறைகள் மற்றும் பலதரப்பட்ட முன்னோக்குகளைப் பயன்படுத்தவும்."
        },
        "6.a": {
          "description": "தொழில்நுட்ப அமைப்புகளைப் புரிந்துகொண்டு பயன்படுத்தவும்."
        },
        "6.c": {
          "description": "சிஸ்டம்ஸ் மற்றும் அப்ளிகேஷன்களை சரிசெய்தல்."
        },
        "6.d": {
          "description": "தற்போதைய அறிவை புதிய தொழில்நுட்பங்களைக் கற்றுக்கொள்வதற்கு மாற்றவும்."
        }
      }
    }
  }
}