{
  "hi-IN": {
    "data": {
      "standards": {
        "ccela/3.RL.4": {
          "description": "शब्दों और वाक्यांशों के अर्थ का निर्धारण करें क्योंकि वे टेक्स्ट में उपयोग किए जाते हैं, शाब्दिक को गैर-शाब्दिक भाषा से अलग करते हैं।"
        },
        "ccela/4.RL.7": {
          "description": "यह पहचानते हुए कि प्रत्येक संस्करण टेक्स्ट में विशिष्ट विवरणों और दिशाओं को दर्शाता है, किसी कहानी या नाटक के टेक्स्ट और टेक्स्ट की एक दृश्य या मौखिक प्रस्तुति के बीच संबंध बनाएं।"
        },
        "ccela/5.RL.4": {
          "description": "शब्दों और वाक्यांशों के अर्थ का निर्धारण करें क्योंकि वे टेक्स्ट में उपयोग किए जाते हैं, जिसमें आलंकारिक भाषा जैसे रूपक और उपमा शामिल हैं।"
        },
        "ccela/5.RL.7": {
          "description": "विश्लेषण करें कि दृश्य और मल्टीमीडिया तत्व किसी टेक्स्ट के अर्थ, स्वर, या सुंदरता में कैसे योगदान डालते हैं (जैसे, ग्राफिक नावेल, कल्पना की मल्टीमीडिया प्रस्तुति, लोककथा, मिथक, कविता)।"
        },
        "ccela/6.SL.1": {
          "description": "दूसरों के विचारों के आधार पर और उनके खुद के विचारों को स्पष्ट रूप से अभिव्यक्त करते हुए, ग्रेड 6 के विषयों, टेक्सट और समस्याओं के बारे में विविध साझेदारों के साथ कई प्रकार की सहयोगात्मक चर्चा (आमने-सामने, समूहों में, और अध्यापक-संचालित) में प्रभावशाली रूप से शामिल हों।"
        },
        "ccela/7.SL.1": {
          "description": "दूसरों के विचारों के आधार पर और उनके खुद के विचारों को स्पष्ट रूप से अभिव्यक्त करते हुए, ग्रेड 7 के विषयों, टेक्सट और समस्याओं के बारे में विविध साझेदारों के साथ कई प्रकार की सहयोगात्मक चर्चा (आमने-सामने, समूहों में, और अध्यापक-संचालित) में प्रभावशाली रूप से शामिल हों।"
        },
        "ccmath/MP.1": {
          "description": "सवालों का अर्थ निकालें और उन्हें हल करने का निरंतर प्रयास करें"
        },
        "ccmath/MP.2": {
          "description": "अमूर्त रूप से और मात्रात्मक ढंग से तर्क करें"
        },
        "ccmath/MP.5": {
          "description": "कार्यनीतिक रूप से उपयुक्त टूल्स का उपयोग करें"
        },
        "ccmath/MP.6": {
          "description": "शुद्धता पर ध्यान दें"
        },
        "ccmath/MP.7": {
          "description": "संरचना खोजें व उसका उपयोग करें"
        },
        "ccmath/MP.8": {
          "description": "दोहराए गए तर्क में नियमितता खोजें और व्यक्त करें"
        },
        "csta2011/CPP.L1:6-06": {
          "description": "ब्लॉक आधारित विज़ुअल प्रोग्रामिंग भाषा का उपयोग करके समस्या के समाधान लागू करें।"
        },
        "csta2011/CT.L2:1": {
          "description": "समाधान तैयार करने के लिए एल्गोरिथम समस्या-समाधान में बुनियादी कदमों का उपयोग करें (उदाहरण के लिए, समस्या विवरण और अन्वेषण, नमूना उदाहरणों की जांच, डिजाइन, समाधान लागू करना, परीक्षण और मूल्यांकन)।"
        },
        "csta2011/CT.L2:12": {
          "description": "किसी समस्या को उप-समस्याओं में विघटित करने के लिए ऐब्स्ट्रैक्शन का उपयोग करें।"
        },
        "csta2011/CT.L2:6": {
          "description": "अनुसरण किए जा रहे निर्देशों के अनुक्रम का वर्णन और विश्लेषण करें (उदाहरण के लिए, नियमों और एल्गोरिदम्स द्वारा संचालित वीडियो गेम में एक चरित्र के व्यवहार का वर्णन करें)।"
        },
        "csta2011/CT.L2:7": {
          "description": "टेक्स्ट, ध्वनियों, चित्रों और संख्याओं सहित विभिन्न तरीकों से डेटा को पेश करें।"
        },
        "csta2011/CT.L2:8": {
          "description": "समस्या की स्थिति, संरचनाओं और डेटा (जैसे, ग्राफ्स, चार्ट्स, नेटवर्क डायग्राम्स, फ़्लोचार्ट्स) के दृश्य पेशकारी का उपयोग करें।"
        },
        "iste/1.a": {
          "description": "नए विचारों, उत्पादों, या प्रक्रियाओं को उत्पन्न करने के लिए मौजूदा ज्ञान को लागू करें।"
        },
        "iste/1.b": {
          "description": "व्यक्तिगत या सामूहिक अभिव्यक्ति के साधनों के रूप में मूल रचनाएँ बनाएँ।"
        },
        "iste/1.c": {
          "description": "जटिल प्रणालियों और मुद्दों का पता लगाने के लिए मॉडल्स और सिमुलेशन्स का उपयोग करें।"
        },
        "iste/4.b": {
          "description": "समाधान बनाने या किसी परियोजना को पूरा करने के लिए गतिविधियों की योजना बनाएं और उनका प्रबंधन करें।"
        },
        "iste/6.a": {
          "description": "तकनीकी प्रणालियों को समझो और इस्तेमाल करो।"
        },
        "iste/6.c": {
          "description": "ट्रबलशूट सिस्टम्स और एप्लिकेशन्स।"
        },
        "iste/6.d": {
          "description": "नई तकनीकों को सीखने के लिए वर्तमान ज्ञान को स्थानांतरित करें।"
        },
        "ccela/1.L.6": {
          "description": "सरल संबंधों का संकेत देने के लिए अकसर आने वाले संयोजकों का उपयोग करने सहित, बातचीत, पठन और पढ़े जाने और टेक्सट संदेशों का जवाब देने के माध्यम से ग्रहण किए शब्दों और वाक्यांशों का उपयोग करें (जैसे क्योंकि)।"
        },
        "ccela/1.SL.1": {
          "description": "ग्रेड 1 के विषयों के बारे में विविध साझेदारों के साथ और छोटे व बड़े समूहों में सहपाठियों व वयस्कों के साथ सामूहिक वार्तालापों में भाग लें।"
        },
        "ccela/11-12.RI.4": {
          "description": "शब्दों और वाक्यांशों के अर्थ का निर्धारण करें जैसे वे एक टेक्स्ट में उपयोग किए जाते हैं, जिसमें आलंकारिक, अर्थपूर्ण, और तकनीकी अर्थ शामिल हैं; विश्लेषण करें कि एक लेखक पाठ के कोर्स के दौरान एक प्रमुख शब्द या शब्दों के अर्थ का उपयोग कैसे करता है और परिशोधित करता है (उदाहरण के लिए, मैडिसन कैसे परिभाषित करते हैं"
        },
        "ccela/2.L.6": {
          "description": "वर्णन करने के लिए बातचीत, पठन और पढ़े जा रहे, और टेक्सट का जवाब देने के माध्यम से ग्रहण किए गए शब्दों और वाक्यांशों का उपयोग करें, विशेषणों और क्रिया विशेषणों का उपयोग करने सहित (जैसे, जब अन्य बच्चे खुश होते हैं, तो मुझे खुशी मिलती है)।"
        },
        "ccela/2.SL.1": {
          "description": "ग्रेड 2 के विषयों के बारे में विविध साझेदारों के साथ और छोटे व बड़े समूहों में सहपाठियों व वयस्कों के साथ सामूहिक वार्तालापों में भाग लें।"
        },
        "ccela/3.L.6": {
          "description": "ग्रेड-उपयुक्त संवादात्मक, सामान्य शैक्षणिक और विषय-विशिष्ट शब्द और वाक्यांश अर्जित व उपयोग करें, उनके सहित, जो स्थानिक और अस्थायी संबंधों का संकेत देते हैं (जैसे, उस रात खाना खाने के बाद हम उन्हें ढूंढने गए)।"
        },
        "ccela/3.SL.1": {
          "description": "दूसरों के विचारों के आधार पर और उनके खुद के विचारों को स्पष्ट रूप से अभिव्यक्त करते हुए, ग्रेड 3 के विषयों, टेक्सट के बारे में विविध साझेदारों के साथ कई प्रकार की सहयोगात्मक चर्चा (आमने-सामने, समूहों में, और अध्यापक-संचालित) में प्रभावशाली रूप से शामिल हों।"
        },
        "ccmath/1.OA.1": {
          "description": "सभी पोजीशनों में अज्ञात घटकों में जोड़ने, उनसे लेने, साथ में जोड़ने, अलग करने, तुलना करने की स्थितियों को शामिल करते हुए  शाब्दिक सवालों को हल करने के लिए 20 के अंदर जोड़ और घटा का उपयोग करें, जैसे सवाल प्रदर्शित करने के लिए अज्ञात संख्या के लिए प्रतीक चिन्ह वाली वस्तुओं, ड्राइंग और समीकरणों का उपयोग करके।"
        },
        "ccmath/2.OA.1": {
          "description": "सभी पोजीशनों में अज्ञात घटकों में जोड़ने, उनसे लेने, साथ में जोड़ने, अलग करने, तुलना करने की स्थितियों को शामिल करते हुए एक या दो स्टेप वाले शाब्दिक सवालों को हल करने के लिए 100 के अंदर जोड़ और घटा का उपयोग करें, जैसे सवाल प्रदर्शित करने के लिए अज्ञात संख्या के लिए प्रतीक चिन्ह वाली ड्राइंग और समीकरणों का उपयोग करके।1"
        },
        "ccmath/3.OA.3": {
          "description": "सभी पोजीशनों में अज्ञात घटकों में जोड़ने, उनसे लेने, साथ में जोड़ने, अलग करने, तुलना करने की स्थितियों को शामिल करते हुए  शाब्दिक सवालों को हल करने के लिए 100 के अंदर जोड़ और घटा का उपयोग करें, जैसे सवाल प्रदर्शित करने के लिए अज्ञात संख्या के लिए प्रतीक चिन्ह वाली वस्तुओं, ड्राइंग और समीकरणों का उपयोग करके।1"
        },
        "csta2011/CD.L1:3-01": {
          "description": "कंप्यूटर और संबंधित तकनीकों को सफलतापूर्वक संचालित करने के लिए मानक इनपुट और आउटपुट डिवाइस का उपयोग करें।"
        },
        "csta2011/CI.L1:3-01": {
          "description": "प्रौद्योगिकी प्रणालियों और सॉफ्टवेयर के उपयोग में जिम्मेदार डिजिटल नागरिकता (कानूनी और नैतिक व्यवहार) का अभ्यास करें।"
        },
        "csta2011/CPP.L1:6-01": {
          "description": "समस्या-समाधान और स्व-निर्देशित शिक्षण के लिए प्रौद्योगिकी संसाधनों (जैसे, कैलकुलेटर, डेटा संग्रह प्रोब्स, मोबाइल डिवाइस, वीडियोस, शैक्षिक सॉफ़्टवेयर और वेब टूल्स) का उपयोग करें।"
        },
        "ccela/11-12.L.6": {
          "description": "कॉलेज और करियर की तैयारी के स्तर पर पढ़ने, लिखने, बोलने, और सुनने के लिए पर्याप्त सामान्य शैक्षणिक और डोमेन-विशिष्ट शब्दों और वाक्यांशों को प्राप्त करना और उनका उपयोग करना; विचार करते समय शब्दावली ज्ञान एकत्र करने में स्वतंत्रता प्रदर्शित करें"
        },
        "ccela/4.L.6": {
          "description": "ग्रेड-उपयुक्त सामान्य शैक्षणिक और विषय-विशिष्ट शब्द और वाक्यांश अर्जित व उपयोग करें, उनके सहित, जो सटीक क्रियाओं, जज्बातों, या होने की स्थितियों (जैसे हंसी उड़ाना, हकलाहट, हिनहिनाहट) और जो किसी विशेष विषय के लिए बुनियादी हों (जैसे"
        },
        "ccela/5.L.6": {
          "description": "ग्रेड-उपयुक्त सामान्य शैक्षणिक और विषय-विशिष्ट शब्द और वाक्यांश अर्जित व उपयोग करें, उनके सहित, जो अंतर, जोड़ और अन्य तार्किक संबंधों का संकेत देते हैं (जैसे, यद्यपि, हालांकि, फिर भी, उसी प्रकार, सिवाय इसके, इसके अलावा )।"
        },
        "ccmath/4.MD.6": {
          "description": "प्रोट्रैक्टर का उपयोग करके कोणों को पूर्ण-संख्या डिग्रीज़ में मापें। निर्दिष्ट माप के स्केच कोण।"
        },
        "ccmath/4.NBT.4": {
          "description": "मानक एल्गोरिदम विधि का उपयोग करते हुए बहु-अंकीय पूर्णांकों को बिना अटके जोड़ें व घटाएं।"
        },
        "ccmath/4.NBT.5": {
          "description": "स्थान मूल्य और संचालनों की विशेषताओं के आधार पर कार्यनीतियों का उपयोग करते हुए, चार अंकों तक वाले पूर्णांक को एक-अंक वाले पूर्णांक से गुणा करें, और दो-अंक वाली दो संख्याओं को गुणा करें। समीकरणों, आयताकार श्रृंखला करके गणना के उदाहरण दें और समझाएं"
        },
        "ccmath/7.G.2": {
          "description": "दी गई स्थितियों के साथ जियोमेट्रिक आकृतियाँ (रूलर और प्रोट्रैक्टर के साथ, और तकनीक के साथ, फ्रीहैंड) ड्रा करें। कोणों या भुजाओं के तीन मापों से त्रिभुजों के निर्माण पर ध्यान दें, यह देखते हुए कि जब परिस्थितियाँ एक अद्वितीय त्रिभुज का निर्धारण करती हैं, एक से अधिक त्रिभुज"
        },
        "csta2011/CPP.L1:3-02": {
          "description": "पाठ्यक्रम में सीखने का समर्थन करने के लिए विकासात्मक रूप से उपयुक्त मल्टीमीडिया संसाधनों (जैसे, इंटरैक्टिव किताबें और शैक्षिक सॉफ्टवेयर) का उपयोग करें।"
        },
        "csta2011/CPP.L1:3-04": {
          "description": "एक साधारण कार्य (जैसे, टर्टल निर्देश) को पूरा करने के लिए बयानों के एक सेट का निर्माण करें।"
        },
        "ccela/11-12.W.6": {
          "description": "नए तर्कों या सूचनाओं सहित, चल रहे फीडबैक के जवाब में व्यक्तिगत या साझा लेखन उत्पादों का उत्पादन, प्रकाशन और अद्यतन करने के लिए इंटरनेट सहित प्रौद्योगिकी का उपयोग करें।"
        },
        "ccela/4.W.3": {
          "description": "प्रभावी तकनीक, वर्णनात्मक विवरणों, और स्पष्ट घटना अनुक्रमों का उपयोग करके वास्तविक या काल्पनिक अनुभवों या इवेंट्स को विकसित करने के लिए आख्यान लिखें।"
        },
        "ccela/6.W.6": {
          "description": "लेखन के निर्माण और प्रकाशन के साथ-साथ दूसरों के साथ बातचीत और सहयोग करने के लिए इंटरनेट सहित प्रौद्योगिकी का उपयोग करें; एक ही बैठक में कम से कम तीन पृष्ठ टाइप करने के लिए कीबोर्डिंग कौशलों की पर्याप्त कमांड प्रदर्शित करें।"
        },
        "ccela/7.W.3": {
          "description": "प्रभावी तकनीक, संबंधित वर्णनात्मक विवरणों, और अच्छी तरह से संरचित इवेंट अनुक्रमों का उपयोग करके वास्तविक या काल्पनिक अनुभवों या इवेंट्स को विकसित करने के लिए आख्यान लिखें।"
        },
        "ccela/7.W.6": {
          "description": "स्रोतों को जोड़ने और उद्धृत करने सहित, लेखन और लिंक को बनाने और प्रकाशित करने और स्रोतों को उद्धृत करने के साथ-साथ अन्य लोगों के साथ बातचीत और सहयोग करने के लिए, इंटरनेट सहित प्रौद्योगिकी का उपयोग करें।"
        },
        "ccela/8.W.6": {
          "description": "लेखन को प्रकाशित और प्रकाशित करने और सूचना और विचारों के बीच संबंधों को कुशलतापूर्वक प्रस्तुत करने के साथ-साथ दूसरों के साथ बातचीत और सहयोग करने के लिए, इंटरनेट सहित प्रौद्योगिकी का उपयोग करें।"
        },
        "ccela/9-10.W.6": {
          "description": "व्यक्तिगत या साझा लेखन उत्पादों का उत्पादन, प्रकाशन, और अद्यतन करने, अन्य जानकारी से लिंक करने और जानकारी को लचीले और गतिशील रूप से प्रदर्शित करने के लिए प्रौद्योगिकी की क्षमता का लाभ उठाने के लिए इंटरनेट सहित प्रौद्योगिकी का उपयोग करें।"
        },
        "ccmath/MP.4": {
          "description": "गणित के साथ मॉडल बनाएं"
        },
        "csta2011/CL.L1:6-02": {
          "description": "समाधानों या उत्पादों को विकसित करने के उद्देश्य से सहयोगी समस्या-समाधान गतिविधियों में भाग लेने के लिए ऑनलाइन संसाधनों (जैसे, ईमेल, ऑनलाइन चर्चाओं, सहयोगी वेब महौल) का उपयोग करें।"
        },
        "csta2011/CPP.L1:3-01": {
          "description": "आयु-उपयुक्त अनुसंधान करने के लिए प्रौद्योगिकी संसाधनों का उपयोग करें।"
        },
        "csta2011/CPP.L2:3": {
          "description": "पाठ्यक्रम धारणाओं को प्रदर्शित और संप्रेषित करने वाले प्रौद्योगिकी संसाधनों का उपयोग करके उत्पादों (जैसे, वेब पेज, मोबाइल एप्लिकेशन्स, एनिमेशन्स) को डिज़ाइन, विकसित, प्रकाशित और प्रस्तुत करें।"
        },
        "iste/2.a": {
          "description": "विभिन्न प्रकार के डिजिटल महौलों और मीडिया को नियोजित करने वाले साथियों, विशेषज्ञों, या अन्य लोगों के साथ बातचीत, सहयोग, और प्रकाशन करें।"
        },
        "iste/2.b": {
          "description": "विभिन्न प्रकार के मीडिया और फोर्मट्स का उपयोग करके सूचना और विचारों को कई दर्शकों तक प्रभावी ढंग से संप्रेषित करें।"
        },
        "iste/4.d": {
          "description": "वैकल्पिक समाधानों का पता लगाने के लिए कई प्रक्रियाओं और विविध दृष्टिकोणों का उपयोग करें।"
        },
        "csp2021/IOC-2.B.5": {
          "description": "एन्क्रिप्शन अनधिकृत पहुंच को रोकने के लिए डेटा को एन्कोड करने की प्रक्रिया है। डिक्रिप्शन डेटा को डिकोड करने की प्रक्रिया है। दो सामान्य एन्क्रिप्शन दृष्टिकोण हैं: ●       सिमेट्रिक कुंजी एन्क्रिप्शन में एन्क्रिप्शन और डिक्रिप्शन दोनों के लिए एक कुंजी शामिल होती है।●       सार्वजनिक कुंजी एन्क्रिप्शन एन्क्रिप्शन के लिए एक सार्वजनिक कुंजी और डिक्रिप्शन के लिए एक निजी कुंजी शामिल करता है। किसी संदेश को एन्क्रिप्ट करने के लिए सेंडर को रिसीवर की निजी कुंजी की आवश्यकता नहीं होती है, लेकिन संदेश को डिक्रिप्ट करने के लिए रिसीवर की निजी कुंजी की आवश्यकता होती है। अपवाद कथन (EKIOC-2.B.5): एन्क्रिप्शन और डिक्रिप्शन के लिए विशिष्ट गणितीय प्रक्रियाएं इस पाठ्यक्रम और AP परीक्षा के दायरे से बाहर हैं।"
        },
        "csta/3A-NI-06": {
          "description": "कुशलता, व्यवहार्यता, और नैतिक प्रभावों जैसे कारकों के आधार पर विभिन्न परिदृश्यों को संबोधित करने के लिए सुरक्षा उपायों की सिफारिश करें।"
        },
        "csta/3A-NI-07": {
          "description": "कंप्यूटर सिस्टम की उपयोगिता और सुरक्षा के बीच ट्रेडऑफ्स पर विचार करते हुए विभिन्न सुरक्षा उपायों की तुलना करें।"
        },
        "csta/3B-NI-04": {
          "description": "उन तरीकों की तुलना करें जिनसे सॉफ़्टवेयर डेवलपर डिवाइस और जानकारी को अनधिकृत पहुंच से सुरक्षित रखते हैं।"
        },
        "csp2021/DAT-1.D.1": {
          "description": "डेटा संक्षिप्तीकरण ट्रांसमिटेड या संग्रहीत डेटा के आकार (बिट्स की संख्या) को कम कर सकता है।"
        },
        "csp2021/DAT-1.D.2": {
          "description": "कम बिट्स का मतलब जरूरी नहीं कि कम जानकारी हो।"
        },
        "csp2021/DAT-1.D.3": {
          "description": "संक्षिप्तीकरण से आकार में कमी की मात्रा मूल डेटा प्रतिनिधित्व में अतिरेक की मात्रा और लागू संक्षिप्तीकरण एल्गोरिदम दोनों पर निर्भर करती है।"
        },
        "csp2021/DAT-1.D.4": {
          "description": "मूल डेटा के पूर्ण पुनर्निर्माण की गारंटी देते हुए दोषरहित डेटा संक्षिप्तीकरण एल्गोरिदम आमतौर पर संग्रहीत या ट्रांसमिटेड बिट्स की संख्या को कम कर सकते हैं।"
        },
        "csta/3A-DA-10": {
          "description": "डेटा तत्वों को कैसे व्यवस्थित किया जाता है और डेटा कहाँ संग्रहीत किया जाता है, इसमें ट्रेडऑफ्स का मूल्यांकन करें।"
        },
        "csta/1B-IC-18": {
          "description": "उन कंप्यूटिंग प्रौद्योगिकियों पर चर्चा करें जिन्होंने दुनिया को बदल दिया है और व्यक्त करें कि वे प्रौद्योगिकियां कैसे प्रभावित करती हैं, और कैसे सांस्कृतिक प्रथाओं से प्रभावित होती हैं।"
        },
        "csta/1B-DA-07": {
          "description": "कारण और प्रभाव संबंधों को उजागर करने या प्रस्तावित करने, परिणामों की भविष्यवाणी करने, या किसी विचार को संप्रेषित करने के लिए डेटा का उपयोग करें।"
        },
        "csta/1A-AP-11": {
          "description": "आसा"
        },
        "csta/1A-CS-02": {
          "description": "कंप्यूटिंग सिस्टम (हार्डवेयर) के सामान्य भौतिक घटकों के कार्य की पहचान करने और वर्णन करने में उपयुक्त शब्दावली का प्रयोग करें।"
        },
        "csta/1A-CS-03": {
          "description": "सटीक शब्दावली का उपयोग करते हुए मूल हार्डवेयर और सॉफ्टवेयर समस्याओं का वर्णन करें।"
        },
        "csta/1A-IC-17": {
          "description": "ऑनलाइन दूसरों के साथ सम्मानपूर्वक ढंग से और जिम्मेदारी से काम करें।"
        },
        "csta/1A-IC-18": {
          "description": "लॉगिन जानकारी को निजी रखें, और डिवाइसेस से उचित रूप से लॉग ऑफ करें।"
        },
        "1A-CS-02": {
          "description": "कंप्यूटिंग सिस्टम (हार्डवेयर) के सामान्य भौतिक घटकों के कार्य की पहचान करने और वर्णन करने में उपयुक्त शब्दावली का प्रयोग करें।"
        },
        "1A-CS-03": {
          "description": "सटीक शब्दावली का उपयोग करते हुए मूल हार्डवेयर और सॉफ्टवेयर समस्याओं का वर्णन करें।"
        },
        "1A-IC-17": {
          "description": "ऑनलाइन दूसरों के साथ सम्मानपूर्वक ढंग से और जिम्मेदारी से काम करें।"
        },
        "1A-IC-18": {
          "description": "लॉगिन जानकारी को निजी रखें, और डिवाइसेस से उचित रूप से लॉग ऑफ करें।"
        },
        "1B-DA-07": {
          "description": "कारण और प्रभाव संबंधों को उजागर करने या प्रस्तावित करने, परिणामों की भविष्यवाणी करने, या किसी विचार को संप्रेषित करने के लिए डेटा का उपयोग करें।"
        },
        "1B-IC-18": {
          "description": "उन कंप्यूटिंग प्रौद्योगिकियों पर चर्चा करें जिन्होंने दुनिया को बदल दिया है और व्यक्त करें कि वे प्रौद्योगिकियां कैसे प्रभावित करती हैं, और कैसे सांस्कृतिक प्रथाओं से प्रभावित होती हैं।"
        },
        "3A-DA-10": {
          "description": "डेटा तत्वों को कैसे व्यवस्थित किया जाता है और डेटा कहाँ संग्रहीत किया जाता है, इसमें ट्रेडऑफ्स का मूल्यांकन करें।"
        },
        "3A-NI-06": {
          "description": "कुशलता, व्यवहार्यता, और नैतिक प्रभावों जैसे कारकों के आधार पर विभिन्न परिदृश्यों को संबोधित करने के लिए सुरक्षा उपायों की सिफारिश करें।"
        },
        "3A-NI-07": {
          "description": "कंप्यूटर सिस्टम की उपयोगिता और सुरक्षा के बीच ट्रेडऑफ्स पर विचार करते हुए विभिन्न सुरक्षा उपायों की तुलना करें।"
        },
        "3B-NI-04": {
          "description": "उन तरीकों की तुलना करें जिनसे सॉफ़्टवेयर डेवलपर डिवाइस और जानकारी को अनधिकृत पहुंच से सुरक्षित रखते हैं।"
        },
        "DAT-1.D.1": {
          "description": "डेटा संक्षिप्तीकरण ट्रांसमिटेड या संग्रहीत डेटा के आकार (बिट्स की संख्या) को कम कर सकता है।"
        },
        "DAT-1.D.2": {
          "description": "कम बिट्स का मतलब जरूरी नहीं कि कम जानकारी हो।"
        },
        "DAT-1.D.3": {
          "description": "संक्षिप्तीकरण से आकार में कमी की मात्रा मूल डेटा प्रतिनिधित्व में अतिरेक की मात्रा और लागू संक्षिप्तीकरण एल्गोरिदम दोनों पर निर्भर करती है।"
        },
        "DAT-1.D.4": {
          "description": "मूल डेटा के पूर्ण पुनर्निर्माण की गारंटी देते हुए दोषरहित डेटा संक्षिप्तीकरण एल्गोरिदम आमतौर पर संग्रहीत या ट्रांसमिटेड बिट्स की संख्या को कम कर सकते हैं।"
        },
        "IOC-2.B.5": {
          "description": "एन्क्रिप्शन अनधिकृत पहुंच को रोकने के लिए डेटा को एन्कोड करने की प्रक्रिया है। डिक्रिप्शन डेटा को डिकोड करने की प्रक्रिया है। दो सामान्य एन्क्रिप्शन दृष्टिकोण हैं: ●       सिमेट्रिक कुंजी एन्क्रिप्शन में एन्क्रिप्शन और डिक्रिप्शन दोनों के लिए एक कुंजी शामिल होती है।●       सार्वजनिक कुंजी एन्क्रिप्शन एन्क्रिप्शन के लिए एक सार्वजनिक कुंजी और डिक्रिप्शन के लिए एक निजी कुंजी शामिल करता है। किसी संदेश को एन्क्रिप्ट करने के लिए सेंडर को रिसीवर की निजी कुंजी की आवश्यकता नहीं होती है, लेकिन संदेश को डिक्रिप्ट करने के लिए रिसीवर की निजी कुंजी की आवश्यकता होती है। अपवाद कथन (EKIOC-2.B.5): एन्क्रिप्शन और डिक्रिप्शन के लिए विशिष्ट गणितीय प्रक्रियाएं इस पाठ्यक्रम और AP परीक्षा के दायरे से बाहर हैं।"
        },
        "CD.L1:3-01": {
          "description": "कंप्यूटर और संबंधित तकनीकों को सफलतापूर्वक संचालित करने के लिए मानक इनपुट और आउटपुट डिवाइस का उपयोग करें।"
        },
        "CI.L1:3-01": {
          "description": "प्रौद्योगिकी प्रणालियों और सॉफ्टवेयर के उपयोग में जिम्मेदार डिजिटल नागरिकता (कानूनी और नैतिक व्यवहार) का अभ्यास करें।"
        },
        "CL.L1:6-02": {
          "description": "समाधानों या उत्पादों को विकसित करने के उद्देश्य से सहयोगी समस्या-समाधान गतिविधियों में भाग लेने के लिए ऑनलाइन संसाधनों (जैसे, ईमेल, ऑनलाइन चर्चाओं, सहयोगी वेब महौल) का उपयोग करें।"
        },
        "CPP.L1:3-01": {
          "description": "आयु-उपयुक्त अनुसंधान करने के लिए प्रौद्योगिकी संसाधनों का उपयोग करें।"
        },
        "CPP.L1:3-02": {
          "description": "पाठ्यक्रम में सीखने का समर्थन करने के लिए विकासात्मक रूप से उपयुक्त मल्टीमीडिया संसाधनों (जैसे, इंटरैक्टिव किताबें और शैक्षिक सॉफ्टवेयर) का उपयोग करें।"
        },
        "CPP.L1:3-04": {
          "description": "एक साधारण कार्य (जैसे, टर्टल निर्देश) को पूरा करने के लिए बयानों के एक सेट का निर्माण करें।"
        },
        "CPP.L1:6-01": {
          "description": "समस्या-समाधान और स्व-निर्देशित शिक्षण के लिए प्रौद्योगिकी संसाधनों (जैसे, कैलकुलेटर, डेटा संग्रह प्रोब्स, मोबाइल डिवाइस, वीडियोस, शैक्षिक सॉफ़्टवेयर और वेब टूल्स) का उपयोग करें।"
        },
        "CPP.L1:6-06": {
          "description": "ब्लॉक आधारित विज़ुअल प्रोग्रामिंग भाषा का उपयोग करके समस्या के समाधान लागू करें।"
        },
        "CPP.L2:3": {
          "description": "पाठ्यक्रम धारणाओं को प्रदर्शित और संप्रेषित करने वाले प्रौद्योगिकी संसाधनों का उपयोग करके उत्पादों (जैसे, वेब पेज, मोबाइल एप्लिकेशन्स, एनिमेशन्स) को डिज़ाइन, विकसित, प्रकाशित और प्रस्तुत करें।"
        },
        "CT.L2:1": {
          "description": "समाधान तैयार करने के लिए एल्गोरिथम समस्या-समाधान में बुनियादी कदमों का उपयोग करें (उदाहरण के लिए, समस्या विवरण और अन्वेषण, नमूना उदाहरणों की जांच, डिजाइन, समाधान लागू करना, परीक्षण और मूल्यांकन)।"
        },
        "CT.L2:12": {
          "description": "किसी समस्या को उप-समस्याओं में विघटित करने के लिए ऐब्स्ट्रैक्शन का उपयोग करें।"
        },
        "CT.L2:6": {
          "description": "अनुसरण किए जा रहे निर्देशों के अनुक्रम का वर्णन और विश्लेषण करें (उदाहरण के लिए, नियमों और एल्गोरिदम्स द्वारा संचालित वीडियो गेम में एक चरित्र के व्यवहार का वर्णन करें)।"
        },
        "CT.L2:7": {
          "description": "टेक्स्ट, ध्वनियों, चित्रों और संख्याओं सहित विभिन्न तरीकों से डेटा को पेश करें।"
        },
        "CT.L2:8": {
          "description": "समस्या की स्थिति, संरचनाओं और डेटा (जैसे, ग्राफ्स, चार्ट्स, नेटवर्क डायग्राम्स, फ़्लोचार्ट्स) के दृश्य पेशकारी का उपयोग करें।"
        },
        "1.L.6": {
          "description": "सरल संबंधों का संकेत देने के लिए अकसर आने वाले संयोजकों का उपयोग करने सहित, बातचीत, पठन और पढ़े जाने और टेक्सट संदेशों का जवाब देने के माध्यम से ग्रहण किए शब्दों और वाक्यांशों का उपयोग करें (जैसे क्योंकि)।"
        },
        "11-12.L.6": {
          "description": "कॉलेज और करियर की तैयारी के स्तर पर पढ़ने, लिखने, बोलने, और सुनने के लिए पर्याप्त सामान्य शैक्षणिक और डोमेन-विशिष्ट शब्दों और वाक्यांशों को प्राप्त करना और उनका उपयोग करना; विचार करते समय शब्दावली ज्ञान एकत्र करने में स्वतंत्रता प्रदर्शित करें"
        },
        "2.L.6": {
          "description": "वर्णन करने के लिए बातचीत, पठन और पढ़े जा रहे, और टेक्सट का जवाब देने के माध्यम से ग्रहण किए गए शब्दों और वाक्यांशों का उपयोग करें, विशेषणों और क्रिया विशेषणों का उपयोग करने सहित (जैसे, जब अन्य बच्चे खुश होते हैं, तो मुझे खुशी मिलती है)।"
        },
        "3.L.6": {
          "description": "ग्रेड-उपयुक्त संवादात्मक, सामान्य शैक्षणिक और विषय-विशिष्ट शब्द और वाक्यांश अर्जित व उपयोग करें, उनके सहित, जो स्थानिक और अस्थायी संबंधों का संकेत देते हैं (जैसे, उस रात खाना खाने के बाद हम उन्हें ढूंढने गए)।"
        },
        "4.L.6": {
          "description": "ग्रेड-उपयुक्त सामान्य शैक्षणिक और विषय-विशिष्ट शब्द और वाक्यांश अर्जित व उपयोग करें, उनके सहित, जो सटीक क्रियाओं, जज्बातों, या होने की स्थितियों (जैसे हंसी उड़ाना, हकलाहट, हिनहिनाहट) और जो किसी विशेष विषय के लिए बुनियादी हों (जैसे"
        },
        "5.L.6": {
          "description": "ग्रेड-उपयुक्त सामान्य शैक्षणिक और विषय-विशिष्ट शब्द और वाक्यांश अर्जित व उपयोग करें, उनके सहित, जो अंतर, जोड़ और अन्य तार्किक संबंधों का संकेत देते हैं (जैसे, यद्यपि, हालांकि, फिर भी, उसी प्रकार, सिवाय इसके, इसके अलावा )।"
        },
        "9-10.L.6": {
          "description": "कॉलेज और करियर की तैयारी के स्तर पर पढ़ने, लिखने, बोलने, और सुनने के लिए पर्याप्त सामान्य शैक्षणिक और डोमेन-विशिष्ट शब्दों और वाक्यांशों को प्राप्त करना और उनका उपयोग करना; विचार करते समय शब्दावली ज्ञान एकत्र करने में स्वतंत्रता प्रदर्शित करें"
        },
        "11-12.RI.4": {
          "description": "शब्दों और वाक्यांशों के अर्थ का निर्धारण करें जैसे वे एक टेक्स्ट में उपयोग किए जाते हैं, जिसमें आलंकारिक, अर्थपूर्ण, और तकनीकी अर्थ शामिल हैं; विश्लेषण करें कि एक लेखक पाठ के कोर्स के दौरान एक प्रमुख शब्द या शब्दों के अर्थ का उपयोग कैसे करता है और परिशोधित करता है (उदाहरण के लिए, मैडिसन कैसे परिभाषित करते हैं"
        },
        "3.RL.4": {
          "description": "शब्दों और वाक्यांशों के अर्थ का निर्धारण करें क्योंकि वे टेक्स्ट में उपयोग किए जाते हैं, शाब्दिक को गैर-शाब्दिक भाषा से अलग करते हैं।"
        },
        "4.RL.7": {
          "description": "यह पहचानते हुए कि प्रत्येक संस्करण टेक्स्ट में विशिष्ट विवरणों और दिशाओं को दर्शाता है, किसी कहानी या नाटक के टेक्स्ट और टेक्स्ट की एक दृश्य या मौखिक प्रस्तुति के बीच संबंध बनाएं।"
        },
        "5.RL.4": {
          "description": "शब्दों और वाक्यांशों के अर्थ का निर्धारण करें क्योंकि वे टेक्स्ट में उपयोग किए जाते हैं, जिसमें आलंकारिक भाषा जैसे रूपक और उपमा शामिल हैं।"
        },
        "5.RL.7": {
          "description": "विश्लेषण करें कि दृश्य और मल्टीमीडिया तत्व किसी टेक्स्ट के अर्थ, स्वर, या सुंदरता में कैसे योगदान डालते हैं (जैसे, ग्राफिक नावेल, कल्पना की मल्टीमीडिया प्रस्तुति, लोककथा, मिथक, कविता)।"
        },
        "1.SL.1": {
          "description": "ग्रेड 1 के विषयों के बारे में विविध साझेदारों के साथ और छोटे व बड़े समूहों में सहपाठियों व वयस्कों के साथ सामूहिक वार्तालापों में भाग लें।"
        },
        "2.SL.1": {
          "description": "ग्रेड 2 के विषयों के बारे में विविध साझेदारों के साथ और छोटे व बड़े समूहों में सहपाठियों व वयस्कों के साथ सामूहिक वार्तालापों में भाग लें।"
        },
        "3.SL.1": {
          "description": "दूसरों के विचारों के आधार पर और उनके खुद के विचारों को स्पष्ट रूप से अभिव्यक्त करते हुए, ग्रेड 3 के विषयों, टेक्सट के बारे में विविध साझेदारों के साथ कई प्रकार की सहयोगात्मक चर्चा (आमने-सामने, समूहों में, और अध्यापक-संचालित) में प्रभावशाली रूप से शामिल हों।"
        },
        "6.SL.1": {
          "description": "दूसरों के विचारों के आधार पर और उनके खुद के विचारों को स्पष्ट रूप से अभिव्यक्त करते हुए, ग्रेड 6 के विषयों, टेक्सट और समस्याओं के बारे में विविध साझेदारों के साथ कई प्रकार की सहयोगात्मक चर्चा (आमने-सामने, समूहों में, और अध्यापक-संचालित) में प्रभावशाली रूप से शामिल हों।"
        },
        "7.SL.1": {
          "description": "दूसरों के विचारों के आधार पर और उनके खुद के विचारों को स्पष्ट रूप से अभिव्यक्त करते हुए, ग्रेड 7 के विषयों, टेक्सट और समस्याओं के बारे में विविध साझेदारों के साथ कई प्रकार की सहयोगात्मक चर्चा (आमने-सामने, समूहों में, और अध्यापक-संचालित) में प्रभावशाली रूप से शामिल हों।"
        },
        "11-12.W.6": {
          "description": "नए तर्कों या सूचनाओं सहित, चल रहे फीडबैक के जवाब में व्यक्तिगत या साझा लेखन उत्पादों का उत्पादन, प्रकाशन और अद्यतन करने के लिए इंटरनेट सहित प्रौद्योगिकी का उपयोग करें।"
        },
        "3.W.3": {
          "description": "प्रभावी तकनीक, वर्णनात्मक विवरणों, और स्पष्ट घटना अनुक्रमों का उपयोग करके वास्तविक या काल्पनिक अनुभवों या इवेंट्स को विकसित करने के लिए आख्यान लिखें।"
        },
        "4.W.3": {
          "description": "प्रभावी तकनीक, वर्णनात्मक विवरणों, और स्पष्ट घटना अनुक्रमों का उपयोग करके वास्तविक या काल्पनिक अनुभवों या इवेंट्स को विकसित करने के लिए आख्यान लिखें।"
        },
        "5.W.3": {
          "description": "प्रभावी तकनीक, वर्णनात्मक विवरणों, और स्पष्ट घटना अनुक्रमों का उपयोग करके वास्तविक या काल्पनिक अनुभवों या इवेंट्स को विकसित करने के लिए आख्यान लिखें।"
        },
        "6.W.3": {
          "description": "प्रभावी तकनीक, संबंधित वर्णनात्मक विवरणों, और अच्छी तरह से संरचित इवेंट अनुक्रमों का उपयोग करके वास्तविक या काल्पनिक अनुभवों या इवेंट्स को विकसित करने के लिए आख्यान लिखें।"
        },
        "6.W.6": {
          "description": "लेखन के निर्माण और प्रकाशन के साथ-साथ दूसरों के साथ बातचीत और सहयोग करने के लिए इंटरनेट सहित प्रौद्योगिकी का उपयोग करें; एक ही बैठक में कम से कम तीन पृष्ठ टाइप करने के लिए कीबोर्डिंग कौशलों की पर्याप्त कमांड प्रदर्शित करें।"
        },
        "7.W.3": {
          "description": "प्रभावी तकनीक, संबंधित वर्णनात्मक विवरणों, और अच्छी तरह से संरचित इवेंट अनुक्रमों का उपयोग करके वास्तविक या काल्पनिक अनुभवों या इवेंट्स को विकसित करने के लिए आख्यान लिखें।"
        },
        "7.W.6": {
          "description": "स्रोतों को जोड़ने और उद्धृत करने सहित, लेखन और लिंक को बनाने और प्रकाशित करने और स्रोतों को उद्धृत करने के साथ-साथ अन्य लोगों के साथ बातचीत और सहयोग करने के लिए, इंटरनेट सहित प्रौद्योगिकी का उपयोग करें।"
        },
        "8.W.3": {
          "description": "प्रभावी तकनीक, संबंधित वर्णनात्मक विवरणों, और अच्छी तरह से संरचित इवेंट अनुक्रमों का उपयोग करके वास्तविक या काल्पनिक अनुभवों या इवेंट्स को विकसित करने के लिए आख्यान लिखें।"
        },
        "8.W.6": {
          "description": "लेखन को प्रकाशित और प्रकाशित करने और सूचना और विचारों के बीच संबंधों को कुशलतापूर्वक प्रस्तुत करने के साथ-साथ दूसरों के साथ बातचीत और सहयोग करने के लिए, इंटरनेट सहित प्रौद्योगिकी का उपयोग करें।"
        },
        "9-10.W.6": {
          "description": "व्यक्तिगत या साझा लेखन उत्पादों का उत्पादन, प्रकाशन, और अद्यतन करने, अन्य जानकारी से लिंक करने और जानकारी को लचीले और गतिशील रूप से प्रदर्शित करने के लिए प्रौद्योगिकी की क्षमता का लाभ उठाने के लिए इंटरनेट सहित प्रौद्योगिकी का उपयोग करें।"
        },
        "11-12.WHST.6": {
          "description": "नए तर्कों या सूचनाओं सहित, चल रहे फीडबैक के जवाब में व्यक्तिगत या साझा लेखन उत्पादों का उत्पादन, प्रकाशन और अद्यतन करने के लिए इंटरनेट सहित प्रौद्योगिकी का उपयोग करें।"
        },
        "9-10.WHST.6": {
          "description": "व्यक्तिगत या साझा लेखन उत्पादों का उत्पादन, प्रकाशन, और अद्यतन करने, अन्य जानकारी से लिंक करने और जानकारी को लचीले और गतिशील रूप से प्रदर्शित करने के लिए प्रौद्योगिकी की क्षमता का लाभ उठाने के लिए इंटरनेट सहित प्रौद्योगिकी का उपयोग करें।"
        },
        "7.G.2": {
          "description": "दी गई स्थितियों के साथ जियोमेट्रिक आकृतियाँ (रूलर और प्रोट्रैक्टर के साथ, और तकनीक के साथ, फ्रीहैंड) ड्रा करें। कोणों या भुजाओं के तीन मापों से त्रिभुजों के निर्माण पर ध्यान दें, यह देखते हुए कि जब परिस्थितियाँ एक अद्वितीय त्रिभुज का निर्धारण करती हैं, एक से अधिक त्रिभुज"
        },
        "4.MD.6": {
          "description": "प्रोट्रैक्टर का उपयोग करके कोणों को पूर्ण-संख्या डिग्रीज़ में मापें। निर्दिष्ट माप के स्केच कोण।"
        },
        "MP.1": {
          "description": "सवालों का अर्थ निकालें और उन्हें हल करने का निरंतर प्रयास करें"
        },
        "MP.2": {
          "description": "अमूर्त रूप से और मात्रात्मक ढंग से तर्क करें"
        },
        "MP.4": {
          "description": "गणित के साथ मॉडल बनाएं"
        },
        "MP.5": {
          "description": "कार्यनीतिक रूप से उपयुक्त टूल्स का उपयोग करें"
        },
        "MP.6": {
          "description": "शुद्धता पर ध्यान दें"
        },
        "MP.7": {
          "description": "संरचना खोजें व उसका उपयोग करें"
        },
        "MP.8": {
          "description": "दोहराए गए तर्क में नियमितता खोजें और व्यक्त करें"
        },
        "4.NBT.4": {
          "description": "मानक एल्गोरिदम विधि का उपयोग करते हुए बहु-अंकीय पूर्णांकों को बिना अटके जोड़ें व घटाएं।"
        },
        "4.NBT.5": {
          "description": "स्थान मूल्य और संचालनों की विशेषताओं के आधार पर कार्यनीतियों का उपयोग करते हुए, चार अंकों तक वाले पूर्णांक को एक-अंक वाले पूर्णांक से गुणा करें, और दो-अंक वाली दो संख्याओं को गुणा करें। समीकरणों, आयताकार श्रृंखला करके गणना के उदाहरण दें और समझाएं"
        },
        "1.OA.1": {
          "description": "सभी पोजीशनों में अज्ञात घटकों में जोड़ने, उनसे लेने, साथ में जोड़ने, अलग करने, तुलना करने की स्थितियों को शामिल करते हुए  शाब्दिक सवालों को हल करने के लिए 20 के अंदर जोड़ और घटा का उपयोग करें, जैसे सवाल प्रदर्शित करने के लिए अज्ञात संख्या के लिए प्रतीक चिन्ह वाली वस्तुओं, ड्राइंग और समीकरणों का उपयोग करके।"
        },
        "2.OA.1": {
          "description": "सभी पोजीशनों में अज्ञात घटकों में जोड़ने, उनसे लेने, साथ में जोड़ने, अलग करने, तुलना करने की स्थितियों को शामिल करते हुए एक या दो स्टेप वाले शाब्दिक सवालों को हल करने के लिए 100 के अंदर जोड़ और घटा का उपयोग करें, जैसे सवाल प्रदर्शित करने के लिए अज्ञात संख्या के लिए प्रतीक चिन्ह वाली ड्राइंग और समीकरणों का उपयोग करके।1"
        },
        "3.OA.3": {
          "description": "सभी पोजीशनों में अज्ञात घटकों में जोड़ने, उनसे लेने, साथ में जोड़ने, अलग करने, तुलना करने की स्थितियों को शामिल करते हुए  शाब्दिक सवालों को हल करने के लिए 100 के अंदर जोड़ और घटा का उपयोग करें, जैसे सवाल प्रदर्शित करने के लिए अज्ञात संख्या के लिए प्रतीक चिन्ह वाली वस्तुओं, ड्राइंग और समीकरणों का उपयोग करके।1"
        },
        "1.a": {
          "description": "नए विचारों, उत्पादों, या प्रक्रियाओं को उत्पन्न करने के लिए मौजूदा ज्ञान को लागू करें।"
        },
        "1.b": {
          "description": "व्यक्तिगत या सामूहिक अभिव्यक्ति के साधनों के रूप में मूल रचनाएँ बनाएँ।"
        },
        "1.c": {
          "description": "जटिल प्रणालियों और मुद्दों का पता लगाने के लिए मॉडल्स और सिमुलेशन्स का उपयोग करें।"
        },
        "2.a": {
          "description": "विभिन्न प्रकार के डिजिटल महौलों और मीडिया को नियोजित करने वाले साथियों, विशेषज्ञों, या अन्य लोगों के साथ बातचीत, सहयोग, और प्रकाशन करें।"
        },
        "2.b": {
          "description": "विभिन्न प्रकार के मीडिया और फोर्मट्स का उपयोग करके सूचना और विचारों को कई दर्शकों तक प्रभावी ढंग से संप्रेषित करें।"
        },
        "4.b": {
          "description": "समाधान बनाने या किसी परियोजना को पूरा करने के लिए गतिविधियों की योजना बनाएं और उनका प्रबंधन करें।"
        },
        "4.d": {
          "description": "वैकल्पिक समाधानों का पता लगाने के लिए कई प्रक्रियाओं और विविध दृष्टिकोणों का उपयोग करें।"
        },
        "6.a": {
          "description": "तकनीकी प्रणालियों को समझो और इस्तेमाल करो।"
        },
        "6.c": {
          "description": "ट्रबलशूट सिस्टम्स और एप्लिकेशन्स।"
        },
        "6.d": {
          "description": "नई तकनीकों को सीखने के लिए वर्तमान ज्ञान को स्थानांतरित करें।"
        }
      }
    }
  }
}