{
  "ro-RO": {
    "data": {
      "standard_categories": {
        "DA": {
          "description": "Date & Analiză"
        },
        "DAT-1": {
          "description": "Modul în care computerul reprezintă date este diferite de modul în care datele sunt interpretate și afișate pentru utilizator. Programele sunt utilizate pentru traducerea datelor într-o reprezentare, care este mai ușoară de înțeles pentru oameni."
        },
        "IOC-2": {
          "description": "Utilizarea inovațiilor informatice poate implica riscuri pentru siguranța și identitatea personală."
        },
        "DAT-1.D": {
          "description": "Să compare algoritmii de comprimare a datelor pentru a determina care este mai bun într-un anumit context."
        },
        "IOC-2.B": {
          "description": "Să explice cum resursele informatice pot fi protejate și pot fi utilizate în mod greșit."
        },
        "CD": {
          "description": "Computere & Dispozitive de Comunicare"
        },
        "CI": {
          "description": "Impacturi la nivel de Comunitate, Global și Etic"
        },
        "CL": {
          "description": "Colaborare"
        },
        "CPP": {
          "description": "Practică de Calcul & Programare "
        },
        "CT": {
          "description": "Gândire Computațională"
        },
        "L": {
          "description": "Limbă"
        },
        "RI": {
          "description": "Citire Informațională"
        },
        "RL": {
          "description": "Să citească Literatură"
        },
        "SL": {
          "description": "Vorbit & Ascultat"
        },
        "W": {
          "description": "Scriere"
        },
        "C": {
          "description": "Cercuri"
        },
        "F": {
          "description": "Funcţii"
        },
        "G": {
          "description": "Geometrie"
        },
        "MP": {
          "description": "Practici Matematice"
        },
        "NBT": {
          "description": "Numere și Operațiuni În Baza Zece"
        },
        "OA": {
          "description": "Operațiuni și Gândire Algebrică"
        },
        "1": {
          "description": "Elevii demonstrează gândire creativă, construiesc cunoștințe și dezvoltă produse și procese inovative, utilizând tehnologia."
        },
        "2": {
          "description": "Elevii utilizează metode și medii digitale pentru a comunica și lucra în colaborare, inclusiv de la distanță, pentru sprijinirea învățării individuale și pentru a contribui la învățarea celorlalți."
        },
        "4": {
          "description": "Studenții utilizează aptitudinile de gândire critică pentru planificarea și conducerea cercetării, gestionării proiectelor, rezolvă probleme și iau decizii informate utilizând instrumentele și resursele digitale adecvate."
        },
        "6": {
          "description": "Elevii demonstrează o înțelegere solidă a conceptelor gehnologice, sistemelor și operațiilor."
        }
      }
    }
  }
}