{
  "ar-SA": {
    "data": {
      "standards": {
        "ccela/3.RL.4": {
          "description": "تحديد معنى الكلمات والعبارات كما يتم استخدامها في النص ، وتمييز اللغة الحرفية عن غير الحرفية."
        },
        "ccela/4.RL.7": {
          "description": "قم بعمل روابط بين نص القصة أو الدراما والعرض التقديمي المرئي أو الشفوي للنص، مع تحديد المكان الذي تعكس فيه كل نسخة أوصافًا واتجاهات محددة في النص."
        },
        "ccela/5.RL.4": {
          "description": "تحديد معنى الكلمات والعبارات كما تُستخدم في النص، بما في ذلك اللغة التصويرية مثل الاستعارات والتشبيهات."
        },
        "ccela/5.RL.7": {
          "description": "تحليل كيف تساهم العناصر المرئية والوسائط المتعددة في معنى أو لهجة أو جمال النص (على سبيل المثال، الرواية المصورة، عرض الوسائط المتعددة للرواية الخيالية، أو الحكاية الشعبية، أو الأسطورة، أو القصيدة)."
        },
        "csta/1B-AP-10": {
          "description": "إنشاء برامج تتضمن التتابع، الأحداث البرمجية، حلقات التكرار والجمل الشرطية."
        },
        "csta/1B-AP-12": {
          "description": "تعديل أجزاء من برنامج موجود أو إعادة مزجها أو دمجها في عمل شخصي، لتطوير شيء جديد أو إضافة ميزات أكثر تقدمًا."
        },
        "csta/1B-AP-15": {
          "description": "اختبار وتصحيح (إيجاد الأخطاء وتصحيحها) برنامج أو خوارزمية لضمان عمله على النحو الصحيح."
        },
        "ccela/6.SL.1": {
          "description": "الانخراط بفاعلية في مجموعة من المناقشات التعاونية (واحد لواحد أو في مجموعات أو بقيادة المعلم) مع شركاء متنوعين في مواضيع ونصوص وقضايا من الصف السادس، والبناء على أفكار الآخرين والتعبير بوضوح عن أفكارهم بوضوح."
        },
        "ccela/7.SL.1": {
          "description": "الانخراط بفاعلية في مجموعة من المناقشات التعاونية (واحد لواحد أو في مجموعات أو بقيادة المعلم) مع شركاء متنوعين في مواضيع ونصوص وقضايا من الصف السابع، والبناء على أفكار الآخرين والتعبير بوضوح عن أفكارهم بوضوح."
        },
        "ccmath/MP.1": {
          "description": "فهم طبيعة المسائل والمثابرة في حلها"
        },
        "ccmath/MP.2": {
          "description": "التفكير بطريقة تجريدية وكميّة"
        },
        "ccmath/MP.5": {
          "description": "استخدام الأدوات المناسبة استخدامًا إستراتيجيًا"
        },
        "ccmath/MP.6": {
          "description": "مراعاة الدقة"
        },
        "ccmath/MP.7": {
          "description": "محاولة إيجاد البنية واستخدامها"
        },
        "ccmath/MP.8": {
          "description": "البحث عن التوافق في الاستنتاجات المتكررة والتعبير عنه"
        },
        "csta2011/CPP.L1:6-06": {
          "description": "تنفيذ حلول المشكلات باستخدام لغة برمجة مرئية تعتمد على القوالب."
        },
        "csta2011/CT.L2:1": {
          "description": "استخدام الخطوات الأساسية في حل المشكلات الخوارزمية لتصميم الحلول (على سبيل المثال، بيان المشكلة واستكشافها وفحص أمثلة العينة والتصميم وتنفيذ الحل والاختبار والتقييم)."
        },
        "csta2011/CT.L2:12": {
          "description": "استخدام التجريد لتحليل مشكلة ما إلى مشكلات فرعية."
        },
        "csta2011/CT.L2:6": {
          "description": "وصف وتحليل سلسلة من التعليمات التي يجري اتباعها (على سبيل المثال، وصف سلوك الشخصية في لعبة فيديو على أنه مدفوع بالقواعد والخوارزميات)."
        },
        "csta2011/CT.L2:7": {
          "description": "تمثيل البيانات بطرق متنوعة، بما في ذلك النصوص والأصوات والصور والأرقام."
        },
        "csta2011/CT.L2:8": {
          "description": "استخدام العروض المرئية لحالات المشكلة وهياكلها وبياناتها (على سبيل المثال، الرسوم البيانية والمخططات ومخططات الشبكة والمخططات الانسيابية)."
        },
        "iste/1.a": {
          "description": "تطبيق المعرفة الحالية لتوليد أفكار أو منتجات أو عمليات جديدة."
        },
        "iste/1.b": {
          "description": "إنشاء أعمال أصلية كوسيلة للتعبير الشخصي أو الجماعي."
        },
        "iste/1.c": {
          "description": "استخدام النماذج والمحاكاة لاستكشاف النظم والقضايا المعقدة."
        },
        "iste/4.b": {
          "description": "تخطيط وإدارة الأنشطة لتطوير حل أو إكمال مشروع."
        },
        "iste/6.a": {
          "description": "فهم أنظمة التكنولوجيا واستخدامها."
        },
        "iste/6.c": {
          "description": "استكشاف أخطاء الأنظمة والتطبيقات وإصلاحها."
        },
        "iste/6.d": {
          "description": "نقل المعرفة الحالية لتعلم التكنولوجيات الجديدة."
        },
        "ccela/1.L.6": {
          "description": "استخدام الكلمات والعبارات المكتسبة عبر المحادثات والقراءة والاستماع لقراءة الآخرين والتجاوب مع النصوص، بما في ذلك استخدام حروف العطف والربط المتكررة للإشارة إلى علاقات بسيطة (على سبيل المثال، بسبب)."
        },
        "ccela/1.SL.1": {
          "description": "المشاركة في محادثات تعاونية مع شركاء متنوعين حول موضوعات الصف الأول ونصوصه، وذلك مع الأقران والبالغين في مجموعات صغيرة وكبيرة."
        },
        "ccela/11-12.RI.4": {
          "description": "تحديد معنى الكلمات والعبارات عند استخدامها في النص، بما في ذلك المعاني التصويرية والدلالية والتقنية؛ تحليل كيف يستخدم المؤلف معنى مصطلح أو مصطلحات رئيسية وينقحها على مدار النص (على سبيل المثال، كيف يعرف"
        },
        "ccela/2.L.6": {
          "description": "استخدام الكلمات والعبارات المكتسبة عبر المحادثات والقراءة والاستماع لقراءة الآخرين والتجاوب مع النصوص، بما في ذلك استخدام الصفات والأحوال لوصف (على سبيل المثال، أكون سعيدًا عندما يكون الأطفال الآخرون سعداء)."
        },
        "ccela/2.SL.1": {
          "description": "المشاركة في محادثات تعاونية مع شركاء متنوعين حول موضوعات الصف الثاني ونصوصه، وذلك مع الأقران والبالغين في مجموعات صغيرة وكبيرة."
        },
        "ccela/3.L.6": {
          "description": "اكتساب الكلمات والعبارات الأكاديمية العامة والخاصة بالمجال والمحادثات واستخدامها بدقة، بما في ذلك تلك التي تشير إلى العلاقات المكانية والزمنية (على سبيل المثال، ذهبنا للبحث عنهم بعد العشاء في تلك الليلة)."
        },
        "ccela/3.SL.1": {
          "description": "الانخراط بفاعلية في مجموعة من المناقشات التعاونية (واحد لواحد أو في مجموعات أو بقيادة المعلم) مع شركاء متنوعين في مواضيع ونصوص من الصف الثالث، والبناء على أفكار الآخرين والتعبير بوضوح عن أفكارهم بوضوح."
        },
        "ccmath/1.OA.1": {
          "description": "استخدام الجمع والطرح في نطاق العدد 20 لحل المسائل الكلامية التي تنطوي على حالات إضافة قيم مجهولة وطرحها وجمعها وتفكيكها ومقارنتها في جميع المواضع، وذلك، على سبيل المثال، باستخدام الأشياء والرسومات والمعادلات مع رمز"
        },
        "ccmath/2.OA.1": {
          "description": "استخدام الجمع والطرح في نطاق العدد 100 لحل المسائل الكلامية المكونة من خطوتين أو ثلاث خطوات والتي تنطوي على حالات إضافة قيم مجهولة وطرحها وجمعها وتفكيكها ومقارنتها في جميع المواضع، وذلك، على سبيل المثال، باستخدام الرسومات والمعادلات مع"
        },
        "ccmath/3.OA.3": {
          "description": "استخدام الجمع والطرح في نطاق العدد 100 لحل المسائل الكلامية التي تنطوي على حالات على مجموعات متساوية، ومصفوفات، وكميات قياسية، وذلك، على سبيل المثال، باستخدام الرسومات والمعادلات مع رمز للرقم المجهول لتمثيل المسألة.1"
        },
        "csta2011/CD.L1:3-01": {
          "description": "استخدام أجهزة الإدخال والإخراج القياسية لتشغيل أجهزة الكمبيوتر والتقنيات ذات الصلة بنجاح."
        },
        "csta2011/CI.L1:3-01": {
          "description": "ممارسة المواطنة الرقمية المسؤولة (السلوكيات القانونية والأخلاقية) في استخدام أنظمة التكنولوجيا وبرمجياتها."
        },
        "csta2011/CPP.L1:6-01": {
          "description": "استخدام موارد التكنولوجيا (مثل الآلات الحاسبة ومجسات جمع البيانات والأجهزة المحمولة ومقاطع الفيديو والبرامج التعليمية وأدوات الويب) لحل المشكلات والتعلم الذاتي."
        },
        "ccela/11-12.L.6": {
          "description": "اكتساب الكلمات والعبارات الأكاديمية العامة والخاصة بالمجال واستخدامها بدقة كافية للقراءة والكتابة والتحدث والاستماع على مستوى الاستعداد للحياة الجامعية والمهنية؛ إظهار الاستقلال في جمع المعرفة بالمفردات عند التفكير"
        },
        "ccela/4.L.6": {
          "description": "اكتساب الكلمات والعبارات الأكاديمية العامة والخاصة بالمجال واستخدامها بدقة، بما في ذلك تلك التي تشير إلى أفعال دقيقة، أو عواطف، أو حالات الوجود (على سبيل المثال، السخرية، والتذمر، والتلعثم) والتي تعد أساسية لموضوع معين (على سبيل المثال"
        },
        "ccela/5.L.6": {
          "description": "اكتساب الكلمات والعبارات الأكاديمية العامة والخاصة بالمجال واستخدامها بدقة، بما في ذلك تلك التي تشير إلى التباين والإضافة والعلاقات المنطقية الأخرى (على سبيل المثال، على الرغم من، بالمثل، بالإضافة إلى، وإلى جانب)."
        },
        "ccmath/4.MD.6": {
          "description": "قياس الزوايا بدرجات الأعداد الصحيحة باستخدام منقلة. رسم زوايا لها قياس محدد."
        },
        "ccmath/4.NBT.4": {
          "description": "جمع الأعداد الصحيحة متعددة الأرقام وطرحها بطلاقة باستخدام الخوارزمية القياسية."
        },
        "ccmath/4.NBT.5": {
          "description": "ضرب عدد صحيح يصل إلى أربعة أرقام في عدد صحيح من رقم واحد وضرب عددين من رقمين، باستخدام الإستراتيجيات القائمة على القيمة المكانية وخواص العمليات. توضيح العملية الحسابية وشرحها باستخدام المعادلات والمصفوفات"
        },
        "ccmath/7.G.2": {
          "description": "رسم (باليد الحرة وبمسطرة ومنقلة وباستخدام التكنولوجيا) أشكال هندسية بالشروط المذكورة في المعطيات. التركيز على تكوين مثلثات من ثلاثة قياسات للزوايا أو الأضلاع وملاحظة متى تحدد الشروط مثلثًا فريدًا أو أكثر من مثلث واحد"
        },
        "csta2011/CPP.L1:3-02": {
          "description": "استخدام موارد الوسائط المتعددة المناسبة من الناحية التطويرية (مثل الكتب التفاعلية والبرامج التعليمية) لدعم التعلم عبر المناهج الدراسية."
        },
        "csta2011/CPP.L1:3-04": {
          "description": "بناء مجموعة من العبارات ليتم تنفيذها لإنجاز مهمة بسيطة (على سبيل المثال، تعليمات السلاحف)."
        },
        "ccela/11-12.W.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة الفردية أو المشتركة ونشرها وتحديثها استجابة لعملية تلقي تعليقات مستمرة، بما في ذلك ظهور براهين أو معلومات جديدة."
        },
        "ccela/4.W.3": {
          "description": "كتابة سرد لتطوير تجارب أو أحداث حقيقية أو متخيلة باستخدام تقنية فعالة وتفاصيل وصفية وتسلسل أحداث واضح."
        },
        "ccela/6.W.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة ونشرها، بالإضافة إلى التفاعل والتعاون مع الآخرين؛ إبداء الإتقان الكافي لمهارات لوحة المفاتيح لكتابة ثلاث صفحات على الأقل في جلسة واحدة."
        },
        "ccela/7.W.3": {
          "description": "كتابة سرد لتطوير تجارب أو أحداث حقيقية أو متخيلة باستخدام تقنية فعالة وتفاصيل وصفية ذات صلة وتسلسل أحداث منظم جيدًا."
        },
        "ccela/7.W.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة ونشرها والربط بالمصادر والاستشهاد بها وكذلك للتفاعل والتعاون مع الآخرين، بما في ذلك الربط بالمصادر والاستشهاد بها."
        },
        "ccela/8.W.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة ونشرها وتقديم العلاقات بين المعلومات والأفكار بكفاءة وكذلك للتفاعل والتعاون مع الآخرين."
        },
        "ccela/9-10.W.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة الفردية أو المشتركة ونشرها وتحديثها، مع الاستفادة من قدرة التكنولوجيا على الربط بمعلومات أخرى وعرض المعلومات بمرونة وديناميكية."
        },
        "ccmath/MP.4": {
          "description": "استخدام نماذج الرياضيات"
        },
        "csta2011/CL.L1:6-02": {
          "description": "استخدام الموارد عبر الإنترنت (مثل البريد الإلكتروني والمناقشات عبر الإنترنت وبيئات الويب التعاونية) للمشاركة في أنشطة حل المشكلات بطريقة تعاونية بغرض وضع الحلول أو تطوير المنتجات."
        },
        "csta2011/CPP.L1:3-01": {
          "description": "استخدام موارد التكنولوجيا لإجراء البحوث المناسبة للعمر."
        },
        "csta2011/CPP.L2:3": {
          "description": "تصميم المنتجات وتطويرها ونشرها وتقديمها (على سبيل المثال، صفحات الويب وتطبيقات الجوال والرسوم المتحركة) باستخدام موارد التكنولوجيا التي توضح مفاهيم المنهج الدراسي وتوصله."
        },
        "iste/2.a": {
          "description": "التفاعل والتعاون والنشر مع الأقران أو الخبراء أو غيرهم ممن يستخدمون مجموعة متنوعة من البيئات والوسائط الرقمية."
        },
        "iste/2.b": {
          "description": "توصيل المعلومات والأفكار بشكل فعال إلى جماهير متعددة باستخدام مجموعة متنوعة من الوسائط والصيغ."
        },
        "iste/4.d": {
          "description": "استخدام عمليات متعددة ووجهات نظر متنوعة لاستكشاف الحلول البديلة."
        },
        "csta/1A-AP-11": {
          "description": "تحليل (تجزيء) الخطوات اللازمة لحل المشكلة إلى تسلسل دقيق من التعليمات."
        },
        "csta/1A-IC-17": {
          "description": "العمل باحترام ومسؤولية مع الآخرين عبر الإنترنت."
        },
        "csta/1A-AP-09": {
          "description": "تمثيل الطريقة التي تخزن بها البرامج البيانات وتعالجها باستخدام الأرقام أو الرموز الأخرى لتمثيل المعلومات."
        },
        "csta/1A-AP-14": {
          "description": "تصحيح الأخطاء (إيجاد وتصحيح) في خوارزمية أو برنامج يتضمن تسلسلات وحلقات تكرار بسيطة."
        },
        "csp2021/IOC-2.B.5": {
          "description": "التشفير هو عملية ترميز البيانات لمنع الوصول غير المصرح به. فك التشفير هو عملية فك تشفير البيانات. هناك طريقتان شائعتان للتشفير هما: ●       تشفير المفتاح المتناظر الذي يتضمن مفتاحًا واحدًا لكل من التشفير وفك التشفير.●       تشفير المفتاح العام الذي يعمل على إقران مفتاح عام للتشفير ومفتاح خاص لفك التشفير. لا يحتاج المرسِل إلى المفتاح الخاص للمستلم لتشفير رسالة، ولكن المفتاح الخاص للمستلم مطلوب لفك تشفير الرسالة. بيان الاستثناء (EKIOC-2.B.5): الإجراءات الرياضية المحددة للتشفير وفك التشفير خارج نطاق هذه الدورة التدريبية وامتحان التنسيب المتقدم."
        },
        "csta/3A-NI-06": {
          "description": "قدِّم توصية بالتدابير الأمنية لمعالجة السيناريوهات المختلفة بناءً على عوامل مثل الكفاءة والجدوى والتأثيرات الأخلاقية."
        },
        "csta/3A-NI-07": {
          "description": "قارن بين تدابير الأمان المختلفة، مع الأخذ في الاعتبار المفاضلات بين قابلية الاستخدام والأمان لنظام الكمبيوتر."
        },
        "csta/3B-NI-04": {
          "description": "قارن طرق حماية مطوري البرامج للأجهزة والمعلومات من الوصول غير المصرح به."
        },
        "csp2021/DAT-1.D.1": {
          "description": "يمكن أن يقلل ضغط البيانات من حجم (عدد البتات) للبيانات المرسلة أو المخزنة."
        },
        "csp2021/DAT-1.D.2": {
          "description": "البتات القليلة لا تعني بالضرورة معلومات أقل."
        },
        "csp2021/DAT-1.D.3": {
          "description": "يعتمد مقدار تقليل الحجم من الضغط على مقدار التكرار في تمثيل البيانات الأصلية وخوارزمية الضغط المطبقة."
        },
        "csp2021/DAT-1.D.4": {
          "description": "عادةً ما تقلل خوارزميات ضغط البيانات بدون فقدان عدد البتات المخزنة أو المنقولة مع ضمان إعادة البناء الكامل للبيانات الأصلية."
        },
        "csta/3A-DA-10": {
          "description": "قم بتقييم المفاضلات في كيفية تنظيم عناصر البيانات ومكان تخزين البيانات."
        },
        "csta/1B-CS-01": {
          "description": "وصف كيف تعمل الأجزاء الداخلية والخارجية في أجهزة الكمبيوتر لتشكل نظاماً متكاملاً."
        },
        "csta/1B-CS-02": {
          "description": "نموذج لكيفية عمل أجهزة وبرامج الكمبيوتر معًا كنظام لإنجاز المهام."
        },
        "csta/1B-NI-05": {
          "description": "مناقشة مشاكل الأمن السيبراني في العالم الحقيقي وطرق حماية المعلومات الشخصية."
        },
        "csta/1B-AP-11": {
          "description": "تحليل (تجزيء) المشكلات إلى مشكلات فرعية أصغر يمكن إدارتها لتسهيل عملية تطوير البرنامج."
        },
        "csta/1B-AP-09": {
          "description": "إنشاء برامج تستخدم المتغيرات لتخزين البيانات وتعديلها."
        },
        "csta/1A-AP-10": {
          "description": "تطوير برامج تتضمن التتابع وحلقات تكرار بسيطة للتعبير عن أفكار أو معالجة مشكلة."
        },
        "csta/1B-AP-14": {
          "description": "مراعاة حقوق الملكية الفكرية وإعطاء الإسناد المناسب عند إنشاء البرامج أو إعادة دمجها."
        },
        "csta/1B-AP-17": {
          "description": "وصف الاختيارات التي تم اتخاذها أثناء تطوير البرنامج باستخدام تعليقات الكود والعروض التقديمية والعروض التوضيحية."
        },
        "csta/1B-IC-21": {
          "description": "استخدام الوسائط المتعددة المتوفرة في مواقع انترنت مجانية والامتناع عن نسخ أو استخدام المواد التي أنشأها الآخرون دون إذن."
        },
        "csta/1B-IC-18": {
          "description": "مناقشة أشكال تكنولوجيا الحوسبة التي غيرت العالم والتعبير عن كيفية تأثير أشكال التكنولوجيا تلك في الممارسات الثقافية وتأثرها بها."
        },
        "csta/1B-DA-07": {
          "description": "استخدم البيانات لتمييز أو اقتراح علاقات السبب والنتيجة، أو التنبؤ بالنتائج، أو توصيل الأفكار."
        },
        "csta/1A-CS-03": {
          "description": "قم بوصف مشاكل الأجهزة والبرامج الأساسية باستخدام مصطلحات دقيقة."
        },
        "1A-AP-09": {
          "description": "تمثيل الطريقة التي تخزن بها البرامج البيانات وتعالجها باستخدام الأرقام أو الرموز الأخرى لتمثيل المعلومات."
        },
        "1A-AP-10": {
          "description": "تطوير برامج تتضمن التتابع وحلقات تكرار بسيطة للتعبير عن أفكار أو معالجة مشكلة."
        },
        "1A-AP-11": {
          "description": "تحليل (تجزيء) الخطوات اللازمة لحل المشكلة إلى تسلسل دقيق من التعليمات."
        },
        "1A-AP-14": {
          "description": "تصحيح الأخطاء (إيجاد وتصحيح) في خوارزمية أو برنامج يتضمن تسلسلات وحلقات تكرار بسيطة."
        },
        "1A-CS-03": {
          "description": "قم بوصف مشاكل الأجهزة والبرامج الأساسية باستخدام مصطلحات دقيقة."
        },
        "1A-IC-17": {
          "description": "العمل باحترام ومسؤولية مع الآخرين عبر الإنترنت."
        },
        "1B-AP-09": {
          "description": "إنشاء برامج تستخدم المتغيرات لتخزين البيانات وتعديلها."
        },
        "1B-AP-10": {
          "description": "إنشاء برامج تتضمن التتابع، الأحداث البرمجية، حلقات التكرار والجمل الشرطية."
        },
        "1B-AP-11": {
          "description": "تحليل (تجزيء) المشكلات إلى مشكلات فرعية أصغر يمكن إدارتها لتسهيل عملية تطوير البرنامج."
        },
        "1B-AP-12": {
          "description": "تعديل أجزاء من برنامج موجود أو إعادة مزجها أو دمجها في عمل شخصي، لتطوير شيء جديد أو إضافة ميزات أكثر تقدمًا."
        },
        "1B-AP-14": {
          "description": "مراعاة حقوق الملكية الفكرية وإعطاء الإسناد المناسب عند إنشاء البرامج أو إعادة دمجها."
        },
        "1B-AP-15": {
          "description": "اختبار وتصحيح (إيجاد الأخطاء وتصحيحها) برنامج أو خوارزمية لضمان عمله على النحو الصحيح."
        },
        "1B-AP-17": {
          "description": "وصف الاختيارات التي تم اتخاذها أثناء تطوير البرنامج باستخدام تعليقات الكود والعروض التقديمية والعروض التوضيحية."
        },
        "1B-CS-01": {
          "description": "وصف كيف تعمل الأجزاء الداخلية والخارجية في أجهزة الكمبيوتر لتشكل نظاماً متكاملاً."
        },
        "1B-CS-02": {
          "description": "نموذج لكيفية عمل أجهزة وبرامج الكمبيوتر معًا كنظام لإنجاز المهام.\n"
        },
        "1B-DA-07": {
          "description": "استخدم البيانات لتمييز أو اقتراح علاقات السبب والنتيجة، أو التنبؤ بالنتائج، أو توصيل الأفكار."
        },
        "1B-IC-18": {
          "description": "مناقشة أشكال تكنولوجيا الحوسبة التي غيرت العالم والتعبير عن كيفية تأثير أشكال التكنولوجيا تلك في الممارسات الثقافية وتأثرها بها."
        },
        "1B-IC-21": {
          "description": "استخدام الوسائط المتعددة المتوفرة في مواقع انترنت مجانية والامتناع عن نسخ أو استخدام المواد التي أنشأها الآخرون دون إذن."
        },
        "1B-NI-05": {
          "description": "مناقشة مشاكل الأمن السيبراني في العالم الحقيقي وطرق حماية المعلومات الشخصية."
        },
        "3A-DA-10": {
          "description": "قم بتقييم المفاضلات في كيفية تنظيم عناصر البيانات ومكان تخزين البيانات."
        },
        "3A-NI-06": {
          "description": "قدِّم توصية بالتدابير الأمنية لمعالجة السيناريوهات المختلفة بناءً على عوامل مثل الكفاءة والجدوى والتأثيرات الأخلاقية."
        },
        "3A-NI-07": {
          "description": "قارن بين تدابير الأمان المختلفة، مع الأخذ في الاعتبار المفاضلات بين قابلية الاستخدام والأمان لنظام الكمبيوتر."
        },
        "3B-NI-04": {
          "description": "قارن طرق حماية مطوري البرامج للأجهزة والمعلومات من الوصول غير المصرح به."
        },
        "DAT-1.D.1": {
          "description": "يمكن أن يقلل ضغط البيانات من حجم (عدد البتات) للبيانات المرسلة أو المخزنة."
        },
        "DAT-1.D.2": {
          "description": "البتات القليلة لا تعني بالضرورة معلومات أقل."
        },
        "DAT-1.D.3": {
          "description": "يعتمد مقدار تقليل الحجم من الضغط على مقدار التكرار في تمثيل البيانات الأصلية وخوارزمية الضغط المطبقة."
        },
        "DAT-1.D.4": {
          "description": "عادةً ما تقلل خوارزميات ضغط البيانات بدون فقدان عدد البتات المخزنة أو المنقولة مع ضمان إعادة البناء الكامل للبيانات الأصلية."
        },
        "IOC-2.B.5": {
          "description": "التشفير هو عملية ترميز البيانات لمنع الوصول غير المصرح به. فك التشفير هو عملية فك تشفير البيانات. هناك طريقتان شائعتان للتشفير هما: ●       تشفير المفتاح المتناظر الذي يتضمن مفتاحًا واحدًا لكل من التشفير وفك التشفير.●       تشفير المفتاح العام الذي يعمل على إقران مفتاح عام للتشفير ومفتاح خاص لفك التشفير. لا يحتاج المرسِل إلى المفتاح الخاص للمستلم لتشفير رسالة، ولكن المفتاح الخاص للمستلم مطلوب لفك تشفير الرسالة. بيان الاستثناء (EKIOC-2.B.5): الإجراءات الرياضية المحددة للتشفير وفك التشفير خارج نطاق هذه الدورة التدريبية وامتحان التنسيب المتقدم."
        },
        "CD.L1:3-01": {
          "description": "استخدام أجهزة الإدخال والإخراج القياسية لتشغيل أجهزة الكمبيوتر والتقنيات ذات الصلة بنجاح."
        },
        "CI.L1:3-01": {
          "description": "ممارسة المواطنة الرقمية المسؤولة (السلوكيات القانونية والأخلاقية) في استخدام أنظمة التكنولوجيا وبرمجياتها."
        },
        "CL.L1:6-02": {
          "description": "استخدام الموارد عبر الإنترنت (مثل البريد الإلكتروني والمناقشات عبر الإنترنت وبيئات الويب التعاونية) للمشاركة في أنشطة حل المشكلات بطريقة تعاونية بغرض وضع الحلول أو تطوير المنتجات."
        },
        "CPP.L1:3-01": {
          "description": "استخدام موارد التكنولوجيا لإجراء البحوث المناسبة للعمر."
        },
        "CPP.L1:3-02": {
          "description": "استخدام موارد الوسائط المتعددة المناسبة من الناحية التطويرية (مثل الكتب التفاعلية والبرامج التعليمية) لدعم التعلم عبر المناهج الدراسية."
        },
        "CPP.L1:3-04": {
          "description": "بناء مجموعة من العبارات ليتم تنفيذها لإنجاز مهمة بسيطة (على سبيل المثال، تعليمات السلاحف)."
        },
        "CPP.L1:6-01": {
          "description": "استخدام موارد التكنولوجيا (مثل الآلات الحاسبة ومجسات جمع البيانات والأجهزة المحمولة ومقاطع الفيديو والبرامج التعليمية وأدوات الويب) لحل المشكلات والتعلم الذاتي."
        },
        "CPP.L1:6-06": {
          "description": "تنفيذ حلول المشكلات باستخدام لغة برمجة مرئية تعتمد على القوالب."
        },
        "CPP.L2:3": {
          "description": "تصميم المنتجات وتطويرها ونشرها وتقديمها (على سبيل المثال، صفحات الويب وتطبيقات الجوال والرسوم المتحركة) باستخدام موارد التكنولوجيا التي توضح مفاهيم المنهج الدراسي وتوصله."
        },
        "CT.L2:1": {
          "description": "استخدام الخطوات الأساسية في حل المشكلات الخوارزمية لتصميم الحلول (على سبيل المثال، بيان المشكلة واستكشافها وفحص أمثلة العينة والتصميم وتنفيذ الحل والاختبار والتقييم)."
        },
        "CT.L2:12": {
          "description": "استخدام التجريد لتحليل مشكلة ما إلى مشكلات فرعية."
        },
        "CT.L2:6": {
          "description": "وصف وتحليل سلسلة من التعليمات التي يجري اتباعها (على سبيل المثال، وصف سلوك الشخصية في لعبة فيديو على أنه مدفوع بالقواعد والخوارزميات)."
        },
        "CT.L2:7": {
          "description": "تمثيل البيانات بطرق متنوعة، بما في ذلك النصوص والأصوات والصور والأرقام."
        },
        "CT.L2:8": {
          "description": "استخدام العروض المرئية لحالات المشكلة وهياكلها وبياناتها (على سبيل المثال، الرسوم البيانية والمخططات ومخططات الشبكة والمخططات الانسيابية)."
        },
        "1.L.6": {
          "description": "استخدام الكلمات والعبارات المكتسبة عبر المحادثات والقراءة والاستماع لقراءة الآخرين والتجاوب مع النصوص، بما في ذلك استخدام حروف العطف والربط المتكررة للإشارة إلى علاقات بسيطة (على سبيل المثال، بسبب)."
        },
        "11-12.L.6": {
          "description": "اكتساب الكلمات والعبارات الأكاديمية العامة والخاصة بالمجال واستخدامها بدقة كافية للقراءة والكتابة والتحدث والاستماع على مستوى الاستعداد للحياة الجامعية والمهنية؛ إظهار الاستقلال في جمع المعرفة بالمفردات عند التفكير"
        },
        "2.L.6": {
          "description": "استخدام الكلمات والعبارات المكتسبة عبر المحادثات والقراءة والاستماع لقراءة الآخرين والتجاوب مع النصوص، بما في ذلك استخدام الصفات والأحوال لوصف (على سبيل المثال، أكون سعيدًا عندما يكون الأطفال الآخرون سعداء)."
        },
        "3.L.6": {
          "description": "اكتساب الكلمات والعبارات الأكاديمية العامة والخاصة بالمجال والمحادثات واستخدامها بدقة، بما في ذلك تلك التي تشير إلى العلاقات المكانية والزمنية (على سبيل المثال، ذهبنا للبحث عنهم بعد العشاء في تلك الليلة)."
        },
        "4.L.6": {
          "description": "اكتساب الكلمات والعبارات الأكاديمية العامة والخاصة بالمجال واستخدامها بدقة، بما في ذلك تلك التي تشير إلى أفعال دقيقة، أو عواطف، أو حالات الوجود (على سبيل المثال، السخرية، والتذمر، والتلعثم) والتي تعد أساسية لموضوع معين (على سبيل المثال"
        },
        "5.L.6": {
          "description": "اكتساب الكلمات والعبارات الأكاديمية العامة والخاصة بالمجال واستخدامها بدقة، بما في ذلك تلك التي تشير إلى التباين والإضافة والعلاقات المنطقية الأخرى (على سبيل المثال، على الرغم من، بالمثل، بالإضافة إلى، وإلى جانب)."
        },
        "9-10.L.6": {
          "description": "اكتساب الكلمات والعبارات الأكاديمية العامة والخاصة بالمجال واستخدامها بدقة كافية للقراءة والكتابة والتحدث والاستماع على مستوى الاستعداد للحياة الجامعية والمهنية؛ إظهار الاستقلال في جمع المعرفة بالمفردات عند التفكير"
        },
        "11-12.RI.4": {
          "description": "تحديد معنى الكلمات والعبارات عند استخدامها في النص، بما في ذلك المعاني التصويرية والدلالية والتقنية؛ تحليل كيف يستخدم المؤلف معنى مصطلح أو مصطلحات رئيسية وينقحها على مدار النص (على سبيل المثال، كيف يعرف"
        },
        "3.RL.4": {
          "description": "تحديد معنى الكلمات والعبارات كما يتم استخدامها في النص ، وتمييز اللغة الحرفية عن غير الحرفية."
        },
        "4.RL.7": {
          "description": "قم بعمل روابط بين نص القصة أو الدراما والعرض التقديمي المرئي أو الشفوي للنص، مع تحديد المكان الذي تعكس فيه كل نسخة أوصافًا واتجاهات محددة في النص."
        },
        "5.RL.4": {
          "description": "تحديد معنى الكلمات والعبارات كما تُستخدم في النص، بما في ذلك اللغة التصويرية مثل الاستعارات والتشبيهات."
        },
        "5.RL.7": {
          "description": "تحليل كيف تساهم العناصر المرئية والوسائط المتعددة في معنى أو لهجة أو جمال النص (على سبيل المثال، الرواية المصورة، عرض الوسائط المتعددة للرواية الخيالية، أو الحكاية الشعبية، أو الأسطورة، أو القصيدة)."
        },
        "1.SL.1": {
          "description": "المشاركة في محادثات تعاونية مع شركاء متنوعين حول موضوعات الصف الأول ونصوصه، وذلك مع الأقران والبالغين في مجموعات صغيرة وكبيرة."
        },
        "2.SL.1": {
          "description": "المشاركة في محادثات تعاونية مع شركاء متنوعين حول موضوعات الصف الثاني ونصوصه، وذلك مع الأقران والبالغين في مجموعات صغيرة وكبيرة."
        },
        "3.SL.1": {
          "description": "الانخراط بفاعلية في مجموعة من المناقشات التعاونية (واحد لواحد أو في مجموعات أو بقيادة المعلم) مع شركاء متنوعين في مواضيع ونصوص من الصف الثالث، والبناء على أفكار الآخرين والتعبير بوضوح عن أفكارهم بوضوح."
        },
        "6.SL.1": {
          "description": "الانخراط بفاعلية في مجموعة من المناقشات التعاونية (واحد لواحد أو في مجموعات أو بقيادة المعلم) مع شركاء متنوعين في مواضيع ونصوص وقضايا من الصف السادس، والبناء على أفكار الآخرين والتعبير بوضوح عن أفكارهم بوضوح."
        },
        "7.SL.1": {
          "description": "الانخراط بفاعلية في مجموعة من المناقشات التعاونية (واحد لواحد أو في مجموعات أو بقيادة المعلم) مع شركاء متنوعين في مواضيع ونصوص وقضايا من الصف السابع، والبناء على أفكار الآخرين والتعبير بوضوح عن أفكارهم بوضوح."
        },
        "11-12.W.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة الفردية أو المشتركة ونشرها وتحديثها استجابة لعملية تلقي تعليقات مستمرة، بما في ذلك ظهور براهين أو معلومات جديدة."
        },
        "3.W.3": {
          "description": "كتابة سرد لتطوير تجارب أو أحداث حقيقية أو متخيلة باستخدام تقنية فعالة وتفاصيل وصفية وتسلسل أحداث واضح."
        },
        "4.W.3": {
          "description": "كتابة سرد لتطوير تجارب أو أحداث حقيقية أو متخيلة باستخدام تقنية فعالة وتفاصيل وصفية وتسلسل أحداث واضح."
        },
        "5.W.3": {
          "description": "كتابة سرد لتطوير تجارب أو أحداث حقيقية أو متخيلة باستخدام تقنية فعالة وتفاصيل وصفية وتسلسل أحداث واضح."
        },
        "6.W.3": {
          "description": "كتابة سرد لتطوير تجارب أو أحداث حقيقية أو متخيلة باستخدام تقنية فعالة وتفاصيل وصفية ذات صلة وتسلسل أحداث منظم جيدًا."
        },
        "6.W.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة ونشرها، بالإضافة إلى التفاعل والتعاون مع الآخرين؛ إبداء الإتقان الكافي لمهارات لوحة المفاتيح لكتابة ثلاث صفحات على الأقل في جلسة واحدة."
        },
        "7.W.3": {
          "description": "كتابة سرد لتطوير تجارب أو أحداث حقيقية أو متخيلة باستخدام تقنية فعالة وتفاصيل وصفية ذات صلة وتسلسل أحداث منظم جيدًا."
        },
        "7.W.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة ونشرها والربط بالمصادر والاستشهاد بها وكذلك للتفاعل والتعاون مع الآخرين، بما في ذلك الربط بالمصادر والاستشهاد بها."
        },
        "8.W.3": {
          "description": "كتابة سرد لتطوير تجارب أو أحداث حقيقية أو متخيلة باستخدام تقنية فعالة وتفاصيل وصفية ذات صلة وتسلسل أحداث منظم جيدًا."
        },
        "8.W.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة ونشرها وتقديم العلاقات بين المعلومات والأفكار بكفاءة وكذلك للتفاعل والتعاون مع الآخرين."
        },
        "9-10.W.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة الفردية أو المشتركة ونشرها وتحديثها، مع الاستفادة من قدرة التكنولوجيا على الربط بمعلومات أخرى وعرض المعلومات بمرونة وديناميكية."
        },
        "11-12.WHST.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة الفردية أو المشتركة ونشرها وتحديثها استجابة لعملية تلقي تعليقات مستمرة، بما في ذلك ظهور براهين أو معلومات جديدة."
        },
        "9-10.WHST.6": {
          "description": "استخدام التكنولوجيا، بما في ذلك الإنترنت، لإنتاج منتجات الكتابة الفردية أو المشتركة ونشرها وتحديثها، مع الاستفادة من قدرة التكنولوجيا على الربط بمعلومات أخرى وعرض المعلومات بمرونة وديناميكية."
        },
        "3-5-ETS1-1": {
          "description": "تحديد مشكلة تصميم بسيطة تعكس حاجة أو رغبة تتضمن معايير محددة للنجاح وقيودًا على المواد أو الوقت أو التكلفة."
        },
        "K-2-ETS1-1": {
          "description": "اطرح أسئلة وقم بأخذ ملاحظات واجمع معلومات حول موقف يريد الناس تغييره لتحديد مشكلة بسيطة يمكن حلها من خلال تطوير كائن أو أداة جديدة أو محسنة."
        },
        "K-2-ETS1-2": {
          "description": "قم بتطوير مخطط بسيط أو رسم أو نموذج ملموس لتوضيح كيف يساعد شكل كائن ما في العمل حسب الحاجة لحل مشكلة معينة."
        },
        "7.G.2": {
          "description": "رسم (باليد الحرة وبمسطرة ومنقلة وباستخدام التكنولوجيا) أشكال هندسية بالشروط المذكورة في المعطيات. التركيز على تكوين مثلثات من ثلاثة قياسات للزوايا أو الأضلاع وملاحظة متى تحدد الشروط مثلثًا فريدًا أو أكثر من مثلث واحد"
        },
        "2.MD.10": {
          "description": "ارسم مخططاً للصورة ورسمًا بيانيًا (بمقياس أحادي الوحدة) لتمثيل مجموعة بيانات تصل إلى أربع فئات. قم بحل المسائل البسيطة المجمعة،جزئها ،وقارن بينها باستخدام المعلومات المقدمة في الرسم البياني الشريطي."
        },
        "4.MD.5.b": {
          "description": "يُقال إن الزاوية التي تدور بمقدار س من الزوايا ذات الدرجة الواحدة يكون قياس زاويتها س درجة."
        },
        "4.MD.6": {
          "description": "قياس الزوايا بدرجات الأعداد الصحيحة باستخدام منقلة. رسم زوايا لها قياس محدد."
        },
        "MP.1": {
          "description": "فهم طبيعة المسائل والمثابرة في حلها"
        },
        "MP.2": {
          "description": "التفكير بطريقة تجريدية وكميّة"
        },
        "MP.4": {
          "description": "استخدام نماذج الرياضيات"
        },
        "MP.5": {
          "description": "استخدام الأدوات المناسبة استخدامًا إستراتيجيًا\n"
        },
        "MP.6": {
          "description": "مراعاة الدقة"
        },
        "MP.7": {
          "description": "محاولة إيجاد البنية واستخدامها"
        },
        "MP.8": {
          "description": "البحث عن التوافق في الاستنتاجات المتكررة والتعبير عنه"
        },
        "4.NBT.4": {
          "description": "جمع الأعداد الصحيحة متعددة الأرقام وطرحها بطلاقة باستخدام الخوارزمية القياسية."
        },
        "4.NBT.5": {
          "description": "ضرب عدد صحيح يصل إلى أربعة أرقام في عدد صحيح من رقم واحد وضرب عددين من رقمين، باستخدام الإستراتيجيات القائمة على القيمة المكانية وخواص العمليات. توضيح العملية الحسابية وشرحها باستخدام المعادلات والمصفوفات"
        },
        "1.OA.1": {
          "description": "استخدام الجمع والطرح في نطاق العدد 20 لحل المسائل الكلامية التي تنطوي على حالات إضافة قيم مجهولة وطرحها وجمعها وتفكيكها ومقارنتها في جميع المواضع، وذلك، على سبيل المثال، باستخدام الأشياء والرسومات والمعادلات مع رمز"
        },
        "2.OA.1": {
          "description": "استخدام الجمع والطرح في نطاق العدد 100 لحل المسائل الكلامية المكونة من خطوتين أو ثلاث خطوات والتي تنطوي على حالات إضافة قيم مجهولة وطرحها وجمعها وتفكيكها ومقارنتها في جميع المواضع، وذلك، على سبيل المثال، باستخدام الرسومات والمعادلات مع"
        },
        "3.OA.3": {
          "description": "استخدام الجمع والطرح في نطاق العدد 100 لحل المسائل الكلامية التي تنطوي على حالات على مجموعات متساوية، ومصفوفات، وكميات قياسية، وذلك، على سبيل المثال، باستخدام الرسومات والمعادلات مع رمز للرقم المجهول لتمثيل المسألة.1"
        },
        "1.a": {
          "description": "تطبيق المعرفة الحالية لتوليد أفكار أو منتجات أو عمليات جديدة."
        },
        "1.b": {
          "description": "إنشاء أعمال أصلية كوسيلة للتعبير الشخصي أو الجماعي."
        },
        "1.c": {
          "description": "استخدام النماذج والمحاكاة لاستكشاف النظم والقضايا المعقدة."
        },
        "2.a": {
          "description": "التفاعل والتعاون والنشر مع الأقران أو الخبراء أو غيرهم ممن يستخدمون مجموعة متنوعة من البيئات والوسائط الرقمية."
        },
        "2.b": {
          "description": "توصيل المعلومات والأفكار بشكل فعال إلى جماهير متعددة باستخدام مجموعة متنوعة من الوسائط والصيغ."
        },
        "4.b": {
          "description": "تخطيط وإدارة الأنشطة لتطوير حل أو إكمال مشروع."
        },
        "4.d": {
          "description": "استخدام عمليات متعددة ووجهات نظر متنوعة لاستكشاف الحلول البديلة."
        },
        "6.a": {
          "description": "فهم أنظمة التكنولوجيا واستخدامها."
        },
        "6.c": {
          "description": "استكشاف أخطاء الأنظمة والتطبيقات وإصلاحها."
        },
        "6.d": {
          "description": "نقل المعرفة الحالية لتعلم التكنولوجيات الجديدة."
        }
      }
    }
  }
}