{
  "bg-BG": {
    "data": {
      "standards": {
        "1-ESS1-1": {
          "description": "Използвайте наблюдения на слънцето, луната и звездите, за да опищете модели, които могат да бъдат предсказани."
        },
        "1-ESS1-2": {
          "description": "Направете наблюдения по различни времена от годината, за да обвържете количеството дневна светлина с времето от годината."
        },
        "1A-DA-06": {
          "description": "Събирайте и представте същите данни визуално по няколко начина."
        },
        "1A-NI-04": {
          "description": "Обяснете какво са паролите и защо ги използваме, и използването на силни пароли за защита на устройства и данни от не опълномощен достъп."
        },
        "2-ESS1-1": {
          "description": "Използвайте информация от няколко източника, за да докажете, че събитията на Земята могат да се случват бързо или бавно.\n[Изяснение: Примери за събития и времеви рамки могат да включват вулканични експлозии и земетресения, които се случват бързо, и ерозия на скалите"
        },
        "3-A-i.3-5": {
          "description": "Разграничете как хората учат и как компютрите учат."
        },
        "3-A-i.6-8": {
          "description": "Контрастирайте уникалните характеристики на човешкото учене с начините, по които работят системите за машинно обучение."
        },
        "3-A-i.K-2": {
          "description": "Опишете и предоставете примери за това как хората се учат и как компютрите се учат."
        },
        "3-A-ii.3-5": {
          "description": "Моделирайте как обучението с надзор идентифицира модели в обозначени данни."
        },
        "3-A-ii.6-8": {
          "description": "Моделирайте как обучението без надзор идентифицира модели в необозначени данни."
        },
        "3-A-ii.9-12": {
          "description": "Използвайте или алгоритъм за учене с надзор, или алгоритъм за учене без надзор, за да обучите модел по данни от истинския свят и оценете резултатите."
        },
        "3-A-ii.K-2": {
          "description": "Идентифицирайте модели в обозначени данни и определете характеристиките, които предсказват обозначения."
        },
        "3-A-iii.3-5": {
          "description": "Обучете класифициращ модел, използвайки машинно обучение, и след това проучете точността на модела на нови входове"
        },
        "3-A-iii.6-8": {
          "description": "Обучете и оценете класифициращ или прогнозиращ модел, използвайки машинно обучение на табличен набор от данни"
        },
        "3-A-iii.K-2": {
          "description": "Демонстрирайте как да обучите компютър да разпознава нещо"
        },
        "3-A-iv.3-5": {
          "description": "Демонстрирайте как са обозначени данни за трениране, когато се използва инструмент за машинно обучение"
        },
        "3-A-iv.6-8": {
          "description": "Обяснете разликата между обучение и използването на модел за разсъждение."
        },
        "3-A-iv.9-12": {
          "description": "Илюстрирайте какво става през всяка от нужните стъпки, когато използвате машинно обучение, за да конструирате класификатор или предсказател."
        },
        "3-A-v.3-5": {
          "description": "Анализирайте игра, където единият конструира дърво за решения, описвайки организацията на дървото и алгоритъма за обучение, използван за добавяне на върхове"
        },
        "3-A-v.6-8": {
          "description": "Сравнете как алгоритъма за обучение на дърво за решения работи с това как работи алгоритъма за обучение на невронна мрежа."
        },
        "3-A-v.9-12": {
          "description": "Опишете как различните видове алгоритми за машинно обучение се учат чрез нагласяне на вътрешните си представи."
        },
        "3-A-vi.6-8": {
          "description": "Обяснете разликите между обучение с надзор и обучение с подкрепа."
        },
        "3-A-vi.9-12": {
          "description": "Изберете подходящия вид алгоритъм за машинно обучение (с надзор, без надзор или обучение с подкрепа), за да решите проблем за разсъждение."
        },
        "3-B-i.3-5": {
          "description": "Илюстрирайте как невронна мрежа с 1 до 3 неврона е функция, която изчислява резултат."
        },
        "3-B-i.6-8": {
          "description": "Илюстрирайте структурата на невронна мрежа и опишете как частите ѝ образуват група функции, които изчисляват резултат."
        },
        "3-B-ii.3-5": {
          "description": "Демонстрирайте как тежестите са зададени в невронна мрежа, за да постигнат желано поведение за вход/изход."
        },
        "3-B-ii.6-8": {
          "description": "Демонстрирайте как правило за учене може да бъде използва за нагласяне на тежестите в еднослойна невронна мрежа."
        },
        "3-C-i.3-5": {
          "description": "Създайте обозначен набор от данни с изрични характеристики от няколко типа и използвайте инструмент за машинно обучение, за да тренирате класификатор на тези данни."
        },
        "3-C-i.9-12": {
          "description": "Сравнете два набора от данни от истинския свят по отношение ма характеристикити, от които са изградени, и как тези характеристики са кодирани."
        },
        "3-C-i.K-2": {
          "description": "Създайте обозначен набор от данни с изрични характеристики, за да илюстрирате как компютрите могат да се научат да класифицират неща като храни, филми или играчки."
        },
        "3-C-ii.3-5": {
          "description": "Илюстрирайте как тренирането на класификатор за широка концепция като \"куче\" изсиква голям размер данни, за да обхване разнообразието на домейна."
        },
        "3-C-ii.6-8": {
          "description": "Илюстрирате как обектите в изображение могат да бъдат сегментирано и обозначени, за да конструират тренировъчен набор за разпознаване на обекти."
        },
        "3-C-ii.9-12": {
          "description": "Оценете набор от данни, използван за трениране на истинска ИТ система, като вземете предвид размера на набора от данни, начинът по който данните са събрани и обозначение, нужното място и очакваното време за създаването на набора от данни."
        },
        "3-C-iii.3-5": {
          "description": "Разгледайте характеристики и обозначения на данни за тренинг, за да намерите потенциални източници на пристрастия."
        },
        "3-C-iii.6-8": {
          "description": "Обяснете как избора на данни за тренинг оформя поведението на класификатора и как пристрастия могат да бъдат въведени, ако данните за тренинг не са правилно балансирани."
        },
        "3-C-iii.9-12": {
          "description": "Проучете дисбалансите в тренировъчните данни по отношение на пол, възраст, етническа принадлежност или други демографски променливи, които биха могли да доведат до пристрастен модел, като използвате инструмент за визуализация на данни."
        },
        "3-C-iii.K-2": {
          "description": "Разгледайте обозначен набор от данни и идентифицирайте проблеми в данните, които могат да накарат компютъра да направи грешни предсказания."
        },
        "4-ESS1-1": {
          "description": "Идентифицирайте доказателствата от моделите в скалните образувания и вкаменелостите в скалните пластове в подкрепа на обяснение за промените в пейзажа с течение на времето."
        },
        "5-ESS1-1": {
          "description": "Подкрепете аргументa, че разликите във видимата яркост на слънцето в сравнение с другите звезди се дължи на тяхното относително разстояние от Земята."
        },
        "5-ESS1-2": {
          "description": "Представяне на данни в графични изображения за разкриване на моделите на ежедневните промени в дължината и посоката на сенките, деня и нощта, както и на сезонната поява на някои звезди в нощното небе."
        },
        "HS-ESS1-1": {
          "description": "Разработване на модел на база доказателства, за да се илюстрира продължиелността на живота на Слънцето и ролята на ядренния синтез в ядрото на Слънцето за освобождаване на енергия, която евентуално достига Земята под формата на радиация. "
        },
        "HS-ESS1-2": {
          "description": "Конструирайте обяснение на теорията за Големия Взрив на база астрономически доказателства за светлинни спектри, движение на далечни галактики и композицията на материята във вселената."
        },
        "HS-ESS1-3": {
          "description": "Разкажете научните си идеас за начина, по който звездите произвеждат елементи през жизнения си цикъл."
        },
        "HS-ESS1-4": {
          "description": "Използвайте математически или изчислителни представяние, за да предскажете движението на орбиталните обекти в Слънчевата система."
        },
        "HS-PS3-3": {
          "description": "Проектирайте, конструирайте и усъвършенствайте устройство, което работи в рамките на дадени ограничения, за да преобразува една форма на енергия в друга.*"
        },
        "HS-PS3-4": {
          "description": "Планирайте и проведете изследване, за да докажете, че преносът на топлинна енергия при комбинирането на два компонента с различна температура в затворена система води до по-равномерно разпределение на енергията между компонентите в системата (се"
        },
        "HS-PS3-5": {
          "description": "Разработете и използвайте модел на два обекта, които си взаимодействат чрез електрическо или магнитно поле, за да илюстрирате силите между обектите и промените в енергията на обектите вследствие от взаимодействието."
        },
        "HS-PS4-4": {
          "description": "Оценете валидността и надеждността на твърдения в публикувани материали за ефектите, които различните честоти електромагнитната радиция оказват при поглъщане от материя."
        },
        "K-PS3-1": {
          "description": "Направете наблюдения, за да определите влиянието на слънчевата светлина върху повърхността на Земята."
        },
        "csta/1A-DA-06": {
          "description": "Събирайте и представте същите данни визуално по няколко начина."
        },
        "csta/1A-NI-04": {
          "description": "Обяснете какво са паролите и защо ги използваме, и използването на силни пароли за защита на устройства и данни от не опълномощен достъп."
        }
      }
    }
  }
}