{
  "mr-IN": {
    "data": {
      "standards": {
        "1.L.6": {
          "description": "संवाद, वाचन आणि वाचून दाखवलेल्या गोष्टींमधून कळलेले शब्द आणि वाक्प्रचार वापरणे आणि साधे नाते दर्शवणाऱ्या वारंवार येणाऱ्या उभयान्वयी अव्ययांसह मजकुरांना प्रतिसाद देणे (उदा. कारण)."
        },
        "1.OA.1": {
          "description": "कशामध्ये तरी जोडणे, कशातून तरी काढून घेणे, एकत्र ठेवणे, वेगळे करणे आणि तुलना करणे अशा स्थिती असलेली शाब्दिक गणिते सोडवण्यासाठी 20 च्या आतील बेरीज आणि वजाबाकी वापरा. यातील सर्व स्थितींमध्ये अज्ञात गोष्टी वापरा उदा. वस्तू, चित्रे आणि चिन्हे असलेली समीकरणे वापरा"
        },
        "1.SL.1": {
          "description": "इयत्ता 1 च्या विषयांबद्दल आणि मजकुराबद्दल वेगवेगळ्या भागीदारांशी समन्वयी संवादात सहभागी व्हा आणि सहकारी लोक आणि प्रौढांशी लहान तसेच जास्त मोठ्या गटांमध्ये संवाद साधा."
        },
        "1.a": {
          "description": "नवीन कल्पना, उत्पादने आणि प्रक्रिया तयार करण्यासाठी सध्या असलेले ज्ञान वापरा."
        },
        "1.b": {
          "description": "वैयक्तिक किंवा गट अभिव्यक्तीचे साधन म्हणून मूळ काम तयार करा."
        },
        "1.c": {
          "description": "गुंतागुंतीच्या प्रणाली आणि समस्यांचा अभ्यास करण्यासाठी मॉडेल्स आणि सिम्युलेशन्स वापरा.  "
        },
        "11-12.L.6": {
          "description": "कॉलेजमध्ये वाचणे, लिहिणे, बोलणे आणि करीअरसाठी तयार असण्याच्या पातळीपर्यंत पुरेसे ठरतील असे सामान्य शैक्षणिक आणि डोमेनमधील विशिष्ट शब्द आणि वाक्प्रचार समजून घ्या आणि अचूकतेने वापरा; शब्दसंग्रहाचे ज्ञान स्वतंत्रपणे गोळा करण्याची क्षमता दाखवा. "
        },
        "11-12.RI.4": {
          "description": "मजकुरात वापरलेल्या शब्दांचा आणि वाक्प्रचारांचा अलंकारिक, गर्भित आणि तांत्रिक अर्थ ठरवा; एखादा लेख मजकुरात एखादी महत्त्वाची संज्ञा किंवा महत्त्वाच्या संज्ञा कशा वापरतो आणि त्यांचा अर्थ कसा अधिक अचूक करतो, त्याचे विश्लेषण करा (उदा. मॅडिसन याची व्याख्या कशी करतो"
        },
        "11-12.W.6": {
          "description": "नवीन वाद किंवा माहितीसह सतत मिळणाऱ्या अभिप्रायाला प्रतिसाद म्हणून वैयक्तिक किंवा शेअर्ड लेखन उत्पादने तयार, प्रकाशित आणि अपडेट करण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा."
        },
        "11-12.WHST.6": {
          "description": "नवीन वाद किंवा माहितीसह सतत मिळणाऱ्या अभिप्रायाला प्रतिसाद म्हणून वैयक्तिक किंवा शेअर्ड लेखन उत्पादने तयार, प्रकाशित आणि अपडेट करण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा."
        },
        "1B-DA-07": {
          "description": "कारण-आणि-परिणाम संबंध उलगडण्यासाठी किंवा प्रस्तावित करण्यासाठी, परिणामांचा अंदाज लावण्यासाठी किंवा कल्पना संप्रेषण करण्यासाठी डेटा वापरा."
        },
        "1B-IC-18": {
          "description": "संगणकीय तंत्रज्ञानावर चर्चा करा ज्यांनी जग बदलले आहे आणि त्या तंत्रज्ञानाचा सांस्कृतिक पद्धतींवर कसा प्रभाव पडतो आणि कसा प्रभावित होतो हे व्यक्त करा."
        },
        "2.L.6": {
          "description": "संवाद, वाचन आणि वाचून दाखवलेल्या गोष्टींमधून कळलेले शब्द आणि वाक्प्रचार वापरणे आणि वर्णन करण्यासाठी वापरलेली विशेषणे आणि क्रियाविशेषणे यासह मजकुरांना प्रतिसाद देणे. (उदा. इतर मुले आनंदी असली की मला आनंद होतो."
        },
        "2.OA.1": {
          "description": "कशामध्ये तरी जोडणे, कशातून तरी काढून घेणे, एकत्र ठेवणे, वेगळे करणे आणि तुलना करणे अशा स्थिती असलेली एक- आणि दोन- पायऱ्यांची शाब्दिक गणिते सोडवण्यासाठी 100 च्या आतील बेरीज आणि वजाबाकी वापरा. यातील सर्व स्थितींमध्ये अज्ञात गोष्टी वापरा उदा. वस्तू, चित्रे आणि चिन्हे असलेली समीकरणे वापरा"
        },
        "2.SL.1": {
          "description": "इयत्ता 2 री च्या विषयांबद्दल आणि मजकुराबद्दल वेगवेगळ्या भागीदारांशी समन्वयी संवादात सहभागी व्हा आणि सहकारी लोक आणि प्रौढांशी लहान तसेच जास्त मोठ्या गटांमध्ये संवाद साधा."
        },
        "2.a": {
          "description": "विविध प्रकारची डिजिटल एन्व्हायर्नमेंट्स आणि मिडीया वापरून सहकारी, तज्ज्ञ आणि इतरांशी संवाद साधा, समन्वय करा आणि प्रकाशित करा."
        },
        "2.b": {
          "description": "विविध प्रकारचा मिडीया आणि फॉरमॅट्स वापरून अनेक प्रेक्षकांपर्यंत माहिती आणि कल्पना प्रभावीपणे पोचवा.    "
        },
        "3.L.6": {
          "description": "इयत्तेप्रमाणे योग्य असलेले संवादात्मक, सामान्य शैक्षणिक आणि विशिष्ट विषयातील शब्द, वाक्प्रचार शिकणे आणि अचूकपणे वापरणे. यामध्ये स्थलीय आणि कालिक नाती दाखवणाऱ्या शब्दांचासुद्धा समावेश होतो (उदा. त्या रात्री जेवणानंतर आम्ही त्यांना शोधायला गेलो.)"
        },
        "3.OA.3": {
          "description": "समान गट, ओळी आणि मापनाची प्रमाणे असलेली 100 पर्यंतच्या गुणाकार आणि भागाकाराची शाब्दिक उदाहरणे सोडवणे. उदा. समस्या दर्शवण्यासाठी माहीत नसलेल्या संख्येसाठी चिन्हांसह चित्रे आणि समीकरणे वापरणे.1"
        },
        "3.RL.4": {
          "description": "शब्द आणि वाक्प्रचारांचा अर्थ मजकूरात वापरल्याप्रमाणे निश्चित करा, शाब्दिक भाषेपासून अ-शाब्दिक भाषेमध्ये फरक करा."
        },
        "3.SL.1": {
          "description": "इयत्ता 2 री च्या विषयांबद्दल आणि मजकुराबद्दल विविध प्रकारच्या समन्वयी चर्चांमध्ये सहभागी होणे (दोन-व्यक्तींच्या, गटांमध्ये आणि शिक्षक नेतृत्व करत असलेल्या) आणि एकमेकांच्या कल्पनांचा विचार करणे आणि स्वत:च्या कल्पना स्पष्टपणे मांडणे."
        },
        "3.W.3": {
          "description": "प्रभावी तंत्र, वर्णनात्मक तपशील आणि घटनांचा स्पष्ट क्रम वापरून  प्रत्यक्ष किंवा काल्पनिक अनुभव किंवा घटना विकसित करण्यासाठी नॅरेटीव्हज लिहा. "
        },
        "3A-DA-10": {
          "description": "डेटा घटक कसे व्यवस्थापित केले जातात आणि डेटा कोठे संग्रहित केला जातो यामधील ट्रेडऑफचे मूल्यांकन करा."
        },
        "3A-NI-06": {
          "description": "कार्यक्षमता, व्यवहार्यता आणि नैतिक परिणाम यासारख्या घटकांवर आधारित विविध परिस्थितींना संबोधित करण्यासाठी सुरक्षा उपायांची शिफारस करा."
        },
        "3A-NI-07": {
          "description": "संगणक प्रणालीची उपयोगिता आणि सुरक्षितता यामधील ट्रेडऑफ लक्षात घेऊन विविध सुरक्षा उपायांची तुलना करा."
        },
        "3B-NI-04": {
          "description": "सॉफ्टवेअर डेव्हलपर डिव्हाइसेस आणि माहितीचे अनधिकृत प्रवेशापासून संरक्षण करण्याच्या पद्धतींची तुलना करा."
        },
        "4.L.6": {
          "description": "इयत्तांनुसार योग्य असलेले सामान्य शैक्षणिक आणि डोमेनमधील विशिष्ट शब्द आणि वाक्प्रचार समजून घ्या आणि अचूकतेने वापरा, यामध्ये विशिष्ट कृती, भावना किंवा स्थिती दर्शवणाऱ्या शब्दांचा  (उदा. प्रश्न विचारले, कुरकुर केली, चाचरला) आणि  विशिष्ट विषयांशी संबंधित शब्दांचा समावेश आहे (उदा."
        },
        "4.MD.6": {
          "description": "कोनमापक वापरून पूर्णांक अंशात कोन मोजा. दिलेल्या मापाचे कोन काढा."
        },
        "4.NBT.4": {
          "description": "मानक अल्गोरीदम वापरून बहु-आकडी संख्यांची सहजपणे बेरीज आणि वजाबाकी करणे."
        },
        "4.NBT.5": {
          "description": "स्थानांची मूल्ये आणि क्रियांचे गुणधर्म वापरून एका चार अंकांपर्यंत असलेल्या पूर्णांक संख्येला एक अंकी पूर्णांक संख्येने गुणा आणि दोन अंकी दोन संख्यांचा गुणाकार करा. समीकरणे, आयत इ. वापरून चित्र काढून दाखवा आणि आकडेमोड समजावून सांगा."
        },
        "4.RL.7": {
          "description": "प्रत्येक आवृत्ती मजकुरातील विशिष्ट तपशील आणि दिशानिर्देश दर्शवते हे ओळखून, कथा किंवा नाटकाचा मजकूर आणि मजकूराचे दृश्य किंवा तोंडी सादरीकरण यांच्यात संबंध निर्माण करा."
        },
        "4.W.3": {
          "description": "प्रभावी तंत्र, वर्णनात्मक तपशील आणि घटनांचा स्पष्ट क्रम वापरून  प्रत्यक्ष किंवा काल्पनिक अनुभव किंवा घटना विकसित करण्यासाठी नॅरेटीव्हज लिहा. "
        },
        "4.b": {
          "description": "एक सोल्युशन किंवा प्रोजेक्ट पूर्ण करण्यासाठी कृतींचे नियोजन आणि व्यवस्थापन करा."
        },
        "4.d": {
          "description": "पर्यायी सोल्युशन्सचा अभ्यास करण्यासाठी अनेक प्रक्रिया आणि वैविध्यपूर्ण दृष्टीकोन वापरा."
        },
        "5.L.6": {
          "description": "इयत्तेप्रमाणे योग्य असलेले संवादात्मक, सामान्य शैक्षणिक आणि विशिष्ट विषयातील शब्द, वाक्प्रचार शिकणे आणि अचूकपणे वापरणे. यामध्ये विरोधाभास, बेरीज आणि इतर तार्किक नात्यांचासुद्धा समावेश होतो (उदा. तथापि, तरीसुद्धा, तरीही, त्याचप्रमाणे, शिवाय, यासह)"
        },
        "5.RL.4": {
          "description": "रूपक आणि उपमा यांसारख्या अलंकारिक भाषेसह मजकुरात शब्द आणि वाक्ये वापरल्याप्रमाणे त्यांचा अर्थ ठरवा."
        },
        "5.RL.7": {
          "description": "व्हिज्युअल आणि मल्टीमीडिया घटक मजकूराच्या अर्थ, टोन किंवा सौंदर्यामध्ये कसे योगदान देतात (उदा. ग्राफिक कादंबरी, कल्पित कथा, लोककथा, मिथक, कविता) यांचे मल्टीमीडिया सादरीकरण."
        },
        "5.W.3": {
          "description": "प्रभावी तंत्र, वर्णनात्मक तपशील आणि घटनांचा स्पष्ट क्रम वापरून  प्रत्यक्ष किंवा काल्पनिक अनुभव किंवा घटना विकसित करण्यासाठी नॅरेटीव्हज लिहा. "
        },
        "6.SL.1": {
          "description": "इयत्ता 6 वी च्या विषयांबद्दल, मजकुराबद्दल आणि समस्यांबद्दल वेगवेगळ्या भागीदारांशी समन्वयी संवादात (दोन-व्यक्तींच्या, गटांमध्ये आणि शिक्षक नेतृत्व करत असलेल्या) सहभागी  \nव्हा आणि एकमेकांच्या कल्पनांचा विचार करा आणि स्वत:च्या कल्पना स्पष्टपणे मांडा."
        },
        "6.W.3": {
          "description": "प्रभावी तंत्र, संबंधित वर्णनात्मक तपशील आणि सुव्यवस्थित घटनांचा स्पष्ट क्रम वापरून प्रत्यक्ष किंवा काल्पनिक अनुभव किंवा घटना विकसित करण्यासाठी नॅरेटीव्हज लिहा."
        },
        "6.W.6": {
          "description": "लेखन तयार आणि प्रकाशित करण्यासाठी तसेच इतरांशी संवाद आणि समन्वय साधण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा; एकाच बैठकीत किमान तीन पाने टाईप करण्यासाठी कीबोर्ड वापरण्याच्या कौशल्यावरील पुरेशा पकडीचे प्रात्यक्षिक दाखवा."
        },
        "6.a": {
          "description": "तंत्रज्ञान प्रणाली समजून घ्या आणि वापरा."
        },
        "6.c": {
          "description": "प्रणाली आणि अॅप्लिकेशन्स ट्रबलशूट करणे. "
        },
        "6.d": {
          "description": "सध्याचे ज्ञान नवीन तंत्रज्ञाने शिकण्यासाठी वापरणे."
        },
        "7.G.2": {
          "description": "दिलेल्या अटीनुसार भौमितिक आकार काढा (नुसत्या हाताने, पट्टी आणि कोनमापक वापरून आणि तंत्रज्ञान वापरून). कोन किंवा बाजूंची तीन मापे वापरून त्रिकोणाची रचना करण्यावर लक्ष केंद्रित करा, कधी या अटींमुळे एकाच प्रकारचा त्रिकोण तयार होतो, कधी एकापेक्षा जास्त तयार होतात, याचे निरीक्षण करा."
        },
        "7.SL.1": {
          "description": "इयत्ता 7  वीच्या विषयांबद्दल, मजकुराबद्दल आणि समस्यांबद्दल वेगवेगळ्या भागीदारांशी समन्वयी संवादात (दोन-व्यक्तींच्या, गटांमध्ये आणि शिक्षक नेतृत्व करत असलेल्या) सहभागी  व्हा आणि एकमेकांच्या कल्पनांचा विचार करा आणि स्वत:च्या कल्पना स्पष्टपणे मांडा."
        },
        "7.W.3": {
          "description": "प्रभावी तंत्र, संबंधित वर्णनात्मक तपशील आणि सुव्यवस्थित घटनांचा स्पष्ट क्रम वापरून प्रत्यक्ष किंवा काल्पनिक अनुभव किंवा घटना विकसित करण्यासाठी नॅरेटीव्हज लिहा."
        },
        "7.W.6": {
          "description": "लेखन तयार आणि प्रकाशित करण्यासाठी, संदर्भ देण्यासाठी तसेच इतरांशी समन्वय साधण्यासाठी आणि संदर्भ जोडण्यासाठी आणि देण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा."
        },
        "8.W.3": {
          "description": "प्रभावी तंत्र, संबंधित वर्णनात्मक तपशील आणि सुव्यवस्थित घटनांचा स्पष्ट क्रम वापरून प्रत्यक्ष किंवा काल्पनिक अनुभव किंवा घटना विकसित करण्यासाठी नॅरेटीव्हज लिहा."
        },
        "8.W.6": {
          "description": "लेखन तयार आणि प्रकाशित करण्यासाठी तसेच माहिती आणि कल्पना यातील नाती प्रभावीपणे सादर करण्यासाठी आणि इतरांशी संवाद, समन्वय साधण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा."
        },
        "9-10.L.6": {
          "description": "कॉलेजमध्ये वाचणे, लिहिणे, बोलणे आणि करीअरसाठी तयार असण्याच्या पातळीपर्यंत पुरेसे ठरतील असे सामान्य शैक्षणिक आणि डोमेनमधील विशिष्ट शब्द आणि वाक्प्रचार समजून घ्या आणि अचूकतेने वापरा; शब्दसंग्रहाचे ज्ञान स्वतंत्रपणे गोळा करण्याची क्षमता दाखवा. "
        },
        "9-10.W.6": {
          "description": "वैयक्तिक किंवा शेअर्ड लेखन उत्पादने तयार, प्रकाशित आणि अपडेट करण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा, इतर माहिती जोडण्याच्या आणि माहिती लवचिकतेने आणि गतीशीलतेने दर्शवण्याच्या तंत्रज्ञानाच्या क्षमतेचा फायदा करून घ्या. "
        },
        "9-10.WHST.6": {
          "description": "वैयक्तिक किंवा शेअर्ड लेखन उत्पादने तयार, प्रकाशित आणि अपडेट करण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा, इतर माहिती जोडण्याच्या आणि माहिती लवचिकतेने आणि गतीशीलतेने दर्शवण्याच्या तंत्रज्ञानाच्या क्षमतेचा फायदा करून घ्या. "
        },
        "CD.L1:3-01": {
          "description": "कॉम्प्युटर्स आणि संबंधित तंत्रज्ञाने यशस्वीपणे चालवण्यासाठी मानक इनपुट आणि आऊटपुट  डिव्हायसेस वापरा.   "
        },
        "CI.L1:3-01": {
          "description": " तंत्रज्ञान प्रणाली आणि सॉफ्टवेअर वापरताना जबाबदार डिजिटल नागरिकत्वाचे (कायदेशीर आणि नैतिक वर्तणूक) पालन करणे. "
        },
        "CL.L1:6-02": {
          "description": "सोल्युशन्स किंवा उत्पादने विकसित करण्याच्या हेतूने समस्या-सोडवण्याच्या समन्वयी कृतींमध्ये सहभागी होण्यासाठी ऑनलाईन संसाधने वापरा (उदा. इमेल, ऑनलाईन चर्चा, समन्वयी वेब एन्व्हायर्नमेंट्स)"
        },
        "CPP.L1:3-01": {
          "description": "वयानुरूप संशोधन करण्यासाठी तंत्रज्ञान संसाधने वापरा."
        },
        "CPP.L1:3-02": {
          "description": "अभ्यासक्रमातील विविध गोष्टींच्या शिक्षणाला मदत म्हणून विकासाच्या दृष्टीने योग्य असलेली मल्टीमिडीया संसाधने (उदा. इंटर अॅक्टीव्ह पुस्तके आणि शैक्षणिक सॉफ्टवेअर) वापरा.    "
        },
        "CPP.L1:3-04": {
          "description": "साधे काम पूर्ण करण्यासाठी ज्या कृती कराव्या लागतील त्या विधानांचा एक संच तयार करा (उदा. टर्टलसाठी सूचना).   "
        },
        "CPP.L1:6-01": {
          "description": "समस्या सोडवण्यासाठी आणि स्व-मार्गदर्शित शिक्षणासाठी तंत्रज्ञान संसाधने वापरणे (उदा. कॅलक्युलेटर्स, डेटा कलेक्शन प्रोब्ज, मोबाईल डिव्हायसेस, व्हिडीओज, शैक्षणिक सॉफ्टवेअर आणि वेब टूल्स).       "
        },
        "CPP.L1:6-06": {
          "description": "ब्लॉकवर आधारित व्हिज्युअल प्रोग्रॅमिंग भाषा वापरून समस्यांच्या उपायांची अंमलबजावणी करा. "
        },
        "CPP.L2:3": {
          "description": "अभ्यासक्रमातील संकल्पनांचे प्रात्यक्षिक दाखवणाऱ्या आणि त्यांची माहिती सांगणाऱ्या तंत्रज्ञान संसाधनांचा वापर करून उत्पादने डिझाईन, विकसित, प्रकाशित आणि सादर करा (उदा. वेब पेजेस, मोबाईल अॅप्लिकेशन्स, अॅनिमेशन्स). "
        },
        "CT.L2:1": {
          "description": "सोल्युशन्स तयार करण्यासाठी बीजगणितीय समस्या सोडवण्याच्या मूलभूत पायऱ्या वापरा. (उदा. समस्येचे विधान आणि एक्सप्लोरेशन, नमुना घटना तपासणे, उपायाची अंमलबजावणी करणे, चाचणी आणि मूल्यांकन)."
        },
        "CT.L2:12": {
          "description": "समस्येचे उप समस्यांमध्ये विभाजन करण्यासाठी अबस्ट्रॅक्शन वापरा."
        },
        "CT.L2:6": {
          "description": "अनुसरल्या जात असलेल्या आज्ञांच्या क्रमाचे वर्णन करा आणि विश्लेषण करा (उदा. नियम आणि अल्गोरिदम्सनुसार होणाऱ्या व्हिडीओ गेममधील पात्रांच्या वर्तनाचे वर्णन करा)."
        },
        "CT.L2:7": {
          "description": "टेक्स्ट,साउंड्स, चित्रे आणि संख्या अशा विविध प्रकारांनी डेटा दर्शवा. "
        },
        "CT.L2:8": {
          "description": "समस्या विधाने,स्ट्रक्चर्स (उदा. आलेख,चार्ट्स, नेटवर्क, आकृत्या, फ्लोचार्ट्स) यांची व्हिज्युअल रीप्रेझेंटेशन्स वापरा.     "
        },
        "DAT-1.D.1": {
          "description": "डेटा कॉम्प्रेशन प्रेषित किंवा संग्रहित डेटाचा आकार (बिट्सची संख्या) कमी करू शकतो."
        },
        "DAT-1.D.2": {
          "description": "कमी बिट्सचा अर्थ कमी माहिती असा होत नाही."
        },
        "DAT-1.D.3": {
          "description": "कम्प्रेशनमधून आकार कमी करण्याचे प्रमाण मूळ डेटा प्रस्तुतीकरणातील रिडंडन्सीचे प्रमाण आणि लागू केलेले कम्प्रेशन अल्गोरिदम या दोन्हींवर अवलंबून असते."
        },
        "DAT-1.D.4": {
          "description": "लॉसलेस डेटा कम्प्रेशन अल्गोरिदम सामान्यत: मूळ डेटाच्या पूर्ण पुनर्रचनाची हमी देताना संचयित किंवा प्रसारित केलेल्या बिटची संख्या कमी करू शकतात."
        },
        "IOC-2.B.5": {
          "description": "एनक्रिप्शन ही अनधिकृत प्रवेश टाळण्यासाठी डेटा एन्कोड करण्याची प्रक्रिया आहे. डिक्रिप्शन म्हणजे डेटा डिकोड करण्याची प्रक्रिया. दोन सामान्य एन्क्रिप्शन पद्धती आहेत: ● सिमेट्रिक की एनक्रिप्शनमध्ये एन्क्रिप्शन आणि डिक्रिप्शन दोन्हीसाठी एक की समाविष्ट असते. ● पब्लिक की एनक्रिप्शन एनक्रिप्शनसाठी सार्वजनिक की आणि डिक्रिप्शनसाठी खाजगी की जोडते. संदेश एन्क्रिप्ट करण्यासाठी प्रेषकाला प्राप्तकर्त्याच्या खाजगी कीची आवश्यकता नसते, परंतु संदेश डिक्रिप्ट करण्यासाठी प्राप्तकर्त्याची खाजगी की आवश्यक असते. एक्सक्ल्यूजन  स्टेटमेंट(EKIOC-2.B.5): एनक्रिप्शन आणि डिक्रिप्शनसाठी विशिष्ट गणितीय प्रक्रिया या अभ्यासक्रमाच्या आणि AP परीक्षेच्या व्याप्तीच्या पलीकडे आहेत."
        },
        "MP.1": {
          "description": "समस्यांचा अर्थ लावा आणि त्या सोडवताना चिकाटी दाखवा"
        },
        "MP.2": {
          "description": "अमूर्तपणे आणि संख्यात्मक रूपात विचार करण्याचा प्रयत्न करणे"
        },
        "MP.4": {
          "description": "गणितासह मॉडेल करून दाखवा"
        },
        "MP.5": {
          "description": "योग्य साधने विचारपूर्वक वापरा"
        },
        "MP.6": {
          "description": "अचूकतेकडे लक्ष द्या"
        },
        "MP.7": {
          "description": "स्ट्रक्चर शोधा आणि त्याचा वापर करा"
        },
        "MP.8": {
          "description": "पुनरावर्ती विचारात नियमितता शोधा आणि व्यक्त करा"
        },
        "ccela/1.L.6": {
          "description": "संवाद, वाचन आणि वाचून दाखवलेल्या गोष्टींमधून कळलेले शब्द आणि वाक्प्रचार वापरणे आणि साधे नाते दर्शवणाऱ्या वारंवार येणाऱ्या उभयान्वयी अव्ययांसह मजकुरांना प्रतिसाद देणे (उदा. कारण)."
        },
        "ccela/1.SL.1": {
          "description": "इयत्ता 1 च्या विषयांबद्दल आणि मजकुराबद्दल वेगवेगळ्या भागीदारांशी समन्वयी संवादात सहभागी व्हा आणि सहकारी लोक आणि प्रौढांशी लहान तसेच जास्त मोठ्या गटांमध्ये संवाद साधा."
        },
        "ccela/11-12.L.6": {
          "description": "कॉलेजमध्ये वाचणे, लिहिणे, बोलणे आणि करीअरसाठी तयार असण्याच्या पातळीपर्यंत पुरेसे ठरतील असे सामान्य शैक्षणिक आणि डोमेनमधील विशिष्ट शब्द आणि वाक्प्रचार समजून घ्या आणि अचूकतेने वापरा; शब्दसंग्रहाचे ज्ञान स्वतंत्रपणे गोळा करण्याची क्षमता दाखवा. "
        },
        "ccela/11-12.RI.4": {
          "description": "मजकुरात वापरलेल्या शब्दांचा आणि वाक्प्रचारांचा अलंकारिक, गर्भित आणि तांत्रिक अर्थ ठरवा; एखादा लेख मजकुरात एखादी महत्त्वाची संज्ञा किंवा महत्त्वाच्या संज्ञा कशा वापरतो आणि त्यांचा अर्थ कसा अधिक अचूक करतो, त्याचे विश्लेषण करा (उदा. मॅडिसन याची व्याख्या कशी करतो"
        },
        "ccela/11-12.W.6": {
          "description": "नवीन वाद किंवा माहितीसह सतत मिळणाऱ्या अभिप्रायाला प्रतिसाद म्हणून वैयक्तिक किंवा शेअर्ड लेखन उत्पादने तयार, प्रकाशित आणि अपडेट करण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा."
        },
        "ccela/2.L.6": {
          "description": "संवाद, वाचन आणि वाचून दाखवलेल्या गोष्टींमधून कळलेले शब्द आणि वाक्प्रचार वापरणे आणि वर्णन करण्यासाठी वापरलेली विशेषणे आणि क्रियाविशेषणे यासह मजकुरांना प्रतिसाद देणे. (उदा. इतर मुले आनंदी असली की मला आनंद होतो."
        },
        "ccela/2.SL.1": {
          "description": "इयत्ता 2 री च्या विषयांबद्दल आणि मजकुराबद्दल वेगवेगळ्या भागीदारांशी समन्वयी संवादात सहभागी व्हा आणि सहकारी लोक आणि प्रौढांशी लहान तसेच जास्त मोठ्या गटांमध्ये संवाद साधा."
        },
        "ccela/3.L.6": {
          "description": "इयत्तेप्रमाणे योग्य असलेले संवादात्मक, सामान्य शैक्षणिक आणि विशिष्ट विषयातील शब्द, वाक्प्रचार शिकणे आणि अचूकपणे वापरणे. यामध्ये स्थलीय आणि कालिक नाती दाखवणाऱ्या शब्दांचासुद्धा समावेश होतो (उदा. त्या रात्री जेवणानंतर आम्ही त्यांना शोधायला गेलो.)"
        },
        "ccela/3.RL.4": {
          "description": "शब्द आणि वाक्प्रचारांचा अर्थ मजकूरात वापरल्याप्रमाणे निश्चित करा, शाब्दिक भाषेपासून अ-शाब्दिक भाषेमध्ये फरक करा."
        },
        "ccela/3.SL.1": {
          "description": "इयत्ता 2 री च्या विषयांबद्दल आणि मजकुराबद्दल विविध प्रकारच्या समन्वयी चर्चांमध्ये सहभागी होणे (दोन-व्यक्तींच्या, गटांमध्ये आणि शिक्षक नेतृत्व करत असलेल्या) आणि एकमेकांच्या कल्पनांचा विचार करणे आणि स्वत:च्या कल्पना स्पष्टपणे मांडणे."
        },
        "ccela/4.L.6": {
          "description": "इयत्तांनुसार योग्य असलेले सामान्य शैक्षणिक आणि डोमेनमधील विशिष्ट शब्द आणि वाक्प्रचार समजून घ्या आणि अचूकतेने वापरा, यामध्ये विशिष्ट कृती, भावना किंवा स्थिती दर्शवणाऱ्या शब्दांचा  (उदा. प्रश्न विचारले, कुरकुर केली, चाचरला) आणि  विशिष्ट विषयांशी संबंधित शब्दांचा समावेश आहे (उदा."
        },
        "ccela/4.RL.7": {
          "description": "प्रत्येक आवृत्ती मजकुरातील विशिष्ट तपशील आणि दिशानिर्देश दर्शवते हे ओळखून, कथा किंवा नाटकाचा मजकूर आणि मजकूराचे दृश्य किंवा तोंडी सादरीकरण यांच्यात संबंध निर्माण करा."
        },
        "ccela/4.W.3": {
          "description": "प्रभावी तंत्र, वर्णनात्मक तपशील आणि घटनांचा स्पष्ट क्रम वापरून  प्रत्यक्ष किंवा काल्पनिक अनुभव किंवा घटना विकसित करण्यासाठी नॅरेटीव्हज लिहा. "
        },
        "ccela/5.L.6": {
          "description": "इयत्तेप्रमाणे योग्य असलेले संवादात्मक, सामान्य शैक्षणिक आणि विशिष्ट विषयातील शब्द, वाक्प्रचार शिकणे आणि अचूकपणे वापरणे. यामध्ये विरोधाभास, बेरीज आणि इतर तार्किक नात्यांचासुद्धा समावेश होतो (उदा. तथापि, तरीसुद्धा, तरीही, त्याचप्रमाणे, शिवाय, यासह)"
        },
        "ccela/5.RL.4": {
          "description": "रूपक आणि उपमा यांसारख्या अलंकारिक भाषेसह मजकुरात शब्द आणि वाक्ये वापरल्याप्रमाणे त्यांचा अर्थ ठरवा."
        },
        "ccela/5.RL.7": {
          "description": "व्हिज्युअल आणि मल्टीमीडिया घटक मजकूराच्या अर्थ, टोन किंवा सौंदर्यामध्ये कसे योगदान देतात (उदा. ग्राफिक कादंबरी, कल्पित कथा, लोककथा, मिथक, कविता) यांचे मल्टीमीडिया सादरीकरण."
        },
        "ccela/6.SL.1": {
          "description": "इयत्ता 6 वी च्या विषयांबद्दल, मजकुराबद्दल आणि समस्यांबद्दल वेगवेगळ्या भागीदारांशी समन्वयी संवादात (दोन-व्यक्तींच्या, गटांमध्ये आणि शिक्षक नेतृत्व करत असलेल्या) सहभागी\\\nव्हा आणि एकमेकांच्या कल्पनांचा विचार करा आणि स्वत:च्या कल्पना स्पष्टपणे मांडा."
        },
        "ccela/6.W.6": {
          "description": "लेखन तयार आणि प्रकाशित करण्यासाठी तसेच इतरांशी संवाद आणि समन्वय साधण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा; एकाच बैठकीत किमान तीन पाने टाईप करण्यासाठी कीबोर्ड वापरण्याच्या कौशल्यावरील पुरेशा पकडीचे प्रात्यक्षिक दाखवा."
        },
        "ccela/7.SL.1": {
          "description": "इयत्ता 7  वीच्या विषयांबद्दल, मजकुराबद्दल आणि समस्यांबद्दल वेगवेगळ्या भागीदारांशी समन्वयी संवादात (दोन-व्यक्तींच्या, गटांमध्ये आणि शिक्षक नेतृत्व करत असलेल्या) सहभागी  व्हा आणि एकमेकांच्या कल्पनांचा विचार करा आणि स्वत:च्या कल्पना स्पष्टपणे मांडा."
        },
        "ccela/7.W.3": {
          "description": "प्रभावी तंत्र, संबंधित वर्णनात्मक तपशील आणि सुव्यवस्थित घटनांचा स्पष्ट क्रम वापरून प्रत्यक्ष किंवा काल्पनिक अनुभव किंवा घटना विकसित करण्यासाठी नॅरेटीव्हज लिहा."
        },
        "ccela/7.W.6": {
          "description": "लेखन तयार आणि प्रकाशित करण्यासाठी, संदर्भ देण्यासाठी तसेच इतरांशी समन्वय साधण्यासाठी आणि संदर्भ जोडण्यासाठी आणि देण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा."
        },
        "ccela/8.W.6": {
          "description": "लेखन तयार आणि प्रकाशित करण्यासाठी तसेच माहिती आणि कल्पना यातील नाती प्रभावीपणे सादर करण्यासाठी आणि इतरांशी संवाद, समन्वय साधण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा."
        },
        "ccela/9-10.W.6": {
          "description": "वैयक्तिक किंवा शेअर्ड लेखन उत्पादने तयार, प्रकाशित आणि अपडेट करण्यासाठी इंटरनेटसह तंत्रज्ञानाचा वापर करा, इतर माहिती जोडण्याच्या आणि माहिती लवचिकतेने आणि गतीशीलतेने दर्शवण्याच्या तंत्रज्ञानाच्या क्षमतेचा फायदा करून घ्या. "
        },
        "ccmath/1.OA.1": {
          "description": "कशामध्ये तरी जोडणे, कशातून तरी काढून घेणे, एकत्र ठेवणे, वेगळे करणे आणि तुलना करणे अशा स्थिती असलेली शाब्दिक गणिते सोडवण्यासाठी 20 च्या आतील बेरीज आणि वजाबाकी वापरा. यातील सर्व स्थितींमध्ये अज्ञात गोष्टी वापरा उदा. वस्तू, चित्रे आणि चिन्हे असलेली समीकरणे वापरा"
        },
        "ccmath/2.OA.1": {
          "description": "कशामध्ये तरी जोडणे, कशातून तरी काढून घेणे, एकत्र ठेवणे, वेगळे करणे आणि तुलना करणे अशा स्थिती असलेली एक- आणि दोन- पायऱ्यांची शाब्दिक गणिते सोडवण्यासाठी 100 च्या आतील बेरीज आणि वजाबाकी वापरा. यातील सर्व स्थितींमध्ये अज्ञात गोष्टी वापरा उदा. वस्तू, चित्रे आणि चिन्हे असलेली समीकरणे वापरा"
        },
        "ccmath/3.OA.3": {
          "description": "समान गट, ओळी आणि मापनाची प्रमाणे असलेली 100 पर्यंतच्या गुणाकार आणि भागाकाराची शाब्दिक उदाहरणे सोडवणे. उदा. समस्या दर्शवण्यासाठी माहीत नसलेल्या संख्येसाठी चिन्हांसह चित्रे आणि समीकरणे वापरणे.1"
        },
        "ccmath/4.MD.6": {
          "description": "कोनमापक वापरून पूर्णांक अंशात कोन मोजा. दिलेल्या मापाचे कोन काढा."
        },
        "ccmath/4.NBT.4": {
          "description": "मानक अल्गोरीदम वापरून बहु-आकडी संख्यांची सहजपणे बेरीज आणि वजाबाकी करणे."
        },
        "ccmath/4.NBT.5": {
          "description": "स्थानांची मूल्ये आणि क्रियांचे गुणधर्म वापरून एका चार अंकांपर्यंत असलेल्या पूर्णांक संख्येला एक अंकी पूर्णांक संख्येने गुणा आणि दोन अंकी दोन संख्यांचा गुणाकार करा. समीकरणे, आयत इ. वापरून चित्र काढून दाखवा आणि आकडेमोड समजावून सांगा."
        },
        "ccmath/7.G.2": {
          "description": "दिलेल्या अटीनुसार भौमितिक आकार काढा (नुसत्या हाताने, पट्टी आणि कोनमापक वापरून आणि तंत्रज्ञान वापरून). कोन किंवा बाजूंची तीन मापे वापरून त्रिकोणाची रचना करण्यावर लक्ष केंद्रित करा, कधी या अटींमुळे एकाच प्रकारचा त्रिकोण तयार होतो, कधी एकापेक्षा जास्त तयार होतात, याचे निरीक्षण करा."
        },
        "ccmath/MP.1": {
          "description": "समस्यांचा अर्थ लावा आणि त्या सोडवताना चिकाटी दाखवा"
        },
        "ccmath/MP.2": {
          "description": "अमूर्तपणे आणि संख्यात्मक रूपात विचार करण्याचा प्रयत्न करणे"
        },
        "ccmath/MP.4": {
          "description": "गणितासह मॉडेल करून दाखवा"
        },
        "ccmath/MP.5": {
          "description": "योग्य साधने विचारपूर्वक वापरा"
        },
        "ccmath/MP.6": {
          "description": "अचूकतेकडे लक्ष द्या"
        },
        "ccmath/MP.7": {
          "description": "स्ट्रक्चर शोधा आणि त्याचा वापर करा"
        },
        "ccmath/MP.8": {
          "description": "पुनरावर्ती विचारात नियमितता शोधा आणि व्यक्त करा"
        },
        "csp2021/DAT-1.D.1": {
          "description": "डेटा कॉम्प्रेशन प्रेषित किंवा संग्रहित डेटाचा आकार (बिट्सची संख्या) कमी करू शकतो."
        },
        "csp2021/DAT-1.D.2": {
          "description": "कमी बिट्सचा अर्थ कमी माहिती असा होत नाही."
        },
        "csp2021/DAT-1.D.3": {
          "description": "कम्प्रेशनमधून आकार कमी करण्याचे प्रमाण मूळ डेटा प्रस्तुतीकरणातील रिडंडन्सीचे प्रमाण आणि लागू केलेले कम्प्रेशन अल्गोरिदम या दोन्हींवर अवलंबून असते."
        },
        "csp2021/DAT-1.D.4": {
          "description": "लॉसलेस डेटा कम्प्रेशन अल्गोरिदम सामान्यत: मूळ डेटाच्या पूर्ण पुनर्रचनाची हमी देताना संचयित किंवा प्रसारित केलेल्या बिटची संख्या कमी करू शकतात."
        },
        "csp2021/IOC-2.B.5": {
          "description": "एनक्रिप्शन ही अनधिकृत प्रवेश टाळण्यासाठी डेटा एन्कोड करण्याची प्रक्रिया आहे. डिक्रिप्शन म्हणजे डेटा डिकोड करण्याची प्रक्रिया. दोन सामान्य एन्क्रिप्शन पद्धती आहेत: ● सिमेट्रिक की एनक्रिप्शनमध्ये एन्क्रिप्शन आणि डिक्रिप्शन दोन्हीसाठी एक की समाविष्ट असते. ● पब्लिक की एनक्रिप्शन एनक्रिप्शनसाठी सार्वजनिक की आणि डिक्रिप्शनसाठी खाजगी की जोडते. संदेश एन्क्रिप्ट करण्यासाठी प्रेषकाला प्राप्तकर्त्याच्या खाजगी कीची आवश्यकता नसते, परंतु संदेश डिक्रिप्ट करण्यासाठी प्राप्तकर्त्याची खाजगी की आवश्यक असते. एक्सक्ल्यूजन  स्टेटमेंट(EKIOC-2.B.5): एनक्रिप्शन आणि डिक्रिप्शनसाठी विशिष्ट गणितीय प्रक्रिया या अभ्यासक्रमाच्या आणि AP परीक्षेच्या व्याप्तीच्या पलीकडे आहेत."
        },
        "csta/1B-DA-07": {
          "description": "कारण-आणि-परिणाम संबंध उलगडण्यासाठी किंवा प्रस्तावित करण्यासाठी, परिणामांचा अंदाज लावण्यासाठी किंवा कल्पना संप्रेषण करण्यासाठी डेटा वापरा."
        },
        "csta/1B-IC-18": {
          "description": "संगणकीय तंत्रज्ञानावर चर्चा करा ज्यांनी जग बदलले आहे आणि त्या तंत्रज्ञानाचा सांस्कृतिक पद्धतींवर कसा प्रभाव पडतो आणि कसा प्रभावित होतो हे व्यक्त करा."
        },
        "csta/3A-DA-10": {
          "description": "डेटा घटक कसे व्यवस्थापित केले जातात आणि डेटा कोठे संग्रहित केला जातो यामधील ट्रेडऑफचे मूल्यांकन करा."
        },
        "csta/3A-NI-06": {
          "description": "कार्यक्षमता, व्यवहार्यता आणि नैतिक परिणाम यासारख्या घटकांवर आधारित विविध परिस्थितींना संबोधित करण्यासाठी सुरक्षा उपायांची शिफारस करा."
        },
        "csta/3A-NI-07": {
          "description": "संगणक प्रणालीची उपयोगिता आणि सुरक्षितता यामधील ट्रेडऑफ लक्षात घेऊन विविध सुरक्षा उपायांची तुलना करा."
        },
        "csta/3B-NI-04": {
          "description": "सॉफ्टवेअर डेव्हलपर डिव्हाइसेस आणि माहितीचे अनधिकृत प्रवेशापासून संरक्षण करण्याच्या पद्धतींची तुलना करा."
        },
        "csta2011/CD.L1:3-01": {
          "description": "कॉम्प्युटर्स आणि संबंधित तंत्रज्ञाने यशस्वीपणे चालवण्यासाठी मानक इनपुट आणि आऊटपुट  डिव्हायसेस वापरा.   "
        },
        "csta2011/CI.L1:3-01": {
          "description": " तंत्रज्ञान प्रणाली आणि सॉफ्टवेअर वापरताना जबाबदार डिजिटल नागरिकत्वाचे (कायदेशीर आणि नैतिक वर्तणूक) पालन करणे. "
        },
        "csta2011/CL.L1:6-02": {
          "description": "सोल्युशन्स किंवा उत्पादने विकसित करण्याच्या हेतूने समस्या-सोडवण्याच्या समन्वयी कृतींमध्ये सहभागी होण्यासाठी ऑनलाईन संसाधने वापरा (उदा. इमेल, ऑनलाईन चर्चा, समन्वयी वेब एन्व्हायर्नमेंट्स)"
        },
        "csta2011/CPP.L1:3-01": {
          "description": "वयानुरूप संशोधन करण्यासाठी तंत्रज्ञान संसाधने वापरा."
        },
        "csta2011/CPP.L1:3-02": {
          "description": "अभ्यासक्रमातील विविध गोष्टींच्या शिक्षणाला मदत म्हणून विकासाच्या दृष्टीने योग्य असलेली मल्टीमिडीया संसाधने (उदा. इंटर अॅक्टीव्ह पुस्तके आणि शैक्षणिक सॉफ्टवेअर) वापरा.    "
        },
        "csta2011/CPP.L1:3-04": {
          "description": "साधे काम पूर्ण करण्यासाठी ज्या कृती कराव्या लागतील त्या विधानांचा एक संच तयार करा (उदा. टर्टलसाठी सूचना).   "
        },
        "csta2011/CPP.L1:6-01": {
          "description": "समस्या सोडवण्यासाठी आणि स्व-मार्गदर्शित शिक्षणासाठी तंत्रज्ञान संसाधने वापरणे (उदा. कॅलक्युलेटर्स, डेटा कलेक्शन प्रोब्ज, मोबाईल डिव्हायसेस, व्हिडीओज, शैक्षणिक सॉफ्टवेअर आणि वेब टूल्स).       "
        },
        "csta2011/CPP.L1:6-06": {
          "description": "ब्लॉकवर आधारित व्हिज्युअल प्रोग्रॅमिंग भाषा वापरून समस्यांच्या उपायांची अंमलबजावणी करा. "
        },
        "csta2011/CPP.L2:3": {
          "description": "अभ्यासक्रमातील संकल्पनांचे प्रात्यक्षिक दाखवणाऱ्या आणि त्यांची माहिती सांगणाऱ्या तंत्रज्ञान संसाधनांचा वापर करून उत्पादने डिझाईन, विकसित, प्रकाशित आणि सादर करा (उदा. वेब पेजेस, मोबाईल अॅप्लिकेशन्स, अॅनिमेशन्स). "
        },
        "csta2011/CT.L2:1": {
          "description": "सोल्युशन्स तयार करण्यासाठी बीजगणितीय समस्या सोडवण्याच्या मूलभूत पायऱ्या वापरा. (उदा. समस्येचे विधान आणि एक्सप्लोरेशन, नमुना घटना तपासणे, उपायाची अंमलबजावणी करणे, चाचणी आणि मूल्यांकन)."
        },
        "csta2011/CT.L2:12": {
          "description": "समस्येचे उप समस्यांमध्ये विभाजन करण्यासाठी अबस्ट्रॅक्शन वापरा."
        },
        "csta2011/CT.L2:6": {
          "description": "अनुसरल्या जात असलेल्या आज्ञांच्या क्रमाचे वर्णन करा आणि विश्लेषण करा (उदा. नियम आणि अल्गोरिदम्सनुसार होणाऱ्या व्हिडीओ गेममधील पात्रांच्या वर्तनाचे वर्णन करा)."
        },
        "csta2011/CT.L2:7": {
          "description": "टेक्स्ट,साउंड्स, चित्रे आणि संख्या अशा विविध प्रकारांनी डेटा दर्शवा. "
        },
        "csta2011/CT.L2:8": {
          "description": "समस्या विधाने,स्ट्रक्चर्स (उदा. आलेख,चार्ट्स, नेटवर्क, आकृत्या, फ्लोचार्ट्स) यांची व्हिज्युअल रीप्रेझेंटेशन्स वापरा.     "
        },
        "iste/1.a": {
          "description": "नवीन कल्पना, उत्पादने आणि प्रक्रिया तयार करण्यासाठी सध्या असलेले ज्ञान वापरा."
        },
        "iste/1.b": {
          "description": "वैयक्तिक किंवा गट अभिव्यक्तीचे साधन म्हणून मूळ काम तयार करा."
        },
        "iste/1.c": {
          "description": "गुंतागुंतीच्या प्रणाली आणि समस्यांचा अभ्यास करण्यासाठी मॉडेल्स आणि सिम्युलेशन्स वापरा.  "
        },
        "iste/2.a": {
          "description": "विविध प्रकारची डिजिटल एन्व्हायर्नमेंट्स आणि मिडीया वापरून सहकारी, तज्ज्ञ आणि इतरांशी संवाद साधा, समन्वय करा आणि प्रकाशित करा."
        },
        "iste/2.b": {
          "description": "विविध प्रकारचा मिडीया आणि फॉरमॅट्स वापरून अनेक प्रेक्षकांपर्यंत माहिती आणि कल्पना प्रभावीपणे पोचवा.    "
        },
        "iste/4.b": {
          "description": "एक सोल्युशन किंवा प्रोजेक्ट पूर्ण करण्यासाठी कृतींचे नियोजन आणि व्यवस्थापन करा."
        },
        "iste/4.d": {
          "description": "पर्यायी सोल्युशन्सचा अभ्यास करण्यासाठी अनेक प्रक्रिया आणि वैविध्यपूर्ण दृष्टीकोन वापरा."
        },
        "iste/6.a": {
          "description": "तंत्रज्ञान प्रणाली समजून घ्या आणि वापरा."
        },
        "iste/6.c": {
          "description": "प्रणाली आणि अॅप्लिकेशन्स ट्रबलशूट करणे. "
        },
        "iste/6.d": {
          "description": "सध्याचे ज्ञान नवीन तंत्रज्ञाने शिकण्यासाठी वापरणे."
        }
      }
    }
  }
}