{
  "fa-IR": {
    "data": {
      "standard_categories": {
        "1": {
          "description": "دانش آموزان تفکر خلاق را نشان می دهند، دانش را ایجاد می کنند و محصولات و فرآیندهای نوآورانه را با استفاده از فناوری توسعه می دهند."
        },
        "2": {
          "description": "دانش آموزان از رسانه ها و محیط های دیجیتال برای برقراری ارتباط و کار مشترک، از جمله از راه دور، برای حمایت از یادگیری فردی و کمک به یادگیری دیگران استفاده می کنند."
        },
        "3": {
          "description": "دانش آموزان از ابزارهای دیجیتالی برای جمع آوری، ارزیابی و استفاده از اطلاعات استفاده می کنند."
        },
        "3-A-i": {
          "description": "ماهیت یادگیری - انسان در مقابل ماشین"
        },
        "3-A-ii": {
          "description": "ماهیت یادگیری - پیدا کردن الگوها در داده ها"
        },
        "3-A-iii": {
          "description": "ماهیت یادگیری - آموزش یک مدل"
        },
        "3-A-iv": {
          "description": "ماهیت یادگیری - ساخت و ساز در مقابل استفاده از استدلال"
        },
        "3-A-v": {
          "description": "ماهیت یادگیری - تنظیم نمایندگی های داخلی"
        },
        "3-A-vi": {
          "description": "ماهیت یادگیری - یادگیری از تجربه"
        },
        "3-B-i": {
          "description": "شبکه های عصبی - ساختار یک شبکه عصبی"
        },
        "3-B-ii": {
          "description": "شبکه های عصبی - تنظیم وزن"
        },
        "3-C-i": {
          "description": "مجموعه داده ها - مجموعه ویژگی"
        },
        "3-C-ii": {
          "description": "مجموعه داده - مجموعه داده های بزرگ"
        },
        "3-C-iii": {
          "description": "مجموعه داده - bias"
        },
        "4": {
          "description": "دانش آموزان از مهارت های تفکر انتقادی برای برنامه ریزی و انجام تحقیقات، مدیریت پروژه ها، حل مشکلات و تصمیم گیری آگاهانه با استفاده از ابزار و منابع دیجیتال مناسب استفاده می کنند."
        },
        "5": {
          "description": "دانش آموزان مسائل انسانی، فرهنگی و اجتماعی مربوط به فناوری را درک می کنند و رفتار قانونی و اخلاقی را انجام می دهند."
        },
        "6": {
          "description": "دانش آموزان درک صحیح مفاهیم فناوری، سیستم ها و عملیات را نشان می دهند."
        },
        "AAP-1": {
          "description": "برای پیدا کردن راه حل های خاص برای مشکلات تعمیم پذیر، برنامه نویسان داده ها را به روش های مختلف نشان می دهند و سازماندهی می کنند."
        },
        "AAP-1.A": {
          "description": "یک مقدار را با یک متغیر نشان دهید."
        },
        "AAP-1.B": {
          "description": "مقدار یک متغیر را به عنوان یک نتیجه از یک تخصیص تعیین کنید."
        },
        "AAP-1.C": {
          "description": "یک لیست یا رشته را با استفاده از یک متغیر نشان دهید."
        },
        "AAP-1.D": {
          "description": "برای انتزاع داده ها: \na توسعه انتزاع داده ها با استفاده از لیست ها برای ذخیره چندین عنصر.\nب توضیح دهید که چگونه استفاده از انتزاع داده ها پیچیدگی را در کد برنامه مدیریت می کند."
        },
        "AAP-2": {
          "description": "نحوه توالی و ترکیب اظهارات در یک برنامه نتیجه محاسبه شده را تعیین می کند. برنامه ها ساختارهای تکرار و انتخاب را برای نشان دادن تکرار و تصمیم گیری برای رسیدگی به مقادیر ورودی متنوع ترکیب می کنند."
        },
        "AAP-2.A": {
          "description": "الگوریتمی را بیان کنید که از توالی یابی بدون استفاده از زبان برنامه‌نویسی استفاده می‌کند."
        },
        "AAP-2.B": {
          "description": "یک فرایند الگوریتمی گام به گام را با استفاده از اظهارات کد متوالی نشان دهید."
        },
        "AAP-2.C": {
          "description": "عبارات را ارزیابی کنید که از اپراتورهای ریاضی استفاده می کنند."
        },
        "AAP-2.D": {
          "description": "عبارات را ارزیابی کنید که رشته ها را دستکاری می کنند."
        },
        "AAP-2.E": {
          "description": "برای روابط بین دو متغیر، عبارات یا مقادیر: \na نشان دهنده با استفاده از عملگرهای رابطه ای\nب ارزیابی عباراتی که از عملگرهای رابطه ای استفاده می کنند."
        },
        "AAP-2.F": {
          "description": "برای روابط بین مقادیر بولی:\na نمایندگی با استفاده از عملگرهای منطقی.\nب عبارات را ارزیابی کنید که از عملگرهای منطقی استفاده می کنند."
        },
        "AAP-2.G": {
          "description": "یک الگوریتم را بیان کنید که بدون استفاده از زبان برنامه نویسی از انتخاب استفاده می کند."
        },
        "AAP-2.H": {
          "description": "برای انتخاب:\na نمایندگی با استفاده از اظهارات شرطی.\nب نتیجه اظهارات شرطی را تعیین کنید."
        },
        "AAP-2.I": {
          "description": "برای انتخاب تو در تو:\na نمایندگی با استفاده از اظهارات شرطی تو در تو. \nب نتیجه اظهارات شرطی توزیع شده را تعیین کنید."
        },
        "AAP-2.J": {
          "description": "الگوریتمی را بیان کنید که بدون استفاده از زبان برنامه نویسی از تکرار استفاده می کند."
        },
        "AAP-2.K": {
          "description": "برای تکرار:\na نمایندگی با استفاده از اظهارات تکرار.\nب نتیجه یا اثر جانبی اظهارات تکرار را تعیین کنید."
        },
        "AAP-2.L": {
          "description": "مقایسه الگوریتم های متعدد برای تعیین اگر آنها عملکرد همان اثر جانبی و یا نتیجه."
        },
        "AAP-2.M": {
          "description": "برای الگوریتم ها: \na الگوریتم ایجاد کنید \nب الگوریتم های موجود را ترکیب و اصلاح کنید."
        },
        "AAP-2.N": {
          "description": "برای عملیات لیست:\na عبارات را بنویسید که از فهرست بندی لیست و رویه های لیست استفاده می کنند.\nب عبارات را ارزیابی کنید که از فهرست بندی لیست و روش های لیست استفاده می کنند."
        },
        "AAP-2.O": {
          "description": "برای الگوریتم های مربوط به عناصر یک لیست:\na نمایندگی با استفاده از اظهارات تکراری برای گذشتن از یک لیست.\nب نتیجه یک الگوریتم را با پیمایش لیست تعیین کنید."
        },
        "AAP-2.P": {
          "description": "برای الگوریتم های جستجوی دودویی:\na تعداد تکرارهای مورد نیاز برای پیدا کردن یک مقدار در یک مجموعه داده را تعیین کنید. \nب الزامات لازم برای تکمیل جستجوی دودویی را توضیح دهید."
        },
        "AAP-3": {
          "description": "برنامه نویسان مشکلات را به قطعات کوچکتر و قابل کنترل تر تقسیم می کنند. با ایجاد رویه‌ها و اعمال نفوذ پارامترها، برنامه‌نویسان فرایندهایی را که قابل استفاده مجدد هستند تعمیم می‌دهند. رویه ها به برنامه نویسان این امکان را می دهد تا کدهای موجود را که قبلاً آزمایش شده اند ترسیم کنند و به برنامه نویسان اجازه می دهد برنامه ها را با سرعت بیشتری و با اطمینان بیشتری بنویسند."
        },
        "AAP-3.A": {
          "description": "برای تماس های رویه:\na اظهارات را برای روش های تماس بنویسید.\nب نتیجه یا اثر یک تماس رویه را تعیین کنید."
        },
        "AAP-3.B": {
          "description": "برای تماس های رویه:\na اظهارات را برای روش های تماس بنویسید.\nب نتیجه یا اثر یک تماس رویه را تعیین کنید."
        },
        "AAP-3.C": {
          "description": "توسعه انتزاع رویه برای مدیریت پیچیدگی در یک برنامه با نوشتن روش."
        },
        "AAP-3.D": {
          "description": "کتابخانه های مناسب یا بخش های کد موجود را برای استفاده در ایجاد برنامه های جدید انتخاب کنید."
        },
        "AAP-3.E": {
          "description": "برای تولید مقادیر تصادفی: \na نوشتن عبارات برای تولید مقادیر ممکن. \nب ارزیابی عبارات برای تعیین نتایج احتمالی."
        },
        "AAP-3.F": {
          "description": "برای شبیه سازی:\na توضیح دهید که چگونه می توان از رایانه ها برای نشان دادن پدیده ها یا نتایج دنیای واقعی استفاده کرد. \nب مقایسه استفاده از شبیه سازی ها با زمینه های دنیای واقعی."
        },
        "AAP-4": {
          "description": "مشکلاتی وجود دارد که کامپیوتر نمی تواند آن را حل کند، و حتی زمانی که کامپیوتر می تواند یک مشکل را حل کند، ممکن است قادر به انجام این کار در یک مقدار معقول از زمان."
        },
        "AAP-4.A": {
          "description": "برای تعیین کارایی یک الگوریتم:\nالف تفاوت بین الگوریتم هایی که در زمان معقول اجرا می شوند و آنهایی که در زمان معقول اجرا نمی شوند را توضیح دهید. \nب موقعیت هایی را شناسایی کنید که یک راه حل ابتکاری ممکن است مناسب تر باشد."
        },
        "AAP-4.B": {
          "description": "وجود مشکلات غیرقابل حل در علوم کامپیوتر را توضیح دهید."
        },
        "AP": {
          "description": "الگوریتم و برنامه نویسی "
        },
        "APR": {
          "description": "حساب با چند جمله ای و عبارات منطقی"
        },
        "BF": {
          "description": "توابع ساختمان"
        },
        "BI-1": {
          "description": "کامپیوترها جهان را با استفاده از سنسورها درک می کنند"
        },
        "BI-2": {
          "description": "نمایندگان نمایندگی های جهان را حفظ می کنند و از آنها برای استدلال استفاده می کنند"
        },
        "BI-3": {
          "description": "کامپیوترها می توانند از داده ها یاد بگیرند"
        },
        "BI-4": {
          "description": "عوامل هوشمند به انواع مختلفی از دانش نیاز دارند تا به طور طبیعی با انسان ارتباط برقرار کنند"
        },
        "BI-5": {
          "description": "هوش مصنوعی می تواند جامعه را به دو روش مثبت و منفی تحت تأثیر قرار دهد"
        },
        "C": {
          "description": "دایره‌ها"
        },
        "CC": {
          "description": "شمارش و کاردینالیتی"
        },
        "CD": {
          "description": "کامپیوتر و دستگاه های ارتباطی"
        },
        "CED": {
          "description": "ایجاد معادلات"
        },
        "CI": {
          "description": "جامعه، جهانی، و اثرات اخلاقی"
        },
        "CL": {
          "description": "همکاری"
        },
        "CN": {
          "description": "سامانه اعداد مختلط"
        },
        "CO": {
          "description": "تجانس"
        },
        "CON-1": {
          "description": "نحوه توالی یابی و ترکیب متغیرها و عملگرها در یک عبارت نتیجه محاسبه شده را تعیین می کند."
        },
        "CON-1.A": {
          "description": "عبارات حسابی را در یک کد برنامه ارزیابی کنید"
        },
        "CON-1.B": {
          "description": "ارزیابی آنچه در یک متغیر به عنوان یک نتیجه از یک عبارت با یک بیانیه تخصیص ذخیره می شود"
        },
        "CON-1.C": {
          "description": "عبارات ریاضی را ارزیابی کنید که از ریخته گری استفاده می کنند."
        },
        "CON-1.D": {
          "description": "ارزیابی عبارات که با استفاده از روش کلاس ریاضی."
        },
        "CON-1.E": {
          "description": "ارزیابی عبارات بولی که با استفاده از اپراتورهای رابطه ای در کد برنامه."
        },
        "CON-1.F": {
          "description": "ارزیابی عبارات بولی compoudn در کد برنامه."
        },
        "CON-1.G": {
          "description": "مقایسه و کنتراست عبارات بولی معادل."
        },
        "CON-1.H": {
          "description": "مقایسه منابع شی با استفاده از عبارات بولی در کد برنامه."
        },
        "CON-2": {
          "description": "برنامه نویسان تکرار و انتخاب را به کد به عنوان راهی برای ارائه دستورالعمل برای کامپیوتر برای پردازش هر یک از بسیاری از مقادیر ورودی ممکن ترکیب می کنند"
        },
        "CON-2.A": {
          "description": "فرآیندهای منطقی شاخه ای را با استفاده از عبارات شرطی نشان دهید."
        },
        "CON-2.B": {
          "description": "فرآیندهای منطقی شاخه ای را با استفاده از عبارات شرطی تو در تو نشان می دهند."
        },
        "CON-2.C": {
          "description": "فرآیندهای تکراری را با استفاده از whileloop نشان دهید."
        },
        "CON-2.D": {
          "description": "برای الگوریتم ها در زمینه یک مشخصات خاص که نیازی به استفاده از تراورس ها ندارد: • الگوریتم های استاندارد را شناسایی کنید • الگوریتم های استاندارد را اصلاح کنید."
        },
        "CON-2.E": {
          "description": "نشان دهنده فرآیندهای تکراری با استفاده از یک حلقه for."
        },
        "CON-2.F": {
          "description": "برای الگوریتم ها در زمینه یک مشخصات خاص که شامل اشیاء رشته • شناسایی الگوریتم های استاندارد • اصلاح الگوریتم های استاندارد."
        },
        "CON-2.G": {
          "description": "نمایش فرآیندهای تکراری تو در تو"
        },
        "CON-2.H": {
          "description": "محاسبه تعداد اجرای بیانیه و مقایسه غیر رسمی زمان اجرا از اظهارات تکراری."
        },
        "CON-2.I": {
          "description": "برای الگوریتم ها در زمینه یک مشخصات خاص که نیاز به استفاده از تراورس آرایه: • شناسایی الگوریتم های استاندارد • اصلاح الگوریتم های استاندارد • توسعه یک الگوریتم."
        },
        "CON-2.J": {
          "description": "برای الگوریتم های در زمینه یک مشخصات خاص که نیاز به استفاده از پیمایش ArrayList: • شناسایی الگوریتم های استاندارد • اصلاح الگوریتم های استاندارد • توسعه یک الگوریتم."
        },
        "CON-2.K": {
          "description": "برای جستجوی اطلاعات خاص در اشیاء آرایه یا ArrayList، الگوریتم های جستجوی دنباله ای/خطی را اعمال کنید."
        },
        "CON-2.L": {
          "description": "برای مرتب سازی عناصر آرایه یا اشیاء ArrayList، الگوریتم های مرتب سازی انتخاب و مرتب سازی درج را اعمال کنید."
        },
        "CON-2.M": {
          "description": "محاسبه تعداد اجرای بیانیه و مقایسه غیر رسمی زمان اجرا الگوریتم های مرتب سازی."
        },
        "CON-2.N": {
          "description": "برای الگوریتم ها در زمینه یک مشخصات خاص که نیاز به استفاده از پیمایش آرایه 2D: • شناسایی الگوریتم های استاندارد • اصلاح الگوریتم های استاندارد."
        },
        "CON-2.O": {
          "description": "نتیجه اجرای روش‌های بازگشتی را تعیین کنید."
        },
        "CON-2.P": {
          "description": "الگوریتم های جستجوی بازگشتی را به اطلاعات موجود در رشته، آرایه 1D یا اشیاء ArrayList اعمال کنید."
        },
        "CON-2.Q": {
          "description": "الگوریتم های بازگشتی را برای مرتب سازی عناصر آرایه یا اشیاء ArrayList اعمال کنید."
        },
        "CP": {
          "description": "احتمال شرطی و قواعد احتمال"
        },
        "CPP": {
          "description": "تمرین محاسبات & برنامه نویسی"
        },
        "CRD-1": {
          "description": "ترکیب دیدگاه های متعدد از طریق همکاری را بهبود می بخشد نوآوری محاسبات در حال توسعه."
        },
        "CRD-1.A": {
          "description": "توضیح دهید که چگونه نوآوری های محاسباتی از طریق همکاری بهبود می یابند."
        },
        "CRD-1.B": {
          "description": "توضیح دهید که چگونه نوآوری های محاسباتی توسط گروه های مردم توسعه می یابد."
        },
        "CRD-1.C": {
          "description": "نشان دادن مهارت های فردی موثر در طول همکاری."
        },
        "CRD-2": {
          "description": "توسعه دهندگان با استفاده از یک فرآیند طراحی تکراری که متمرکز بر کاربر است، که شامل چرخه های پیاده سازی/بازخورد است، ایجاد و نوآوری می کنند و فضای کافی برای آزمایش و ریسک پذیری را فراهم می کند."
        },
        "CRD-2.A": {
          "description": "توصیف هدف از یک نوآوری محاسباتی."
        },
        "CRD-2.B": {
          "description": "توضیح دهید که چگونه یک برنامه یا کد بخش توابع."
        },
        "CRD-2.C": {
          "description": "شناسایی ورودی (بازدید کنندگان) به یک برنامه."
        },
        "CRD-2.D": {
          "description": "شناسایی خروجی (بازدید کنندگان) تولید شده توسط یک برنامه."
        },
        "CRD-2.E": {
          "description": "یک برنامه را با استفاده از یک فرآیند توسعه توسعه دهید."
        },
        "CRD-2.F": {
          "description": "طراحی یک برنامه و رابط کاربری آن."
        },
        "CRD-2.G": {
          "description": "هدف از یک بخش کد یا برنامه را با نوشتن مستندات توصیف کنید."
        },
        "CRD-2.H": {
          "description": "اذعان بخش کد استفاده شده از منابع دیگر."
        },
        "CRD-2.I": {
          "description": "برای اشتباهات در یک الگوریتم یا برنامه: \na خطا را شناسایی کنید \nب خطا را اصلاح کنید"
        },
        "CRD-2.J": {
          "description": "شناسایی ورودی ها و خروجی مورد انتظار متناظر یا رفتارهایی که می تواند برای بررسی صحت یک الگوریتم یا برنامه مورد استفاده قرار گیرد."
        },
        "CS": {
          "description": "سیستم های محاسباتی"
        },
        "CSN-1": {
          "description": "سیستم‌ها و شبکه‌های کامپیوتری نحوه انتقال داده‌ها را تسهیل می‌کنند."
        },
        "CSN-1.A": {
          "description": "توضیح دهید که چگونه دستگاه های محاسباتی در یک شبکه با هم کار می کنند."
        },
        "CSN-1.B": {
          "description": "توضیح دهید که چگونه اینترنت کار می کند."
        },
        "CSN-1.C": {
          "description": "توضیح دهید که چگونه داده ها از طریق اینترنت از طریق بسته ها ارسال می شوند."
        },
        "CSN-1.D": {
          "description": "تفاوت بین اینترنت و شبکه جهانی وب را شرح دهید."
        },
        "CSN-1.E": {
          "description": "برای سیستم های مقاوم در برابر خطا، مانند اینترنت:\na. مزایای تحمل خطا را شرح دهید\nb. توضیح دهید که چگونه یک سیستم داده شده تحمل خطا دارد c. شناسایی آسیب پذیری در یک سیستم.\n"
        },
        "CSN-2": {
          "description": "محاسبات موازی و توزیع شده چندین کامپیوتر را برای حل سریع تر مشکلات پیچیده یا پردازش مجموعه داده های بزرگ استفاده می کند."
        },
        "CSN-2.A": {
          "description": "راه حل های مسئله ای را که از محاسبات متوالی، موازی و توزیع شده استفاده می کنند، مقایسه کنید."
        },
        "CSN-2.B": {
          "description": "کارایی راه حل های متوالی و موازی را تعیین کنید."
        },
        "CSN-2.C": {
          "description": "مزایا و چالش های محاسبات موازی و توزیع شده را توصیف کنید."
        },
        "CT": {
          "description": "تفکر محاسباتی"
        },
        "D1": {
          "description": "توسعه سوالات و برنامه ریزی پرس و جو"
        },
        "D2.Civ": {
          "description": "تعلیمات مدنی"
        },
        "D2.Eco": {
          "description": "اقتصاد"
        },
        "D2.His": {
          "description": "تاریخچه"
        },
        "D3.Claims": {
          "description": "توسعه ادعاها و استفاده از شواهد"
        },
        "D3.Sources": {
          "description": "جمع آوری و ارزیابی منابع"
        },
        "D4.Action": {
          "description": "اقدام آگاهانه"
        },
        "D4.Conclusions": {
          "description": "برقراری ارتباط و نقد نتیجه گیری"
        },
        "DA": {
          "description": "داده ها و تجزیه و تحلیل"
        },
        "DAT-1": {
          "description": "روشی که رایانه نشان دهنده داده‌ها است با روشی که داده‌ها برای کاربر تفسیر و نمایش داده می‌شوند متفاوت است. برنامه ها برای ترجمه داده ها به یک نمایندگی استفاده می شود که به راحتی توسط مردم قابل درک است."
        },
        "DAT-1.A": {
          "description": "توضیح دهید که چگونه داده ها را می توان با استفاده از بیت ها نشان داد."
        },
        "DAT-1.B": {
          "description": "عواقب استفاده از بیت ها برای نشان دادن داده ها را توضیح دهید."
        },
        "DAT-1.C": {
          "description": "برای اعداد دودویی:\na محاسبه دودویی (پایه 2) معادل یک عدد صحیح مثبت (پایه 10) و بالعکس. \nب مقایسه و سفارش اعداد دودویی."
        },
        "DAT-1.D": {
          "description": "الگوریتم های فشرده سازی داده ها را مقایسه کنید تا مشخص کنید کدام یک از بهترین ها در یک زمینه خاص است."
        },
        "DAT-2": {
          "description": "از برنامه‌ها می‌توان برای پردازش داده‌ها استفاده کرد، که به کاربران امکان کشف اطلاعات و ایجاد دانش جدید را می‌دهد."
        },
        "DAT-2.A": {
          "description": "توضیح دهید چه اطلاعاتی را می توان از داده ها استخراج کرد."
        },
        "DAT-2.B": {
          "description": "توضیح دهید که چه اطلاعاتی را می توان از ابرداده استخراج کرد."
        },
        "DAT-2.C": {
          "description": "شناسایی چالش های مرتبط با پردازش داده ها."
        },
        "DAT-2.D": {
          "description": "استخراج اطلاعات از داده ها با استفاده از یک برنامه."
        },
        "DAT-2.E": {
          "description": "توضیح دهید که چگونه برنامه ها می توانند برای به دست آوردن بینش و دانش از داده ها استفاده شوند."
        },
        "EE": {
          "description": "عبارات و معادلات"
        },
        "ESS": {
          "description": "علوم زمین و فضا"
        },
        "ESS1": {
          "description": "جایگاه زمین در جهان"
        },
        "ESS2": {
          "description": "سیستم های زمین"
        },
        "ESS3": {
          "description": "زمین و فعالیت های انسانی"
        },
        "ETS": {
          "description": "مهندسی در علوم"
        },
        "ETS1": {
          "description": "طراحی مهندسی"
        },
        "F": {
          "description": "توابع"
        },
        "G": {
          "description": "هندسه"
        },
        "GMD": {
          "description": "اندازه گیری هندسی و ابعاد"
        },
        "GPE": {
          "description": "بیان خواص هندسی با معادلات"
        },
        "IC": {
          "description": "تاثیرات محاسبات"
        },
        "ID": {
          "description": "تفسیر داده های طبقه ای و کمی"
        },
        "IF": {
          "description": "توابع تفسیر"
        },
        "IOC-1": {
          "description": "در حالی که نوآوری‌های محاسباتی به‌طور معمول برای رسیدن به یک هدف خاص طراحی می‌شوند، ممکن است پیامدهای ناخواسته داشته باشند."
        },
        "IOC-1.A": {
          "description": "توضیح دهید که چگونه یک اثر نوآوری محاسباتی می تواند مفید و مضر باشد."
        },
        "IOC-1.B": {
          "description": "توضیح دهید که چگونه یک نوآوری محاسباتی می تواند تاثیری فراتر از هدف مورد نظر خود داشته باشد."
        },
        "IOC-1.C": {
          "description": "مسائلی را که به شکاف دیجیتال کمک می کنند توصیف کنید."
        },
        "IOC-1.D": {
          "description": "توضیح دهید که چگونه تعصب در نوآوری های محاسباتی وجود دارد."
        },
        "IOC-1.E": {
          "description": "توضیح دهید که چگونه مردم در فرایندهای حل مسئله در مقیاس شرکت می کنند."
        },
        "IOC-1.F": {
          "description": "توضیح دهید که چگونه استفاده از محاسبات می تواند نگرانی های قانونی و اخلاقی را افزایش دهد."
        },
        "IOC-2": {
          "description": "استفاده از نوآوریهای محاسباتی ممکن است خطراتی برای امنیت و هویت شخصی شما داشته باشد."
        },
        "IOC-2.A": {
          "description": "خطرات مربوط به حریم خصوصی را از جمع آوری و ذخیره اطلاعات شخصی در یک سیستم رایانه ای توصیف کنید."
        },
        "IOC-2.B": {
          "description": "توضیح دهید که چگونه منابع محاسباتی را می توان محافظت کرد و می تواند سوء استفاده شود."
        },
        "IOC-2.C": {
          "description": "توضیح دهید که چگونه دسترسی غیر مجاز به منابع محاسباتی به دست آمده است."
        },
        "L": {
          "description": "زبان"
        },
        "LE": {
          "description": "مدل های خطی، درجه دوم و نمایی ★"
        },
        "LS": {
          "description": "رده: علوم زیستی"
        },
        "LS1": {
          "description": "از مولکول‌ها تا ارگانیسم‌ها: ساختارها و فرایندها"
        },
        "LS2": {
          "description": "اکوسیستم ها: تعاملات، انرژی و دینامیک"
        },
        "LS3": {
          "description": "وراثت: وراثت و تنوع صفات"
        },
        "LS4": {
          "description": "تکامل زیستی: وحدت و تنوع"
        },
        "MD": {
          "description": "با استفاده از احتمال برای تصمیم گیری"
        },
        "MG": {
          "description": "مدل سازی با هندسه"
        },
        "MOD-1": {
          "description": "برخی از اشیاء یا مفاهیم به طوری که اغلب نشان داده شده است که برنامه نویسان می توانند بر روی کد های موجود است که در حال حاضر تست شده قرعه کشی، آنها را قادر به نوشتن راه حل های سریع تر و با درجه بیشتری از اعتماد به نفس"
        },
        "MOD-1.A": {
          "description": "تماس با روش های کلاس سیستم برای تولید خروجی به کنسول."
        },
        "MOD-1.B": {
          "description": "رابطه بین یک کلاس و یک شی را توضیح دهید."
        },
        "MOD-1.C": {
          "description": "شناسایی، با استفاده از امضای آن، سازنده صحیح نامیده می شود."
        },
        "MOD-1.D": {
          "description": "برای ایجاد شی: a ایجاد اشیاء با فراخوانی سازندگان بدون پارامتر. ب ایجاد اشیاء با فراخوانی سازندگان با پارامترها."
        },
        "MOD-1.E": {
          "description": "روش های خالی غیر استاتیک را بدون پارامتر فراخوانی کنید."
        },
        "MOD-1.F": {
          "description": "روش های void غیر استاتیک را با پارامترها فراخوانی کنید"
        },
        "MOD-1.G": {
          "description": "روش های غیر خالی غیر استاتیک را با یا بدون پارامتر فراخوانی کنید"
        },
        "MOD-1.H": {
          "description": "تماس با روش های استاتیک"
        },
        "MOD-2": {
          "description": "برنامه نویسان از کد برای نشان دادن یک شی فیزیکی یا مفهوم غیر فیزیکی، واقعی یا تصور، با تعریف یک کلاس بر اساس attirbutes و/یا رفتارهای شی یا مفهوم استفاده می کنند"
        },
        "MOD-2.A": {
          "description": "تعیین دسترسی و دید محدودیت به کلاس, داده ها, سازندگان, و روش."
        },
        "MOD-2.B": {
          "description": "تعریف متغیرهای نمونه برای ویژگی های به از طریق سازندگان از یک کلاس مقداردهی اولیه می شود."
        },
        "MOD-2.C": {
          "description": "Desribe قابلیت و استفاده از کد برنامه thorugh نظرات."
        },
        "MOD-2.D": {
          "description": "تعریف رفتارهای یک شی از طریق روش های غیر void بدون prameters نوشته شده در یک کلاس."
        },
        "MOD-2.E": {
          "description": "تعریف رفتارهای یک شی از طریق روش از درجه اعتبار ساقط با یا بدون پارامترهای نوشته شده در یک کلاس."
        },
        "MOD-2.F": {
          "description": "تعریف رفتارهای یک شی از طریق روش های غیر void با پارامترهای نوشته شده در یک کلاس."
        },
        "MOD-2.G": {
          "description": "تعریف رفتارهای یک کلاس از طریق روش استاتیک."
        },
        "MOD-2.H": {
          "description": "تعریف متغیرهای استاتیک که متعلق به کلاس."
        },
        "MOD-3": {
          "description": "هنگامی که کلاس های چندگانه شامل ویژگی ها و رفتارهای مشترک هستند، برنامه نویسان یک کلاس جدید شامل ویژگی ها و رفتارهای مشترک ایجاد می کنند که یک hierachy را تشکیل می دهند. اصلاحات انجام شده در بالاترین سطح سلسله مراتب به زیر کلاسها اعمال می شود."
        },
        "MOD-3.A": {
          "description": "تعیین دید خصوصی از متغیرهای نمونه به کپسوله کردن ویژگی های یک شی."
        },
        "MOD-3.B": {
          "description": "یک رابطه ارث بری از یک زیرکلاس به ابرکلاس ایجاد کنید."
        },
        "MOD-3.C": {
          "description": "متغیرهای مرجع یک ابرکلاس را تعریف کنید تا به یک شی از یک زیرکلاس در همان سلسله مراتب اختصاص یابد."
        },
        "MOD-3.D": {
          "description": "روش های تماس در یک رابطه ارث."
        },
        "MOD-3.E": {
          "description": "پاسخ روش کلاس شی از طریق ارث."
        },
        "MP": {
          "description": "شیوه های ریاضی"
        },
        "NBT": {
          "description": "تعداد و عملیات در پایگاه ده"
        },
        "NF": {
          "description": "تعداد و عملیات — فراکسیون"
        },
        "NI": {
          "description": "اینترنت و شبکه‌ها"
        },
        "NS": {
          "description": "سیستم شماره"
        },
        "OA": {
          "description": "عملیات و تفکر جبری"
        },
        "PS": {
          "description": "علوم فیزیکی"
        },
        "PS1": {
          "description": "ماده و فعل و انفعالات آن"
        },
        "PS2": {
          "description": "حرکت و پایداری: نیروها و تعاملات"
        },
        "PS3": {
          "description": "رده: انرژی"
        },
        "PS4": {
          "description": "امواج و کاربردهای آنها در فناوری در انتقال اطلاعات"
        },
        "Q": {
          "description": "مقادیر"
        },
        "REI": {
          "description": "استدلال با معادلات و نابرابری"
        },
        "RF": {
          "description": "خواندن مهارت های بنیادی"
        },
        "RH": {
          "description": "تاریخ خواندن/مطالعات اجتماعی"
        },
        "RI": {
          "description": "خواندن اطلاعات"
        },
        "RL": {
          "description": "ادبیات خواندن"
        },
        "RN": {
          "description": "سامانه اعداد حقیقی"
        },
        "RP": {
          "description": "نسبت ها و روابط متناسب"
        },
        "RST": {
          "description": "علم خواندن/فنی"
        },
        "SL": {
          "description": "صحبت کردن و گوش دادن"
        },
        "SP": {
          "description": "آمار و احتمال"
        },
        "SRT": {
          "description": "شباهت، مثلث راست، و مثلثات"
        },
        "SSE": {
          "description": "دیدن ساختار در عبارات"
        },
        "TF": {
          "description": "توابع مثلثاتی"
        },
        "VAR-1": {
          "description": "برای پیدا کردن راه حل‌های خاص برای مسائل تعمیم پذیر، برنامه نویسان متغیرهایی را در کد خود قرار می‌دهند تا الگوریتم یکسان با استفاده از مقادیر ورودی متفاوت اجرا شود"
        },
        "VAR-1.A": {
          "description": "ایجاد ادبیات رشته"
        },
        "VAR-1.B": {
          "description": "مناسب ترین دسته نوع داده را برای یک مشخصات خاص مشخص کنید"
        },
        "VAR-1.C": {
          "description": "اعلام متغیرهای از انواع صحیح برای نشان دادن داده های اولیه"
        },
        "VAR-1.D": {
          "description": "تعریف متغیرهای از انواع صحیح برای نشان دادن داده های مرجع."
        },
        "VAR-1.E": {
          "description": "برای کلاس String: a ایجاد اشیاء String. b."
        },
        "VAR-1.F": {
          "description": "برای کلاس های wrapper: a ایجاد اشیاء عدد صحیح. ب روش های عدد صحیح را فراخوانی کنید. c ایجاد اشیاء دوتایی."
        },
        "VAR-1.G": {
          "description": "توضیح دهید که کجا متغیرها را می توان در کد برنامه استفاده کرد."
        },
        "VAR-1.H": {
          "description": "ارزیابی عبارات مرجع شی که با استفاده از کلمه کلیدی این."
        },
        "VAR-2": {
          "description": "برای مدیریت حجم زیادی از داده ها یا روابط پیچیده در داده ها، برنامه نویسان کد را می نویسند که داده ها را با هم در یک ساختار داده واحد گروه بندی می کند و متغیرهای فردی را برای هر مقدار ایجاد می کند."
        },
        "VAR-2.A": {
          "description": "مجموعه ای از داده های مرجع اولیه یا شی مرتبط را با استفاده از اشیاء آرایه یک بعدی (1D) نشان دهید."
        },
        "VAR-2.B": {
          "description": "گذشتن از عناصر در یک آرایه 1D."
        },
        "VAR-2.C": {
          "description": "گذشتن از عناصر در یک شی آرایه 1D با استفاده از یک حلقه افزایش یافته برای."
        },
        "VAR-2.D": {
          "description": "مجموعه ای از داده های مرجع شیء مرتبط را با استفاده از اشیاء ArrayList نشان دهید."
        },
        "VAR-2.E": {
          "description": "برای آبجکت های ArrayList: • گذشتن با استفاده از یک حلقه for یا while • گذشتن با استفاده از یک حلقه افزایش یافته برای."
        },
        "VAR-2.F": {
          "description": "مجموعه ای از داده های مرجع اولیه یا شی مرتبط را با استفاده از اشیاء آرایه ای دو بعدی (2D) نشان دهید."
        },
        "VAR-2.G": {
          "description": "برای آبجکت های آرایه ای 2 بعدی: • گذشتن با استفاده از حلقه های تو در تو برای حلقه ها"
        },
        "VM": {
          "description": "مقادیر بردار و ماتریس"
        },
        "W": {
          "description": "نوشتن"
        },
        "WHST": {
          "description": "نوشتن HS/S/T"
        }
      }
    }
  }
}