{
  "ru-RU": {
    "data": {
      "standard_categories": {
        "DA": {
          "description": "Данные и анализ"
        },
        "DAT-1": {
          "description": "Способ, которым компьютер представляет данные, отличается от способа, который используется для интерпретации и отображения данных для пользователя. Программы позволяют преобразовать данные в более понятное для людей представление."
        },
        "IOC-2": {
          "description": "Использование компьютерных инноваций может быть сопряжено с риском для вашей личной безопасности и идентичности."
        },
        "DAT-1.D": {
          "description": "Сравните алгоритмы сжатия данных, чтобы определить, какой из них лучше всего подходит для конкретного контекста."
        },
        "IOC-2.B": {
          "description": "Объясните, как вычислительные ресурсы могут быть использованы не по назначению и как можно защитить их."
        },
        "CD": {
          "description": "Компьютеры и устройства для связи"
        },
        "CI": {
          "description": "Сообщество, глобальное и этническое влияние"
        },
        "CL": {
          "description": "Сотрудничество"
        },
        "CPP": {
          "description": "Практика вычислений и программирование"
        },
        "CT": {
          "description": "Вычислительное мышление"
        },
        "L": {
          "description": "Язык"
        },
        "RI": {
          "description": "Чтение информационных текстов"
        },
        "RL": {
          "description": "Чтение литературы"
        },
        "SL": {
          "description": "Говорение и слушание"
        },
        "W": {
          "description": "Письмо"
        },
        "C": {
          "description": "Туннель"
        },
        "F": {
          "description": "функции"
        },
        "G": {
          "description": "Геометрия"
        },
        "MP": {
          "description": "Математические методы"
        },
        "NBT": {
          "description": "Числа и операции в десятичной системе"
        },
        "OA": {
          "description": "Операции и алгебраическое мышление"
        },
        "1": {
          "description": "Учащиеся демонстрируют творческое мышление, овладевают знаниями и разрабатывают инновационные продукты и процессы с помощью технологий."
        },
        "2": {
          "description": "Учащиеся используют цифровые средства и среды для коммуникации и совместной работы, в том числе дистанционно, что одновременно способствует их собственному индивидуальному обучению и обучению других."
        },
        "4": {
          "description": "Учащиеся используют навыки критического мышления для планирования и выполнения исследовательской работы, управления проектами, решения задач и принятия информированных решений об использовании цифровых инструментов и ресурсов."
        },
        "6": {
          "description": "Учащиеся демонстрируют четкое понимание технологических концепций, систем и операций."
        },
        "3": {
          "description": "Студенты применят цифровые инструменты для сбора, оценки и использования информации."
        },
        "5": {
          "description": "Студенты поймут человеческие, культурные и социальные проблемы, связанные с технологией, и попрактикуют правовое и этическое поведение."
        }
      }
    }
  }
}