{
  "hi-IN": {
    "data": {
      "standard_categories": {
        "1": {
          "description": "छात्र रचनात्मक सोच का प्रदर्शन करते हैं, ज्ञान का निर्माण करते हैं, और प्रौद्योगिकी का उपयोग करके नवीन उत्पादों और प्रक्रियाओं का विकास करते हैं।"
        },
        "2": {
          "description": "छात्र डिजिटल मीडिया और माहौल का उपयोग संवाद करने और सहयोगात्मक रूप से काम करने के लिए करते हैं, जिसमें दूरी भी शामिल है, व्यक्तिगत सीखने का समर्थन करना और दूसरों के सीखने में योगदान करना शामिल है।"
        },
        "3": {
          "description": "छात्र जानकारी इकट्ठा करने, मूल्यांकन करने और उसका उपयोग करने के लिए डिजिटल टूल लागू करते हैं।"
        },
        "3-A-i": {
          "description": "सीखने की प्रकृति - मनुष्य बनाम मशीन"
        },
        "3-A-ii": {
          "description": "सीखने की प्रकृति - डेटा में पैटर्न खोजना"
        },
        "3-A-iii": {
          "description": "सीखने की प्रकृति - एक मॉडल को प्रशिक्षित करना"
        },
        "3-A-iv": {
          "description": "सीखने की प्रकृति - एक तर्ककर्ता का उपयोग करना बनाम निर्माण करना"
        },
        "3-A-v": {
          "description": "सीखने की प्रकृति - आंतरिक अभ्यावेदन को समायोजित करना"
        },
        "3-A-vi": {
          "description": "सीखने की प्रकृति - अनुभव से सीखना"
        },
        "3-B-i": {
          "description": "तंत्रिका नेटवर्क - एक तंत्रिका नेटवर्क की संरचना"
        },
        "3-B-ii": {
          "description": "तंत्रिका नेटवर्क - वजन समायोजन"
        },
        "3-C-i": {
          "description": "डेटासेट - फ़ीचर सेट"
        },
        "3-C-ii": {
          "description": "डेटासेट - बड़े डेटासेट"
        },
        "3-C-iii": {
          "description": "डेटासेट - पूर्वाग्रह"
        },
        "4": {
          "description": "छात्र खोज की योजना बनाने और संचालित करने, परियोजनाओं का प्रबंधन करने, समस्याओं का समाधान करने और उपयुक्त डिजिटल उपकरणों और संसाधनों का उपयोग करके सूचित निर्णय लेने के लिए महत्वपूर्ण सोच कौशल का उपयोग करते हैं।"
        },
        "5": {
          "description": "छात्र प्रौद्योगिकी से संबंधित मानवीय, सांस्कृतिक और सामाजिक मुद्दों को समझते हैं और कानूनी और नैतिक व्यवहार का अभ्यास करते हैं।"
        },
        "6": {
          "description": "छात्र प्रौद्योगिकी अवधारणाओं, प्रणालियों और संचालन की एक अच्छी समझ प्रदर्शित करते हैं।"
        },
        "AAP-1": {
          "description": "सामान्यीकृत समस्याओं के विशिष्ट समाधान खोजने के लिए, प्रोग्रामर कई तरीकों से डेटा का प्रतिनिधित्व और आयोजन करते हैं।"
        },
        "AAP-1.A": {
          "description": "एक चर के साथ एक मान का प्रतिनिधित्व करें।"
        },
        "AAP-1.B": {
          "description": "असाइनमेंट के परिणामस्वरूप एक वैरिएबल का मान निर्धारित करें।"
        },
        "AAP-1.C": {
          "description": "एक चर का उपयोग करके एक सूची या स्ट्रिंग का प्रतिनिधित्व करें।"
        },
        "AAP-1.D": {
          "description": "डेटा एब्स्ट्रैक्शन के लिए: \nए कई तत्वों को स्टोर करने के लिए सूचियों का उपयोग करके डेटा एब्स्ट्रैक्शन विकसित करें।\nबी बताएं कि डेटा एब्स्ट्रैक्शन का उपयोग प्रोग्राम कोड में जटिलता का प्रबंधन कैसे करता है।"
        },
        "AAP-2": {
          "description": "जिस तरह से कथनों को एक प्रोग्राम में अनुक्रमित और संयोजित किया जाता है, वह गणना किए गए परिणाम को निर्धारित करता है। कार्यक्रमों में दोहराव का प्रतिनिधित्व करने और विभिन्न इनपुट मूल्यों को संभालने के लिए निर्णय लेने के लिए पुनरावृत्ति और चयन संरचनाएं शामिल हैं।"
        },
        "AAP-2.A": {
          "description": "एक एल्गोरिथ्म व्यक्त करें जो प्रोग्रामिंग भाषा का उपयोग किए बिना अनुक्रमण का उपयोग करता है।"
        },
        "AAP-2.B": {
          "description": "अनुक्रमिक कोड स्टेटमेंट का उपयोग करके चरण-दर-चरण एल्गोरिथम प्रक्रिया का प्रतिनिधित्व करें।"
        },
        "AAP-2.C": {
          "description": "अंकगणितीय ऑपरेटरों का उपयोग करने वाले अभिव्यक्तियों का मूल्यांकन करें।"
        },
        "AAP-2.D": {
          "description": "उन अभिव्यक्तियों का मूल्यांकन करें जो स्ट्रिंग्स में हेरफेर करते हैं।"
        },
        "AAP-2.E": {
          "description": "दो चर, अभिव्यक्तियों या मानों के बीच संबंधों के लिए: \nए रिलेशनल ऑपरेटरों का उपयोग करके प्रतिनिधित्व करें\nबी रिलेशनल ऑपरेटरों का उपयोग करने वाले अभिव्यक्तियों का मूल्यांकन करें।"
        },
        "AAP-2.F": {
          "description": "बूलियन मानों के बीच संबंधों के लिए:\nए लॉजिकल ऑपरेटरों का उपयोग करके प्रतिनिधित्व करें।\nख तर्क ऑपरेटरों का उपयोग करने वाले अभिव्यक्तियों का मूल्यांकन करें।"
        },
        "AAP-2.G": {
          "description": "एक एल्गोरिथ्म व्यक्त करें जो प्रोग्रामिंग भाषा का उपयोग किए बिना चयन का उपयोग करता है।"
        },
        "AAP-2.H": {
          "description": "चयन के लिए:\na सशर्त कथनों का उपयोग करके प्रतिनिधित्व करें।\nख सशर्त कथनों का परिणाम निर्धारित करें।"
        },
        "AAP-2.I": {
          "description": "नेस्टेड चयन के लिए:\nए नेस्टेड सशर्त स्टेटमेंट का उपयोग करके प्रतिनिधित्व करें। \nख नेस्टेड सशर्त कथनों का परिणाम निर्धारित करें।"
        },
        "AAP-2.J": {
          "description": "एक एल्गोरिथ्म व्यक्त करें जो प्रोग्रामिंग भाषा का उपयोग किए बिना पुनरावृत्ति का उपयोग करता है।"
        },
        "AAP-2.K": {
          "description": "पुनरावृत्ति के लिए:\na. पुनरावृति कथन का उपयोग करके प्रतिनिधित्व करें।\nख। पुनरावृति कथनों के परिणाम या दुष्प्रभाव का निर्धारण करें।"
        },
        "AAP-2.L": {
          "description": "यह निर्धारित करने के लिए कि क्या वे समान दुष्प्रभाव या परिणाम देते हैं, कई एल्गोरिदम की तुलना करें।"
        },
        "AAP-2.M": {
          "description": "एल्गोरिदम के लिए: \nए एल्गोरिदम बनाएं। \nख। मौजूदा एल्गोरिदम को मिलाएं और संशोधित करें।"
        },
        "AAP-2.N": {
          "description": "सूची संचालन के लिए:\na. सूची अनुक्रमण और सूची प्रक्रियाओं का उपयोग करने वाले अभिव्यक्तियों को लिखें।\nख। सूची अनुक्रमण और सूची प्रक्रियाओं का उपयोग करने वाले अभिव्यक्तियों का मूल्यांकन करें।"
        },
        "AAP-2.O": {
          "description": "सूची के तत्वों को शामिल करने वाले एल्गोरिदम के लिए:\nए सूची को पार करने के लिए पुनरावृत्त कथनों का उपयोग करके प्रतिनिधित्व करें।\nख सूची ट्रैवर्सल के साथ एक एल्गोरिथ्म का परिणाम निर्धारित करें।"
        },
        "AAP-2.P": {
          "description": "बाइनरी सर्च एल्गोरिदम के लिए:\nए डेटा सेट में मान खोजने के लिए आवश्यक पुनरावृत्तियों की संख्या निर्धारित करें। \nख. द्विआधारी खोज को पूरा करने के लिए आवश्यक आवश्यकताओं की व्याख्या करें।"
        },
        "AAP-3": {
          "description": "प्रोग्रामर समस्याओं को छोटे और अधिक प्रबंधनीय टुकड़ों में विभाजित करते हैं। प्रक्रियाओं और मापदंडों का लाभ उठाकर, प्रोग्रामर उन प्रक्रियाओं को सामान्य बनाते हैं जिनका पुन: उपयोग किया जा सकता है। प्रक्रियाएँ प्रोग्रामर को पहले से ही परीक्षण किए जा चुके मौजूदा कोड को आकर्षित करने की अनुमति देती हैं, जिससे प्रोग्रामर अधिक तेज़ी से और अधिक आत्मविश्वास के साथ प्रोग्राम लिख सकते हैं।"
        },
        "AAP-3.A": {
          "description": "प्रक्रिया कॉल के लिए:\na. कॉल प्रक्रियाओं के लिए कथन लिखें।\nख. प्रक्रिया कॉल के परिणाम या प्रभाव का निर्धारण करें।"
        },
        "AAP-3.B": {
          "description": "प्रक्रिया कॉल के लिए:\na. कॉल प्रक्रियाओं के लिए कथन लिखें।\nख. प्रक्रिया कॉल के परिणाम या प्रभाव का निर्धारण करें।"
        },
        "AAP-3.C": {
          "description": "प्रक्रियाओं को लिखकर एक कार्यक्रम में जटिलता का प्रबंधन करने के लिए प्रक्रियात्मक सार विकसित करें।"
        },
        "AAP-3.D": {
          "description": "नए प्रोग्राम बनाने में उपयोग करने के लिए उपयुक्त लाइब्रेरी या मौजूदा कोड सेगमेंट का चयन करें।"
        },
        "AAP-3.E": {
          "description": "यादृच्छिक मान उत्पन्न करने के लिए: \na. संभव मान उत्पन्न करने के लिए अभिव्यक्ति लिखें। \nख. संभावित परिणामों को निर्धारित करने के लिए अभिव्यक्तियों का मूल्यांकन करें।"
        },
        "AAP-3.F": {
          "description": "सिमुलेशन के लिए:\nए समझाएं कि वास्तविक दुनिया की घटनाओं या परिणामों का प्रतिनिधित्व करने के लिए कंप्यूटर का उपयोग कैसे किया जा सकता है। \nबी वास्तविक दुनिया के संदर्भों के साथ सिमुलेशन के उपयोग की तुलना करें।"
        },
        "AAP-4": {
          "description": "ऐसी समस्याएं मौजूद हैं जिन्हें कंप्यूटर हल नहीं कर सकता है, और जब कंप्यूटर किसी समस्या को हल कर सकता है, तब भी वह उचित समय में ऐसा करने में सक्षम नहीं हो सकता है।"
        },
        "AAP-4.A": {
          "description": "एल्गोरिथम की दक्षता निर्धारित करने के लिए:\na. उचित समय में चलने वाले एल्गोरिदम और उचित समय में नहीं चलने वाले एल्गोरिदम के बीच अंतर स्पष्ट करें। \nबी उन स्थितियों की पहचान करें जहां एक अनुमानी समाधान अधिक उपयुक्त हो सकता है।"
        },
        "AAP-4.B": {
          "description": "कंप्यूटर विज्ञान में अनिश्चित समस्याओं के अस्तित्व की व्याख्या करें।"
        },
        "AP": {
          "description": "एल्गोरिदम और प्रोग्रामिंग"
        },
        "APR": {
          "description": "बहुपद और तर्कसंगत अभिव्यक्तियों के साथ अंकगणित"
        },
        "BF": {
          "description": "भवन के कार्य"
        },
        "BI-1": {
          "description": "कंप्यूटर सेंसर का उपयोग करके दुनिया का अनुभव करते हैं"
        },
        "BI-2": {
          "description": "एजेंट दुनिया का प्रतिनिधित्व करते हैं और तर्क के लिए उनका इस्तेमाल करते हैं"
        },
        "BI-3": {
          "description": "कंप्यूटर डेटा से सीख सकते हैं"
        },
        "BI-4": {
          "description": "बुद्धिमान एजेंटों को मनुष्यों के साथ स्वाभाविक रूप से बातचीत करने के लिए कई तरह के ज्ञान की आवश्यकता होती है"
        },
        "BI-5": {
          "description": "एआई समाज को सकारात्मक और नकारात्मक दोनों तरीकों से प्रभावित कर सकता है"
        },
        "C": {
          "description": "चक्र"
        },
        "CC": {
          "description": "काउंटिंग एंड कार्डिनैलिटी"
        },
        "CD": {
          "description": "कंप्यूटर और संचार उपकरण"
        },
        "CED": {
          "description": "समीकरण बनाना"
        },
        "CI": {
          "description": "समुदाय, वैश्विक और नैतिक प्रभाव"
        },
        "CL": {
          "description": "सहयोग"
        },
        "CN": {
          "description": "द कॉम्प्लेक्स नंबर सिस्टम"
        },
        "CO": {
          "description": "अनुरूपता"
        },
        "CON-1": {
          "description": "जिस तरह से वेरिएबल और ऑपरेटर्स को एक अभिव्यक्ति में अनुक्रमित और संयोजित किया जाता है, वह गणना किए गए परिणाम को निर्धारित करता है।"
        },
        "CON-1.A": {
          "description": "प्रोग्राम कोड में अंकगणितीय अभिव्यक्तियों का मूल्यांकन करें"
        },
        "CON-1.B": {
          "description": "मूल्यांकन करें कि एक असाइनमेंट स्टेटमेंट के साथ अभिव्यक्ति के परिणामस्वरूप एक चर में क्या संग्रहीत किया गया है"
        },
        "CON-1.C": {
          "description": "कास्टिंग का उपयोग करने वाले अंकगणितीय अभिव्यक्तियों का मूल्यांकन करें।"
        },
        "CON-1.D": {
          "description": "उन अभिव्यक्तियों का मूल्यांकन करें जो गणित वर्ग विधियों का उपयोग करते हैं।"
        },
        "CON-1.E": {
          "description": "प्रोग्राम कोड में रिलेशनल ऑपरेटरों का उपयोग करने वाले बूलियन अभिव्यक्तियों का मूल्यांकन करें।"
        },
        "CON-1.F": {
          "description": "प्रोग्राम कोड में यौगिक बूलियन अभिव्यक्तियों का मूल्यांकन करें।"
        },
        "CON-1.G": {
          "description": "समतुल्य बूलियन अभिव्यक्तियों की तुलना और कंट्रास्ट करें।"
        },
        "CON-1.H": {
          "description": "प्रोग्राम कोड में बूलियन अभिव्यक्तियों का उपयोग करके ऑब्जेक्ट संदर्भों की तुलना करें।"
        },
        "CON-2": {
          "description": "प्रोग्रामर कंप्यूटर को कई संभावित इनपुट मानों में से प्रत्येक को संसाधित करने के लिए निर्देश प्रदान करने के तरीके के रूप में कोड में पुनरावृत्ति और चयन को शामिल करते हैं"
        },
        "CON-2.A": {
          "description": "सशर्त कथनों का उपयोग करके ब्रांचिंग लॉजिकल प्रक्रियाओं का प्रतिनिधित्व करें।"
        },
        "CON-2.B": {
          "description": "नेस्टेड कंडीशनल स्टेटमेंट का उपयोग करके ब्रांचिंग लॉजिकल प्रक्रियाओं का प्रतिनिधित्व करें।"
        },
        "CON-2.C": {
          "description": "व्होललूप का उपयोग करके पुनरावृत्त प्रक्रियाओं का प्रतिनिधित्व करें।"
        },
        "CON-2.D": {
          "description": "किसी विशेष विनिर्देश के संदर्भ में एल्गोरिदम के लिए जिसके लिए ट्रैवर्सल के उपयोग की आवश्यकता नहीं है: • मानक एल्गोरिदम को पहचानें. • मानक एल्गोरिदम को संशोधित करें. • एक एल्गोरिथम विकसित करें।"
        },
        "CON-2.E": {
          "description": "फॉर लूप का उपयोग करके पुनरावृत्त प्रक्रियाओं का प्रतिनिधित्व करें।"
        },
        "CON-2.F": {
          "description": "किसी विशेष विनिर्देश के संदर्भ में एल्गोरिदम के लिए जिसमें स्ट्रिंग ऑब्जेक्ट शामिल हैं • मानक एल्गोरिदम को पहचानें. • मानक एल्गोरिदम को संशोधित करें. • एक एल्गोरिथम विकसित करें।"
        },
        "CON-2.G": {
          "description": "नेस्टेड पुनरावृत्त प्रक्रियाओं का प्रतिनिधित्व करें"
        },
        "CON-2.H": {
          "description": "स्टेटमेंट निष्पादन गणना और पुनरावृत्त विवरणों की अनौपचारिक रन-टाइम तुलना की गणना करें।"
        },
        "CON-2.I": {
          "description": "किसी विशेष विनिर्देश के संदर्भ में एल्गोरिदम के लिए जिसके लिए सरणी ट्रैवर्सल के उपयोग की आवश्यकता होती है: • मानक एल्गोरिदम को पहचानें. • मानक एल्गोरिदम को संशोधित करें. • एक एल्गोरिथम विकसित करें।"
        },
        "CON-2.J": {
          "description": "किसी विशेष विनिर्देश के संदर्भ में एल्गोरिदम के लिए जिसके लिए ArrayList ट्रैवर्सल के उपयोग की आवश्यकता होती है: • मानक एल्गोरिदम को पहचानें. • मानक एल्गोरिदम को संशोधित करें. • एक एल्गोरिथम विकसित करें।"
        },
        "CON-2.K": {
          "description": "सरणी या ArrayList ऑब्जेक्ट में विशिष्ट जानकारी खोजने के लिए अनुक्रमिक/रैखिक खोज एल्गोरिदम लागू करें।"
        },
        "CON-2.L": {
          "description": "सरणी या ऐरेलिस्ट ऑब्जेक्ट्स के तत्वों को सॉर्ट करने के लिए चयन सॉर्ट और इंसर्शन सॉर्ट एल्गोरिदम लागू करें।"
        },
        "CON-2.M": {
          "description": "स्टेटमेंट निष्पादन गणना और सॉर्टिंग एल्गोरिदम की अनौपचारिक रन-टाइम तुलना की गणना करें।"
        },
        "CON-2.N": {
          "description": "एल्गोरिदम के लिए किसी विशेष विनिर्देश के संदर्भ में जिसके लिए 2D सरणी ट्रैवर्सल के उपयोग की आवश्यकता होती है: • मानक एल्गोरिदम को पहचानें। • मानक एल्गोरिदम को संशोधित करें। • एक एल्गोरिथम विकसित करें।"
        },
        "CON-2.O": {
          "description": "रिकर्सिव विधियों को निष्पादित करने का परिणाम निर्धारित करें।"
        },
        "CON-2.P": {
          "description": "स्ट्रिंग, 1D सरणी, या ArrayList ऑब्जेक्ट्स में जानकारी के लिए रिकर्सिव सर्च एल्गोरिदम लागू करें।"
        },
        "CON-2.Q": {
          "description": "सरणी या ArrayList ऑब्जेक्ट्स के तत्वों को सॉर्ट करने के लिए रिकर्सिव एल्गोरिदम लागू करें।"
        },
        "CP": {
          "description": "सशर्त संभाव्यता और संभाव्यता के नियम"
        },
        "CPP": {
          "description": "कंप्यूटिंग अभ्यास और प्रोग्रामिंग"
        },
        "CRD-1": {
          "description": "सहयोग के माध्यम से कई दृष्टिकोणों को शामिल करने से विकसित किए जा रहे कंप्यूटिंग नवाचारों में सुधार होता है।"
        },
        "CRD-1.A": {
          "description": "बताएं कि सहयोग के माध्यम से कंप्यूटिंग नवाचारों को कैसे बेहतर बनाया जाता है।"
        },
        "CRD-1.B": {
          "description": "बताएं कि लोगों के समूहों द्वारा कंप्यूटिंग नवाचार कैसे विकसित किए जाते हैं।"
        },
        "CRD-1.C": {
          "description": "सहयोग के दौरान प्रभावी पारस्परिक कौशल का प्रदर्शन करें।"
        },
        "CRD-2": {
          "description": "डेवलपर्स एक पुनरावृत्त डिज़ाइन प्रक्रिया का उपयोग करके बनाते हैं और नया करते हैं, जो उपयोगकर्ता-केंद्रित होती है, जिसमें कार्यान्वयन/प्रतिक्रिया चक्र शामिल होते हैं, और जो प्रयोग और जोखिम लेने के लिए पर्याप्त जगह छोड़ता है।"
        },
        "CRD-2.A": {
          "description": "कंप्यूटिंग नवाचार के उद्देश्य का वर्णन करें।"
        },
        "CRD-2.B": {
          "description": "बताएं कि प्रोग्राम या कोड सेगमेंट कैसे काम करता है।"
        },
        "CRD-2.C": {
          "description": "किसी प्रोग्राम में इनपुट (ओं) को पहचानें।"
        },
        "CRD-2.D": {
          "description": "किसी प्रोग्राम द्वारा उत्पादित आउटपुट को पहचानें।"
        },
        "CRD-2.E": {
          "description": "विकास प्रक्रिया का उपयोग करके एक प्रोग्राम विकसित करें।"
        },
        "CRD-2.F": {
          "description": "एक प्रोग्राम और उसके यूज़र इंटरफ़ेस को डिज़ाइन करें।"
        },
        "CRD-2.G": {
          "description": "दस्तावेज़ीकरण लिखकर कोड सेगमेंट या प्रोग्राम के उद्देश्य का वर्णन करें।"
        },
        "CRD-2.H": {
          "description": "अन्य स्रोतों से उपयोग किए गए कोड सेगमेंट को स्वीकार करें।"
        },
        "CRD-2.I": {
          "description": "एल्गोरिथम या प्रोग्राम में त्रुटियों के लिए: \na. त्रुटि को पहचानें। \nख. त्रुटि को ठीक करें।"
        },
        "CRD-2.J": {
          "description": "उन इनपुट और संबंधित अपेक्षित आउटपुट या व्यवहारों को पहचानें जिनका उपयोग एल्गोरिथम या प्रोग्राम की शुद्धता की जांच करने के लिए किया जा सकता है।"
        },
        "CS": {
          "description": "कंप्यूटिंग सिस्टम"
        },
        "CSN-1": {
          "description": "कंप्यूटर सिस्टम और नेटवर्क यह सुविधा देते हैं कि डेटा कैसे स्थानांतरित किया जाता है।"
        },
        "CSN-1.A": {
          "description": "बताएं कि कंप्यूटिंग डिवाइस एक नेटवर्क में एक साथ कैसे काम करते हैं।"
        },
        "CSN-1.B": {
          "description": "समझाइए कि इंटरनेट कैसे काम करता है।"
        },
        "CSN-1.C": {
          "description": "बताएं कि पैकेट के माध्यम से इंटरनेट के माध्यम से डेटा कैसे भेजा जाता है।"
        },
        "CSN-1.D": {
          "description": "इंटरनेट और वर्ल्ड वाइड वेब के बीच अंतर का वर्णन करें।"
        },
        "CSN-1.E": {
          "description": "गलती-सहिष्णु प्रणालियों के लिए, जैसे इंटरनेट:\na. गलती-सहनशीलता के लाभों का वर्णन करें\nb. बताएं कि दी गई प्रणाली कैसे गलती-सहिष्णु है\nc. सिस्टम में कमजोरियों को पहचानें।"
        },
        "CSN-2": {
          "description": "समानांतर और वितरित कंप्यूटिंग जटिल समस्याओं को अधिक तेज़ी से हल करने या बड़े डेटा सेट को संसाधित करने के लिए कई कंप्यूटरों का लाभ उठाती है।"
        },
        "CSN-2.A": {
          "description": "अनुक्रमिक, समानांतर और वितरित कंप्यूटिंग का उपयोग करने वाले समस्या समाधानों की तुलना करें।"
        },
        "CSN-2.B": {
          "description": "अनुक्रमिक और समानांतर समाधानों की दक्षता निर्धारित करें।"
        },
        "CSN-2.C": {
          "description": "समानांतर और वितरित कंप्यूटिंग के लाभों और चुनौतियों का वर्णन करें।"
        },
        "CT": {
          "description": "अभिकलनात्मक चिंतन"
        },
        "D1": {
          "description": "प्रश्न विकसित करना और पूछताछ की योजना बनाना"
        },
        "D2.Civ": {
          "description": "नागरिकशास्र"
        },
        "D2.Eco": {
          "description": "अर्थशास्त्र"
        },
        "D3.Claims": {
          "description": "दावे विकसित करना और साक्ष्य का उपयोग करना"
        },
        "D3.Sources": {
          "description": "स्रोतों को इकट्ठा करना और उनका मूल्यांकन करना"
        },
        "D4.Action": {
          "description": "सूचित कार्रवाई करना"
        },
        "D4.Conclusions": {
          "description": "संप्रेषण और आलोचनात्मक निष्कर्ष"
        },
        "DA": {
          "description": "डेटा और विश्लेषण"
        },
        "DAT-1": {
          "description": "जिस तरह से कंप्यूटर डेटा का प्रतिनिधित्व करता है वह उस तरीके से भिन्न होता है जिस तरह से उपयोगकर्ता के लिए डेटा की व्याख्या और प्रदर्शित किया जाता है। डेटा को एक ऐसे प्रतिनिधित्व में अनुवाद करने के लिए प्रोग्राम का उपयोग किया जाता है जिसे लोग आसानी से समझ सकें।"
        },
        "DAT-1.A": {
          "description": "बताएं कि बिट्स का उपयोग करके डेटा का प्रतिनिधित्व कैसे किया जा सकता है।"
        },
        "DAT-1.B": {
          "description": "डेटा का प्रतिनिधित्व करने के लिए बिट्स का उपयोग करने के परिणामों की व्याख्या करें।"
        },
        "DAT-1.C": {
          "description": "द्विआधारी संख्याओं के लिए:\na एक सकारात्मक पूर्णांक (आधार 10) के बराबर द्विआधारी (आधार 2) की गणना करें और इसके विपरीत। \nबी बाइनरी नंबरों की तुलना करें और ऑर्डर करें।"
        },
        "DAT-1.D": {
          "description": "किसी विशेष संदर्भ में सबसे उत्तम कौन सा है यह निर्धारित करने के लिए डेटा संक्षिप्तीकरण एल्गोरिदम की तुलना करें।"
        },
        "DAT-2": {
          "description": "कार्यक्रमों का उपयोग डेटा को संसाधित करने के लिए किया जा सकता है, जो उपयोगकर्ताओं को जानकारी खोजने और नया ज्ञान बनाने की अनुमति देता है।"
        },
        "DAT-2.A": {
          "description": "वर्णन करें कि डेटा से कौन सी जानकारी निकाली जा सकती है।"
        },
        "DAT-2.B": {
          "description": "वर्णन करें कि मेटाडेटा से कौन सी जानकारी निकाली जा सकती है।"
        },
        "DAT-2.C": {
          "description": "प्रोसेसिंग डेटा से जुड़ी चुनौतियों को पहचानें।"
        },
        "DAT-2.D": {
          "description": "प्रोग्राम का उपयोग करके डेटा से जानकारी निकालें।"
        },
        "DAT-2.E": {
          "description": "बताएं कि डेटा से अंतर्दृष्टि और ज्ञान प्राप्त करने के लिए कार्यक्रमों का उपयोग कैसे किया जा सकता है।"
        },
        "EE": {
          "description": "अभिव्यक्तियां और समीकरण"
        },
        "ESS": {
          "description": "पृथ्वी और अंतरिक्ष विज्ञान"
        },
        "ESS1": {
          "description": "ब्रह्मांड में पृथ्वी का स्थान"
        },
        "ESS2": {
          "description": "पृथ्वी के सिस्टम"
        },
        "ESS3": {
          "description": "पृथ्वी और मानव गतिविधि"
        },
        "ETS": {
          "description": "विज्ञान में अभियांत्रिकी"
        },
        "ETS1": {
          "description": "इंजीनियरिंग डिज़ाइन"
        },
        "F": {
          "description": "कार्य"
        },
        "G": {
          "description": "ज्यामिति"
        },
        "GMD": {
          "description": "ज्यामितीय मापन और आयाम"
        },
        "GPE": {
          "description": "समीकरणों के साथ ज्यामितीय गुणों को व्यक्त करना"
        },
        "IC": {
          "description": "कंप्यूटिंग के प्रभाव"
        },
        "ID": {
          "description": "श्रेणीबद्ध और मात्रात्मक डेटा की व्याख्या करना"
        },
        "IF": {
          "description": "कार्यों की व्याख्या करना"
        },
        "IOC-1": {
          "description": "जबकि कंप्यूटिंग नवाचार आमतौर पर एक विशिष्ट उद्देश्य को प्राप्त करने के लिए डिज़ाइन किए जाते हैं, उनके अनपेक्षित परिणाम हो सकते हैं।"
        },
        "IOC-1.A": {
          "description": "बताएं कि कंप्यूटिंग इनोवेशन का प्रभाव कैसे फायदेमंद और हानिकारक दोनों हो सकता है।"
        },
        "IOC-1.B": {
          "description": "बताएं कि कैसे एक कंप्यूटिंग नवाचार अपने इच्छित उद्देश्य से परे प्रभाव डाल सकता है।"
        },
        "IOC-1.C": {
          "description": "उन मुद्दों का वर्णन करें जो डिजिटल डिवाइड में योगदान करते हैं।"
        },
        "IOC-1.D": {
          "description": "बताएं कि कंप्यूटिंग नवाचारों में पूर्वाग्रह कैसे मौजूद है।"
        },
        "IOC-1.E": {
          "description": "बताएं कि लोग समस्या-समाधान प्रक्रियाओं में बड़े पैमाने पर कैसे भाग लेते हैं।"
        },
        "IOC-1.F": {
          "description": "बताएं कि कंप्यूटिंग का उपयोग कैसे कानूनी और नैतिक चिंताओं को बढ़ा सकता है।"
        },
        "IOC-2": {
          "description": "कंप्यूटिंग नवाचारों के उपयोग से आपकी व्यक्तिगत सुरक्षा और पहचान के लिए जोखिम शामिल हो सकते हैं।"
        },
        "IOC-2.A": {
          "description": "कंप्यूटर सिस्टम पर व्यक्तिगत डेटा एकत्र करने और संग्रहीत करने से गोपनीयता के जोखिमों का वर्णन करें।"
        },
        "IOC-2.B": {
          "description": "समझाएं कि कैसे कंप्यूटिंग संसाधनों को संरक्षित किया जा सकता है और उनका दुरुपयोग किया जा सकता है।"
        },
        "IOC-2.C": {
          "description": "बताएं कि कंप्यूटिंग संसाधनों तक अनधिकृत पहुंच कैसे प्राप्त की जाती है।"
        },
        "L": {
          "description": "भाषा"
        },
        "LE": {
          "description": "लीनियर, क्वाड्रैटिक और एक्सपोनेंशियल मॉडल ★"
        },
        "LS": {
          "description": "लाइफ़ साइंस"
        },
        "LS1": {
          "description": "अणुओं से जीवों तक: संरचनाएँ और प्रक्रियाएँ"
        },
        "LS2": {
          "description": "इकोसिस्टम: इंटरैक्शन, एनर्जी, और डायनामिक्स"
        },
        "LS3": {
          "description": "आनुवंशिकता: वंशानुक्रम और लक्षणों की विविधता"
        },
        "LS4": {
          "description": "जैविक विकास: एकता और विविधता"
        },
        "MD": {
          "description": "निर्णय लेने के लिए संभाव्यता का उपयोग करना"
        },
        "MG": {
          "description": "ज्यामिति के साथ मॉडलिंग"
        },
        "MOD-1": {
          "description": "कुछ वस्तुओं या अवधारणाओं का इतनी बार प्रतिनिधित्व किया जाता है कि प्रोग्रामर पहले से परीक्षण किए जा चुके मौजूदा कोड को आकर्षित कर सकते हैं, जिससे वे अधिक तेज़ी से और अधिक आत्मविश्वास के साथ समाधान लिख सकते हैं"
        },
        "MOD-1.A": {
          "description": "कंसोल में आउटपुट जेनरेट करने के लिए सिस्टम क्लास मेथड्स को कॉल करें।"
        },
        "MOD-1.B": {
          "description": "एक वर्ग और एक वस्तु के बीच के संबंध को समझाइए।"
        },
        "MOD-1.C": {
          "description": "पहचानें, इसके हस्ताक्षर का उपयोग करके, सही कन्स्ट्रक्टर को कॉल किया जा रहा है।"
        },
        "MOD-1.D": {
          "description": "ऑब्जेक्ट बनाने के लिए: a. मापदंडों के बिना कन्स्ट्रक्टर को कॉल करके ऑब्जेक्ट बनाएं। b. मापदंडों के साथ कन्स्ट्रक्टर को कॉल करके ऑब्जेक्ट बनाएं।"
        },
        "MOD-1.E": {
          "description": "मापदंडों के बिना गैर-स्थैतिक शून्य विधियों को कॉल करें।"
        },
        "MOD-1.F": {
          "description": "मापदंडों के साथ गैर-स्थैतिक शून्य विधियों को कॉल करें"
        },
        "MOD-1.G": {
          "description": "पैरामीटर के साथ या उसके बिना गैर-स्थैतिक गैर-शून्य विधियों को कॉल करें"
        },
        "MOD-1.H": {
          "description": "स्थिर तरीकों को कॉल करें।"
        },
        "MOD-2": {
          "description": "प्रोग्रामर किसी भौतिक वस्तु या गैर-भौतिक अवधारणा, वास्तविक या काल्पनिक का प्रतिनिधित्व करने के लिए कोड का उपयोग करते हैं, वस्तु या अवधारणा के गुणों और/या व्यवहार के आधार पर एक वर्ग को परिभाषित करके"
        },
        "MOD-2.A": {
          "description": "कक्षाओं, डेटा, कन्स्ट्रक्टर और विधियों तक पहुंच और दृश्यता बाधाओं को निर्दिष्ट करें।"
        },
        "MOD-2.B": {
          "description": "क्लास के कन्स्ट्रक्टर के माध्यम से आरंभ की जाने वाली विशेषताओं के लिए इंस्टेंस वैरिएबल को परिभाषित करें।"
        },
        "MOD-2.C": {
          "description": "टिप्पणियों के माध्यम से प्रोग्राम कोड की कार्यक्षमता और उपयोग का वर्णन करें।"
        },
        "MOD-2.D": {
          "description": "कक्षा में लिखे गए पैरामीटर के बिना गैर-शून्य विधियों के माध्यम से किसी ऑब्जेक्ट के व्यवहार को परिभाषित करें।"
        },
        "MOD-2.E": {
          "description": "कक्षा में लिखे गए मापदंडों के साथ या उसके बिना शून्य विधियों के माध्यम से किसी वस्तु के व्यवहार को परिभाषित करें।"
        },
        "MOD-2.F": {
          "description": "कक्षा में लिखे गए मापदंडों के साथ गैर-शून्य विधियों के माध्यम से किसी ऑब्जेक्ट के व्यवहार को परिभाषित करें।"
        },
        "MOD-2.G": {
          "description": "स्थिर तरीकों के माध्यम से कक्षा के व्यवहार को परिभाषित करें।"
        },
        "MOD-2.H": {
          "description": "कक्षा से संबंधित स्थिर चर को परिभाषित करें।"
        },
        "MOD-3": {
          "description": "जब कई वर्गों में सामान्य विशेषताएँ और व्यवहार होते हैं, तो प्रोग्रामर एक नया वर्ग बनाते हैं जिसमें साझा विशेषताएँ और व्यवहार शामिल होते हैं जो एक पदानुक्रम बनाते हैं। पदानुक्रम के उच्चतम स्तर पर किए गए संशोधन उपवर्गों पर लागू होते हैं।"
        },
        "MOD-3.A": {
          "description": "किसी ऑब्जेक्ट की विशेषताओं को एनकैप्सुलेट करने के लिए इंस्टेंस वेरिएबल्स की निजी दृश्यता को निर्दिष्ट करें।"
        },
        "MOD-3.B": {
          "description": "एक उपवर्ग से सुपरक्लास तक विरासत संबंध बनाएं।"
        },
        "MOD-3.C": {
          "description": "एक ही पदानुक्रम में उप-वर्ग के ऑब्जेक्ट को असाइन किए जाने वाले सुपरक्लास के संदर्भ चर को परिभाषित करें।"
        },
        "MOD-3.D": {
          "description": "वंशानुगत संबंध में कॉल मेथड्स।"
        },
        "MOD-3.E": {
          "description": "विरासत के माध्यम से ऑब्जेक्ट क्लास विधियों को कॉल करें।"
        },
        "MP": {
          "description": "गणित के अभ्यास"
        },
        "NBT": {
          "description": "मूल दस में संख्या व कार्य प्रणालियां"
        },
        "NF": {
          "description": "संख्या और संचालन — अंश"
        },
        "NI": {
          "description": "नेटवर्क और इंटरनेट"
        },
        "NS": {
          "description": "द नंबर सिस्टम"
        },
        "OA": {
          "description": "कार्य प्रणालियां व बीजगणितीय चिंतन"
        },
        "PS": {
          "description": "भौतिक विज्ञान"
        },
        "PS1": {
          "description": "पदार्थ और उसकी सहभागिता"
        },
        "PS2": {
          "description": "गति और स्थिरता: बल और बातचीत"
        },
        "PS3": {
          "description": "ऊर्जा"
        },
        "PS4": {
          "description": "सूचना हस्तांतरण में प्रौद्योगिकी में तरंगें और उनके अनुप्रयोग"
        },
        "Q": {
          "description": "मात्राएं"
        },
        "REI": {
          "description": "समीकरणों और असमानताओं के साथ तर्क"
        },
        "RF": {
          "description": "फाउंडेशनल स्किल्स पढ़ना"
        },
        "RH": {
          "description": "इतिहास पढ़ना/सामाजिक अध्ययन"
        },
        "RI": {
          "description": "सूचनात्मक पढ़ना"
        },
        "RL": {
          "description": "साहित्य पढ़ना"
        },
        "RN": {
          "description": "द रियल नंबर सिस्टम"
        },
        "RP": {
          "description": "अनुपात और आनुपातिक संबंध"
        },
        "RST": {
          "description": "पठन विज्ञान/तकनीकी"
        },
        "SL": {
          "description": "बोलना व सुनना"
        },
        "SP": {
          "description": "सांख्यिकी और संभाव्यता"
        },
        "SRT": {
          "description": "समानता, समकोण त्रिभुज, और त्रिकोणमिति"
        },
        "SSE": {
          "description": "अभिव्यक्तियों में संरचना देखना"
        },
        "TF": {
          "description": "त्रिकोणमितीय कार्य"
        },
        "VAR-1": {
          "description": "सामान्यीकृत समस्याओं के विशिष्ट समाधान खोजने के लिए, प्रोग्रामर अपने कोड में चर शामिल करते हैं ताकि एक ही एल्गोरिथ्म अलग-अलग इनपुट मानों का उपयोग करके चल सके"
        },
        "VAR-1.A": {
          "description": "स्ट्रिंग लिटरल्स बनाएं"
        },
        "VAR-1.B": {
          "description": "किसी विशेष विनिर्देश के लिए सबसे उपयुक्त डेटा प्रकार श्रेणी को पहचानें"
        },
        "VAR-1.C": {
          "description": "आदिम डेटा का प्रतिनिधित्व करने के लिए सही प्रकार के चर घोषित करें"
        },
        "VAR-1.D": {
          "description": "संदर्भ डेटा का प्रतिनिधित्व करने के लिए सही प्रकार के चर को परिभाषित करें।"
        },
        "VAR-1.E": {
          "description": "स्ट्रिंग क्लास के लिए: a. String ऑब्जेक्ट्स बनाएं. b. कॉल स्ट्रिंग मेथड्स"
        },
        "VAR-1.F": {
          "description": "रैपर क्लासेस के लिए: a. इंटीजर ऑब्जेक्ट्स बनाएं. b. कॉल इंटीजर मेथड्स. c. डबल ऑब्जेक्ट्स बनाएं। d. कॉल डबल मेथड्स।"
        },
        "VAR-1.G": {
          "description": "बताएं कि प्रोग्राम कोड में वेरिएबल का उपयोग कहां किया जा सकता है।"
        },
        "VAR-1.H": {
          "description": "इस कीवर्ड का उपयोग करने वाले ऑब्जेक्ट संदर्भ अभिव्यक्तियों का मूल्यांकन करें।"
        },
        "VAR-2": {
          "description": "डेटा में बड़ी मात्रा में डेटा या जटिल संबंधों को प्रबंधित करने के लिए, प्रोग्रामर कोड लिखते हैं जो प्रत्येक मान के लिए अलग-अलग चर बनाए बिना डेटा को एक डेटा संरचना में समूहित करता है।"
        },
        "VAR-2.A": {
          "description": "एक-आयामी (1D) सरणी ऑब्जेक्ट्स का उपयोग करके संबंधित आदिम या ऑब्जेक्ट संदर्भ डेटा के संग्रह का प्रतिनिधित्व करें।"
        },
        "VAR-2.B": {
          "description": "तत्वों को 1D सरणी में ट्रैवर्स करें।"
        },
        "VAR-2.C": {
          "description": "लूप के लिए एन्हांस्ड का उपयोग करके 1D सरणी ऑब्जेक्ट में तत्वों को ट्रैवर्स करें।"
        },
        "VAR-2.D": {
          "description": "ArrayList ऑब्जेक्ट्स का उपयोग करके संबंधित ऑब्जेक्ट संदर्भ डेटा के संग्रह का प्रतिनिधित्व करें।"
        },
        "VAR-2.E": {
          "description": "ArrayList ऑब्जेक्ट्स के लिए: • लूप के लिए या जबकि लूप का उपयोग करके ट्रैवर्स करें • लूप के लिए एन्हांस्ड का उपयोग करके ट्रैवर्स करें।"
        },
        "VAR-2.F": {
          "description": "द्वि-आयामी (2D) सरणी ऑब्जेक्ट्स का उपयोग करके संबंधित आदिम या ऑब्जेक्ट संदर्भ डेटा के संग्रह का प्रतिनिधित्व करें।"
        },
        "VAR-2.G": {
          "description": "2D सरणी ऑब्जेक्ट्स के लिए: • लूप के लिए नेस्टेड का उपयोग करके ट्रैवर्स करें। • लूप के लिए नेस्टेड एन्हांस्ड का उपयोग करके ट्रैवर्स करें।"
        },
        "VM": {
          "description": "वेक्टर और मैट्रिक्स मात्राएं"
        },
        "W": {
          "description": "लिखना"
        },
        "WHST": {
          "description": "HS/S/T लिखना"
        }
      }
    }
  }
}