{
  "es-MX": {
    "data": {
      "standard_categories": {
        "1": {
          "description": "Los estudiantes demuestran pensamiento creativo, construyen conocimiento y desarrollan productos y procesos innovadores utilizando tecnología."
        },
        "2": {
          "description": "Los estudiantes utilizan medios y entornos digitales para comunicarse y trabajar en colaboración, incluso a distancia, para apoyar el aprendizaje individual y contribuir al aprendizaje de otros."
        },
        "3": {
          "description": "Los estudiantes aplican herramientas digitales para recopilar, evaluar y usar la información."
        },
        "3-A-i": {
          "description": "La naturaleza del aprendizaje - Humanos contra máquinas"
        },
        "3-A-ii": {
          "description": "La naturaleza del aprendizaje - Búsqueda de patrones en los datos"
        },
        "3-A-iii": {
          "description": "La naturaleza del aprendizaje - Entrenamiento de un modelo"
        },
        "3-A-iv": {
          "description": "La naturaleza del aprendizaje - Construcción contra uso de un razonador"
        },
        "3-A-v": {
          "description": "Naturaleza del aprendizaje: ajuste de representaciones internas"
        },
        "3-A-vi": {
          "description": "Naturaleza del aprendizaje - aprender de la experiencia"
        },
        "3-B-i": {
          "description": "Redes neuronales - estructura de una red neuronal"
        },
        "3-B-ii": {
          "description": "Redes neuronales - ajuste de peso"
        },
        "3-C-i": {
          "description": "Conjuntos de datos - Conjuntos de características"
        },
        "3-C-ii": {
          "description": "Conjuntos de datos - grandes conjuntos de datos"
        },
        "3-C-iii": {
          "description": "Conjuntos de datos: Sesgo"
        },
        "4": {
          "description": "Los estudiantes usan habilidades de pensamiento crítico para planificar y realizar investigaciones, gestionar proyectos, resolver problemas y tomar decisiones informadas utilizando herramientas y recursos digitales apropiados."
        },
        "5": {
          "description": "Los estudiantes entienden cuestiones humanas, culturales y sociales relacionadas con la tecnología y practican comportamientos legales y éticos."
        },
        "6": {
          "description": "Los estudiantes demuestran un conocimiento sólido de conceptos, sistemas y operaciones de tecnología."
        },
        "AAP-1": {
          "description": "Para encontrar soluciones específicas a problemas generalizables, los programadores representan y organizan los datos de múltiples maneras."
        },
        "AAP-1.A": {
          "description": "Representar un valor con una variable."
        },
        "AAP-1.B": {
          "description": "Determinar el valor de una variable como resultado de una asignación."
        },
        "AAP-1.C": {
          "description": "Representar una lista o cadena usando una variable."
        },
        "AAP-1.D": {
          "description": "Para la abstracción de datos: \na. Desarrollar abstracción de datos usando listas para almacenar múltiples elementos.\nb. Explicar cómo el uso de la abstracción de datos gestiona la complejidad en el código del programa."
        },
        "AAP-2": {
          "description": "La forma en que se secuencian y combinan las declaraciones en un programa determina el resultado calculado. Los programas incorporan construcciones de iteración y selección para representar la repetición y tomar decisiones para manejar valores de entrada variados."
        },
        "AAP-2.A": {
          "description": "Expresar un algoritmo que usa secuenciación sin usar un lenguaje de programación."
        },
        "AAP-2.B": {
          "description": "Representa un proceso algorítmico paso a paso usando instrucciones de código secuenciales."
        },
        "AAP-2.C": {
          "description": "Evaluar expresiones que utilizan operadores aritméticos."
        },
        "AAP-2.D": {
          "description": "Evalúa expresiones que manipulan cadenas."
        },
        "AAP-2.E": {
          "description": "Para las relaciones entre dos variables, expresiones o valores: \na. Representar usando operadores relacionales\nb. Evaluar expresiones que utilizan operadores relacionales."
        },
        "AAP-2.F": {
          "description": "Para las relaciones entre valores booleanos:\na. Representar usando operadores lógicos.\nb. Evaluar expresiones que utilizan operadores lógicos."
        },
        "AAP-2.G": {
          "description": "Expresar un algoritmo que usa secuenciación sin usar un lenguaje de programación."
        },
        "AAP-2.H": {
          "description": "Para la selección:\na. Representar usando declaraciones condicionales.\nb. Determinar el resultado de las declaraciones condicionales."
        },
        "AAP-2.I": {
          "description": "Para la selección anidada:\na. Representar usando sentencias condicionales anidadas. \nb. Determinar el resultado de las declaraciones condicionales anidadas."
        },
        "AAP-2.J": {
          "description": "Expresar un algoritmo que usa secuenciación sin usar un lenguaje de programación."
        },
        "AAP-2.K": {
          "description": "Para iteración:\na. Representar usando sentencias de iteración.\nb. Determinar el resultado o efecto secundario de las sentencias de iteración."
        },
        "AAP-2.L": {
          "description": "Compare múltiples algoritmos para determinar si producen el mismo efecto secundario o resultado."
        },
        "AAP-2.M": {
          "description": "Para algoritmos: \na. Crear algoritmos. \nb. Combinar y modificar algoritmos existentes."
        },
        "AAP-2.N": {
          "description": "Para operaciones de lista:\na. Escribir expresiones que utilicen procedimientos de indexación de listas y listas.\nb. Evaluar expresiones que utilicen procedimientos de indexación de listas y listas."
        },
        "AAP-2.O": {
          "description": "Para algoritmos que involucran elementos de una lista:\na. representar usando sentencias iterativas para atravesar una lista.\nb. Determinar el resultado de un algoritmo con traversos de lista."
        },
        "AAP-2.P": {
          "description": "Para algoritmos de búsqueda binaria:\na. Determinar el número de iteraciones necesarias para encontrar un valor en un conjunto de datos. \nb. Explicar los requisitos necesarios para completar una búsqueda binaria."
        },
        "AAP-3": {
          "description": "Los programadores descomponen los problemas en piezas más pequeñas y manejables. Al crear procedimientos y aprovechar parámetros, los programadores generalizan procesos que pueden reutilizarse. Los procedimientos permiten a los programadores aprovechar el código existente que ya ha sido probado, lo que permite a los programadores escribir programas de manera más rápida y con más confianza."
        },
        "AAP-3.A": {
          "description": "Para convocatorias de trámite:\na. Escribir declaraciones para llamar procedimientos.\nb. Determinar el resultado o efecto de una convocatoria de trámite."
        },
        "AAP-3.B": {
          "description": "Para convocatorias de trámite:\na. Escribir declaraciones para llamar procedimientos.\nb. Determinar el resultado o efecto de una convocatoria de trámite."
        },
        "AAP-3.C": {
          "description": "Desarrollar abstracciones procesales para gestionar la complejidad en un programa mediante procedimientos de escritura."
        },
        "AAP-3.D": {
          "description": "Seleccione bibliotecas apropiadas o segmentos de código existentes para usar en la creación de nuevos programas."
        },
        "AAP-3.E": {
          "description": "Para generar valores aleatorios: \na. Escribe expresiones para generar posibles valores. \nb. Evaluar expresiones para determinar los posibles resultados."
        },
        "AAP-3.F": {
          "description": "Para simulaciones:\na. Explique cómo se pueden usar las computadoras para representar fenómenos o resultados del mundo real. \nb. Comparar el uso de simulaciones con contextos del mundo real."
        },
        "AAP-4": {
          "description": "Existen problemas que la computadora no puede resolver, e incluso cuando la computadora puede resolver un problema, es posible que no pueda hacerlo en un tiempo razonable."
        },
        "AAP-4.A": {
          "description": "Para determinar la eficiencia de un algoritmo:\na. Explicar la diferencia entre algoritmos que se ejecutan en tiempo razonable y aquellos que no se ejecutan en tiempo razonable. \nb. Identificar situaciones en las que una solución heurística pueda ser más apropiada."
        },
        "AAP-4.B": {
          "description": "Explicar la existencia de problemas indecibles en la informática."
        },
        "AP": {
          "description": "Algoritmos y programación"
        },
        "APR": {
          "description": "Aritmética con polinomios y expresiones racionales"
        },
        "BF": {
          "description": "Funciones de construcción"
        },
        "BI-1": {
          "description": "Las computadoras perciben el mundo usando sensores"
        },
        "BI-2": {
          "description": "Los agentes mantienen representaciones del mundo y las utilizan para el razonamiento"
        },
        "BI-3": {
          "description": "Las computadoras pueden aprender de los datos"
        },
        "BI-4": {
          "description": "Los agentes inteligentes requieren muchos tipos de conocimiento para interactuar naturalmente con los humanos"
        },
        "BI-5": {
          "description": "La IA puede impactar a la sociedad tanto de manera positiva como negativa"
        },
        "C": {
          "description": "Túnel"
        },
        "CC": {
          "description": "Conteo y cardenalidad"
        },
        "CD": {
          "description": "Computadoras y dispositivos de comunicación"
        },
        "CED": {
          "description": "Creación de ecuaciones"
        },
        "CI": {
          "description": "Impactos comunitarios, globales y éticos"
        },
        "CL": {
          "description": "Colaboración"
        },
        "CN": {
          "description": "El sistema de números complejos"
        },
        "CO": {
          "description": "Congruencia"
        },
        "CON-1": {
          "description": "La forma en que las variables y los operadores se secuencian y combinan en una expresión determina el resultado calculado."
        },
        "CON-1.A": {
          "description": "Evaluar expresiones aritméticas en un código de programa"
        },
        "CON-1.B": {
          "description": "Evaluar lo que se almacena en una variable como resultado de una expresión con una instrucción de asignación"
        },
        "CON-1.C": {
          "description": "Evaluar expresiones aritméticas que utilizan casting."
        },
        "CON-1.D": {
          "description": "Evaluar expresiones que utilizan los métodos de clase Math."
        },
        "CON-1.E": {
          "description": "Evaluar expresiones booleanas que utilizan operadores relacionales en el código del programa."
        },
        "CON-1.F": {
          "description": "Evaluar expresiones booleanas compoudn en el código del programa."
        },
        "CON-1.G": {
          "description": "Compara y contrasta expresiones booleanas equivalentes."
        },
        "CON-1.H": {
          "description": "Compare referencias a objetos usando expresiones booleanas en el código del programa."
        },
        "CON-2": {
          "description": "Los programadores incorporan iteración y selección en el código como una forma de proporcionar instrucciones para que la computadora procese cada uno de los muchos valores de entrada posibles"
        },
        "CON-2.A": {
          "description": "Representar procesos lógicos de ramificación mediante el uso de sentencias condicionales."
        },
        "CON-2.B": {
          "description": "Representar procesos lógicos de ramificación mediante el uso de sentencias condicionales anidadas."
        },
        "CON-2.C": {
          "description": "Representar procesos iterativos usando un mieloop."
        },
        "CON-2.D": {
          "description": "Para algoritmos en el contexto de una especificación particular que no requiere el uso de travesales: • Identificar algoritmos estándar. • Modificar algoritmos estándar. • Desarrollar un algoritmo."
        },
        "CON-2.E": {
          "description": "Representan procesos iterativos usando un bucle for."
        },
        "CON-2.F": {
          "description": "Para algoritmos en el contexto de una especificación particular que involucra objetos String • Identificar algoritmos estándar. • Modificar algoritmos estándar. • Desarrollar un algoritmo."
        },
        "CON-2.G": {
          "description": "Representar procesos iterativos anidados"
        },
        "CON-2.H": {
          "description": "Recuentos de ejecución de sentencias de cómputos y comparación informal en tiempo de ejecución de sentencias iterativas."
        },
        "CON-2.I": {
          "description": "Para algoritmos en el contexto de una especificación particular que requiere el uso de travesales de matriz: • Identificar algoritmos estándar. • Modificar algoritmos estándar. • Desarrollar un algoritmo."
        },
        "CON-2.J": {
          "description": "Para algoritmos en el contexto de una especificación particular que requiera el uso de traversales ArrayList: • Identificar algoritmos estándar. • Modificar algoritmos estándar. • Desarrollar un algoritmo."
        },
        "CON-2.K": {
          "description": "Aplicar algoritmos de búsqueda secuencial/lineal para buscar información específica en objetos array o ArrayList."
        },
        "CON-2.L": {
          "description": "Aplicar algoritmos de selección y de inserción para ordenar los elementos de los objetos array o ArrayList."
        },
        "CON-2.M": {
          "description": "Recuentos de ejecución de estados de cómputos y comparación informal de tiempo de ejecución de algoritmos de clasificación."
        },
        "CON-2.N": {
          "description": "Para Algoritmos en el contexto de una especificación particular que requiere el uso de transversales de matriz 2D: • Identificar algoritmos estándar. • Modificar algoritmos estándar. • Desarrollar un algoritmo."
        },
        "CON-2.O": {
          "description": "Determinar el resultado de ejecutar métodos recursivos."
        },
        "CON-2.P": {
          "description": "Aplique algoritmos de búsqueda recursiva a la información de los objetos String, 1D array o ArrayList."
        },
        "CON-2.Q": {
          "description": "Aplicar algoritmos recursivos para ordenar elementos de objetos array o ArrayList."
        },
        "CP": {
          "description": "Probabilidad condicional y las reglas de probabilidad"
        },
        "CPP": {
          "description": "Práctica de computación y programación"
        },
        "CRD-1": {
          "description": "La incorporación de múltiples perspectivas a través de la colaboración, mejora las innovaciones informáticas que se están desarrollando."
        },
        "CRD-1.A": {
          "description": "Explique cómo se mejoran las innovaciones informáticas a través de la colaboración."
        },
        "CRD-1.B": {
          "description": "Explicar cómo las innovaciones informáticas son desarrolladas por grupos de personas."
        },
        "CRD-1.C": {
          "description": "Demostrar habilidades interpersonales efectivas durante la colaboración."
        },
        "CRD-2": {
          "description": "Los desarrolladores crean e innovan utilizando un proceso de diseño iterativo centrado en el usuario, que incorpora ciclos de implementación/retroalimentación y que deja un amplio espacio para la experimentación y la asunción de riesgos."
        },
        "CRD-2.A": {
          "description": "Describir el propósito de una innovación informática."
        },
        "CRD-2.B": {
          "description": "Explicar cómo funciona un programa o segmento de código."
        },
        "CRD-2.C": {
          "description": "Identificar entrada (s) a un programa."
        },
        "CRD-2.D": {
          "description": "Identificar los productos producidos por un programa."
        },
        "CRD-2.E": {
          "description": "Desarrollar un programa usando un proceso de desarrollo."
        },
        "CRD-2.F": {
          "description": "Diseñar un programa y su interfaz de usuario."
        },
        "CRD-2.G": {
          "description": "Describir el propósito de un segmento de código o programa escribiendo documentación."
        },
        "CRD-2.H": {
          "description": "Reconocer los segmentos de código utilizados de otras fuentes."
        },
        "CRD-2.I": {
          "description": "Por errores en un algoritmo o programa: \na. Identificar el error. \nb. Corregir el error."
        },
        "CRD-2.J": {
          "description": "Identificar las entradas y los resultados esperados correspondientes o comportamientos que pueden ser utilizados para verificar la exactitud de un algoritmo o programa."
        },
        "CS": {
          "description": "Sistemas de computación"
        },
        "CSN-1": {
          "description": "Los sistemas informáticos y las redes facilitan la forma en que se transfieren los datos."
        },
        "CSN-1.A": {
          "description": "Explique cómo los dispositivos informáticos funcionan juntos en una red."
        },
        "CSN-1.B": {
          "description": "Explique cómo funciona Internet."
        },
        "CSN-1.C": {
          "description": "Explique cómo se envían los datos a través de Internet vía paquetes."
        },
        "CSN-1.D": {
          "description": "Describir las diferencias entre Internet y la World Wide Web."
        },
        "CSN-1.E": {
          "description": "Para sistemas tolerantes a fallas, como Internet:\na. Describir los beneficios de la tolerancia a fallas\nb. Explicar cómo un sistema dado es tolerante a fallas\nc. Identificar vulnerabilidades en un sistema."
        },
        "CSN-2": {
          "description": "La computación paralela y distribuida aprovecha múltiples computadoras para resolver problemas complejos más rápidamente o procesar grandes conjuntos de datos."
        },
        "CSN-2.A": {
          "description": "Compare soluciones de problemas que utilizan computación secuencial, paralela y distribuida."
        },
        "CSN-2.B": {
          "description": "Determinar la eficiencia de las soluciones secuenciales y paralelas."
        },
        "CSN-2.C": {
          "description": "Describir los beneficios y desafíos de la computación paralela y distribuida."
        },
        "CT": {
          "description": "Pensamiento computacional"
        },
        "D1": {
          "description": "Desarrollo de preguntas y planeación de inqueries"
        },
        "D2.Civ": {
          "description": "Civismo"
        },
        "D2.Eco": {
          "description": "Economía"
        },
        "D3.Claims": {
          "description": "Desarrollo de Reclamaciones y Uso de Evidencias"
        },
        "D3.Sources": {
          "description": "Recopilación y Evaluación de Fuentes"
        },
        "D4.Action": {
          "description": "Tomar medidas informadas"
        },
        "D4.Conclusions": {
          "description": "Comunicar y criticar las conclusiones"
        },
        "DA": {
          "description": "Datos y análisis"
        },
        "DAT-1": {
          "description": "La forma en que el ordenador representa los datos es diferente de la forma en que los datos se interpretan y se muestran al usuario. Los programas se utilizan para traducir los datos en una representación que sea más fácil de entender para las personas."
        },
        "DAT-1.A": {
          "description": "Explica cómo se pueden representar los datos usando bits."
        },
        "DAT-1.B": {
          "description": "Explicar las consecuencias de usar bits para representar datos."
        },
        "DAT-1.C": {
          "description": "Para números binarios:\na. Calcular el equivalente binario (base 2) de un entero positivo (base 10) y viceversa. \nb. Comparar y ordenar números binarios."
        },
        "DAT-1.D": {
          "description": "Compara los algoritmos de compresión de datos para determinar cuál es el mejor en un contexto determinado."
        },
        "DAT-2": {
          "description": "Los programas pueden ser utilizados para procesar datos, lo que permite a los usuarios descubrir información y crear nuevos conocimientos."
        },
        "DAT-2.A": {
          "description": "Describir qué información se puede extraer de los datos."
        },
        "DAT-2.B": {
          "description": "Describir qué información se puede extraer de los metadatos."
        },
        "DAT-2.C": {
          "description": "Identificar los desafíos asociados con el procesamiento de datos."
        },
        "DAT-2.D": {
          "description": "Extraer información de datos usando un programa."
        },
        "DAT-2.E": {
          "description": "Explique cómo se pueden utilizar los programas para obtener información y conocimientos a partir de los datos."
        },
        "EE": {
          "description": "Expresiones y ecuaciones"
        },
        "ESS": {
          "description": "Ciencias de la Tierra y el Espacio"
        },
        "ESS1": {
          "description": "El lugar de la Tierra en el Universo"
        },
        "ESS2": {
          "description": "Sistemas de la Tierra"
        },
        "ESS3": {
          "description": "Tierra y Actividad Humana"
        },
        "ETS": {
          "description": "Ingeniería en las Ciencias"
        },
        "ETS1": {
          "description": "Diseño Ingenieril"
        },
        "F": {
          "description": "Funciones"
        },
        "G": {
          "description": "Geometría"
        },
        "GMD": {
          "description": "Medición Geométrica Y Dimensión"
        },
        "GPE": {
          "description": "Expresar propiedades geométricas con ecuaciones"
        },
        "IC": {
          "description": "Impactos de la computación"
        },
        "ID": {
          "description": "Interpretación de datos categóricos y cuantitativos"
        },
        "IF": {
          "description": "Funciones de interpretación"
        },
        "IOC-1": {
          "description": "Si bien las innovaciones informáticas suelen estar diseñadas para lograr un propósito específico, pueden tener consecuencias no deseadas."
        },
        "IOC-1.A": {
          "description": "Explique cómo un efecto de una innovación informática puede ser beneficioso y dañino."
        },
        "IOC-1.B": {
          "description": "Explique cómo una innovación informática puede tener un impacto más allá de su propósito previsto."
        },
        "IOC-1.C": {
          "description": "Describir los problemas que contribuyen a la brecha digital."
        },
        "IOC-1.D": {
          "description": "Explique cómo existe el sesgo en las innovaciones informáticas."
        },
        "IOC-1.E": {
          "description": "Explicar cómo las personas participan en los procesos de resolución de problemas a escala."
        },
        "IOC-1.F": {
          "description": "Explicar cómo el uso de la computación podría plantear preocupaciones legales y éticas."
        },
        "IOC-2": {
          "description": "El uso de las innovaciones informáticas puede implicar riesgos para tu seguridad personal y tu identidad."
        },
        "IOC-2.A": {
          "description": "Describir los riesgos para la privacidad derivados de la recopilación y almacenamiento de datos personales en un sistema informático."
        },
        "IOC-2.B": {
          "description": "Explique cómo los recursos informáticos pueden proteger y utilizarse indebidamente."
        },
        "IOC-2.C": {
          "description": "Explique cómo se obtiene el acceso no autorizado a los recursos informáticos."
        },
        "L": {
          "description": "Idioma"
        },
        "LE": {
          "description": "Modelos Lineales, Cuadráticos y Exponenciales ★"
        },
        "LS": {
          "description": "Ciencias de la vida"
        },
        "LS1": {
          "description": "De las moléculas a los organismos: estructuras y procesos"
        },
        "LS2": {
          "description": "Ecosistemas: Interacciones, Energía y Dinámica"
        },
        "LS3": {
          "description": "Herencia: Herencia y Variación de Rasgos"
        },
        "LS4": {
          "description": "Evolución Biológica: Unidad y Diversidad"
        },
        "MD": {
          "description": "Usando Probabilidades para Tomar Decisiones"
        },
        "MG": {
          "description": "Modelado con geometría"
        },
        "MOD-1": {
          "description": "Algunos objetos o conceptos se representan con tanta frecuencia que los programadores pueden aprovechar el código existente que ya ha sido probado, lo que les permite escribir soluciones más rápidamente y con un mayor grado de confianza"
        },
        "MOD-1.A": {
          "description": "Llame a los métodos de clase System para generar salida a la consola."
        },
        "MOD-1.B": {
          "description": "Explicar la relación entre una clase y un objeto."
        },
        "MOD-1.C": {
          "description": "Identificar, usando su firma, al constructor correcto que se llama."
        },
        "MOD-1.D": {
          "description": "Para crear objeto: a. Crear objetos llamando a constructores sin parámetros. b. Crear objetos llamando a constructores con parámetros."
        },
        "MOD-1.E": {
          "description": "Llame a métodos de vacío no estáticos sin parámetros."
        },
        "MOD-1.F": {
          "description": "Llamar a métodos de vacío no estáticos con parámetros"
        },
        "MOD-1.G": {
          "description": "Llamar a métodos no estáticos no vacíos con o sin parámetros"
        },
        "MOD-1.H": {
          "description": "Llamar a métodos estáticos."
        },
        "MOD-2": {
          "description": "Los programadores utilizan código para representar un objeto físico o concepto no físico, real o imaginario, definiendo una clase basada en los attirbutes y/o comportamientos del objeto o concepto"
        },
        "MOD-2.A": {
          "description": "Designe restricciones de acceso y visibilidad a clases, datos, constructores y métodos."
        },
        "MOD-2.B": {
          "description": "Defina variables de instancia para que los atributos se inicialicen a través de los constructores de una clase."
        },
        "MOD-2.C": {
          "description": "Desribe la funcionalidad y uso del código de programa a través de comentarios."
        },
        "MOD-2.D": {
          "description": "Definir comportamientos de un objeto a través de métodos no vacíos sin prámetros escritos en una clase."
        },
        "MOD-2.E": {
          "description": "Definir comportamientos de un objeto a través de métodos void con o sin parámetros escritos en una clase."
        },
        "MOD-2.F": {
          "description": "Definir comportamientos de un objeto a través de métodos no nulos con parámetros escritos en una clase."
        },
        "MOD-2.G": {
          "description": "Definir comportamientos de una clase a través de métodos estáticos."
        },
        "MOD-2.H": {
          "description": "Define las variables estáticas que pertenecen a la clase."
        },
        "MOD-3": {
          "description": "Cuando las clases múltiples contienen atributos y comportamientos comunes, los programadores crean una nueva clase que contiene los atributos compartidos y los comportamientos que forman una jeraquía. Las modificaciones realizadas en el nivel más alto de la jerarquía se aplican a las subclases."
        },
        "MOD-3.A": {
          "description": "Designar visibilidad privada de variables de instancia para encapsular los atributos de un objeto."
        },
        "MOD-3.B": {
          "description": "Crear una relación de herencia de una subclase a la superclase."
        },
        "MOD-3.C": {
          "description": "Definir variables de referencia de una superclase a asignar a un objeto de una subclase en la misma jerarquía."
        },
        "MOD-3.D": {
          "description": "Métodos de llamada en una relación de herencia."
        },
        "MOD-3.E": {
          "description": "Llamar a los métodos de clase Object a través de la herencia."
        },
        "MP": {
          "description": "Prácticas matemáticas"
        },
        "NBT": {
          "description": "Número Y Operaciones En Base Diez"
        },
        "NF": {
          "description": "Número y Operaciones — Fracciones"
        },
        "NI": {
          "description": "Redes e Internet"
        },
        "NS": {
          "description": "El Sistema de Números"
        },
        "OA": {
          "description": "Operaciones y pensamiento algebraico"
        },
        "PS": {
          "description": "Ciencias Físicas"
        },
        "PS1": {
          "description": "La materia y sus interacciones"
        },
        "PS2": {
          "description": "Movimiento y Estabilidad: Fuerzas e Interacciones"
        },
        "PS3": {
          "description": "Energía"
        },
        "PS4": {
          "description": "Las ondas y sus aplicaciones en las tecnologías en la transferencia de información"
        },
        "Q": {
          "description": "Cantidades"
        },
        "REI": {
          "description": "Razonamiento con ecuaciones y desigualdades"
        },
        "RF": {
          "description": "Habilidades Fundacionales de Lectura"
        },
        "RH": {
          "description": "Leyendo Historia/Estudios Sociales"
        },
        "RI": {
          "description": "Lectura informativa"
        },
        "RL": {
          "description": "Lectura de literatura"
        },
        "RN": {
          "description": "El sistema de números reales"
        },
        "RP": {
          "description": "Relaciones y relaciones proporcionales"
        },
        "RST": {
          "description": "Ciencia de la lectura/técnica"
        },
        "SL": {
          "description": "Hablar y escuchar"
        },
        "SP": {
          "description": "Estadística y Probabilidad"
        },
        "SRT": {
          "description": "Similaridad, triángulos rectos y trigonometría"
        },
        "SSE": {
          "description": "Ver estructura en expresiones"
        },
        "TF": {
          "description": "Funciones trigonométricas"
        },
        "VAR-1": {
          "description": "Para encontrar soluciones específicas a problemas generalizables, los programadores incluyen variables en su código para que el mismo algoritmo se ejecute usando diferentes valores de entrada"
        },
        "VAR-1.A": {
          "description": "Crear literales de cadena"
        },
        "VAR-1.B": {
          "description": "Identificar la categoría de tipo de datos más apropiada para una especificación particular"
        },
        "VAR-1.C": {
          "description": "Declarar variables de los tipos correctos para representar datos primitivos"
        },
        "VAR-1.D": {
          "description": "Definir variables de los tipos correctos para representar datos de referencia."
        },
        "VAR-1.E": {
          "description": "Para la clase String: a. Crear objetos String. b. Llamar a los métodos String."
        },
        "VAR-1.F": {
          "description": "Para clases envolvedora: a. Crear objetos Integer. b. Llamar a métodos Integer. c. Crear objetos Double. d. Llamar métodos Double."
        },
        "VAR-1.G": {
          "description": "Explicar dónde se pueden usar las variables en el código del programa."
        },
        "VAR-1.H": {
          "description": "Evaluar expresiones de referencia de objeto que utilizan la palabra clave this."
        },
        "VAR-2": {
          "description": "Para administrar grandes cantidades de datos o relaciones complejas en los datos, los programadores escriben código que agrupa los datos en una sola estructura de datos sin crear variables individuales para cada valor."
        },
        "VAR-2.A": {
          "description": "Representar colecciones de datos de referencia primitivos o de objetos relacionados utilizando objetos de matriz unidimensionales (1D)."
        },
        "VAR-2.B": {
          "description": "Atravesa los elementos en una matriz 1D."
        },
        "VAR-2.C": {
          "description": "Atravesa los elementos en un objeto de matriz 1D usando un bucle for mejorado."
        },
        "VAR-2.D": {
          "description": "Representar colecciones de datos de referencia de objetos relacionados usando objetos ArrayList."
        },
        "VAR-2.E": {
          "description": "Para objetos ArrayList: • Traverse usando un bucle for o while. • Traverse usando un bucle for mejorado."
        },
        "VAR-2.F": {
          "description": "Representar colecciones de datos de referencia primitivos o de objetos relacionados utilizando objetos de matriz bidimensionales (2D)."
        },
        "VAR-2.G": {
          "description": "Para objetos de matriz 2D: • Traverse usando bucles anidado para. • Traverse usando bucles mejorados anidados para."
        },
        "VM": {
          "description": "Cantidades vectoriales y matriciales"
        },
        "W": {
          "description": "Escribir"
        },
        "WHST": {
          "description": "Escritura HS/S/T"
        }
      }
    }
  }
}