{
  "kn-IN": {
    "data": {
      "standards": {
        "ccela/3.RL.4": {
          "description": "ಪಠ್ಯದಲ್ಲಿ ಬಳಸಿದ ಹಾಗೆ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳ ಅರ್ಥವನ್ನು ನಿರ್ಧರಿಸಿ ಮತ್ತು ಅಕ್ಷರಶಃ ಮತ್ತು ಅಕ್ಷರಶಃ ಅಲ್ಲದ ಭಾಷೆಗೆ ವ್ಯತ್ಯಾಸವನ್ನು ಗುರುತಿಸಿ."
        },
        "ccela/4.RL.7": {
          "description": "ಒಂದು ಕಥೆ ಅಥವಾ ನಾಟಕದ ಪಠ್ಯದ ಮತ್ತು ಪಠ್ಯದ ಮೌಖಿಕ ಪ್ರಸ್ತುತಿ ಅಥವಾ ದೃಶ್ಯ ಪ್ರಸ್ತುತಿ ಮಧ್ಯೆ ಸಂಪರ್ಕ ಸಾಧಿಸಿ ಮತ್ತು ನಿರ್ದಿಷ್ಟ ವಿವರಗಳು ಮತ್ತು ನಿರ್ದೇಶನಗಳನ್ನು ಪಠ್ಯದಲ್ಲಿ ಪ್ರತಿಫಲಿಸುತ್ತದೆ ಎಂಬುದನ್ನು ಗುರುತಿಸಿ."
        },
        "ccela/5.RL.4": {
          "description": "ರೂಪಕಗಳು ಮತ್ತು ಸ್ಮೈಲೀಗಳಂತಹ ಸಚಿತ್ರ ಭಾಷೆಯೂ ಸೇರಿದಂತೆ ಪಠ್ಯದಲ್ಲಿ ಬಳಸಿದ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳ ಅರ್ಥವನ್ನು ತಿಳಿದುಕೊಳ್ಳಿ."
        },
        "ccela/5.RL.7": {
          "description": "ಪಠ್ಯದ ಅರ್ಥ, ಟೋನ್ ಅಥವಾ ಸೌಂದರ್ಯಕ್ಕೆ ಹೇಗೆ ದೃಶ್ಯ ಮತ್ತು ಮಲ್ಟಿಮೀಡಿಯಾ ಅಂಶಗಳು ಕೊಡುಗೆ ನೀಡುತ್ತವೆ ಎಂದು ವಿಶ್ಲೇಷಣೆ ಮಾಡಿ (ಉದಾ., ಕಲ್ಪನಾ ಕಾದಂಬರಿ, ಕಥೆ, ಜಾನಪದ, ಮಿಥ್ಯ, ಕವನದ ಮಲ್ಟಿಮೀಡಿಯಾ ಪ್ರಸ್ತುತಿ)."
        },
        "ccela/6.SL.1": {
          "description": "ಇತರರ ಐಡಿಯಾಗಳು ಮತ್ತು ತಮ್ಮದೇ ಐಡಿಯಾಗಳನ್ನು ಸ್ಪಷ್ಟವಾಗಿ ಅಭಿವ್ಯಕ್ತಿಗೊಳಿಸಿ ಗ್ರೇಡ್ 6 ವಿಷಯಗಳು, ಪಠ್ಯಗಳು ಮತ್ತು ಸಮಸ್ಯೆಗಳ ಕುರಿತು ವೈವಿಧ್ಯಮಯ ಪಾಲುದಾರರೊಂದಿಗೆ ವಿವಿಧ ಸಂಯೋಜನಾತ್ಮಕ ಚರ್ಚೆಗಳಲ್ಲಿ (ಮುಖಾಮುಖಿ, ಗುಂಪುಗಳಲ್ಲಿ ಮತ್ತು ಶಿಕ್ಷಕರ ನೇತೃತ್ವದ) ಪರಿಣಾಮಕಾರಿಯಾಗಿ ತೊಡಗಿಸಿಕೊಳ್ಳಿ."
        },
        "ccela/7.SL.1": {
          "description": "ಇತರರ ಐಡಿಯಾಗಳು ಮತ್ತು ತಮ್ಮದೇ ಐಡಿಯಾಗಳನ್ನು ಸ್ಪಷ್ಟವಾಗಿ ಅಭಿವ್ಯಕ್ತಿಗೊಳಿಸಿ ಗ್ರೇಡ್ 7 ವಿಷಯಗಳು, ಪಠ್ಯಗಳು ಮತ್ತು ಸಮಸ್ಯೆಗಳ ಕುರಿತು ವೈವಿಧ್ಯಮಯ ಪಾಲುದಾರರೊಂದಿಗೆ ವಿವಿಧ ಸಂಯೋಜನಾತ್ಮಕ ಚರ್ಚೆಗಳಲ್ಲಿ (ಮುಖಾಮುಖಿ, ಗುಂಪುಗಳಲ್ಲಿ ಮತ್ತು ಶಿಕ್ಷಕರ ನೇತೃತ್ವದ) ಪರಿಣಾಮಕಾರಿಯಾಗಿ ತೊಡಗಿಸಿಕೊಳ್ಳಿ."
        },
        "ccmath/MP.1": {
          "description": "ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸಲು ಮತ್ತು ಸಂರಕ್ಷಿಸಲು ಸೂಕ್ತವಾಗಿದೆ"
        },
        "ccmath/MP.2": {
          "description": "ಅಮೂರ್ತವಾಗಿ ಮತ್ತು ಪರಿಣಾಮಾತ್ಮಕವಾಗಿ ಕಾರಣ"
        },
        "ccmath/MP.5": {
          "description": "ಸೂಕ್ತ ಪರಿಕರಗಳನ್ನು ವ್ಯೂಹಾತ್ಮಕವಾಗಿ ಬಳಸಿ"
        },
        "ccmath/MP.6": {
          "description": "ನಿಖರತೆಗೆ ಗಮನವಿಡಿ"
        },
        "ccmath/MP.7": {
          "description": "ರಚನೆಯನ್ನು ನೋಡಿ ಮತ್ತು ಅದರ ಬಳಕೆ ಮಾಡಿಕೊಳ್ಳಿ"
        },
        "ccmath/MP.8": {
          "description": "ಪುನರಾವರ್ತಿತ ರೀಸನಿಂಗ್‌ನಲ್ಲಿ ನಿಯತತೆಯನ್ನು ಎದುರು ನೋಡಿ ಮತ್ತು ಅಭಿವ್ಯಕ್ತಿ ಇರಲಿ"
        },
        "csta2011/CPP.L1:6-06": {
          "description": "ಬ್ಲಾಕ್ ಆಧರಿತ ವಿಶುವಲ್ ಪ್ರೋಗ್ರಾಮಿಂಗ್‌ ಭಾಷೆಯನ್ನು ಬಳಸಿ ಸಮಸ್ಯೆ ಪರಿಹಾರಗಳನ್ನು ಅನುಷ್ಠಾನಗೊಳಿಸಿ."
        },
        "csta2011/CT.L2:1": {
          "description": "ವಿನ್ಯಾಸ ಪರಿಹಾರಗಳಿಗೆ ಅಲ್ಗೊರಿಥಮ್‌ ಸಂಬಂಧಿ ಸಮಸ್ಯೆ ಪರಿಹಾರದಲ್ಲಿ ಪ್ರಾಥಮಿಕ ಕ್ರಮಗಳನ್ನು ಬಳಸಿ (ಉದಾ., ಸಮಸ್ಯೆ ಹೇಳಿಕೆ ಮತ್ತು ಅನಾವರಣ, ಮಾದರಿ ಘಟನೆಗಳ ತಪಾಸಣೆ, ವಿನ್ಯಾಸ, ಪರಿಹಾರವನ್ನು ಅನುಷ್ಠಾನಗೊಳಿಸುವುದು, ಪರೀಕ್ಷಿಸುವುದು ಮತ್ತು ಮೌಲೀಕರಣ)."
        },
        "csta2011/CT.L2:12": {
          "description": "ಉಪ ಸಮಸ್ಯೆಗಳಿಗೆ ಸಮಸ್ಯೆಯನ್ನು ಡಿಕಂಪೋಸ್ ಮಾಡಲು ಅಬ್‌ಸ್ಟ್ರಾಕ್ಷನ್ ಬಳಸಿ."
        },
        "csta2011/CT.L2:6": {
          "description": "ಅನುಸರಿಸಲಾಗುವ ಸೂಚನೆಗಳ ಅನುಕ್ರಮವನ್ನು ವಿವರಿಸಿ ಮತ್ತು ವಿಶ್ಲೇಷಿಸಿ (ಉದಾ., ನಿಯಮ ಮತ್ತು ಅಲ್ಗೊರಿಥಂಗಳನ್ನು ಆಧರಿಸಿದ ವೀಡಿಯೋ ಗೇಮ್‌ನಲ್ಲಿ ಕ್ಯಾರೆಕ್ಟರ್‌ನ ವರ್ತನೆಯನ್ನು ವಿವರಿಸಿ)."
        },
        "csta2011/CT.L2:7": {
          "description": "ಪಠ್ಯ, ಧ್ವನಿಗಳು, ಚಿತ್ರಗಳು ಮತ್ತು ಸಂಖ್ಯೆಗಳು ಸೇರಿದಂತೆ ಹಲವು ವಿಧಗಳಲ್ಲಿ ಡೇಟಾ ಪ್ರತಿನಿಧಿಸಿ."
        },
        "csta2011/CT.L2:8": {
          "description": "ಸಮಸ್ಯೆ ಸ್ಥಿತಿಗಳು, ರಚನೆಗಳು ಮತ್ತು ಡೇಟಾದ ಗೋಚರ ಪ್ರತಿನಿಧಿತ್ವಗಳನ್ನು ಬಳಸಿ (ಉದಾ., ಗ್ರಾಫ್‌ಗಳು, ಚಾರ್ಟ್‌ಗಳು, ನೆಟ್‌ವರ್ಕ್‌ ಡಯಾಗ್ರಾಮ್‌ಗಳು, ಫ್ಲೋಚಾರ್ಟ್‌ಗಳು)."
        },
        "iste/1.a": {
          "description": "ಹೊಸ ಐಡಿಯಾಗಳು, ಉತ್ಪನ್ನಗಳು ಅಥವಾ ಪ್ರಕ್ರಿಯೆಗಳನ್ನು ಜನರೇಟ್ ಮಾಡಲು ಪ್ರಸ್ತುತ ಜ್ಞಾನವನ್ನು ಅನ್ವಯಿಸಿ."
        },
        "iste/1.b": {
          "description": "ವೈಯಕ್ತಿಕ ಅಥವಾ ಸಮೂಹ ಅಭಿವ್ಯಕ್ತಿ ರೂಪದಲ್ಲಿ ಮೂಲ ಕೆಲಸಗಳನ್ನು ರಚಿಸಿ."
        },
        "iste/1.c": {
          "description": "ಸಂಕೀರ್ಣ ಸಿಸ್ಟಮ್‌ಗಳು ಮತ್ತು ಸಮಸ್ಯೆಗಳನ್ನು ಎಕ್ಸ್‌ಪ್ಲೋರ್‌ ಮಾಡಲು ಮಾಡೆಲ್‌ಗಳು ಮತ್ತು ಸಿಮ್ಯುಲೇಶನ್‌ಗಳನ್ನು ಬಳಸಿ."
        },
        "iste/4.b": {
          "description": "ಪರಿಹಾರವನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲು ಅಥವಾ ಪ್ರಾಜೆಕ್ಟ್‌ ಪೂರ್ಣಗೊಳಿಸಲು ಚಟುವಟಿಕೆಗಳನ್ನು ಯೋಜಿಸಿ ಮತ್ತು ನಿರ್ವಹಿಸಿ."
        },
        "iste/6.a": {
          "description": "ತಂತ್ರಜ್ಞಾನ ಸಿಸ್ಟಮ್‌ಗಳನ್ನು ಅರ್ಥಮಾಡಿಕೊಳ್ಳಿ ಮತ್ತು ತಂತ್ರಜ್ಞಾನ ಬಳಸಿ."
        },
        "iste/6.c": {
          "description": "ಸಿಸ್ಟಮ್‌ಗಳು ಮತ್ತು ಅಪ್ಲಿಕೇಶನ್‌ಗಳ ದೋಷ ಪರಿಹಾರ ಮಾಡಿ."
        },
        "iste/6.d": {
          "description": "ಹೊಸ ತಂತ್ರಜ್ಞಾನಗಳನ್ನು ಕಲಿಯಲು ಪ್ರಸ್ತುತ ಜ್ಞಾನ ವರ್ಗಾವಣೆ ಮಾಡಿ."
        },
        "ccela/1.L.6": {
          "description": "ಸರಳ ಸಂಬಂಧಗಳನ್ನು (ಉದಾ., ಯಾಕೆಂದರೆ) ಸೂಚಿಸಲು ಪದೇ ಪದೇ ಕಂಡುಬರುವ ಕಂಜಂಕ್ಷನ್‌ಗಳನ್ನು ಬಳಸುವುದೂ ಸೇರಿದಂತೆ ಸಂವಾದಗಳು, ಓದುವುದು ಮತ್ತು ಓದಲಾಗಿರುವ ಮತ್ತು ಪಠ್ಯಗಳಿಗೆ ಪ್ರತಿಕ್ರಿಯಿಸುವ ಮೂಲಕ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳನ್ನು ಬಳಸಿ."
        },
        "ccela/1.SL.1": {
          "description": "ಸಣ್ಣ ಮತ್ತು ದೊಡ್ಡ ಗುಂಪುಗಳಲ್ಲಿ ಸಹಭಾಗಿಗಳು ಮತ್ತು ವಯಸ್ಕರೊಂದಿಗೆ ಗ್ರೇಡ್ 1 ವಿಷಯಗಳು ಮತ್ತು ಪಠ್ಯಗಳ ಬಗ್ಗೆ ವೈವಿಧ್ಯಮಯ ಪಾಲುದಾರರುಗಳೊಂದಿಗೆ ಸಹಭಾಗಿತ್ವದ ಸಂವಾದಗಳಲ್ಲಿ ತೊಡಗಿಸಿಕೊಳ್ಳಿ."
        },
        "ccela/11-12.RI.4": {
          "description": "ಸಾಂಕೇತಿಕ, ಅರ್ಥಪೂರ್ಣ ಮತ್ತು ತಾಂತ್ರಿಕ ಅರ್ಥಗಳೂ ಸೇರಿದಂತೆ ಪಠ್ಯದಲ್ಲಿ ಬಳಸಿದಂತೆಯೇ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳ ಅರ್ಥವನ್ನು ಗುರುತಿಸಿ; ಪಠ್ಯದಲ್ಲಿ ಪ್ರಮುಖ ಪದ ಅಥವಾ ಪದಗಳ ಅರ್ಥವನ್ನು ಲೇಖಕರು ಹೇಗೆ ಬಳಸುತ್ತಾರೆ ಮತ್ತು ಪರಿಷ್ಕರಿಸುತ್ತಾರೆ ಎಂಬುದನ್ನು ವಿಶ್ಲೇಷಿಸಿ. (ಉದಾ., ಮ್ಯಾಡಿಸನ್ ಹೇಗೆ ವ್ಯಾಖ್ಯಾನಿಸುತ್ತಾರೆ"
        },
        "ccela/2.L.6": {
          "description": "ವಿವರಿಸಲು ಅಡ್ಜೆಕ್ಟಿವ್‌ಗಳು ಮತ್ತು ಅಡ್‌ವರ್ಬ್‌ಗಳನ್ನು (ಉದಾ., ಇತರ ಮಕ್ಕಳು ಖುಷಿಯಾದಾಗ ನನಗೆ ಖುಷಿಯಾಗುತ್ತದೆ) ಬಳಸುವುದೂ ಸೇರಿದಂತೆ ಸಂವಾದಗಳು, ಓದುವುದು ಮತ್ತು ಓದಲಾಗಿರುವ ಮತ್ತು ಪಠ್ಯಗಳಿಗೆ ಪ್ರತಿಕ್ರಿಯಿಸುವ ಮೂಲಕ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳನ್ನು ಬಳಸಿ."
        },
        "ccela/2.SL.1": {
          "description": "ಸಣ್ಣ ಮತ್ತು ದೊಡ್ಡ ಗುಂಪುಗಳಲ್ಲಿ ಸಹಭಾಗಿಗಳು ಮತ್ತು ವಯಸ್ಕರೊಂದಿಗೆ ಗ್ರೇಡ್ 2 ವಿಷಯಗಳು ಮತ್ತು ಪಠ್ಯಗಳ ಬಗ್ಗೆ ವೈವಿಧ್ಯಮಯ ಪಾಲುದಾರರುಗಳೊಂದಿಗೆ ಸಹಭಾಗಿತ್ವದ ಸಂವಾದಗಳಲ್ಲಿ ತೊಡಗಿಸಿಕೊಳ್ಳಿ."
        },
        "ccela/3.L.6": {
          "description": "ಸಂಕೇತ ವ್ಯಾಪ್ತ ಮತ್ತು ತಾತ್ಕಾಲಿಕ ಸಂಬಂಧಗಳೂ ಸೇರಿದಂತೆ (ಉದಾ., ರಾತ್ರಿಯೂಟದ ನಂತರ ನಾವು ಅವರನ್ನು ಹುಡುಕುತ್ತಾ ಹೋದೆವು) ಸೂಕ್ತ ಸಂವಾದಾತ್ಮಕ, ಸಾಮಾನ್ಯ ಶೈಕ್ಷಣಿಕ ಮತ್ತು ಡೊಮೇನ್ ಸಂಬಂಧಿತ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳ ಸೂಕ್ತ ಗ್ರೇಡ್ ಅನ್ನು ಸ್ವಾಧೀನಪಡಿಸಿಕೊಳ್ಳಿ ಮತ್ತು ಬಳಸಿ."
        },
        "ccela/3.SL.1": {
          "description": "ಇತರರ ಐಡಿಯಾಗಳು ಮತ್ತು ತಮ್ಮದೇ ಐಡಿಯಾಗಳನ್ನು ಸ್ಪಷ್ಟವಾಗಿ ಅಭಿವ್ಯಕ್ತಿಗೊಳಿಸಿ ಗ್ರೇಡ್ 3 ವಿಷಯಗಳು ಮತ್ತು ಪಠ್ಯಗಳ ಕುರಿತು ವೈವಿಧ್ಯಮಯ ಪಾಲುದಾರರೊಂದಿಗೆ ವಿವಿಧ ಸಂಯೋಜನಾತ್ಮಕ ಚರ್ಚೆಗಳಲ್ಲಿ (ಮುಖಾಮುಖಿ, ಗುಂಪುಗಳಲ್ಲಿ ಮತ್ತು ಶಿಕ್ಷಕರ ನೇತೃತ್ವದ) ಪರಿಣಾಮಕಾರಿಯಾಗಿ ತೊಡಗಿಸಿಕೊಳ್ಳಿ."
        },
        "ccmath/1.OA.1": {
          "description": "ಅಧಿಕ ಮತ್ತು ಗುಣಾಕಾರವನ್ನು 20 ರಲ್ಲಿ ಬಳಸಿಕೊಂಡು ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸಿ. ಇದರಲ್ಲಿ, ಸೇರಿಸುವುದು, ತೆಗೆದುಕೊಳ್ಳುವುದು, ಒಟ್ಟು ಸೇರಿಸುವುದು, ಪ್ರತ್ಯೇಕಿಸುವುದು ಮತ್ತು ಹೋಲಿಕೆ ಮಾಡುವ ಸನ್ನಿವೇಶಗಳೂ ಒಳಗೊಂಡಿರಬಹುದು ಮತ್ತು ಇದರ ಎಲ್ಲ ಸ್ಥಾನಗಳಲ್ಲಿ ಅನಾಮಿಕ ಅಂಶಗಳೂ ಒಳಗೊಂಡಿರಬಹುದು. ಉದಾ., ವಸ್ತುಗಳು, ಡ್ರಾಯಿಂಗ್‌ಗಳು ಮತ್ತು ಈಕ್ವೇಶನ್‌ಗಳನ್ನು ಬಳಸುವುದು."
        },
        "ccmath/2.OA.1": {
          "description": "ಅಧಿಕ ಮತ್ತು ಗುಣಾಕಾರವನ್ನು 100 ರಲ್ಲಿ ಬಳಸಿಕೊಂಡು ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸಿ. ಇದರಲ್ಲಿ, ಸೇರಿಸುವುದು, ತೆಗೆದುಕೊಳ್ಳುವುದು, ಒಟ್ಟು ಸೇರಿಸುವುದು, ಪ್ರತ್ಯೇಕಿಸುವುದು ಮತ್ತು ಹೋಲಿಕೆ ಮಾಡುವ ಸನ್ನಿವೇಶಗಳೂ ಒಳಗೊಂಡಿರಬಹುದು ಮತ್ತು ಇದರ ಎಲ್ಲ ಸ್ಥಾನಗಳಲ್ಲಿ ಅನಾಮಿಕ ಅಂಶಗಳೂ ಒಳಗೊಂಡಿರಬಹುದು. ಉದಾ., ಡ್ರಾಯಿಂಗ್‌ಗಳು ಮತ್ತು ಈಕ್ವೇಶನ್‌ಗಳನ್ನು ಬಳಸುವುದು."
        },
        "ccmath/3.OA.3": {
          "description": "ಸಮಾನ ಗುಂಪುಗಳು, ವರ್ಗಮೂಲಗಳು ಮತ್ತು ಪ್ರಮಾಣಗಳನ್ನು ಅಳೆಯುವ ಸನ್ನಿವೇಶಗಳಲ್ಲಿ ಶಬ್ದ ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸಲು 100 ರಲ್ಲಿ ಗುಣಾಕಾರ ಮತ್ತು ಭಾಗಾಕಾರವನ್ನು ಬಳಸಿ. ಉದಾ, ಸಮಸ್ಯೆಯನ್ನು ಪ್ರತಿನಿಧಿಸಲು ಅನಾಮಿಕ ಸಂಖ್ಯೆಗೆ ಚಿಹ್ನೆಯೊಂದಿಗೆ ಡ್ರಾಯಿಂಗ್‌ಗಳು ಮತ್ತು ಈಕ್ವೇಶನ್‌ಗಳನ್ನು ಬಳಸುವ ಮೂಲಕ.1"
        },
        "csta2011/CD.L1:3-01": {
          "description": "ಕಂಪ್ಯೂಟರ್‌ಗಳು ಮತ್ತು ಸಂಬಂಧಿಸಿದ ತಂತ್ರಜ್ಞಾನಗಳನ್ನು ಯಶಸ್ವಿಯಾಗಿ ನಿರ್ವಹಿಸಲು ಪ್ರಮಾಣಿತ ಇನ್‌ಪುಟ್ ಮತ್ತು ಔಟ್‌ಪುಟ್ ಸಾಧನಗಳನ್ನು ಬಳಸಿ."
        },
        "csta2011/CI.L1:3-01": {
          "description": "ತಂತ್ರಜ್ಞಾನ ಸಿಸ್ಟಮ್‌ಗಳು ಮತ್ತು ಸಾಫ್ಟ್‌ವೇರ್‌ ಬಳಸುವಲ್ಲಿ ಜವಾಬ್ದಾರಿಯುತ ಡಿಜಿಟಲ್ ಪೌರತ್ವವನ್ನು (ಕಾನೂನಾತ್ಮಕ ಮತ್ತು ನೈತಿಕ ವರ್ತನೆಗಳು) ಅಭ್ಯಾಸ ಮಾಡಿ."
        },
        "csta2011/CPP.L1:6-01": {
          "description": "ಸಮಸ್ಯೆ ಪರಿಹಾರ ಮತ್ತು ಸ್ವಯಂ ನಿರ್ದೇಶಿತ ಕಲಿಕೆಗೆ ತಂತ್ರಜ್ಞಾನ ಸಂಪನ್ಮೂಲಗಳನ್ನು ಬಳಸಿ (ಉದಾ., ಕ್ಯಾಲಕ್ಯುಲೇಟರ್‌ಗಳು, ಡೇಟಾ ಸಂಗ್ರಹ ಪ್ರೋಬ್‌ಗಳು, ಮೊಬೈಲ್ ಸಾಧನಗಳು, ವೀಡಿಯೋಗಳು, ಶೈಕ್ಷಣಿಕ ಸಾಫ್ಟ್‌ವೇರ್ ಮತ್ತು ವೆಬ್‌ ಟೂಲ್‌ಗಳು)."
        },
        "ccela/11-12.L.6": {
          "description": "ಕಾಲೇಜು ಮತ್ತು ವೃತ್ತಿ ಸಿದ್ಧತೆ ಮಟ್ಟದಲ್ಲಿ ಸಾಮಾನ್ಯ ಶೈಕ್ಷಣಿಕ ಮತ್ತು ಡೊಮೇನ್ ಆಧರಿತ, ಓದಲು, ಬರೆಯಲು, ಮಾತನಾಡಲು ಮತ್ತು ಕೇಳಲು ಸೂಕ್ತವಾದ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳನ್ನು ನಿಖರವಾಗಿ ಬಳಸಿ ಮತ್ತು ಸ್ವಾಧೀನಪಡಿಸಿಕೊಳ್ಳಿ; ಪರಿಗಣಿಸಿದಾಗ ಶಬ್ದಕೋಶವನ್ನು ಗ್ರಹಿಸಲು ಸ್ವಾತಂತ್ರ್ಯವನ್ನು ಒದಗಿಸಿ"
        },
        "ccela/4.L.6": {
          "description": "ನಿಖರ ಕ್ರಮಗಳು, ಭಾವನೆಗಳು ಅಥವಾ ಸ್ಥಿತಿಗಳನ್ನು ಸೂಚಿಸುವ (ಉದಾ., ಪ್ರಶ್ನಿಸಿದ, ಕಣ್ಣುಹೊಡೆದ, ಹಠಾತ್ತನೆ ಮಾತನಾಡಿದ) ಮತ್ತು ನಿರ್ದಿಷ್ಟ ವಿಷಯಕ್ಕೆ ಪ್ರಾಥಮಿಕವಾಗಿರುವುದೂ ಒಳಗೊಂಡಂತೆ ಗ್ರೇಡ್‌ಗೆ ಸೂಕ್ತವಾದ ಸಾಮಾನ್ಯ ಶೈಕ್ಷಣಿಕ ಮತ್ತು ಡೊಮೇನ್ ಸಂಬಂಧಿ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳನ್ನು ನಿಖರವಾಗಿ ಬಳಸಿ ಮತ್ತು ಸ್ವಾಧೀನಪಡಿಸಿಕೊಳ್ಳಿ (ಉದಾ.,"
        },
        "ccela/5.L.6": {
          "description": "ವ್ಯತಿರಿಕ್ತ, ಸಂಕಲನ ಮತ್ತು ಇತರ ಲಾಜಿಕಲ್‌ ಸಂಬಂಧಗಳನ್ನು (ಉದಾ., ಆದಾಗ್ಯೂ, ಆದರೂ, ಏನೇ ಆದರೂ, ಇದೇ ರೀತಿ, ಹೆಚ್ಚಿನದಾಗಿ, ಇದರ ಜೊತೆಗೆ) ಸೂಚಿಸುವುದೂ ಸೇರಿದಂತೆ ಗ್ರೇಡ್‌ಗೆ ಸಂಬಂಧಿಸಿದ ಸಾಮಾನ್ಯ ಶೈಕ್ಷಣಿಕ ಮತ್ತು ಡೊಮೇನ್ ಸಂಬಂಧಿತ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳನ್ನು ನಿಖರವಾಗಿ ಬಳಸಿ ಮತ್ತು ಸ್ವಾಧೀನಪಡಿಸಿಕೊಳ್ಳಿ."
        },
        "ccmath/4.MD.6": {
          "description": "ಪ್ರೋಟ್ರಾಕ್ಟರ್ ಬಳಸಿ ಪೂರ್ಣ ಸಂಖ್ಯೆ ಡಿಗ್ರಿಗಳಲ್ಲಿನ ಕೋನಗಳನ್ನು ಅಳೆಯಿರಿ. ನಿರ್ದಿಷ್ಟ ಅಳತೆಯ ಕೋನಗಳನ್ನು ಸ್ಕೆಚ್ ಮಾಡಿ."
        },
        "ccmath/4.NBT.4": {
          "description": "ಪ್ರಮಾಣಿತ ಅಲ್ಗೊರಿಥಂ ಅನ್ನು ಬಳಸಿ ಬಹು ಅಂಕಿಯ ಪೂರ್ಣ ಸಂಖ್ಯೆಗಳನ್ನು ಸರಾಗವಾಗಿ ಸೇರಿಸಿ ಮತ್ತು ಕಳೆಯಿರಿ."
        },
        "ccmath/4.NBT.5": {
          "description": "ಒಂದು ಪೂರ್ಣ ಸಂಖ್ಯೆಯಿಂದ ಗರಿಷ್ಠ ನಾಲ್ಕು ಸಂಖ್ಯೆಗಳ ಪೂರ್ಣ ಸಂಖ್ಯೆಯನ್ನು ಗುಣಿಸಿ ಮತ್ತು ಮೌಲ್ಯವನ್ನು ಆಧರಿಸಿದ ಕಾರ್ಯತಂತ್ರಗಳು ಮತ್ತು ಕಾರ್ಯಾಚರಣೆಗಳ ಗುಣಲಕ್ಷಣಗಳನ್ನು ಬಳಸಿ ಎರಡು ಅಂಕಿಗಳ ಸಂಖ್ಯೆಯನ್ನು ಗುಣಿಸಿ. ಸಮೀಕರಣಗಳು, ಆಯತವನ್ನು ಬಳಸಿ ಲೆಕ್ಕಾಚಾರವನ್ನು ರಚಿಸಿ ಮತ್ತು ವಿವರಿಸಿ."
        },
        "ccmath/7.G.2": {
          "description": "(ಫ್ರೀಹ್ಯಾಂಡ್‌, ರೂಲರ್ ಮತ್ತು ಪ್ರೋಟ್ರ್ಯಾಕ್ಟರ್ ಮತ್ತು ತಂತ್ರಜ್ಞಾನ ಬಳಸಿ) ಜಾಮೆಟ್ರಿ ಆಕಾರಗಳನ್ನು ನೀಡಿದ ಸ್ಥಿತಿಗಳಲ್ಲಿ ಎಳೆಯಿರಿ. ಒಂದು ಕೋನಕ್ಕಿಮತ ಹೆಚ್ಚಾಗಿ ವಿಶಿಷ್ಟ ತ್ರಿಕೋನವನ್ನು ಯಾವಾಗ ಷರತ್ತುಗಳು ಪೂರೈಸುತ್ತವೆ ಎಂಬುದನ್ನು ಗಮನಿಸಿ ಮೂರು ಕೋನಗಳು ಅಥವಾ ಬದಿಗಳ ಮೂರು ಅಳತೆಗಳಿಂದ ತ್ರಿಕೋನಗಳನ್ನು ರಚಿಸುವಲ್ಲಿ ಗಮನ ಹರಿಸಿ"
        },
        "csta2011/CPP.L1:3-02": {
          "description": "ಪಠ್ಯಕ್ರಮದಾದ್ಯಂತ ಕಲಿಕೆಗೆ ಬೆಂಬಲ ನೀಡಲು ಅಭಿವೃದ್ಧಿಯುತವಾಗಿ ಸೂಕ್ತವಾದ ಮಲ್ಟಿಮೀಡಿಯಾ ಸಂಪನ್ಮೂಲಗಳನ್ನು (ಉದಾ., ಇಂಟರ್ಯಾಕ್ಟಿವ್ ಪುಸ್ತಕಗಳು ಮತ್ತು ಶೈಕ್ಷಣಿಕ ಸಾಫ್ಟ್‌ವೇರ್‌) ಬಳಸಿ."
        },
        "csta2011/CPP.L1:3-04": {
          "description": "ಸರಳ ಟಾಸ್ಕ್ ಅನ್ನು ಸಾಧಿಸಲು ಕ್ರಮ ವಹಿಸುವ ಹೇಳಿಕೆಗಳ ಗುಚ್ಛವನ್ನು ರಚಿಸಿ (ಉದಾ., ಟರ್ಟಲ್‌ ಸೂಚನೆಗಳು)."
        },
        "ccela/11-12.W.6": {
          "description": "ಹೊಸ ವ್ಯವಸ್ಥೆಗಳು ಅಥವಾ ಮಾಹಿತಿ ಸೇರಿದಂತೆ ಚಾಲ್ತಿಯಲ್ಲಿರುವ ಪ್ರತಿಕ್ರಿಯೆಗೆ ಪ್ರತಿಕ್ರಿಯೆಯಾಗಿ ಪ್ರತ್ಯೇಕ ಅಥವಾ ಹಂಚಿದ ಬರೆಯುವ ಉತ್ಪನ್ನಗಳನ್ನು ಉತ್ಪಾದಿಸಲು, ಪ್ರಕಟಿಸಲು ಮತ್ತು ನವೀಕರಿಸಲು ಇಂಟರ್ನೆಟ್‌ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ."
        },
        "ccela/4.W.3": {
          "description": "ಪರಿಣಾಮಕಾರಿ ತಂತ್ರ, ವಿವರಣಾತ್ಮಕ ವಿವರಗಳು ಮತ್ತು ಸ್ಪಷ್ಟ ಈವೆಂಟ್‌ ಸನ್ನಿವೇಶಗಳನ್ನು ಬಳಸಿ ನೈಜ ಅಥವಾ ಊಹೆಯ ಅನುಭವಗಳು ಅಥವಾ ಈವೆಂಟ್‌ಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲು ನಿರೂಪಣೆಗಳನ್ನು ಬರೆಯಿರಿ."
        },
        "ccela/6.W.6": {
          "description": "ಬರೆದಿರುವುದನ್ನು ಪ್ರಕಟಿಸಲು ಮತ್ತು ಉತ್ಪಾದಿಸಲು ಹಾಗೂ ಇತರರೊಂದಿಗೆ ಸಂವಹನ ನಡೆಸಲು ಮತ್ತು ಸಹಭಾಗಿತ್ವ ಸಾಧಿಸಲು ಇಂಟರ್ನೆಟ್‌ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ; ಒಂದೇ ಬಾರಿಗೆ ಕನಿಷ್ಠ ಮೂರು ಪುಟಗಳನ್ನು ಟೈಪ್ ಮಾಡಲು ಕೀಬೋರ್ಡ್‌ ಕೌಶಲಗಳ ಕುರಿತು ಸಾಕಷ್ಟು ಪರಿಣಿತಿಯನ್ನು ಸಾಧಿಸುವುದು."
        },
        "ccela/7.W.3": {
          "description": "ಪರಿಣಾಮಕಾರಿ ತಂತ್ರ, ಸೂಕ್ತ ವಿವರಣಾತ್ಮಕ ವಿವರಗಳು ಮತ್ತು ಉತ್ತಮ ರಚನಾತ್ಮಕ ಈವೆಂಟ್‌ ಸನ್ನಿವೇಶಗಳನ್ನು ಬಳಸಿ ನೈಜ ಅಥವಾ ಊಹೆಯ ಅನುಭವಗಳು ಅಥವಾ ಈವೆಂಟ್‌ಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲು ನಿರೂಪಣೆಗಳನ್ನು ಬರೆಯಿರಿ."
        },
        "ccela/7.W.6": {
          "description": "ಬರವಣಿಗೆಯನ್ನು ಉತ್ಪಾದಿಸಲು ಮತ್ತು ಪ್ರಕಟಿಸಲು ಇಂಟರ್ನೆಟ್ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ ಮೂಲಗಳನ್ನು ಸಂಪರ್ಕಿಸುವುದು ಮತ್ತು ಉಲ್ಲೇಖಿಸುವುದೂ ಸೇರಿದಂತೆ ಇತರರೊಂದಿಗೆ ಸಂವಹನ ಮತ್ತು ಸಹಭಾಗಿತ್ವ ಸಾಧಿಸಲು ಹಾಗೂ ಮೂಲಗಳನ್ನು ಲಿಂಕ್‌ ಮಾಡಿ ಮತ್ತು ಉಲ್ಲೇಖಿಸಿ."
        },
        "ccela/8.W.6": {
          "description": "ಉತ್ಪಾದಿಸಲು ಮತ್ತು ಬರೆಯುವುದನ್ನು ಪ್ರಕಟಿಸಲು ಮತ್ತು ಇತರರೊಂದಿಗೆ ಸಂವಹನ ನಡೆಸಲು ಮತ್ತು ಸಹಭಾಗಿತ್ವ ಸಾಧಿಸಲು ಮಾಹಿತಿ ಮತ್ತು ಪರಿಕಲ್ಪನೆಗಳ ಮಧ್ಯೆ ದಕ್ಷವಾಗಿ ಸಂಬಂಧಗಳನ್ನು ಪ್ರಸ್ತುತಪಡಿಸಲು ಇಂಟರ್ನೆಟ್‌ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ."
        },
        "ccela/9-10.W.6": {
          "description": "ಪ್ರತ್ಯೇಕ ಅಥವಾ ಹಂಚಿದ ಬರೆಯುವ ಉತ್ಪನ್ನಗಳನ್ನು ಉತ್ಪಾದಿಸಲು, ಪ್ರಕಟಿಸಲು ಮತ್ತು ನವೀಕರಿಸಲು, ಇತರ ಮಾಹಿತಿಗೆ ಲಿಂಕ್ ಮಾಡಲು ತಂತ್ರಜ್ಞಾನದ ಸಾಮರ್ಥ್ಯದ ಅನುಕೂಲವನ್ನು ತೆಗೆದುಕೊಳ್ಳಲು ಮತ್ತು ಮಾಹಿತಿಯನ್ನು ಫ್ಲೆಕ್ಸಿಬಲ್ ಆಗಿ ಮತ್ತು ಡೈನಾಮಿಕ್ ಆಗಿ ಪ್ರದರ್ಶಿಸಲು ಇಂಟರ್ನೆಟ್‌ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ."
        },
        "ccmath/MP.4": {
          "description": "ಗಣಿತಗಳೊಂದಿಗೆ ಮಾಡೆಲ್"
        },
        "csta2011/CL.L1:6-02": {
          "description": "ಅಭಿವೃದ್ಧಿಗೊಳ್ಳುತ್ತಿರುವ ಪರಿಹಾರಗಳು ಅಥವಾ ಉತ್ಪನ್ನಗಳ ಉದ್ದೇಶಕ್ಕೆ ಸಹಭಾಗಿತ್ವದ ಸಮಸ್ಯೆ ಪರಿಹಾರ ಚಟುವಟಿಕೆಗಳಲ್ಲಿ ಭಾಗವಹಿಸಲು ಆನ್‌ಲೈನ್ ಸಂಪನ್ಮೂಲಗಳನ್ನು (ಉದಾ., ಇಮೇಲ್, ಆನ್‌ಲೈನ್‌ ಚರ್ಚೆಗಳು, ಸಹಭಾಗಿತ್ವ ವೆಬ್ ಪರಿಸರಗಳು) ಬಳಸಿ."
        },
        "csta2011/CPP.L1:3-01": {
          "description": "ವಯಸ್ಸಿಗೆ ಸೂಕ್ತ ಸಂಶೋಧನೆಯನ್ನು ನಡೆಸಲು ತಂತ್ರಜ್ಞಾನ ಸಂಪನ್ಮೂಲಗಳನ್ನು ಬಳಸಿ."
        },
        "csta2011/CPP.L2:3": {
          "description": "ಪಠ್ಯಕ್ರಮ ಪರಿಕಲ್ಪನೆಗಳನ್ನು ಪ್ರದರ್ಶಿಸಲು ಮತ್ತು ಸಂವಹನ ನಡೆಸಲು ತಂತ್ರಜ್ಞಾನ ಸಂಪನ್ಮೂಲಗಳನ್ನು ಬಳಸಿ ಉತ್ಪನ್ನಗಳನ್ನು ವಿನ್ಯಾಸ ಮಾಡಿ, ಅಭಿವೃದ್ಧಿಪಡಿಸಿ, ಪ್ರಕಟಿಸಿ ಮತ್ತು ಉತ್ಪನ್ನಗಳನ್ನು ಪ್ರಸ್ತುತಪಡಿಸಿ (ಉದಾ., ವೆಬ್‌ ಪುಟಗಳು, ಮೊಬೈಲ್ ಅಪ್ಲಿಕೇಶನ್‌ಗಳು, ಆನಿಮೇಶನ್‌ಗಳು)."
        },
        "iste/2.a": {
          "description": "ವಿವಿಧ ಡಿಜಿಟಲ್ ಪರಿಸರ ಮತ್ತು ಮಾಧ್ಯಮದಲ್ಲಿ ನೇಮಕವಾಗಿರುವ ಸಹಭಾಗಿಗಳು, ಪರಿಣಿತರು ಅಥವಾ ಇತರರೊಂದಿಗೆ ಸಂವಹನ ನಡೆಸಿ, ಸಹಭಾಗಿತ್ವ ಸಾಧಿಸಿ ಮತ್ತು ಪ್ರಕಟಿಸಿ."
        },
        "iste/2.b": {
          "description": "ವಿವಿಧ ಮಾಧ್ಯಮ ಮತ್ತು ಫಾರ್ಮ್ಯಾಟ್‌ಗಳನ್ನು ಬಳಸಿ ಹಲವು ಪ್ರೇಕ್ಷಕರುಗಳಿಗೆ ಮಾಹಿತಿ ಮತ್ತು ಪರಿಕಲ್ಪನೆಗಳನ್ನು ಪರಿಣಾಮಕಾರಿಯಾಗಿ ಸಂವಹನ ನಡೆಸಿ."
        },
        "iste/4.d": {
          "description": "ಪರ್ಯಾಯ ಪರಿಹಾರಗಳನ್ನು ಎಕ್ಸ್‌ಪ್ಲೋರ್ ಮಾಡಲು ಹಲವು ಪ್ರಕ್ರಿಯೆಗಳು ಮತ್ತು ವೈವಿಧ್ಯ ದೃಷ್ಟಿಕೋನಗಳನ್ನು ಬಳಸಿ."
        },
        "csp2021/IOC-2.B.5": {
          "description": "ಎನ್‌ಕ್ರಿಪ್ಶನ್ ಎನ್ನುವುದು ಅನಧಿಕೃತ ಪ್ರವೇಶವನ್ನು ತಡೆಯಲು ಡೇಟಾವನ್ನು ಎನ್‌ಕೋಡಿಂಗ್ ಮಾಡುವ ಪ್ರಕ್ರಿಯೆಯಾಗಿದೆ. ಡೀಕ್ರಿಪ್ಶನ್ ಎನ್ನುವುದು ಡೇಟಾವನ್ನು ಡಿಕೋಡ್ ಮಾಡುವ ಪ್ರಕ್ರಿಯೆಯಾಗಿದೆ. ಎರಡು ಸಾಮಾನ್ಯ ಗೂಢಲಿಪೀಕರಣ ವಿಧಾನಗಳೆಂದರೆ: ●        ಸಿಮೆಟ್ರಿಕ್ ಕೀ ಎನ್‌ಕ್ರಿಪ್ಶನ್ ಎನ್‌ಕ್ರಿಪ್ಶನ್ ಮತ್ತು ಡೀಕ್ರಿಪ್ಶನ್ ಎರಡಕ್ಕೂ ಒಂದು ಕೀಲಿಯನ್ನು ಒಳಗೊಂಡಿರುತ್ತದೆ. ಸಂದೇಶವನ್ನು ಎನ್‌ಕ್ರಿಪ್ಟ್ ಮಾಡಲು ಕಳುಹಿಸುವವರಿಗೆ ರಿಸೀವರ್‌ನ ಖಾಸಗಿ ಕೀ ಅಗತ್ಯವಿಲ್ಲ, ಆದರೆ ಸಂದೇಶವನ್ನು ಡೀಕ್ರಿಪ್ಟ್ ಮಾಡಲು ಸ್ವೀಕರಿಸುವವರ ಖಾಸಗಿ ಕೀ ಅಗತ್ಯವಿದೆ. ಹೊರಗಿಡುವ ಹೇಳಿಕೆ (EKIOC-2.B.5): ಗೂಢಲಿಪೀಕರಣ ಮತ್ತು ಡೀಕ್ರಿಪ್ಶನ್‌ಗಾಗಿ ನಿರ್ದಿಷ್ಟ ಗಣಿತದ ಕಾರ್ಯವಿಧಾನಗಳು ಈ ಕೋರ್ಸ್ ಮತ್ತು AP ಪರೀಕ್ಷೆಯ ವ್ಯಾಪ್ತಿಯನ್ನು ಮೀರಿವೆ."
        },
        "csta/3A-NI-06": {
          "description": "ದಕ್ಷತೆ, ಕಾರ್ಯಸಾಧ್ಯತೆ ಮತ್ತು ನೈತಿಕ ಪರಿಣಾಮಗಳಂತಹ ಅಂಶಗಳ ಆಧಾರದ ಮೇಲೆ ವಿವಿಧ ಸನ್ನಿವೇಶಗಳನ್ನು ಪರಿಹರಿಸಲು ಭದ್ರತಾ ಕ್ರಮಗಳನ್ನು ಶಿಫಾರಸು ಮಾಡಿ."
        },
        "csta/3A-NI-07": {
          "description": "ಕಂಪ್ಯೂಟರ್ ಸಿಸ್ಟಮ್‌ನ ಉಪಯುಕ್ತತೆ ಮತ್ತು ಸುರಕ್ಷತೆಯ ನಡುವಿನ ವ್ಯಾಪಾರವನ್ನು ಪರಿಗಣಿಸಿ ವಿವಿಧ ಭದ್ರತಾ ಕ್ರಮಗಳನ್ನು ಹೋಲಿಕೆ ಮಾಡಿ."
        },
        "csta/3B-NI-04": {
          "description": "ಸಾಫ್ಟ್‌ವೇರ್ ಡೆವಲಪರ್‌ಗಳು ಸಾಧನಗಳು ಮತ್ತು ಮಾಹಿತಿಯನ್ನು ಅನಧಿಕೃತ ಪ್ರವೇಶದಿಂದ ರಕ್ಷಿಸುವ ವಿಧಾನಗಳನ್ನು ಹೋಲಿಕೆ ಮಾಡಿ."
        },
        "csp2021/DAT-1.D.1": {
          "description": "ಡೇಟಾ ಸಂಕೋಚನವು ರವಾನೆಯಾಗುವ ಅಥವಾ ಸಂಗ್ರಹಿಸಿದ ಡೇಟಾದ ಗಾತ್ರವನ್ನು (ಬಿಟ್‌ಗಳ ಸಂಖ್ಯೆ) ಕಡಿಮೆ ಮಾಡುತ್ತದೆ."
        },
        "csp2021/DAT-1.D.2": {
          "description": "ಕಡಿಮೆ ಬಿಟ್‌ಗಳು ಕಡಿಮೆ ಮಾಹಿತಿ ಎಂದರ್ಥವಲ್ಲ."
        },
        "csp2021/DAT-1.D.3": {
          "description": "ಸಂಕೋಚನದಿಂದ ಗಾತ್ರ ಕಡಿತದ ಪ್ರಮಾಣವು ಮೂಲ ಡೇಟಾ ಪ್ರಾತಿನಿಧ್ಯದಲ್ಲಿನ ಪುನರುಕ್ತಿ ಪ್ರಮಾಣ ಮತ್ತು ಅನ್ವಯಿಸಲಾದ ಸಂಕೋಚನ ಅಲ್ಗಾರಿದಮ್ ಎರಡನ್ನೂ ಅವಲಂಬಿಸಿರುತ್ತದೆ."
        },
        "csp2021/DAT-1.D.4": {
          "description": "ನಷ್ಟವಿಲ್ಲದ ಡೇಟಾ ಕಂಪ್ರೆಷನ್ ಅಲ್ಗಾರಿದಮ್‌ಗಳು ಸಾಮಾನ್ಯವಾಗಿ ಮೂಲ ಡೇಟಾದ ಸಂಪೂರ್ಣ ಪುನರ್ನಿರ್ಮಾಣವನ್ನು ಖಾತರಿಪಡಿಸುವಾಗ ಸಂಗ್ರಹಿಸಲಾದ ಅಥವಾ ರವಾನೆಯಾಗುವ ಬಿಟ್‌ಗಳ ಸಂಖ್ಯೆಯನ್ನು ಕಡಿಮೆ ಮಾಡಬಹುದು."
        },
        "csta/3A-DA-10": {
          "description": "ಡೇಟಾ ಅಂಶಗಳನ್ನು ಹೇಗೆ ಆಯೋಜಿಸಲಾಗಿದೆ ಮತ್ತು ಡೇಟಾವನ್ನು ಎಲ್ಲಿ ಸಂಗ್ರಹಿಸಲಾಗಿದೆ ಎಂಬುದರಲ್ಲಿ ವಹಿವಾಟುಗಳನ್ನು ಮೌಲ್ಯಮಾಪನ ಮಾಡಿ."
        },
        "csta/1B-IC-18": {
          "description": "ವಿಶ್ವವನ್ನು ಬದಲಿಸಿದ ಕಂಪ್ಯೂಟಿಂಗ್‌ ತಂತ್ರಜ್ಞಾನಗಳ ಚರ್ಚೆ ಮಾಡಿ ಮತ್ತು ಆ ತಂತ್ರಜ್ಞಾನಗಳು ಹೇಗೆ ಪ್ರಭಾವ ಬೀರುತ್ತವೆ ಮತ್ತು ಸಾಂಸ್ಕೃತಿಕ ಅಭ್ಯಾಸಗಳಿಂದಾಗಿ ಅವು ಹೇಗೆ ಪ್ರಭಾವಕ್ಕೊಳಗಾಗಿವೆ ಎಂದು ಅಭಿವ್ಯಕ್ತಪಡಿಸಿ."
        },
        "csta/1B-DA-07": {
          "description": "ಕಾರಣ ಮತ್ತು ಪರಿಣಾಮ ಸಂಬಂಧಗಳು, ಫಲಿತಾಂಶಗಳನ್ನು ಊಹಿಸುವುದು ಅಥವಾ ಒಂದು ಐಡಿಯಾವನ್ನು ಸಂವಹನದ ಹೈಲೈಟ್ ಮಾಡಲು ಅಥವಾ ಪ್ರಸ್ತಾಪಿಸಲು ಡೇಟಾ ಬಳಸಿ."
        },
        "1B-DA-07": {
          "description": "ಕಾರಣ ಮತ್ತು ಪರಿಣಾಮ ಸಂಬಂಧಗಳು, ಫಲಿತಾಂಶಗಳನ್ನು ಊಹಿಸುವುದು ಅಥವಾ ಒಂದು ಐಡಿಯಾವನ್ನು ಸಂವಹನದ ಹೈಲೈಟ್ ಮಾಡಲು ಅಥವಾ ಪ್ರಸ್ತಾಪಿಸಲು ಡೇಟಾ ಬಳಸಿ."
        },
        "1B-IC-18": {
          "description": "ವಿಶ್ವವನ್ನು ಬದಲಿಸಿದ ಕಂಪ್ಯೂಟಿಂಗ್‌ ತಂತ್ರಜ್ಞಾನಗಳ ಚರ್ಚೆ ಮಾಡಿ ಮತ್ತು ಆ ತಂತ್ರಜ್ಞಾನಗಳು ಹೇಗೆ ಪ್ರಭಾವ ಬೀರುತ್ತವೆ ಮತ್ತು ಸಾಂಸ್ಕೃತಿಕ ಅಭ್ಯಾಸಗಳಿಂದಾಗಿ ಅವು ಹೇಗೆ ಪ್ರಭಾವಕ್ಕೊಳಗಾಗಿವೆ ಎಂದು ಅಭಿವ್ಯಕ್ತಪಡಿಸಿ."
        },
        "3A-DA-10": {
          "description": "ಡೇಟಾ ಅಂಶಗಳನ್ನು ಹೇಗೆ ಆಯೋಜಿಸಲಾಗಿದೆ ಮತ್ತು ಡೇಟಾವನ್ನು ಎಲ್ಲಿ ಸಂಗ್ರಹಿಸಲಾಗಿದೆ ಎಂಬುದರಲ್ಲಿ ವಹಿವಾಟುಗಳನ್ನು ಮೌಲ್ಯಮಾಪನ ಮಾಡಿ."
        },
        "3A-NI-06": {
          "description": "ದಕ್ಷತೆ, ಕಾರ್ಯಸಾಧ್ಯತೆ ಮತ್ತು ನೈತಿಕ ಪರಿಣಾಮಗಳಂತಹ ಅಂಶಗಳ ಆಧಾರದ ಮೇಲೆ ವಿವಿಧ ಸನ್ನಿವೇಶಗಳನ್ನು ಪರಿಹರಿಸಲು ಭದ್ರತಾ ಕ್ರಮಗಳನ್ನು ಶಿಫಾರಸು ಮಾಡಿ."
        },
        "3A-NI-07": {
          "description": "ಕಂಪ್ಯೂಟರ್ ಸಿಸ್ಟಮ್‌ನ ಉಪಯುಕ್ತತೆ ಮತ್ತು ಸುರಕ್ಷತೆಯ ನಡುವಿನ ವ್ಯಾಪಾರವನ್ನು ಪರಿಗಣಿಸಿ ವಿವಿಧ ಭದ್ರತಾ ಕ್ರಮಗಳನ್ನು ಹೋಲಿಕೆ ಮಾಡಿ."
        },
        "3B-NI-04": {
          "description": "ಸಾಫ್ಟ್‌ವೇರ್ ಡೆವಲಪರ್‌ಗಳು ಸಾಧನಗಳು ಮತ್ತು ಮಾಹಿತಿಯನ್ನು ಅನಧಿಕೃತ ಪ್ರವೇಶದಿಂದ ರಕ್ಷಿಸುವ ವಿಧಾನಗಳನ್ನು ಹೋಲಿಕೆ ಮಾಡಿ."
        },
        "DAT-1.D.1": {
          "description": "ಡೇಟಾ ಸಂಕೋಚನವು ರವಾನೆಯಾಗುವ ಅಥವಾ ಸಂಗ್ರಹಿಸಿದ ಡೇಟಾದ ಗಾತ್ರವನ್ನು (ಬಿಟ್‌ಗಳ ಸಂಖ್ಯೆ) ಕಡಿಮೆ ಮಾಡುತ್ತದೆ."
        },
        "DAT-1.D.2": {
          "description": "ಕಡಿಮೆ ಬಿಟ್‌ಗಳು ಕಡಿಮೆ ಮಾಹಿತಿ ಎಂದರ್ಥವಲ್ಲ."
        },
        "DAT-1.D.3": {
          "description": "ಸಂಕೋಚನದಿಂದ ಗಾತ್ರ ಕಡಿತದ ಪ್ರಮಾಣವು ಮೂಲ ಡೇಟಾ ಪ್ರಾತಿನಿಧ್ಯದಲ್ಲಿನ ಪುನರುಕ್ತಿ ಪ್ರಮಾಣ ಮತ್ತು ಅನ್ವಯಿಸಲಾದ ಸಂಕೋಚನ ಅಲ್ಗಾರಿದಮ್ ಎರಡನ್ನೂ ಅವಲಂಬಿಸಿರುತ್ತದೆ."
        },
        "DAT-1.D.4": {
          "description": "ನಷ್ಟವಿಲ್ಲದ ಡೇಟಾ ಕಂಪ್ರೆಷನ್ ಅಲ್ಗಾರಿದಮ್‌ಗಳು ಸಾಮಾನ್ಯವಾಗಿ ಮೂಲ ಡೇಟಾದ ಸಂಪೂರ್ಣ ಪುನರ್ನಿರ್ಮಾಣವನ್ನು ಖಾತರಿಪಡಿಸುವಾಗ ಸಂಗ್ರಹಿಸಲಾದ ಅಥವಾ ರವಾನೆಯಾಗುವ ಬಿಟ್‌ಗಳ ಸಂಖ್ಯೆಯನ್ನು ಕಡಿಮೆ ಮಾಡಬಹುದು."
        },
        "IOC-2.B.5": {
          "description": "ಎನ್‌ಕ್ರಿಪ್ಶನ್ ಎನ್ನುವುದು ಅನಧಿಕೃತ ಪ್ರವೇಶವನ್ನು ತಡೆಯಲು ಡೇಟಾವನ್ನು ಎನ್‌ಕೋಡಿಂಗ್ ಮಾಡುವ ಪ್ರಕ್ರಿಯೆಯಾಗಿದೆ. ಡೀಕ್ರಿಪ್ಶನ್ ಎನ್ನುವುದು ಡೇಟಾವನ್ನು ಡಿಕೋಡ್ ಮಾಡುವ ಪ್ರಕ್ರಿಯೆಯಾಗಿದೆ. ಎರಡು ಸಾಮಾನ್ಯ ಗೂಢಲಿಪೀಕರಣ ವಿಧಾನಗಳೆಂದರೆ: ●        ಸಿಮೆಟ್ರಿಕ್ ಕೀ ಎನ್‌ಕ್ರಿಪ್ಶನ್ ಎನ್‌ಕ್ರಿಪ್ಶನ್ ಮತ್ತು ಡೀಕ್ರಿಪ್ಶನ್ ಎರಡಕ್ಕೂ ಒಂದು ಕೀಲಿಯನ್ನು ಒಳಗೊಂಡಿರುತ್ತದೆ. ಸಂದೇಶವನ್ನು ಎನ್‌ಕ್ರಿಪ್ಟ್ ಮಾಡಲು ಕಳುಹಿಸುವವರಿಗೆ ರಿಸೀವರ್‌ನ ಖಾಸಗಿ ಕೀ ಅಗತ್ಯವಿಲ್ಲ, ಆದರೆ ಸಂದೇಶವನ್ನು ಡೀಕ್ರಿಪ್ಟ್ ಮಾಡಲು ಸ್ವೀಕರಿಸುವವರ ಖಾಸಗಿ ಕೀ ಅಗತ್ಯವಿದೆ. ಹೊರಗಿಡುವ ಹೇಳಿಕೆ (EKIOC-2.B.5): ಗೂಢಲಿಪೀಕರಣ ಮತ್ತು ಡೀಕ್ರಿಪ್ಶನ್‌ಗಾಗಿ ನಿರ್ದಿಷ್ಟ ಗಣಿತದ ಕಾರ್ಯವಿಧಾನಗಳು ಈ ಕೋರ್ಸ್ ಮತ್ತು AP ಪರೀಕ್ಷೆಯ ವ್ಯಾಪ್ತಿಯನ್ನು ಮೀರಿವೆ."
        },
        "CD.L1:3-01": {
          "description": "ಕಂಪ್ಯೂಟರ್‌ಗಳು ಮತ್ತು ಸಂಬಂಧಿಸಿದ ತಂತ್ರಜ್ಞಾನಗಳನ್ನು ಯಶಸ್ವಿಯಾಗಿ ನಿರ್ವಹಿಸಲು ಪ್ರಮಾಣಿತ ಇನ್‌ಪುಟ್ ಮತ್ತು ಔಟ್‌ಪುಟ್ ಸಾಧನಗಳನ್ನು ಬಳಸಿ."
        },
        "CI.L1:3-01": {
          "description": "ತಂತ್ರಜ್ಞಾನ ಸಿಸ್ಟಮ್‌ಗಳು ಮತ್ತು ಸಾಫ್ಟ್‌ವೇರ್‌ ಬಳಸುವಲ್ಲಿ ಜವಾಬ್ದಾರಿಯುತ ಡಿಜಿಟಲ್ ಪೌರತ್ವವನ್ನು (ಕಾನೂನಾತ್ಮಕ ಮತ್ತು ನೈತಿಕ ವರ್ತನೆಗಳು) ಅಭ್ಯಾಸ ಮಾಡಿ."
        },
        "CL.L1:6-02": {
          "description": "ಅಭಿವೃದ್ಧಿಗೊಳ್ಳುತ್ತಿರುವ ಪರಿಹಾರಗಳು ಅಥವಾ ಉತ್ಪನ್ನಗಳ ಉದ್ದೇಶಕ್ಕೆ ಸಹಭಾಗಿತ್ವದ ಸಮಸ್ಯೆ ಪರಿಹಾರ ಚಟುವಟಿಕೆಗಳಲ್ಲಿ ಭಾಗವಹಿಸಲು ಆನ್‌ಲೈನ್ ಸಂಪನ್ಮೂಲಗಳನ್ನು (ಉದಾ., ಇಮೇಲ್, ಆನ್‌ಲೈನ್‌ ಚರ್ಚೆಗಳು, ಸಹಭಾಗಿತ್ವ ವೆಬ್ ಪರಿಸರಗಳು) ಬಳಸಿ."
        },
        "CPP.L1:3-01": {
          "description": "ವಯಸ್ಸಿಗೆ ಸೂಕ್ತ ಸಂಶೋಧನೆಯನ್ನು ನಡೆಸಲು ತಂತ್ರಜ್ಞಾನ ಸಂಪನ್ಮೂಲಗಳನ್ನು ಬಳಸಿ."
        },
        "CPP.L1:3-02": {
          "description": "ಪಠ್ಯಕ್ರಮದಾದ್ಯಂತ ಕಲಿಕೆಗೆ ಬೆಂಬಲ ನೀಡಲು ಅಭಿವೃದ್ಧಿಯುತವಾಗಿ ಸೂಕ್ತವಾದ ಮಲ್ಟಿಮೀಡಿಯಾ ಸಂಪನ್ಮೂಲಗಳನ್ನು (ಉದಾ., ಇಂಟರ್ಯಾಕ್ಟಿವ್ ಪುಸ್ತಕಗಳು ಮತ್ತು ಶೈಕ್ಷಣಿಕ ಸಾಫ್ಟ್‌ವೇರ್‌) ಬಳಸಿ."
        },
        "CPP.L1:3-04": {
          "description": "ಸರಳ ಟಾಸ್ಕ್ ಅನ್ನು ಸಾಧಿಸಲು ಕ್ರಮ ವಹಿಸುವ ಹೇಳಿಕೆಗಳ ಗುಚ್ಛವನ್ನು ರಚಿಸಿ (ಉದಾ., ಟರ್ಟಲ್‌ ಸೂಚನೆಗಳು)."
        },
        "CPP.L1:6-01": {
          "description": "ಸಮಸ್ಯೆ ಪರಿಹಾರ ಮತ್ತು ಸ್ವಯಂ ನಿರ್ದೇಶಿತ ಕಲಿಕೆಗೆ ತಂತ್ರಜ್ಞಾನ ಸಂಪನ್ಮೂಲಗಳನ್ನು ಬಳಸಿ (ಉದಾ., ಕ್ಯಾಲಕ್ಯುಲೇಟರ್‌ಗಳು, ಡೇಟಾ ಸಂಗ್ರಹ ಪ್ರೋಬ್‌ಗಳು, ಮೊಬೈಲ್ ಸಾಧನಗಳು, ವೀಡಿಯೋಗಳು, ಶೈಕ್ಷಣಿಕ ಸಾಫ್ಟ್‌ವೇರ್ ಮತ್ತು ವೆಬ್‌ ಟೂಲ್‌ಗಳು)."
        },
        "CPP.L1:6-06": {
          "description": "ಬ್ಲಾಕ್ ಆಧರಿತ ವಿಶುವಲ್ ಪ್ರೋಗ್ರಾಮಿಂಗ್‌ ಭಾಷೆಯನ್ನು ಬಳಸಿ ಸಮಸ್ಯೆ ಪರಿಹಾರಗಳನ್ನು ಅನುಷ್ಠಾನಗೊಳಿಸಿ."
        },
        "CPP.L2:3": {
          "description": "ಪಠ್ಯಕ್ರಮ ಪರಿಕಲ್ಪನೆಗಳನ್ನು ಪ್ರದರ್ಶಿಸಲು ಮತ್ತು ಸಂವಹನ ನಡೆಸಲು ತಂತ್ರಜ್ಞಾನ ಸಂಪನ್ಮೂಲಗಳನ್ನು ಬಳಸಿ ಉತ್ಪನ್ನಗಳನ್ನು ವಿನ್ಯಾಸ ಮಾಡಿ, ಅಭಿವೃದ್ಧಿಪಡಿಸಿ, ಪ್ರಕಟಿಸಿ ಮತ್ತು ಉತ್ಪನ್ನಗಳನ್ನು ಪ್ರಸ್ತುತಪಡಿಸಿ (ಉದಾ., ವೆಬ್‌ ಪುಟಗಳು, ಮೊಬೈಲ್ ಅಪ್ಲಿಕೇಶನ್‌ಗಳು, ಆನಿಮೇಶನ್‌ಗಳು)."
        },
        "CT.L2:1": {
          "description": "ವಿನ್ಯಾಸ ಪರಿಹಾರಗಳಿಗೆ ಅಲ್ಗೊರಿಥಮ್‌ ಸಂಬಂಧಿ ಸಮಸ್ಯೆ ಪರಿಹಾರದಲ್ಲಿ ಪ್ರಾಥಮಿಕ ಕ್ರಮಗಳನ್ನು ಬಳಸಿ (ಉದಾ., ಸಮಸ್ಯೆ ಹೇಳಿಕೆ ಮತ್ತು ಅನಾವರಣ, ಮಾದರಿ ಘಟನೆಗಳ ತಪಾಸಣೆ, ವಿನ್ಯಾಸ, ಪರಿಹಾರವನ್ನು ಅನುಷ್ಠಾನಗೊಳಿಸುವುದು, ಪರೀಕ್ಷಿಸುವುದು ಮತ್ತು ಮೌಲೀಕರಣ)."
        },
        "CT.L2:12": {
          "description": "ಉಪ ಸಮಸ್ಯೆಗಳಿಗೆ ಸಮಸ್ಯೆಯನ್ನು ಡಿಕಂಪೋಸ್ ಮಾಡಲು ಅಬ್‌ಸ್ಟ್ರಾಕ್ಷನ್ ಬಳಸಿ."
        },
        "CT.L2:6": {
          "description": "ಅನುಸರಿಸಲಾಗುವ ಸೂಚನೆಗಳ ಅನುಕ್ರಮವನ್ನು ವಿವರಿಸಿ ಮತ್ತು ವಿಶ್ಲೇಷಿಸಿ (ಉದಾ., ನಿಯಮ ಮತ್ತು ಅಲ್ಗೊರಿಥಂಗಳನ್ನು ಆಧರಿಸಿದ ವೀಡಿಯೋ ಗೇಮ್‌ನಲ್ಲಿ ಕ್ಯಾರೆಕ್ಟರ್‌ನ ವರ್ತನೆಯನ್ನು ವಿವರಿಸಿ)."
        },
        "CT.L2:7": {
          "description": "ಪಠ್ಯ, ಧ್ವನಿಗಳು, ಚಿತ್ರಗಳು ಮತ್ತು ಸಂಖ್ಯೆಗಳು ಸೇರಿದಂತೆ ಹಲವು ವಿಧಗಳಲ್ಲಿ ಡೇಟಾ ಪ್ರತಿನಿಧಿಸಿ."
        },
        "CT.L2:8": {
          "description": "ಸಮಸ್ಯೆ ಸ್ಥಿತಿಗಳು, ರಚನೆಗಳು ಮತ್ತು ಡೇಟಾದ ಗೋಚರ ಪ್ರತಿನಿಧಿತ್ವಗಳನ್ನು ಬಳಸಿ (ಉದಾ., ಗ್ರಾಫ್‌ಗಳು, ಚಾರ್ಟ್‌ಗಳು, ನೆಟ್‌ವರ್ಕ್‌ ಡಯಾಗ್ರಾಮ್‌ಗಳು, ಫ್ಲೋಚಾರ್ಟ್‌ಗಳು)."
        },
        "1.L.6": {
          "description": "ಸರಳ ಸಂಬಂಧಗಳನ್ನು (ಉದಾ., ಯಾಕೆಂದರೆ) ಸೂಚಿಸಲು ಪದೇ ಪದೇ ಕಂಡುಬರುವ ಕಂಜಂಕ್ಷನ್‌ಗಳನ್ನು ಬಳಸುವುದೂ ಸೇರಿದಂತೆ ಸಂವಾದಗಳು, ಓದುವುದು ಮತ್ತು ಓದಲಾಗಿರುವ ಮತ್ತು ಪಠ್ಯಗಳಿಗೆ ಪ್ರತಿಕ್ರಿಯಿಸುವ ಮೂಲಕ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳನ್ನು ಬಳಸಿ."
        },
        "11-12.L.6": {
          "description": "ಕಾಲೇಜು ಮತ್ತು ವೃತ್ತಿ ಸಿದ್ಧತೆ ಮಟ್ಟದಲ್ಲಿ ಸಾಮಾನ್ಯ ಶೈಕ್ಷಣಿಕ ಮತ್ತು ಡೊಮೇನ್ ಆಧರಿತ, ಓದಲು, ಬರೆಯಲು, ಮಾತನಾಡಲು ಮತ್ತು ಕೇಳಲು ಸೂಕ್ತವಾದ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳನ್ನು ನಿಖರವಾಗಿ ಬಳಸಿ ಮತ್ತು ಸ್ವಾಧೀನಪಡಿಸಿಕೊಳ್ಳಿ; ಪರಿಗಣಿಸಿದಾಗ ಶಬ್ದಕೋಶವನ್ನು ಗ್ರಹಿಸಲು ಸ್ವಾತಂತ್ರ್ಯವನ್ನು ಒದಗಿಸಿ"
        },
        "2.L.6": {
          "description": "ವಿವರಿಸಲು ಅಡ್ಜೆಕ್ಟಿವ್‌ಗಳು ಮತ್ತು ಅಡ್‌ವರ್ಬ್‌ಗಳನ್ನು (ಉದಾ., ಇತರ ಮಕ್ಕಳು ಖುಷಿಯಾದಾಗ ನನಗೆ ಖುಷಿಯಾಗುತ್ತದೆ) ಬಳಸುವುದೂ ಸೇರಿದಂತೆ ಸಂವಾದಗಳು, ಓದುವುದು ಮತ್ತು ಓದಲಾಗಿರುವ ಮತ್ತು ಪಠ್ಯಗಳಿಗೆ ಪ್ರತಿಕ್ರಿಯಿಸುವ ಮೂಲಕ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳನ್ನು ಬಳಸಿ."
        },
        "3.L.6": {
          "description": "ಸಂಕೇತ ವ್ಯಾಪ್ತ ಮತ್ತು ತಾತ್ಕಾಲಿಕ ಸಂಬಂಧಗಳೂ ಸೇರಿದಂತೆ (ಉದಾ., ರಾತ್ರಿಯೂಟದ ನಂತರ ನಾವು ಅವರನ್ನು ಹುಡುಕುತ್ತಾ ಹೋದೆವು) ಸೂಕ್ತ ಸಂವಾದಾತ್ಮಕ, ಸಾಮಾನ್ಯ ಶೈಕ್ಷಣಿಕ ಮತ್ತು ಡೊಮೇನ್ ಸಂಬಂಧಿತ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳ ಸೂಕ್ತ ಗ್ರೇಡ್ ಅನ್ನು ಸ್ವಾಧೀನಪಡಿಸಿಕೊಳ್ಳಿ ಮತ್ತು ಬಳಸಿ."
        },
        "4.L.6": {
          "description": "ನಿಖರ ಕ್ರಮಗಳು, ಭಾವನೆಗಳು ಅಥವಾ ಸ್ಥಿತಿಗಳನ್ನು ಸೂಚಿಸುವ (ಉದಾ., ಪ್ರಶ್ನಿಸಿದ, ಕಣ್ಣುಹೊಡೆದ, ಹಠಾತ್ತನೆ ಮಾತನಾಡಿದ) ಮತ್ತು ನಿರ್ದಿಷ್ಟ ವಿಷಯಕ್ಕೆ ಪ್ರಾಥಮಿಕವಾಗಿರುವುದೂ ಒಳಗೊಂಡಂತೆ ಗ್ರೇಡ್‌ಗೆ ಸೂಕ್ತವಾದ ಸಾಮಾನ್ಯ ಶೈಕ್ಷಣಿಕ ಮತ್ತು ಡೊಮೇನ್ ಸಂಬಂಧಿ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳನ್ನು ನಿಖರವಾಗಿ ಬಳಸಿ ಮತ್ತು ಸ್ವಾಧೀನಪಡಿಸಿಕೊಳ್ಳಿ (ಉದಾ.,"
        },
        "5.L.6": {
          "description": "ವ್ಯತಿರಿಕ್ತ, ಸಂಕಲನ ಮತ್ತು ಇತರ ಲಾಜಿಕಲ್‌ ಸಂಬಂಧಗಳನ್ನು (ಉದಾ., ಆದಾಗ್ಯೂ, ಆದರೂ, ಏನೇ ಆದರೂ, ಇದೇ ರೀತಿ, ಹೆಚ್ಚಿನದಾಗಿ, ಇದರ ಜೊತೆಗೆ) ಸೂಚಿಸುವುದೂ ಸೇರಿದಂತೆ ಗ್ರೇಡ್‌ಗೆ ಸಂಬಂಧಿಸಿದ ಸಾಮಾನ್ಯ ಶೈಕ್ಷಣಿಕ ಮತ್ತು ಡೊಮೇನ್ ಸಂಬಂಧಿತ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳನ್ನು ನಿಖರವಾಗಿ ಬಳಸಿ ಮತ್ತು ಸ್ವಾಧೀನಪಡಿಸಿಕೊಳ್ಳಿ."
        },
        "9-10.L.6": {
          "description": "ಕಾಲೇಜು ಮತ್ತು ವೃತ್ತಿ ಸಿದ್ಧತೆ ಮಟ್ಟದಲ್ಲಿ ಸಾಮಾನ್ಯ ಶೈಕ್ಷಣಿಕ ಮತ್ತು ಡೊಮೇನ್ ಆಧರಿತ, ಓದಲು, ಬರೆಯಲು, ಮಾತನಾಡಲು ಮತ್ತು ಕೇಳಲು ಸೂಕ್ತವಾದ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳನ್ನು ನಿಖರವಾಗಿ ಬಳಸಿ ಮತ್ತು ಸ್ವಾಧೀನಪಡಿಸಿಕೊಳ್ಳಿ; ಪರಿಗಣಿಸಿದಾಗ ಶಬ್ದಕೋಶವನ್ನು ಗ್ರಹಿಸಲು ಸ್ವಾತಂತ್ರ್ಯವನ್ನು ಒದಗಿಸಿ"
        },
        "11-12.RI.4": {
          "description": "ಸಾಂಕೇತಿಕ, ಅರ್ಥಪೂರ್ಣ ಮತ್ತು ತಾಂತ್ರಿಕ ಅರ್ಥಗಳೂ ಸೇರಿದಂತೆ ಪಠ್ಯದಲ್ಲಿ ಬಳಸಿದಂತೆಯೇ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳ ಅರ್ಥವನ್ನು ಗುರುತಿಸಿ; ಪಠ್ಯದಲ್ಲಿ ಪ್ರಮುಖ ಪದ ಅಥವಾ ಪದಗಳ ಅರ್ಥವನ್ನು ಲೇಖಕರು ಹೇಗೆ ಬಳಸುತ್ತಾರೆ ಮತ್ತು ಪರಿಷ್ಕರಿಸುತ್ತಾರೆ ಎಂಬುದನ್ನು ವಿಶ್ಲೇಷಿಸಿ. (ಉದಾ., ಮ್ಯಾಡಿಸನ್ ಹೇಗೆ ವ್ಯಾಖ್ಯಾನಿಸುತ್ತಾರೆ"
        },
        "3.RL.4": {
          "description": "ಪಠ್ಯದಲ್ಲಿ ಬಳಸಿದ ಹಾಗೆ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳ ಅರ್ಥವನ್ನು ನಿರ್ಧರಿಸಿ ಮತ್ತು ಅಕ್ಷರಶಃ ಮತ್ತು ಅಕ್ಷರಶಃ ಅಲ್ಲದ ಭಾಷೆಗೆ ವ್ಯತ್ಯಾಸವನ್ನು ಗುರುತಿಸಿ."
        },
        "4.RL.7": {
          "description": "ಒಂದು ಕಥೆ ಅಥವಾ ನಾಟಕದ ಪಠ್ಯದ ಮತ್ತು ಪಠ್ಯದ ಮೌಖಿಕ ಪ್ರಸ್ತುತಿ ಅಥವಾ ದೃಶ್ಯ ಪ್ರಸ್ತುತಿ ಮಧ್ಯೆ ಸಂಪರ್ಕ ಸಾಧಿಸಿ ಮತ್ತು ನಿರ್ದಿಷ್ಟ ವಿವರಗಳು ಮತ್ತು ನಿರ್ದೇಶನಗಳನ್ನು ಪಠ್ಯದಲ್ಲಿ ಪ್ರತಿಫಲಿಸುತ್ತದೆ ಎಂಬುದನ್ನು ಗುರುತಿಸಿ."
        },
        "5.RL.4": {
          "description": "ರೂಪಕಗಳು ಮತ್ತು ಸ್ಮೈಲೀಗಳಂತಹ ಸಚಿತ್ರ ಭಾಷೆಯೂ ಸೇರಿದಂತೆ ಪಠ್ಯದಲ್ಲಿ ಬಳಸಿದ ಶಬ್ದಗಳು ಮತ್ತು ಪದಗುಚ್ಛಗಳ ಅರ್ಥವನ್ನು ತಿಳಿದುಕೊಳ್ಳಿ."
        },
        "5.RL.7": {
          "description": "ಪಠ್ಯದ ಅರ್ಥ, ಟೋನ್ ಅಥವಾ ಸೌಂದರ್ಯಕ್ಕೆ ಹೇಗೆ ದೃಶ್ಯ ಮತ್ತು ಮಲ್ಟಿಮೀಡಿಯಾ ಅಂಶಗಳು ಕೊಡುಗೆ ನೀಡುತ್ತವೆ ಎಂದು ವಿಶ್ಲೇಷಣೆ ಮಾಡಿ (ಉದಾ., ಕಲ್ಪನಾ ಕಾದಂಬರಿ, ಕಥೆ, ಜಾನಪದ, ಮಿಥ್ಯ, ಕವನದ ಮಲ್ಟಿಮೀಡಿಯಾ ಪ್ರಸ್ತುತಿ)."
        },
        "1.SL.1": {
          "description": "ಸಣ್ಣ ಮತ್ತು ದೊಡ್ಡ ಗುಂಪುಗಳಲ್ಲಿ ಸಹಭಾಗಿಗಳು ಮತ್ತು ವಯಸ್ಕರೊಂದಿಗೆ ಗ್ರೇಡ್ 1 ವಿಷಯಗಳು ಮತ್ತು ಪಠ್ಯಗಳ ಬಗ್ಗೆ ವೈವಿಧ್ಯಮಯ ಪಾಲುದಾರರುಗಳೊಂದಿಗೆ ಸಹಭಾಗಿತ್ವದ ಸಂವಾದಗಳಲ್ಲಿ ತೊಡಗಿಸಿಕೊಳ್ಳಿ."
        },
        "2.SL.1": {
          "description": "ಸಣ್ಣ ಮತ್ತು ದೊಡ್ಡ ಗುಂಪುಗಳಲ್ಲಿ ಸಹಭಾಗಿಗಳು ಮತ್ತು ವಯಸ್ಕರೊಂದಿಗೆ ಗ್ರೇಡ್ 2 ವಿಷಯಗಳು ಮತ್ತು ಪಠ್ಯಗಳ ಬಗ್ಗೆ ವೈವಿಧ್ಯಮಯ ಪಾಲುದಾರರುಗಳೊಂದಿಗೆ ಸಹಭಾಗಿತ್ವದ ಸಂವಾದಗಳಲ್ಲಿ ತೊಡಗಿಸಿಕೊಳ್ಳಿ."
        },
        "3.SL.1": {
          "description": "ಇತರರ ಐಡಿಯಾಗಳು ಮತ್ತು ತಮ್ಮದೇ ಐಡಿಯಾಗಳನ್ನು ಸ್ಪಷ್ಟವಾಗಿ ಅಭಿವ್ಯಕ್ತಿಗೊಳಿಸಿ ಗ್ರೇಡ್ 3 ವಿಷಯಗಳು ಮತ್ತು ಪಠ್ಯಗಳ ಕುರಿತು ವೈವಿಧ್ಯಮಯ ಪಾಲುದಾರರೊಂದಿಗೆ ವಿವಿಧ ಸಂಯೋಜನಾತ್ಮಕ ಚರ್ಚೆಗಳಲ್ಲಿ (ಮುಖಾಮುಖಿ, ಗುಂಪುಗಳಲ್ಲಿ ಮತ್ತು ಶಿಕ್ಷಕರ ನೇತೃತ್ವದ) ಪರಿಣಾಮಕಾರಿಯಾಗಿ ತೊಡಗಿಸಿಕೊಳ್ಳಿ."
        },
        "6.SL.1": {
          "description": "ಇತರರ ಐಡಿಯಾಗಳು ಮತ್ತು ತಮ್ಮದೇ ಐಡಿಯಾಗಳನ್ನು ಸ್ಪಷ್ಟವಾಗಿ ಅಭಿವ್ಯಕ್ತಿಗೊಳಿಸಿ ಗ್ರೇಡ್ 6 ವಿಷಯಗಳು, ಪಠ್ಯಗಳು ಮತ್ತು ಸಮಸ್ಯೆಗಳ ಕುರಿತು ವೈವಿಧ್ಯಮಯ ಪಾಲುದಾರರೊಂದಿಗೆ ವಿವಿಧ ಸಂಯೋಜನಾತ್ಮಕ ಚರ್ಚೆಗಳಲ್ಲಿ (ಮುಖಾಮುಖಿ, ಗುಂಪುಗಳಲ್ಲಿ ಮತ್ತು ಶಿಕ್ಷಕರ ನೇತೃತ್ವದ) ಪರಿಣಾಮಕಾರಿಯಾಗಿ ತೊಡಗಿಸಿಕೊಳ್ಳಿ."
        },
        "7.SL.1": {
          "description": "ಇತರರ ಐಡಿಯಾಗಳು ಮತ್ತು ತಮ್ಮದೇ ಐಡಿಯಾಗಳನ್ನು ಸ್ಪಷ್ಟವಾಗಿ ಅಭಿವ್ಯಕ್ತಿಗೊಳಿಸಿ ಗ್ರೇಡ್ 7 ವಿಷಯಗಳು, ಪಠ್ಯಗಳು ಮತ್ತು ಸಮಸ್ಯೆಗಳ ಕುರಿತು ವೈವಿಧ್ಯಮಯ ಪಾಲುದಾರರೊಂದಿಗೆ ವಿವಿಧ ಸಂಯೋಜನಾತ್ಮಕ ಚರ್ಚೆಗಳಲ್ಲಿ (ಮುಖಾಮುಖಿ, ಗುಂಪುಗಳಲ್ಲಿ ಮತ್ತು ಶಿಕ್ಷಕರ ನೇತೃತ್ವದ) ಪರಿಣಾಮಕಾರಿಯಾಗಿ ತೊಡಗಿಸಿಕೊಳ್ಳಿ."
        },
        "11-12.W.6": {
          "description": "ಹೊಸ ವ್ಯವಸ್ಥೆಗಳು ಅಥವಾ ಮಾಹಿತಿ ಸೇರಿದಂತೆ ಚಾಲ್ತಿಯಲ್ಲಿರುವ ಪ್ರತಿಕ್ರಿಯೆಗೆ ಪ್ರತಿಕ್ರಿಯೆಯಾಗಿ ಪ್ರತ್ಯೇಕ ಅಥವಾ ಹಂಚಿದ ಬರೆಯುವ ಉತ್ಪನ್ನಗಳನ್ನು ಉತ್ಪಾದಿಸಲು, ಪ್ರಕಟಿಸಲು ಮತ್ತು ನವೀಕರಿಸಲು ಇಂಟರ್ನೆಟ್‌ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ."
        },
        "3.W.3": {
          "description": "ಪರಿಣಾಮಕಾರಿ ತಂತ್ರ, ವಿವರಣಾತ್ಮಕ ವಿವರಗಳು ಮತ್ತು ಸ್ಪಷ್ಟ ಈವೆಂಟ್‌ ಸನ್ನಿವೇಶಗಳನ್ನು ಬಳಸಿ ನೈಜ ಅಥವಾ ಊಹೆಯ ಅನುಭವಗಳು ಅಥವಾ ಈವೆಂಟ್‌ಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲು ನಿರೂಪಣೆಗಳನ್ನು ಬರೆಯಿರಿ."
        },
        "4.W.3": {
          "description": "ಪರಿಣಾಮಕಾರಿ ತಂತ್ರ, ವಿವರಣಾತ್ಮಕ ವಿವರಗಳು ಮತ್ತು ಸ್ಪಷ್ಟ ಈವೆಂಟ್‌ ಸನ್ನಿವೇಶಗಳನ್ನು ಬಳಸಿ ನೈಜ ಅಥವಾ ಊಹೆಯ ಅನುಭವಗಳು ಅಥವಾ ಈವೆಂಟ್‌ಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲು ನಿರೂಪಣೆಗಳನ್ನು ಬರೆಯಿರಿ."
        },
        "5.W.3": {
          "description": "ಪರಿಣಾಮಕಾರಿ ತಂತ್ರ, ವಿವರಣಾತ್ಮಕ ವಿವರಗಳು ಮತ್ತು ಸ್ಪಷ್ಟ ಈವೆಂಟ್‌ ಸನ್ನಿವೇಶಗಳನ್ನು ಬಳಸಿ ನೈಜ ಅಥವಾ ಊಹೆಯ ಅನುಭವಗಳು ಅಥವಾ ಈವೆಂಟ್‌ಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲು ನಿರೂಪಣೆಗಳನ್ನು ಬರೆಯಿರಿ."
        },
        "6.W.3": {
          "description": "ಪರಿಣಾಮಕಾರಿ ತಂತ್ರ, ಸೂಕ್ತ ವಿವರಣಾತ್ಮಕ ವಿವರಗಳು ಮತ್ತು ಉತ್ತಮ ರಚನಾತ್ಮಕ ಈವೆಂಟ್‌ ಸನ್ನಿವೇಶಗಳನ್ನು ಬಳಸಿ ನೈಜ ಅಥವಾ ಊಹೆಯ ಅನುಭವಗಳು ಅಥವಾ ಈವೆಂಟ್‌ಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲು ನಿರೂಪಣೆಗಳನ್ನು ಬರೆಯಿರಿ."
        },
        "6.W.6": {
          "description": "ಬರೆದಿರುವುದನ್ನು ಪ್ರಕಟಿಸಲು ಮತ್ತು ಉತ್ಪಾದಿಸಲು ಹಾಗೂ ಇತರರೊಂದಿಗೆ ಸಂವಹನ ನಡೆಸಲು ಮತ್ತು ಸಹಭಾಗಿತ್ವ ಸಾಧಿಸಲು ಇಂಟರ್ನೆಟ್‌ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ; ಒಂದೇ ಬಾರಿಗೆ ಕನಿಷ್ಠ ಮೂರು ಪುಟಗಳನ್ನು ಟೈಪ್ ಮಾಡಲು ಕೀಬೋರ್ಡ್‌ ಕೌಶಲಗಳ ಕುರಿತು ಸಾಕಷ್ಟು ಪರಿಣಿತಿಯನ್ನು ಸಾಧಿಸುವುದು."
        },
        "7.W.3": {
          "description": "ಪರಿಣಾಮಕಾರಿ ತಂತ್ರ, ಸೂಕ್ತ ವಿವರಣಾತ್ಮಕ ವಿವರಗಳು ಮತ್ತು ಉತ್ತಮ ರಚನಾತ್ಮಕ ಈವೆಂಟ್‌ ಸನ್ನಿವೇಶಗಳನ್ನು ಬಳಸಿ ನೈಜ ಅಥವಾ ಊಹೆಯ ಅನುಭವಗಳು ಅಥವಾ ಈವೆಂಟ್‌ಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲು ನಿರೂಪಣೆಗಳನ್ನು ಬರೆಯಿರಿ."
        },
        "7.W.6": {
          "description": "ಬರವಣಿಗೆಯನ್ನು ಉತ್ಪಾದಿಸಲು ಮತ್ತು ಪ್ರಕಟಿಸಲು ಇಂಟರ್ನೆಟ್ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ ಮೂಲಗಳನ್ನು ಸಂಪರ್ಕಿಸುವುದು ಮತ್ತು ಉಲ್ಲೇಖಿಸುವುದೂ ಸೇರಿದಂತೆ ಇತರರೊಂದಿಗೆ ಸಂವಹನ ಮತ್ತು ಸಹಭಾಗಿತ್ವ ಸಾಧಿಸಲು ಹಾಗೂ ಮೂಲಗಳನ್ನು ಲಿಂಕ್‌ ಮಾಡಿ ಮತ್ತು ಉಲ್ಲೇಖಿಸಿ."
        },
        "8.W.3": {
          "description": "ಪರಿಣಾಮಕಾರಿ ತಂತ್ರ, ಸೂಕ್ತ ವಿವರಣಾತ್ಮಕ ವಿವರಗಳು ಮತ್ತು ಉತ್ತಮ ರಚನಾತ್ಮಕ ಈವೆಂಟ್‌ ಸನ್ನಿವೇಶಗಳನ್ನು ಬಳಸಿ ನೈಜ ಅಥವಾ ಊಹೆಯ ಅನುಭವಗಳು ಅಥವಾ ಈವೆಂಟ್‌ಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲು ನಿರೂಪಣೆಗಳನ್ನು ಬರೆಯಿರಿ."
        },
        "8.W.6": {
          "description": "ಉತ್ಪಾದಿಸಲು ಮತ್ತು ಬರೆಯುವುದನ್ನು ಪ್ರಕಟಿಸಲು ಮತ್ತು ಇತರರೊಂದಿಗೆ ಸಂವಹನ ನಡೆಸಲು ಮತ್ತು ಸಹಭಾಗಿತ್ವ ಸಾಧಿಸಲು ಮಾಹಿತಿ ಮತ್ತು ಪರಿಕಲ್ಪನೆಗಳ ಮಧ್ಯೆ ದಕ್ಷವಾಗಿ ಸಂಬಂಧಗಳನ್ನು ಪ್ರಸ್ತುತಪಡಿಸಲು ಇಂಟರ್ನೆಟ್‌ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ."
        },
        "9-10.W.6": {
          "description": "ಪ್ರತ್ಯೇಕ ಅಥವಾ ಹಂಚಿದ ಬರೆಯುವ ಉತ್ಪನ್ನಗಳನ್ನು ಉತ್ಪಾದಿಸಲು, ಪ್ರಕಟಿಸಲು ಮತ್ತು ನವೀಕರಿಸಲು, ಇತರ ಮಾಹಿತಿಗೆ ಲಿಂಕ್ ಮಾಡಲು ತಂತ್ರಜ್ಞಾನದ ಸಾಮರ್ಥ್ಯದ ಅನುಕೂಲವನ್ನು ತೆಗೆದುಕೊಳ್ಳಲು ಮತ್ತು ಮಾಹಿತಿಯನ್ನು ಫ್ಲೆಕ್ಸಿಬಲ್ ಆಗಿ ಮತ್ತು ಡೈನಾಮಿಕ್ ಆಗಿ ಪ್ರದರ್ಶಿಸಲು ಇಂಟರ್ನೆಟ್‌ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ."
        },
        "11-12.WHST.6": {
          "description": "ಹೊಸ ವ್ಯವಸ್ಥೆಗಳು ಅಥವಾ ಮಾಹಿತಿ ಸೇರಿದಂತೆ ಚಾಲ್ತಿಯಲ್ಲಿರುವ ಪ್ರತಿಕ್ರಿಯೆಗೆ ಪ್ರತಿಕ್ರಿಯೆಯಾಗಿ ಪ್ರತ್ಯೇಕ ಅಥವಾ ಹಂಚಿದ ಬರೆಯುವ ಉತ್ಪನ್ನಗಳನ್ನು ಉತ್ಪಾದಿಸಲು, ಪ್ರಕಟಿಸಲು ಮತ್ತು ನವೀಕರಿಸಲು ಇಂಟರ್ನೆಟ್‌ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ."
        },
        "9-10.WHST.6": {
          "description": "ಪ್ರತ್ಯೇಕ ಅಥವಾ ಹಂಚಿದ ಬರೆಯುವ ಉತ್ಪನ್ನಗಳನ್ನು ಉತ್ಪಾದಿಸಲು, ಪ್ರಕಟಿಸಲು ಮತ್ತು ನವೀಕರಿಸಲು, ಇತರ ಮಾಹಿತಿಗೆ ಲಿಂಕ್ ಮಾಡಲು ತಂತ್ರಜ್ಞಾನದ ಸಾಮರ್ಥ್ಯದ ಅನುಕೂಲವನ್ನು ತೆಗೆದುಕೊಳ್ಳಲು ಮತ್ತು ಮಾಹಿತಿಯನ್ನು ಫ್ಲೆಕ್ಸಿಬಲ್ ಆಗಿ ಮತ್ತು ಡೈನಾಮಿಕ್ ಆಗಿ ಪ್ರದರ್ಶಿಸಲು ಇಂಟರ್ನೆಟ್‌ ಸೇರಿದಂತೆ ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸಿ."
        },
        "7.G.2": {
          "description": "(ಫ್ರೀಹ್ಯಾಂಡ್‌, ರೂಲರ್ ಮತ್ತು ಪ್ರೋಟ್ರ್ಯಾಕ್ಟರ್ ಮತ್ತು ತಂತ್ರಜ್ಞಾನ ಬಳಸಿ) ಜಾಮೆಟ್ರಿ ಆಕಾರಗಳನ್ನು ನೀಡಿದ ಸ್ಥಿತಿಗಳಲ್ಲಿ ಎಳೆಯಿರಿ. ಒಂದು ಕೋನಕ್ಕಿಮತ ಹೆಚ್ಚಾಗಿ ವಿಶಿಷ್ಟ ತ್ರಿಕೋನವನ್ನು ಯಾವಾಗ ಷರತ್ತುಗಳು ಪೂರೈಸುತ್ತವೆ ಎಂಬುದನ್ನು ಗಮನಿಸಿ ಮೂರು ಕೋನಗಳು ಅಥವಾ ಬದಿಗಳ ಮೂರು ಅಳತೆಗಳಿಂದ ತ್ರಿಕೋನಗಳನ್ನು ರಚಿಸುವಲ್ಲಿ ಗಮನ ಹರಿಸಿ"
        },
        "4.MD.6": {
          "description": "ಪ್ರೋಟ್ರಾಕ್ಟರ್ ಬಳಸಿ ಪೂರ್ಣ ಸಂಖ್ಯೆ ಡಿಗ್ರಿಗಳಲ್ಲಿನ ಕೋನಗಳನ್ನು ಅಳೆಯಿರಿ. ನಿರ್ದಿಷ್ಟ ಅಳತೆಯ ಕೋನಗಳನ್ನು ಸ್ಕೆಚ್ ಮಾಡಿ."
        },
        "MP.1": {
          "description": "ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸಲು ಮತ್ತು ಸಂರಕ್ಷಿಸಲು ಸೂಕ್ತವಾಗಿದೆ"
        },
        "MP.2": {
          "description": "ಅಮೂರ್ತವಾಗಿ ಮತ್ತು ಪರಿಣಾಮಾತ್ಮಕವಾಗಿ ಕಾರಣ"
        },
        "MP.4": {
          "description": "ಗಣಿತಗಳೊಂದಿಗೆ ಮಾಡೆಲ್"
        },
        "MP.5": {
          "description": "ಸೂಕ್ತ ಪರಿಕರಗಳನ್ನು ವ್ಯೂಹಾತ್ಮಕವಾಗಿ ಬಳಸಿ"
        },
        "MP.6": {
          "description": "ನಿಖರತೆಗೆ ಗಮನವಿಡಿ"
        },
        "MP.7": {
          "description": "ರಚನೆಯನ್ನು ನೋಡಿ ಮತ್ತು ಅದರ ಬಳಕೆ ಮಾಡಿಕೊಳ್ಳಿ"
        },
        "MP.8": {
          "description": "ಪುನರಾವರ್ತಿತ ರೀಸನಿಂಗ್‌ನಲ್ಲಿ ನಿಯತತೆಯನ್ನು ಎದುರು ನೋಡಿ ಮತ್ತು ಅಭಿವ್ಯಕ್ತಿ ಇರಲಿ"
        },
        "4.NBT.4": {
          "description": "ಪ್ರಮಾಣಿತ ಅಲ್ಗೊರಿಥಂ ಅನ್ನು ಬಳಸಿ ಬಹು ಅಂಕಿಯ ಪೂರ್ಣ ಸಂಖ್ಯೆಗಳನ್ನು ಸರಾಗವಾಗಿ ಸೇರಿಸಿ ಮತ್ತು ಕಳೆಯಿರಿ."
        },
        "4.NBT.5": {
          "description": "ಒಂದು ಪೂರ್ಣ ಸಂಖ್ಯೆಯಿಂದ ಗರಿಷ್ಠ ನಾಲ್ಕು ಸಂಖ್ಯೆಗಳ ಪೂರ್ಣ ಸಂಖ್ಯೆಯನ್ನು ಗುಣಿಸಿ ಮತ್ತು ಮೌಲ್ಯವನ್ನು ಆಧರಿಸಿದ ಕಾರ್ಯತಂತ್ರಗಳು ಮತ್ತು ಕಾರ್ಯಾಚರಣೆಗಳ ಗುಣಲಕ್ಷಣಗಳನ್ನು ಬಳಸಿ ಎರಡು ಅಂಕಿಗಳ ಸಂಖ್ಯೆಯನ್ನು ಗುಣಿಸಿ. ಸಮೀಕರಣಗಳು, ಆಯತವನ್ನು ಬಳಸಿ ಲೆಕ್ಕಾಚಾರವನ್ನು ರಚಿಸಿ ಮತ್ತು ವಿವರಿಸಿ."
        },
        "1.OA.1": {
          "description": "ಅಧಿಕ ಮತ್ತು ಗುಣಾಕಾರವನ್ನು 20 ರಲ್ಲಿ ಬಳಸಿಕೊಂಡು ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸಿ. ಇದರಲ್ಲಿ, ಸೇರಿಸುವುದು, ತೆಗೆದುಕೊಳ್ಳುವುದು, ಒಟ್ಟು ಸೇರಿಸುವುದು, ಪ್ರತ್ಯೇಕಿಸುವುದು ಮತ್ತು ಹೋಲಿಕೆ ಮಾಡುವ ಸನ್ನಿವೇಶಗಳೂ ಒಳಗೊಂಡಿರಬಹುದು ಮತ್ತು ಇದರ ಎಲ್ಲ ಸ್ಥಾನಗಳಲ್ಲಿ ಅನಾಮಿಕ ಅಂಶಗಳೂ ಒಳಗೊಂಡಿರಬಹುದು. ಉದಾ., ವಸ್ತುಗಳು, ಡ್ರಾಯಿಂಗ್‌ಗಳು ಮತ್ತು ಈಕ್ವೇಶನ್‌ಗಳನ್ನು ಬಳಸುವುದು."
        },
        "2.OA.1": {
          "description": "ಅಧಿಕ ಮತ್ತು ಗುಣಾಕಾರವನ್ನು 100 ರಲ್ಲಿ ಬಳಸಿಕೊಂಡು ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸಿ. ಇದರಲ್ಲಿ, ಸೇರಿಸುವುದು, ತೆಗೆದುಕೊಳ್ಳುವುದು, ಒಟ್ಟು ಸೇರಿಸುವುದು, ಪ್ರತ್ಯೇಕಿಸುವುದು ಮತ್ತು ಹೋಲಿಕೆ ಮಾಡುವ ಸನ್ನಿವೇಶಗಳೂ ಒಳಗೊಂಡಿರಬಹುದು ಮತ್ತು ಇದರ ಎಲ್ಲ ಸ್ಥಾನಗಳಲ್ಲಿ ಅನಾಮಿಕ ಅಂಶಗಳೂ ಒಳಗೊಂಡಿರಬಹುದು. ಉದಾ., ಡ್ರಾಯಿಂಗ್‌ಗಳು ಮತ್ತು ಈಕ್ವೇಶನ್‌ಗಳನ್ನು ಬಳಸುವುದು."
        },
        "3.OA.3": {
          "description": "ಸಮಾನ ಗುಂಪುಗಳು, ವರ್ಗಮೂಲಗಳು ಮತ್ತು ಪ್ರಮಾಣಗಳನ್ನು ಅಳೆಯುವ ಸನ್ನಿವೇಶಗಳಲ್ಲಿ ಶಬ್ದ ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸಲು 100 ರಲ್ಲಿ ಗುಣಾಕಾರ ಮತ್ತು ಭಾಗಾಕಾರವನ್ನು ಬಳಸಿ. ಉದಾ, ಸಮಸ್ಯೆಯನ್ನು ಪ್ರತಿನಿಧಿಸಲು ಅನಾಮಿಕ ಸಂಖ್ಯೆಗೆ ಚಿಹ್ನೆಯೊಂದಿಗೆ ಡ್ರಾಯಿಂಗ್‌ಗಳು ಮತ್ತು ಈಕ್ವೇಶನ್‌ಗಳನ್ನು ಬಳಸುವ ಮೂಲಕ.1"
        },
        "1.a": {
          "description": "ಹೊಸ ಐಡಿಯಾಗಳು, ಉತ್ಪನ್ನಗಳು ಅಥವಾ ಪ್ರಕ್ರಿಯೆಗಳನ್ನು ಜನರೇಟ್ ಮಾಡಲು ಪ್ರಸ್ತುತ ಜ್ಞಾನವನ್ನು ಅನ್ವಯಿಸಿ."
        },
        "1.b": {
          "description": "ವೈಯಕ್ತಿಕ ಅಥವಾ ಸಮೂಹ ಅಭಿವ್ಯಕ್ತಿ ರೂಪದಲ್ಲಿ ಮೂಲ ಕೆಲಸಗಳನ್ನು ರಚಿಸಿ."
        },
        "1.c": {
          "description": "ಸಂಕೀರ್ಣ ಸಿಸ್ಟಮ್‌ಗಳು ಮತ್ತು ಸಮಸ್ಯೆಗಳನ್ನು ಎಕ್ಸ್‌ಪ್ಲೋರ್‌ ಮಾಡಲು ಮಾಡೆಲ್‌ಗಳು ಮತ್ತು ಸಿಮ್ಯುಲೇಶನ್‌ಗಳನ್ನು ಬಳಸಿ."
        },
        "2.a": {
          "description": "ವಿವಿಧ ಡಿಜಿಟಲ್ ಪರಿಸರ ಮತ್ತು ಮಾಧ್ಯಮದಲ್ಲಿ ನೇಮಕವಾಗಿರುವ ಸಹಭಾಗಿಗಳು, ಪರಿಣಿತರು ಅಥವಾ ಇತರರೊಂದಿಗೆ ಸಂವಹನ ನಡೆಸಿ, ಸಹಭಾಗಿತ್ವ ಸಾಧಿಸಿ ಮತ್ತು ಪ್ರಕಟಿಸಿ."
        },
        "2.b": {
          "description": "ವಿವಿಧ ಮಾಧ್ಯಮ ಮತ್ತು ಫಾರ್ಮ್ಯಾಟ್‌ಗಳನ್ನು ಬಳಸಿ ಹಲವು ಪ್ರೇಕ್ಷಕರುಗಳಿಗೆ ಮಾಹಿತಿ ಮತ್ತು ಪರಿಕಲ್ಪನೆಗಳನ್ನು ಪರಿಣಾಮಕಾರಿಯಾಗಿ ಸಂವಹನ ನಡೆಸಿ."
        },
        "4.b": {
          "description": "ಪರಿಹಾರವನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲು ಅಥವಾ ಪ್ರಾಜೆಕ್ಟ್‌ ಪೂರ್ಣಗೊಳಿಸಲು ಚಟುವಟಿಕೆಗಳನ್ನು ಯೋಜಿಸಿ ಮತ್ತು ನಿರ್ವಹಿಸಿ."
        },
        "4.d": {
          "description": "ಪರ್ಯಾಯ ಪರಿಹಾರಗಳನ್ನು ಎಕ್ಸ್‌ಪ್ಲೋರ್ ಮಾಡಲು ಹಲವು ಪ್ರಕ್ರಿಯೆಗಳು ಮತ್ತು ವೈವಿಧ್ಯ ದೃಷ್ಟಿಕೋನಗಳನ್ನು ಬಳಸಿ."
        },
        "6.a": {
          "description": "ತಂತ್ರಜ್ಞಾನ ಸಿಸ್ಟಮ್‌ಗಳನ್ನು ಅರ್ಥಮಾಡಿಕೊಳ್ಳಿ ಮತ್ತು ತಂತ್ರಜ್ಞಾನ ಬಳಸಿ."
        },
        "6.c": {
          "description": "ಸಿಸ್ಟಮ್‌ಗಳು ಮತ್ತು ಅಪ್ಲಿಕೇಶನ್‌ಗಳ ದೋಷ ಪರಿಹಾರ ಮಾಡಿ."
        },
        "6.d": {
          "description": "ಹೊಸ ತಂತ್ರಜ್ಞಾನಗಳನ್ನು ಕಲಿಯಲು ಪ್ರಸ್ತುತ ಜ್ಞಾನ ವರ್ಗಾವಣೆ ಮಾಡಿ."
        }
      }
    }
  }
}