{
  "bg-BG": {
    "data": {
      "standards": {
        "csta/1A-NI-04": {
          "description": "Обяснете какво са паролите и защо ги използваме, и използването на силни пароли за защита на устройства и данни от не опълномощен достъп."
        },
        "csta/1A-DA-06": {
          "description": "Събирайте и представте същите данни визуално по няколко начина."
        },
        "1A-DA-06": {
          "description": "Събирайте и представте същите данни визуално по няколко начина."
        },
        "1A-NI-04": {
          "description": "Обяснете какво са паролите и защо ги използваме, и използването на силни пароли за защита на устройства и данни от не опълномощен достъп."
        },
        "1-ESS1-1": {
          "description": "Използвайте наблюдения на слънцето, луната и звездите, за да опищете модели, които могат да бъдат предсказани."
        },
        "1-ESS1-2": {
          "description": "Направете наблюдения по различни времена от годината, за да обвържете количеството дневна светлина с времето от годината."
        },
        "2-ESS1-1": {
          "description": "Използвайте информация от няколко източника, за да докажете, че събитията на Земята могат да се случват бързо или бавно.\n[Изяснение: Примери за събития и времеви рамки могат да включват вулканични експлозии и земетресения, които се случват бързо, и ерозия на скалите"
        },
        "HS-PS3-3": {
          "description": "Проектирайте, конструирайте и усъвършенствайте устройство, което работи в рамките на дадени ограничения, за да преобразува една форма на енергия в друга.*"
        },
        "HS-PS3-4": {
          "description": "Планирайте и проведете изследване, за да докажете, че преносът на топлинна енергия при комбинирането на два компонента с различна температура в затворена система води до по-равномерно разпределение на енергията между компонентите в системата (се"
        },
        "HS-PS3-5": {
          "description": "Разработете и използвайте модел на два обекта, които си взаимодействат чрез електрическо или магнитно поле, за да илюстрирате силите между обектите и промените в енергията на обектите вследствие от взаимодействието."
        },
        "K-PS3-1": {
          "description": "Направете наблюдения, за да определите влиянието на слънчевата светлина върху повърхността на Земята."
        },
        "HS-PS4-4": {
          "description": "Оценете валидността и надеждността на твърдения в публикувани материали за ефектите, които различните честоти електромагнитната радиция оказват при поглъщане от материя."
        }
      }
    }
  }
}