{
  "ru-RU": {
    "data": {
      "standards": {
        "ccela/3.RL.4": {
          "description": "Определите значение слов и словосочетаний в том виде, в каком они используются в тексте, отличая буквальный смысл от небуквального."
        },
        "ccela/4.RL.7": {
          "description": "Установите связь между текстом рассказа или пьесы и визуальным или устным представлением текста, отмечая, каким образом в тексте отображаются определенные описания и указания."
        },
        "ccela/5.RL.4": {
          "description": "Определите значение слов и фраз по мере их использования в тексте, включая фигуры речи, такие как метафоры и сравнения."
        },
        "ccela/5.RL.7": {
          "description": "Проанализируйте, как визуальные и мультимедийные элементы влияют на значение, настроение и красоту текста (например, графический роман, мультимедийное представление художественного повествования, народной сказки, мифа, стихотворения)."
        },
        "ccela/6.SL.1": {
          "description": "Действенное участие в различных дискуссиях по вопросам совместной работы с различными участниками (один на один, в группах и под руководством учителя) по темам, текстам и вопросам для 6 класса, опираясь на идеи других участников, с четким и убедительным выражением своих идей."
        },
        "ccela/7.SL.1": {
          "description": "Действенное участие в различных дискуссиях по вопросам совместной работы с различными участниками (один на один, в группах и под руководством учителя) по темам, текстам и вопросам для 7 класса, опираясь на идеи других участников, с четким выражением своих идей."
        },
        "ccmath/MP.1": {
          "description": "Понимание смысла задач и проявление упорства в их решении"
        },
        "ccmath/MP.2": {
          "description": "Абстрактные рассуждения с использованием количественных категорий"
        },
        "ccmath/MP.5": {
          "description": "Использование подходящих инструментов на основе стратегического подхода"
        },
        "ccmath/MP.6": {
          "description": "Внимание к точности"
        },
        "ccmath/MP.7": {
          "description": "Поиск и использование структур"
        },
        "ccmath/MP.8": {
          "description": "Поиск и описание закономерностей в повторяющихся рассуждениях"
        },
        "csta2011/CPP.L1:6-06": {
          "description": "Решение задач с помощью визуального языка блочного программирования."
        },
        "csta2011/CT.L2:1": {
          "description": "Использование основных шагов решения задач с помощью алгоритмов для разработки решений (например, постановка задачи и исследование условий, рассмотрение типичных случаев, проектирование, реализация решения, тестирование и оценка)."
        },
        "csta2011/CT.L2:12": {
          "description": "Использование абстракций для разбиения задачи на подзадачи."
        },
        "csta2011/CT.L2:6": {
          "description": "Описание и анализ последовательности команд (например, описание поведения персонажа видеоигры в соответствии с правилами и алгоритмами)."
        },
        "csta2011/CT.L2:7": {
          "description": "Представление данных различными способами, включая использование текста, звука, изображений и чисел."
        },
        "csta2011/CT.L2:8": {
          "description": "Использование визуальных средств представления состояния работы над задачей, структур и данных (например, графиков, диаграмм, сетевых графиков, блок-схем)."
        },
        "iste/1.a": {
          "description": "Использование имеющихся знаний для генерации новых идей, создания продуктов или процессов."
        },
        "iste/1.b": {
          "description": "Создание оригинальных работ как способ личного или группового самовыражения."
        },
        "iste/1.c": {
          "description": "Использование моделей и имитационного моделирования для исследования сложных систем и проблем."
        },
        "iste/4.b": {
          "description": "Планирование и организация действий с целью разработки решения или выполнения проекта."
        },
        "iste/6.a": {
          "description": "Понимание и использование технологических систем."
        },
        "iste/6.c": {
          "description": "Устранение проблем в работе систем и приложений."
        },
        "iste/6.d": {
          "description": "Использование имеющихся знаний для изучения новых технологий."
        },
        "ccela/1.L.6": {
          "description": "Использование слов и фраз из разговоров, чтения, прослушивания текстов и ответов на них, включая часто встречающиеся союзы, служащие для обозначения простых взаимосвязей (например, \"потому что\")."
        },
        "ccela/1.SL.1": {
          "description": "Участие в обсуждении совместной работы по темам и текстам для 1 класса с различными партнерами – товарищами и взрослыми, в малых и больших группах."
        },
        "ccela/11-12.RI.4": {
          "description": "Определение значений слов и фраз, используемых в тексте, в том числе переносных, ассоциативных и технических значений; анализ того, как автор использует и уточняет значения ключевых слов или терминов в тексте (например, как Мэдисон определяет понятие"
        },
        "ccela/2.L.6": {
          "description": "Использование слов и фраз из разговоров, чтения, прослушивания текстов и ответов на них, в том числе прилагательных и наречий (например, \"я счастлив, когда другие дети счастливы\")."
        },
        "ccela/2.SL.1": {
          "description": "Участие в обсуждении совместной работы по темам и текстам для 2 класса с различными партнерами – товарищами и взрослыми, в малых и больших группах."
        },
        "ccela/3.L.6": {
          "description": "Усвоение и правильное использование на уровне, соответствующем классу, разговорных, общенаучных и специальных слов и фраз, включая те, которые выражают пространственно-временные отношения (например, \"в тот вечер после ужина мы пошли искать их\")."
        },
        "ccela/3.SL.1": {
          "description": "Действенное участие в различных дискуссиях по вопросам совместной работы с различными участниками (один на один, в группах и под руководством учителя) по темам, и текстам для 3 класса с опорой на идеи других участников, с четким и убедительным выражением своих идей."
        },
        "ccmath/1.OA.1": {
          "description": "Решение с помощью сложения и вычитания в пределах 20 устных задач, описывающих ситуации прибавления, убавления, складывания вместе, разделения и сравнения с неизвестными величинами любого рода, например, с использованием при описании задачи объектов, чертежей и уравнений с символом, обозначающим"
        },
        "ccmath/2.OA.1": {
          "description": "Решение с помощью сложения и вычитания в пределах 100 в одно или два действия устных задач, описывающих ситуации прибавления, убавления, складывания вместе, разделения и сравнения с неизвестными величинами любого рода, например, с использованием при описании задачи объектов, чертежей и уравнений с символом"
        },
        "ccmath/3.OA.3": {
          "description": "Решение с помощью умножения и деления в пределах 100 устных задач, описывающих ситуации наличия равных групп, массивов и результатов измерений, например, с использованием при описании задачи чертежей и уравнений с символом для обозначения неизвестного числа.1"
        },
        "csta2011/CD.L1:3-01": {
          "description": "Использование стандартных устройств ввода-вывода для успешного управления компьютерами и связанными с ними технологическими средствами."
        },
        "csta2011/CI.L1:3-01": {
          "description": "Соблюдение принципов ответственного цифрового гражданства (законопослушного и этичного поведения) при использовании технологических систем и программного обеспечения."
        },
        "csta2011/CPP.L1:6-01": {
          "description": "Использование технологических ресурсов (например, калькуляторов, устройств сбора данных, мобильных устройств, видеоматериалов, образовательного ПО и имеющихся в интернете инструментов) для решения задач и самообучения."
        },
        "ccela/11-12.L.6": {
          "description": "Усвоение и правильное использование общенаучных и специальных терминов и фраз, необходимых для чтения, письма, говорения и слушания в колледже или к моменту начала трудовой деятельности; самостоятельность в освоении словарного запаса в случаях, когда ученик считает"
        },
        "ccela/4.L.6": {
          "description": "Усвоение и правильное использование на уровне, соответствующем классу, разговорных, общенаучных и специальных слов и фраз, включая те, которые выражают определенные действия, эмоции или состояния (например, \"расспрашивал\", \"скулил\", \"заикался\"), а также те, которые входят в базовую лексику по определенной теме (например"
        },
        "ccela/5.L.6": {
          "description": "Усвоение и правильное использование на уровне, соответствующем классу, разговорных, общенаучных и специальных слов и фраз, включая те, которые выражают контраст, дополнение и иные логические отношения (например, \"однако\", \"хотя\", \"тем не менее\", \"подобно\", \"более того\", \"помимо этого\")."
        },
        "ccmath/4.MD.6": {
          "description": "Измерение углов целыми числами градусов с помощью транспортира. Черчение углов указанной величины."
        },
        "ccmath/4.NBT.4": {
          "description": "Быстрое сложение и вычитание многозначных целых чисел с помощью стандартного алгоритма."
        },
        "ccmath/4.NBT.5": {
          "description": "Умножение целого, не более чем четырехзначного числа на однозначное целое, и перемножение двух двузначных чисел, с использованием стратегий, основанных на разрядных значениях цифр и свойствах операций. Иллюстрация и объяснение расчета с помощью уравнений, прямоугольных массивов"
        },
        "ccmath/7.G.2": {
          "description": "Черчение (от руки, с помощью линейки и транспортира, а также с помощью технических средств) геометрических фигур, удовлетворяющих заданным условиям. Обратить особое внимание на построение треугольников с использованием трех величин углов или сторон, отмечая, в каких случаях условия задают единственный треугольник, более одного треугольника"
        },
        "csta2011/CPP.L1:3-02": {
          "description": "Использование подходящих для обучения и развития мультимедийных ресурсов (например, интерактивных книг и образовательного программного обеспечения) с целью содействия прохождению учебной программы."
        },
        "csta2011/CPP.L1:3-04": {
          "description": "Построение набора операторов (например, команд Turtle) для их использования при решении простой задачи."
        },
        "ccela/11-12.W.6": {
          "description": "Использование технологий, включая интернет, для индивидуального или совместного изготовления, публикации и обновлении продуктов; реакция на текущие отзывы, в том числе содержащие новые аргументы или информацию."
        },
        "ccela/4.W.3": {
          "description": "Написание текстов, в которых излагаются реальные или вымышленные ситуации или события, с использованием эффективных методов описания, деталей и четкого изложения последовательности событий."
        },
        "ccela/6.W.6": {
          "description": "Использование технологий, включая интернет, для написания и публикации работ, а также взаимодействие и совместная работа с другими учениками; демонстрация достаточного уровня навыков работы с клавиатурой, позволяющих напечатать не менее трех страниц за одно занятие."
        },
        "ccela/7.W.3": {
          "description": "Написание текстов, в которых излагаются реальные или вымышленные ситуации или события, с использованием эффективных методов описания, уместных деталей и хорошо структурированного изложения последовательности событий."
        },
        "ccela/7.W.6": {
          "description": "Использование технологий, включая интернет, для написания и публикации работ, использование ссылок и цитирование источников, а также взаимодействие и совместная работа с другими учениками, включая использование ссылок и цитирование источников."
        },
        "ccela/8.W.6": {
          "description": "Использование технологий, включая интернет, для написания и публикации работ, эффективное представление взаимосвязей между информацией и идеями, а также взаимодействие и совместная работа с другими учениками."
        },
        "ccela/9-10.W.6": {
          "description": "Использование технологий, включая интернет, для создания, публикации и обновления индивидуальных или совместно разрабатываемых продуктов с использованием возможностей технологий для получения различной информации и ее гибкой и динамичной демонстрации."
        },
        "ccmath/MP.4": {
          "description": "Моделирование с помощью математики"
        },
        "csta2011/CL.L1:6-02": {
          "description": "Использование онлайн-ресурсов (например, обсуждений по электронной почте или онлайн, платформ совместной работы в интернете) для участия в совместном решении задач с целью разработки решений или продуктов."
        },
        "csta2011/CPP.L1:3-01": {
          "description": "Использование технологических ресурсов для выполнения исследований в соответствии с возрастом."
        },
        "csta2011/CPP.L2:3": {
          "description": "Проектирование, разработка, публикация и презентация продуктов (например, веб-страниц, мобильных приложений, мультфильмов) с использованием технологических ресурсов, связанных с понятиями, входящими в программу обучения."
        },
        "iste/2.a": {
          "description": "Взаимодействие, работа и публикация результатов совместно с товарищами, экспертами и другими людьми с использованием разнообразных цифровых сред и средств."
        },
        "iste/2.b": {
          "description": "Сообщение информации и идей различным аудиториям с эффективным использованием различных средств передачи и форматов данных."
        },
        "iste/4.d": {
          "description": "Использование различных процессов и учет различных точек зрения при исследовании альтернативных решений."
        },
        "csp2021/IOC-2.B.5": {
          "description": "Шифрование — это процесс кодирования данных для предотвращения несанкционированного доступа. Дешифрование — это процесс декодирования данных. Два наиболее распространенных метода шифрования: ●       Шифрование с симметричным ключом, в котором для шифрования и дешифрования используется один ключ. ●       Шифрование с открытым ключом, при котором совместно используются открытый ключ для шифрования и закрытый ключ для дешифрования. Отправителю не нужен ключ получателя для шифрования сообщения, но для расшифровки сообщения требуется закрытый ключ получателя. ЗАЯВЛЕНИЕ ОБ ИСКЛЮЧЕНИИ (EKIOC-2.B.5): Конкретные математические процедуры для шифрования и дешифрования не входят в этот курс и экзамен AP."
        },
        "csta/3A-NI-06": {
          "description": "Рекомендуйте меры безопасности для различных сценариев на основе таких факторов, как эффективность, возможность реализации и этические последствия."
        },
        "csta/3A-NI-07": {
          "description": "Сравните разные меры безопасности с учетом компромиссов между удобством использования и безопасностью компьютерной системы."
        },
        "csta/3B-NI-04": {
          "description": "Сравните методы, используемые разработчиками для защиты устройств и информации от неавторизованного доступа."
        },
        "csp2021/DAT-1.D.1": {
          "description": "Сжатие данных может уменьшить размер (число битов) передаваемых или сохраняемых данных."
        },
        "csp2021/DAT-1.D.2": {
          "description": "Меньше битов не обязательно означает меньше информации."
        },
        "csp2021/DAT-1.D.3": {
          "description": "Степень уменьшения размера в результате сжатия зависит как от степени избыточности в исходном представлении данных, так и от применяемого алгоритма сжатия."
        },
        "csp2021/DAT-1.D.4": {
          "description": "Алгоритмы сжатия данных без потерь обычно уменьшают количество передаваемых или сохраняемых битов, гарантируя при этом полную реконструкцию исходных данных."
        },
        "csta/3A-DA-10": {
          "description": "Оцените компромиссы в организации элементов данных и то, где эти данные хранятся."
        },
        "csta/1B-IC-18": {
          "description": "Участие в обсуждении компьютерных технологий, изменивших мир, и выражение своего мнения о том, каким образом эти технологии повлияли на культурные практики и какое влияние этих практик они испытали."
        },
        "csta/1B-DA-07": {
          "description": "Используйте данные, чтобы определить или выявить причинно-следственные связи, предсказать результаты или передать идею."
        },
        "1B-DA-07": {
          "description": "Используйте данные, чтобы определить или выявить причинно-следственные связи, предсказать результаты или передать идею."
        },
        "1B-IC-18": {
          "description": "Участие в обсуждении компьютерных технологий, изменивших мир, и выражение своего мнения о том, каким образом эти технологии повлияли на культурные практики и какое влияние этих практик они испытали."
        },
        "3A-DA-10": {
          "description": "Оцените компромиссы в организации элементов данных и то, где эти данные хранятся."
        },
        "3A-NI-06": {
          "description": "Рекомендуйте меры безопасности для различных сценариев на основе таких факторов, как эффективность, возможность реализации и этические последствия."
        },
        "3A-NI-07": {
          "description": "Сравните разные меры безопасности с учетом компромиссов между удобством использования и безопасностью компьютерной системы."
        },
        "3B-NI-04": {
          "description": "Сравните методы, используемые разработчиками для защиты устройств и информации от неавторизованного доступа."
        },
        "DAT-1.D.1": {
          "description": "Сжатие данных может уменьшить размер (число битов) передаваемых или сохраняемых данных."
        },
        "DAT-1.D.2": {
          "description": "Меньше битов не обязательно означает меньше информации."
        },
        "DAT-1.D.3": {
          "description": "Степень уменьшения размера в результате сжатия зависит как от степени избыточности в исходном представлении данных, так и от применяемого алгоритма сжатия."
        },
        "DAT-1.D.4": {
          "description": "Алгоритмы сжатия данных без потерь обычно уменьшают количество передаваемых или сохраняемых битов, гарантируя при этом полную реконструкцию исходных данных."
        },
        "IOC-2.B.5": {
          "description": "Шифрование — это процесс кодирования данных для предотвращения несанкционированного доступа. Дешифрование — это процесс декодирования данных. Два наиболее распространенных метода шифрования: ●       Шифрование с симметричным ключом, в котором для шифрования и дешифрования используется один ключ. ●       Шифрование с открытым ключом, при котором совместно используются открытый ключ для шифрования и закрытый ключ для дешифрования. Отправителю не нужен ключ получателя для шифрования сообщения, но для расшифровки сообщения требуется закрытый ключ получателя. ЗАЯВЛЕНИЕ ОБ ИСКЛЮЧЕНИИ (EKIOC-2.B.5): Конкретные математические процедуры для шифрования и дешифрования не входят в этот курс и экзамен AP."
        },
        "CD.L1:3-01": {
          "description": "Использование стандартных устройств ввода-вывода для успешного управления компьютерами и связанными с ними технологическими средствами."
        },
        "CI.L1:3-01": {
          "description": "Соблюдение принципов ответственного цифрового гражданства (законопослушного и этичного поведения) при использовании технологических систем и программного обеспечения."
        },
        "CL.L1:6-02": {
          "description": "Использование онлайн-ресурсов (например, обсуждений по электронной почте или онлайн, платформ совместной работы в интернете) для участия в совместном решении задач с целью разработки решений или продуктов."
        },
        "CPP.L1:3-01": {
          "description": "Использование технологических ресурсов для выполнения исследований в соответствии с возрастом."
        },
        "CPP.L1:3-02": {
          "description": "Использование подходящих для обучения и развития мультимедийных ресурсов (например, интерактивных книг и образовательного программного обеспечения) с целью содействия прохождению учебной программы."
        },
        "CPP.L1:3-04": {
          "description": "Построение набора операторов (например, команд Turtle) для их использования при решении простой задачи."
        },
        "CPP.L1:6-01": {
          "description": "Использование технологических ресурсов (например, калькуляторов, устройств сбора данных, мобильных устройств, видеоматериалов, образовательного ПО и имеющихся в интернете инструментов) для решения задач и самообучения."
        },
        "CPP.L1:6-06": {
          "description": "Решение задач с помощью визуального языка блочного программирования."
        },
        "CPP.L2:3": {
          "description": "Проектирование, разработка, публикация и презентация продуктов (например, веб-страниц, мобильных приложений, мультфильмов) с использованием технологических ресурсов, связанных с понятиями, входящими в программу обучения."
        },
        "CT.L2:1": {
          "description": "Использование основных шагов решения задач с помощью алгоритмов для разработки решений (например, постановка задачи и исследование условий, рассмотрение типичных случаев, проектирование, реализация решения, тестирование и оценка)."
        },
        "CT.L2:12": {
          "description": "Использование абстракций для разбиения задачи на подзадачи."
        },
        "CT.L2:6": {
          "description": "Описание и анализ последовательности команд (например, описание поведения персонажа видеоигры в соответствии с правилами и алгоритмами)."
        },
        "CT.L2:7": {
          "description": "Представление данных различными способами, включая использование текста, звука, изображений и чисел."
        },
        "CT.L2:8": {
          "description": "Использование визуальных средств представления состояния работы над задачей, структур и данных (например, графиков, диаграмм, сетевых графиков, блок-схем)."
        },
        "1.L.6": {
          "description": "Использование слов и фраз из разговоров, чтения, прослушивания текстов и ответов на них, включая часто встречающиеся союзы, служащие для обозначения простых взаимосвязей (например, \"потому что\")."
        },
        "11-12.L.6": {
          "description": "Усвоение и правильное использование общенаучных и специальных терминов и фраз, необходимых для чтения, письма, говорения и слушания в колледже или к моменту начала трудовой деятельности; самостоятельность в освоении словарного запаса в случаях, когда ученик считает"
        },
        "2.L.6": {
          "description": "Использование слов и фраз из разговоров, чтения, прослушивания текстов и ответов на них, в том числе прилагательных и наречий (например, \"я счастлив, когда другие дети счастливы\")."
        },
        "3.L.6": {
          "description": "Усвоение и правильное использование на уровне, соответствующем классу, разговорных, общенаучных и специальных слов и фраз, включая те, которые выражают пространственно-временные отношения (например, \"в тот вечер после ужина мы пошли искать их\")."
        },
        "4.L.6": {
          "description": "Усвоение и правильное использование на уровне, соответствующем классу, разговорных, общенаучных и специальных слов и фраз, включая те, которые выражают определенные действия, эмоции или состояния (например, \"расспрашивал\", \"скулил\", \"заикался\"), а также те, которые входят в базовую лексику по определенной теме (например"
        },
        "5.L.6": {
          "description": "Усвоение и правильное использование на уровне, соответствующем классу, разговорных, общенаучных и специальных слов и фраз, включая те, которые выражают контраст, дополнение и иные логические отношения (например, \"однако\", \"хотя\", \"тем не менее\", \"подобно\", \"более того\", \"помимо этого\")."
        },
        "9-10.L.6": {
          "description": "Усвоение и правильное использование общенаучных и специальных терминов и фраз, необходимых для чтения, письма, говорения и слушания в колледже или к моменту начала трудовой деятельности; самостоятельность в освоении словарного запаса в случаях, когда ученик считает"
        },
        "11-12.RI.4": {
          "description": "Определение значений слов и фраз, используемых в тексте, в том числе переносных, ассоциативных и технических значений; анализ того, как автор использует и уточняет значения ключевых слов или терминов в тексте (например, как Мэдисон определяет понятие"
        },
        "3.RL.4": {
          "description": "Определите значение слов и словосочетаний в том виде, в каком они используются в тексте, отличая буквальный смысл от небуквального."
        },
        "4.RL.7": {
          "description": "Установите связь между текстом рассказа или пьесы и визуальным или устным представлением текста, отмечая, каким образом в тексте отображаются определенные описания и указания."
        },
        "5.RL.4": {
          "description": "Определите значение слов и фраз по мере их использования в тексте, включая фигуры речи, такие как метафоры и сравнения."
        },
        "5.RL.7": {
          "description": "Проанализируйте, как визуальные и мультимедийные элементы влияют на значение, настроение и красоту текста (например, графический роман, мультимедийное представление художественного повествования, народной сказки, мифа, стихотворения)."
        },
        "1.SL.1": {
          "description": "Участие в обсуждении совместной работы по темам и текстам для 1 класса с различными партнерами – товарищами и взрослыми, в малых и больших группах."
        },
        "2.SL.1": {
          "description": "Участие в обсуждении совместной работы по темам и текстам для 2 класса с различными партнерами – товарищами и взрослыми, в малых и больших группах."
        },
        "3.SL.1": {
          "description": "Действенное участие в различных дискуссиях по вопросам совместной работы с различными участниками (один на один, в группах и под руководством учителя) по темам, и текстам для 3 класса с опорой на идеи других участников, с четким и убедительным выражением своих идей."
        },
        "6.SL.1": {
          "description": "Действенное участие в различных дискуссиях по вопросам совместной работы с различными участниками (один на один, в группах и под руководством учителя) по темам, текстам и вопросам для 6 класса, опираясь на идеи других участников, с четким и убедительным выражением своих идей."
        },
        "7.SL.1": {
          "description": "Действенное участие в различных дискуссиях по вопросам совместной работы с различными участниками (один на один, в группах и под руководством учителя) по темам, текстам и вопросам для 7 класса, опираясь на идеи других участников, с четким выражением своих идей."
        },
        "11-12.W.6": {
          "description": "Использование технологий, включая интернет, для индивидуального или совместного изготовления, публикации и обновлении продуктов; реакция на текущие отзывы, в том числе содержащие новые аргументы или информацию."
        },
        "3.W.3": {
          "description": "Написание текстов, в которых излагаются реальные или вымышленные ситуации или события, с использованием эффективных методов описания, деталей и четкого изложения последовательности событий."
        },
        "4.W.3": {
          "description": "Написание текстов, в которых излагаются реальные или вымышленные ситуации или события, с использованием эффективных методов описания, деталей и четкого изложения последовательности событий."
        },
        "5.W.3": {
          "description": "Написание текстов, в которых излагаются реальные или вымышленные ситуации или события, с использованием эффективных методов описания, деталей и четкого изложения последовательности событий."
        },
        "6.W.3": {
          "description": "Написание текстов, в которых излагаются реальные или вымышленные ситуации или события, с использованием эффективных методов описания, уместных деталей и хорошо структурированного изложения последовательности событий."
        },
        "6.W.6": {
          "description": "Использование технологий, включая интернет, для написания и публикации работ, а также взаимодействие и совместная работа с другими учениками; демонстрация достаточного уровня навыков работы с клавиатурой, позволяющих напечатать не менее трех страниц за одно занятие."
        },
        "7.W.3": {
          "description": "Написание текстов, в которых излагаются реальные или вымышленные ситуации или события, с использованием эффективных методов описания, уместных деталей и хорошо структурированного изложения последовательности событий."
        },
        "7.W.6": {
          "description": "Использование технологий, включая интернет, для написания и публикации работ, использование ссылок и цитирование источников, а также взаимодействие и совместная работа с другими учениками, включая использование ссылок и цитирование источников."
        },
        "8.W.3": {
          "description": "Написание текстов, в которых излагаются реальные или вымышленные ситуации или события, с использованием эффективных методов описания, уместных деталей и хорошо структурированного изложения последовательности событий."
        },
        "8.W.6": {
          "description": "Использование технологий, включая интернет, для написания и публикации работ, эффективное представление взаимосвязей между информацией и идеями, а также взаимодействие и совместная работа с другими учениками."
        },
        "9-10.W.6": {
          "description": "Использование технологий, включая интернет, для создания, публикации и обновления индивидуальных или совместно разрабатываемых продуктов с использованием возможностей технологий для получения различной информации и ее гибкой и динамичной демонстрации."
        },
        "11-12.WHST.6": {
          "description": "Использование технологий, включая интернет, для индивидуального или совместного изготовления, публикации и обновлении продуктов; реакция на текущие отзывы, в том числе содержащие новые аргументы или информацию."
        },
        "9-10.WHST.6": {
          "description": "Использование технологий, включая интернет, для создания, публикации и обновления индивидуальных или совместно разрабатываемых продуктов с использованием возможностей технологий для получения различной информации и ее гибкой и динамичной демонстрации."
        },
        "7.G.2": {
          "description": "Черчение (от руки, с помощью линейки и транспортира, а также с помощью технических средств) геометрических фигур, удовлетворяющих заданным условиям. Обратить особое внимание на построение треугольников с использованием трех величин углов или сторон, отмечая, в каких случаях условия задают единственный треугольник, более одного треугольника"
        },
        "4.MD.6": {
          "description": "Измерение углов целыми числами градусов с помощью транспортира. Черчение углов указанной величины."
        },
        "MP.1": {
          "description": "Понимание смысла задач и проявление упорства в их решении"
        },
        "MP.2": {
          "description": "Абстрактные рассуждения с использованием количественных категорий"
        },
        "MP.4": {
          "description": "Моделирование с помощью математики"
        },
        "MP.5": {
          "description": "Использование подходящих инструментов на основе стратегического подхода"
        },
        "MP.6": {
          "description": "Внимание к точности"
        },
        "MP.7": {
          "description": "Поиск и использование структур"
        },
        "MP.8": {
          "description": "Поиск и описание закономерностей в повторяющихся рассуждениях"
        },
        "4.NBT.4": {
          "description": "Быстрое сложение и вычитание многозначных целых чисел с помощью стандартного алгоритма."
        },
        "4.NBT.5": {
          "description": "Умножение целого, не более чем четырехзначного числа на однозначное целое, и перемножение двух двузначных чисел, с использованием стратегий, основанных на разрядных значениях цифр и свойствах операций. Иллюстрация и объяснение расчета с помощью уравнений, прямоугольных массивов"
        },
        "1.OA.1": {
          "description": "Решение с помощью сложения и вычитания в пределах 20 устных задач, описывающих ситуации прибавления, убавления, складывания вместе, разделения и сравнения с неизвестными величинами любого рода, например, с использованием при описании задачи объектов, чертежей и уравнений с символом, обозначающим"
        },
        "2.OA.1": {
          "description": "Решение с помощью сложения и вычитания в пределах 100 в одно или два действия устных задач, описывающих ситуации прибавления, убавления, складывания вместе, разделения и сравнения с неизвестными величинами любого рода, например, с использованием при описании задачи объектов, чертежей и уравнений с символом"
        },
        "3.OA.3": {
          "description": "Решение с помощью умножения и деления в пределах 100 устных задач, описывающих ситуации наличия равных групп, массивов и результатов измерений, например, с использованием при описании задачи чертежей и уравнений с символом для обозначения неизвестного числа.1"
        },
        "1.a": {
          "description": "Использование имеющихся знаний для генерации новых идей, создания продуктов или процессов."
        },
        "1.b": {
          "description": "Создание оригинальных работ как способ личного или группового самовыражения."
        },
        "1.c": {
          "description": "Использование моделей и имитационного моделирования для исследования сложных систем и проблем."
        },
        "2.a": {
          "description": "Взаимодействие, работа и публикация результатов совместно с товарищами, экспертами и другими людьми с использованием разнообразных цифровых сред и средств."
        },
        "2.b": {
          "description": "Сообщение информации и идей различным аудиториям с эффективным использованием различных средств передачи и форматов данных."
        },
        "4.b": {
          "description": "Планирование и организация действий с целью разработки решения или выполнения проекта."
        },
        "4.d": {
          "description": "Использование различных процессов и учет различных точек зрения при исследовании альтернативных решений."
        },
        "6.a": {
          "description": "Понимание и использование технологических систем."
        },
        "6.c": {
          "description": "Устранение проблем в работе систем и приложений."
        },
        "6.d": {
          "description": "Использование имеющихся знаний для изучения новых технологий."
        },
        "1.d": {
          "description": "Выявляйте тенденции и прогнозируйте возможности."
        },
        "2.c": {
          "description": "Развивайте культурное понимание и глобальную осведомленность, взаимодействуя с учащимися других культур."
        },
        "2.d": {
          "description": "Участвуйте в работе проектных групп для создания оригинальных работ или решения проблем."
        },
        "3.a": {
          "description": "Планируйте стратегии, чтобы проводить исследование."
        },
        "3.b": {
          "description": "Находите, систематизируйте, анализируйте, оценивайте, синтезируйте и этично используйте информацию из различных источников и средств массовой информации."
        },
        "3.c": {
          "description": "Оценивайте и выбирайте источники информации и цифровые инструменты соответственно конкретным задачам."
        },
        "3.d": {
          "description": "Обрабатывайте данные и сообщайте о результатах."
        },
        "4.a": {
          "description": "Выявляйте и определяйте подлинные проблемы и важные вопросы для исследования."
        },
        "4.c": {
          "description": "Собирайте и анализируйте данные для определения решений и/или принятия обоснованных решений."
        },
        "5.a": {
          "description": "Пропагандируйте и практикуйте безопасное, законное и ответственное использование информации и технологий."
        },
        "5.b": {
          "description": "Демонстрируйте позитивное отношение к использованию технологий, поддерживающих совместную работу, обучение и продуктивность."
        },
        "5.c": {
          "description": "Демонстрируйте личную ответственность при обучении на протяжении всей жизни."
        },
        "5.d": {
          "description": "Демонстрируйте лидерство в области цифрового гражданства."
        },
        "6.b": {
          "description": "Выбирайте и используйте приложения эффективно и продуктивно."
        },
        "3-A-i.K-2": {
          "description": "Опишите и приведите примеры того, как учатся люди и как учатся компьютеры."
        },
        "3-A-i.3-5": {
          "description": "Отличия между тем как учатся люди, и как учатся компьютеры."
        },
        "3-A-i.6-8": {
          "description": "Сравните уникальные характеристики обучения человека с тем, как работают системы машинного обучения."
        },
        "3-A-i.9-12": {
          "description": "Определите алгоритмы обучения с учителем, без учителя и с подкреплением и приведите примеры обучения человека, похожие на каждый алгоритм."
        },
        "3-A-ii.K-2": {
          "description": "Определите закономерности в маркированных данных и определите признаки, по которым предсказывается маркировка."
        },
        "3-A-ii.3-5": {
          "description": "Смоделируйте, как обучение с учителем определяет закономерности в маркированных данных."
        },
        "3-A-ii.6-8": {
          "description": "Смоделируйте, как обучение без учителя определяет закономерности в немаркированных данных."
        },
        "3-A-ii.9-12": {
          "description": "Используйте алгоритм обучения с учителем или без учителя, чтобы обучить модель на реальных данных, а затем оценить результаты."
        },
        "3-A-iii.K-2": {
          "description": "Продемонстрируйте как научить компьютер что-либо распознавать"
        },
        "3-A-iii.3-5": {
          "description": "Обучите модель классификации с помощью машинного обучения, а затем проверьте точность модели на новых входных данных"
        },
        "3-A-iii.6-8": {
          "description": "Обучение и оценка модели классификации или прогнозирования с помощью машинного обучения на табличном наборе данных"
        },
        "3-A-iv.3-5": {
          "description": "Продемонстрируйте маркировку обучающих данных при использовании инструмента машинного обучения."
        },
        "3-A-iv.6-8": {
          "description": "Объясните разницу между обучением и использованием модели рассуждения."
        },
        "3-A-iv.9-12": {
          "description": "Проиллюстрируйте, что происходит на каждом из шагов, необходимых при использовании машинного обучения для построения классификатора или предиктора."
        },
        "3-A-v.3-5": {
          "description": "Проанализируйте игру, в которой строится дерево решений, описывающее организацию дерева и алгоритм обучения, используемый для добавления узлов"
        },
        "3-A-v.6-8": {
          "description": "Сравните, как работает алгоритм обучения дерева решений и алгоритм обучения нейронной сети."
        },
        "3-A-v.9-12": {
          "description": "Опишите, как различные типы алгоритмов машинного обучения учатся, корректируя свое внутреннее представление."
        },
        "3-A-vi.3-5": {
          "description": "Объясните, как обучение с подкреплением позволяет компьютеру учиться на опыте (например, методом проб и ошибок)."
        },
        "3-A-vi.6-8": {
          "description": "Объясните разницу между обучением с учителем и обучением с подкреплением."
        },
        "3-A-vi.9-12": {
          "description": "Выберите подходящий тип алгоритма машинного обучения (обучение с учителем, без учителя или с подкреплением) для решения проблемы рассуждения."
        },
        "3-B-i.3-5": {
          "description": "Проиллюстрируйте, как нейронная сеть из 1-3 нейронов является функцией, вычисляющей выходные данные."
        },
        "3-B-i.6-8": {
          "description": "Проиллюстрируйте структуру нейронной сети и опишите, как ее части образуют набор функций, вычисляющих выходные данные."
        },
        "3-B-i.9-12": {
          "description": "Опишите следующие архитектуры нейронных сетей и их использование: сеть прямой связи, двухмерная сверточная сеть, рекуррентная сеть, генеративная состязательная сеть."
        },
        "3-B-ii.3-5": {
          "description": "Продемонстрируйте, как в нейронной сети назначаются веса для получения желаемого поведения ввода/вывода."
        },
        "3-B-ii.6-8": {
          "description": "Продемонстрируйте, как правило обучения можно использовать для корректировки весов в однослойной нейронной сети."
        },
        "3-B-ii.9-12": {
          "description": "Обучите многослойную нейронную сеть, используя алгоритм обучения обратному распространению, и опишите, как веса нейронов и выходные данные скрытых единиц меняются в результате обучения."
        },
        "3-C-i.K-2": {
          "description": "Создайте набор данных с метками с явными функциями, чтобы показать, как компьютеры могут научиться классифицировать такие вещи, как продукты питания, фильмы или игрушки."
        },
        "3-C-i.3-5": {
          "description": "Создайте набор данных с метками с явными функциями нескольких типов и используйте инструмент машинного обучения для обучения классификатора на этих данных."
        },
        "3-C-i.6-8": {
          "description": "Создайте набор данных для обучения классификатора или предиктора дерева решений и изучите влияние различных кодировок объектов на дерево решений."
        },
        "3-C-i.9-12": {
          "description": "Сравните два реальных набора данных с точки зрения составляющих их объектов и способа кодирования этих объектов."
        },
        "3-C-ii.3-5": {
          "description": "Проиллюстрируйте, как обучение классификатора широкому понятию, такому как «собака», требует большого количества данных для отражения разнообразия области."
        },
        "3-C-ii.6-8": {
          "description": "Проиллюстрируйте, как можно сегментировать и маркировать объекты на изображении, чтобы создать обучающий набор для распознавания объектов."
        },
        "3-C-ii.9-12": {
          "description": "Оцените набор данных, используемый для обучения реальной системы искусственного интеллекта, учитывая размер набора данных, способ получения и маркировки данных, требуемое хранение и предполагаемое время создания набора данных."
        },
        "3-C-iii.K-2": {
          "description": "Изучите маркированный набор данных и выявите проблемы в данных, которые могут привести к неправильным прогнозам компьютера."
        },
        "3-C-iii.3-5": {
          "description": "Изучите характеристики и метки обучающих данных, чтобы обнаружить потенциальные источники предвзятости."
        },
        "3-C-iii.6-8": {
          "description": "Объясните, как выбор обучающих данных влияет на поведение классификатора и как можно ввести предвзятость, если обучающий набор не сбалансирован должным образом."
        },
        "3-C-iii.9-12": {
          "description": "Изучите дисбаланс в обучающих данных с точки зрения пола, возраста, этнической принадлежности или других демографических переменных, которые могут привести к предвзятой модели, с помощью инструмента визуализации данных."
        }
      }
    }
  }
}