{
  "el-GR": {
    "data": {
      "standard_categories": {
        "1": {
          "description": "Οι φοιτητές επιδεικνύουν δημιουργική σκέψη, κατασκευάζουν γνώσεις και αναπτύσσουν καινοτόμα προϊόντα και διαδικασίες χρησιμοποιώντας την τεχνολογία."
        },
        "2": {
          "description": "Οι μαθητές χρησιμοποιούν ψηφιακά μέσα και περιβάλλοντα για να επικοινωνήσουν και να εργαστούν συνεργατικά, μεταξύ άλλων και εξ αποστάσεως, για να υποστηρίξουν την ατομική μάθηση και να συμβάλουν στη μάθηση των άλλων."
        },
        "3": {
          "description": "Οι μαθητές εφαρμόζουν ψηφιακά εργαλεία για τη συλλογή, αξιολόγηση και χρήση πληροφοριών."
        },
        "3-A-i": {
          "description": "Φύση της Μάθησης - Άνθρωποι εναντίον Μηχανών"
        },
        "3-A-ii": {
          "description": "Φύση της Μάθησης - εύρεση προτύπων στα δεδομένα"
        },
        "3-A-iii": {
          "description": "Φύση της Μάθησης - Κατάρτιση ενός μοντέλου"
        },
        "3-A-iv": {
          "description": "Φύση της μάθησης - constructinv vs χρήση ενός reasoner"
        },
        "3-A-v": {
          "description": "Φύση της μάθησης - προσαρμογή εσωτερικών αναπαραστάσεων"
        },
        "3-A-vi": {
          "description": "Φύση της Μάθησης - Μαθαίνοντας από την εμπειρία"
        },
        "3-B-i": {
          "description": "Νευρωνικά Δίκτυα - δομή νευρωνικού δικτύου"
        },
        "3-B-ii": {
          "description": "Νευρωνικά δίκτυα - ρύθμιση βάρους"
        },
        "3-C-i": {
          "description": "Σύνολα δεδομένων - σύνολα χαρακτηριστικών"
        },
        "3-C-ii": {
          "description": "Σύνολα δεδομένων - μεγάλα σύνολα δεδομένων"
        },
        "3-C-iii": {
          "description": "Σύνολα δεδομένων - προκατάληψη"
        },
        "4": {
          "description": "Οι μαθητές χρησιμοποιούν δεξιότητες κριτικής σκέψης για να σχεδιάσουν και να διεξάγουν έρευνα, να διαχειριστούν έργα, να επιλύσουν προβλήματα και να λάβουν τεκμηριωμένες αποφάσεις χρησιμοποιώντας κατάλληλα ψηφιακά εργαλεία και πόρους."
        },
        "5": {
          "description": "Οι φοιτητές κατανοούν ανθρώπινα, πολιτισμικά και κοινωνικά ζητήματα που σχετίζονται με την τεχνολογία και την πρακτική της νομικής και ηθικής συμπεριφοράς."
        },
        "6": {
          "description": "Οι φοιτητές επιδεικνύουν καλή κατανόηση των τεχνολογικών εννοιών, συστημάτων και λειτουργιών."
        },
        "AAP-1": {
          "description": "Για να βρείτε συγκεκριμένες λύσεις σε γενικεύσιμων προβλημάτων, οι προγραμματιστές αντιπροσωπεύουν και οργανώνουν τα δεδομένα με πολλούς τρόπους."
        },
        "AAP-1.A": {
          "description": "Αντιπροσωπεύει μια τιμή με μια μεταβλητή."
        },
        "AAP-1.B": {
          "description": "Προσδιορίστε την τιμή μιας μεταβλητής ως αποτέλεσμα μιας ανάθεσης."
        },
        "AAP-1.C": {
          "description": "Αντιπροσωπεύει μια λίστα ή συμβολοσειρά χρησιμοποιώντας μια μεταβλητή."
        },
        "AAP-2": {
          "description": "Ο τρόπος με τον οποίο οι προτάσεις ακολουθούνται και συνδυάζονται σε ένα πρόγραμμα καθορίζει το υπολογισμένο αποτέλεσμα. Τα προγράμματα ενσωματώνουν δομές επανάληψης και επιλογής για την αναπαράσταση της επανάληψης και τη λήψη αποφάσεων για τον χειρισμό ποικίλων τιμών εισόδου."
        },
        "AAP-2.A": {
          "description": "Εκφράστε έναν αλγόριθμο που χρησιμοποιεί αλληλουχία χωρίς τη χρήση γλώσσας προγραμματισμού."
        },
        "AAP-2.B": {
          "description": "Αντιπροσωπεύει μια αλγοριθμική διαδικασία βήμα προς βήμα χρησιμοποιώντας διαδοχικές δηλώσεις κώδικα."
        },
        "AAP-2.C": {
          "description": "Αξιολογήστε παραστάσεις που χρησιμοποιούν αριθμητικούς τελεστές."
        },
        "AAP-2.D": {
          "description": "Αξιολογήστε εκφράσεις που χειρίζονται συμβολοσειρές."
        },
        "AAP-2.E": {
          "description": "Για σχέσεις μεταξύ δύο μεταβλητών, παραστάσεων ή τιμών: \na. Αντιπροσωπεύει τη χρήση σχεσιακών τελεστών\nb. Αξιολογήστε εκφράσεις που χρησιμοποιούν σχεσιακούς τελεστές."
        },
        "AAP-2.F": {
          "description": "Για σχέσεις μεταξύ τιμών Boolean:\na. Αντιπροσωπεύουν τη χρήση λογικών τελεστών.\nβ. Αξιολόγηση εκφράσεων που χρησιμοποιούν λογικούς τελεστές."
        },
        "AAP-2.G": {
          "description": "Εκφράστε έναν αλγόριθμο που χρησιμοποιεί επιλογή χωρίς τη χρήση γλώσσας προγραμματισμού."
        },
        "AAP-2.H": {
          "description": "Για επιλογή:\na. Αντιπροσωπεύει τη χρήση προτάσεων υπό συνθήκη.\nb Προσδιορίστε το αποτέλεσμα των δηλώσεων υπό όρους."
        },
        "AAP-2.I": {
          "description": "Για ένθετη επιλογή:\na. Αντιπροσωπεύει τη χρήση ένθετων προτάσεων υπό συνθήκες. \nβ. Προσδιορίστε το αποτέλεσμα των ένθετων προτάσεων υπό όρους."
        },
        "AAP-2.J": {
          "description": "Εκφράστε έναν αλγόριθμο που χρησιμοποιεί επανάληψη χωρίς τη χρήση γλώσσας προγραμματισμού."
        },
        "AAP-2.K": {
          "description": "Για επανάληψη:\na. Αντιπροσωπεύουν τη χρήση δηλώσεων επανάληψης.\nβ. Προσδιορίζει το αποτέλεσμα ή την παρενέργεια των δηλώσεων επανάληψης."
        },
        "AAP-2.L": {
          "description": "Συγκρίνετε πολλαπλούς αλγόριθμους για να προσδιορίσετε αν έχουν την ίδια παρενέργεια ή αποτέλεσμα."
        },
        "AAP-2.M": {
          "description": "Για αλγορίθμους: \nα. Δημιουργία αλγορίθμων. \nβ) Συνδυασμός και τροποποίηση υπαρχόντων αλγορίθμων."
        },
        "AAP-2.N": {
          "description": "Για λειτουργίες λίστας:\na. Γράψτε παραστάσεις που χρησιμοποιούν τη λίστα ευρετηρίου και διαδικασίες λίστας.\nβ. Αξιολόγηση παραστάσεων που χρησιμοποιούν διαδικασίες ευρετηρίου λίστας και λίστας."
        },
        "AAP-2.O": {
          "description": "Για αλγορίθμους που περιλαμβάνουν στοιχεία μιας λίστας:\na. Αντιπροσωπεύουν τη χρήση επαναληπτικών προτάσεων για τη διέλευση μιας λίστας.\nb. Προσδιορίστε το αποτέλεσμα ενός αλγορίθμου με traversals λίστας."
        },
        "AAP-2.P": {
          "description": "Για αλγορίθμους δυαδικής αναζήτησης:\na. Προσδιορισμός του αριθμού επαναλήψεων που απαιτούνται για την εύρεση μιας τιμής σε ένα σύνολο δεδομένων. \nβ. Εξηγήστε τις απαιτήσεις που απαιτούνται για την ολοκλήρωση μιας δυαδικής αναζήτησης."
        },
        "AAP-3": {
          "description": "Οι προγραμματιστές διασπούν τα προβλήματα σε μικρότερα και πιο διαχειρίσιμα κομμάτια. Δημιουργώντας διαδικασίες και αξιοποιώντας παραμέτρους, οι προγραμματιστές γενικεύουν διαδικασίες που μπορούν να επαναχρησιμοποιηθούν. Οι διαδικασίες επιτρέπουν στους προγραμματιστές να αντλήσουν από υπάρχοντα κώδικα που έχει ήδη δοκιμαστεί, επιτρέποντας στους προγραμματιστές να γράφουν προγράμματα πιο γρήγορα και με περισσότερη εμπιστοσύνη."
        },
        "AAP-3.A": {
          "description": "Για κλήσεις διαδικασίας:\nα. Γράψτε δηλώσεις για να καλέσετε διαδικασίες.\nβ) Προσδιορίστε το αποτέλεσμα ή το αποτέλεσμα μιας κλήσης διαδικασίας."
        },
        "AAP-3.B": {
          "description": "Για κλήσεις διαδικασίας:\nα. Γράψτε δηλώσεις για να καλέσετε διαδικασίες.\nβ) Προσδιορίστε το αποτέλεσμα ή το αποτέλεσμα μιας κλήσης διαδικασίας."
        },
        "AAP-3.C": {
          "description": "Ανάπτυξη διαδικαστικών αφαίρεσης για τη διαχείριση της πολυπλοκότητας σε ένα πρόγραμμα με τη συγγραφή διαδικασιών."
        },
        "AAP-3.D": {
          "description": "Επιλέξτε κατάλληλες βιβλιοθήκες ή υπάρχοντα τμήματα κώδικα για χρήση στη δημιουργία νέων προγραμμάτων."
        },
        "AAP-3.E": {
          "description": "Για τη δημιουργία τυχαίων τιμών: \na. Γράψτε εκφράσεις για να δημιουργήσετε πιθανές τιμές. \nβ. Αξιολογήστε εκφράσεις για να προσδιορίσετε τα πιθανά αποτελέσματα."
        },
        "AAP-3.F": {
          "description": "Για προσομοιώσεις:\nα. Εξηγήστε πώς οι υπολογιστές μπορούν να χρησιμοποιηθούν για να αναπαραστήσουν πραγματικά φαινόμενα ή αποτελέσματα. \nβ) Να συγκρίνουν τη χρήση προσομοιώσεων με πραγματικά περιβάλλοντα."
        },
        "AAP-4": {
          "description": "Υπάρχουν προβλήματα που ο υπολογιστής δεν μπορεί να λύσει και ακόμη και όταν ο υπολογιστής μπορεί να λύσει ένα πρόβλημα, ενδέχεται να μην είναι σε θέση να το πράξει σε εύλογο χρονικό διάστημα."
        },
        "AAP-4.A": {
          "description": "Για τον προσδιορισμό της αποτελεσματικότητας ενός αλγορίθμου:\nα. Εξηγήστε τη διαφορά μεταξύ αλγορίθμων που εκτελούνται σε εύλογο χρόνο και εκείνων που δεν εκτελούνται σε εύλογο χρόνο. \nβ. Προσδιορισμός καταστάσεων στις οποίες μια ευρετική λύση μπορεί να είναι καταλληλότερη."
        },
        "AAP-4.B": {
          "description": "Εξηγήστε την ύπαρξη αναποφάσιστων προβλημάτων στην επιστήμη των υπολογιστών."
        },
        "AP": {
          "description": "Αλγόριθμοι"
        },
        "APR": {
          "description": "Αριθμητική με πολυώνυμα και ορθολογικές εκφράσεις"
        },
        "BF": {
          "description": "Λειτουργίες Κτιρίων"
        },
        "BI-1": {
          "description": "Οι υπολογιστές αντιλαμβάνονται τον κόσμο χρησιμοποιώντας αισθητήρες"
        },
        "BI-2": {
          "description": "Οι πράκτορες διατηρούν αναπαραστάσεις του κόσμου και τις χρησιμοποιούν για συλλογισμό."
        },
        "BI-3": {
          "description": "Οι υπολογιστές μπορούν να μάθουν από τα δεδομένα"
        },
        "BI-4": {
          "description": "Οι ευφυείς πράκτορες απαιτούν πολλά είδη γνώσης για να αλληλεπιδρούν φυσικά με τους ανθρώπους."
        },
        "BI-5": {
          "description": "Η τεχνητή νοημοσύνη μπορεί να επηρεάσει την κοινωνία τόσο με θετικό όσο και με αρνητικό τρόπο"
        },
        "C": {
          "description": "Σήραγγα"
        },
        "CC": {
          "description": "Καταμέτρηση και προτεραιότητα"
        },
        "CD": {
          "description": "Υπολογιστές & Συσκευές Επικοινωνίας"
        },
        "CED": {
          "description": "Δημιουργία εξισώσεων"
        },
        "CI": {
          "description": "Κοινοτικές, παγκόσμιες και δεοντολογικές επιπτώσεις"
        },
        "CL": {
          "description": "Συνεργασία"
        },
        "CN": {
          "description": "Το σύστημα μιγαδικών αριθμών"
        },
        "CO": {
          "description": "Συσχέτιση"
        },
        "CON-1": {
          "description": "Ο τρόπος με τον οποίο οι μεταβλητές και οι τελεστές ακολουθούνται και συνδυάζονται σε μια παράσταση καθορίζει το υπολογισμένο αποτέλεσμα."
        },
        "CON-1.A": {
          "description": "Αξιολογήστε αριθμητικές εκφράσεις σε έναν κώδικα προγράμματος"
        },
        "CON-1.B": {
          "description": "Αξιολογήστε τι είναι αποθηκευμένο σε μια μεταβλητή ως αποτέλεσμα μιας παράστασης με μια πρόταση ανάθεσης"
        },
        "CON-1.C": {
          "description": "Αξιολογήστε αριθμητικές εκφράσεις που χρησιμοποιούν χύτευση."
        },
        "CON-1.D": {
          "description": "Αξιολογήστε παραστάσεις που χρησιμοποιούν τις μεθόδους κλάσης μαθηματικών."
        },
        "CON-1.E": {
          "description": "Αξιολογήστε Boolean εκφράσεις που χρησιμοποιούν σχεσιακούς τελεστές σε κώδικα προγράμματος."
        },
        "CON-1.F": {
          "description": "Αξιολογήστε compoudn Boolean εκφράσεις στον κώδικα του προγράμματος."
        },
        "CON-1.G": {
          "description": "Συγκρίνετε και αντιπαραβάλλετε ισοδύναμες εκφράσεις Boolean."
        },
        "CON-1.H": {
          "description": "Συγκρίνετε αναφορές αντικειμένων χρησιμοποιώντας εκφράσεις Boolean στον κώδικα του προγράμματος."
        },
        "CON-2": {
          "description": "Οι προγραμματιστές ενσωματώνουν επανάληψη και επιλογή στον κώδικα ως τρόπο παροχής οδηγιών στον υπολογιστή για την επεξεργασία κάθε μιας από τις πολλές πιθανές τιμές εισόδου"
        },
        "CON-2.A": {
          "description": "Αντιπροσωπεύει τις λογικές διεργασίες διακλάδωσης χρησιμοποιώντας δηλώσεις υπό όρους."
        },
        "CON-2.B": {
          "description": "Αντιπροσωπεύει τις λογικές διεργασίες διακλάδωσης χρησιμοποιώντας ένθετες προτάσεις υπό όρους."
        },
        "CON-2.C": {
          "description": "Αντιπροσωπεύουν επαναληπτικές διεργασίες χρησιμοποιώντας ένα ενώβρόχο."
        },
        "CON-2.D": {
          "description": "Για αλγορίθμους στο πλαίσιο συγκεκριμένης προδιαγραφής που δεν απαιτεί τη χρήση traversals: • Προσδιορισμός τυποποιημένων αλγορίθμων • Τροποποίηση τυποποιημένων αλγορίθμων • Ανάπτυξη αλγορίθμων."
        },
        "CON-2.E": {
          "description": "Αντιπροσωπεύουν επαναληπτικές διεργασίες χρησιμοποιώντας ένα βρόχο for."
        },
        "CON-2.F": {
          "description": "Για αλγορίθμους στο πλαίσιο συγκεκριμένης προδιαγραφής που περιλαμβάνει αντικείμενα String • Προσδιορισμός τυποποιημένων αλγορίθμων • Τροποποίηση πρότυπων αλγορίθμων • Ανάπτυξη αλγορίθμου."
        },
        "CON-2.G": {
          "description": "Αναπαράσταση ένθετων επαναληπτικών διεργασιών"
        },
        "CON-2.H": {
          "description": "Υπολογισμός καταμετρήσεις εκτέλεσης πρότασης και σύγκριση άτυπη χρόνου εκτέλεσης επαναληπτική δηλώσεις."
        },
        "CON-2.I": {
          "description": "Για αλγορίθμους στο πλαίσιο μιας συγκεκριμένης προδιαγραφής που απαιτεί τη χρήση πινάκων traversals: • Προσδιορισμός πρότυπων αλγορίθμων • Τροποποίηση πρότυπων αλγορίθμων • Ανάπτυξη αλγορίθμων."
        },
        "CON-2.J": {
          "description": "Για αλγορίθμους στο πλαίσιο συγκεκριμένης προδιαγραφής που απαιτεί τη χρήση διαβαθμίσεις ArrayList: • Προσδιορισμός τυποποιημένων αλγορίθμων • Τροποποίηση πρότυπων αλγορίθμων • Ανάπτυξη αλγορίθμων."
        },
        "CON-2.K": {
          "description": "Εφαρμογή αλγορίθμων διαδοχικής/γραμμικής αναζήτησης για αναζήτηση συγκεκριμένων πληροφοριών σε αντικείμενα πίνακα ή ArrayList."
        },
        "CON-2.L": {
          "description": "Εφαρμογή αλγορίθμων ταξινόμησης επιλογής και ταξινόμησης εισαγωγής για να ταξινομήσετε τα στοιχεία αντικειμένων πίνακα ή ArrayList."
        },
        "CON-2.M": {
          "description": "Υπολογισμός καταμέτρηση εκτέλεσης πρότασης και άτυπη σύγκριση χρόνου εκτέλεσης αλγορίθμων ταξινόμησης."
        },
        "CON-2.N": {
          "description": "Για Αλγόριθμοι στο πλαίσιο συγκεκριμένης προδιαγραφής που απαιτεί τη χρήση διδιάστατων πινάκων: • Προσδιορισμός πρότυπων αλγορίθμων • Τροποποίηση πρότυπων αλγορίθμων • Ανάπτυξη αλγορίθμων."
        },
        "CON-2.O": {
          "description": "Προσδιορίστε το αποτέλεσμα της εκτέλεσης αναδρομικών μεθόδων."
        },
        "CON-2.P": {
          "description": "Εφαρμογή αλγορίθμων περιοδικότητας αναζήτησης σε πληροφορίες σε αντικείμενα συμβολοσειράς, πίνακα 1D ή ArrayList."
        },
        "CON-2.Q": {
          "description": "Εφαρμογή αλγορίθμων περιοδικότητας για να ταξινομήσετε στοιχεία αντικειμένων πίνακα ή ArrayList."
        },
        "CP": {
          "description": "Υποχρεωτική πιθανότητα και οι κανόνες πιθανότητας"
        },
        "CPP": {
          "description": "Υπολογιστική Πρακτική & Προγραμματισμός"
        },
        "CRD-1": {
          "description": "Η ενσωμάτωση πολλαπλών προοπτικών μέσω της συνεργασίας βελτιώνει τις καινοτομίες πληροφορικής που αναπτύσσονται."
        },
        "CRD-1.A": {
          "description": "Εξηγήστε πώς βελτιώνονται οι καινοτομίες πληροφορικής μέσω της συνεργασίας."
        },
        "CRD-1.B": {
          "description": "Εξηγήστε πώς οι καινοτομίες πληροφορικής αναπτύσσονται από ομάδες ανθρώπων."
        },
        "CRD-1.C": {
          "description": "Επίδειξη αποτελεσματικών διαπροσωπικών δεξιοτήτων κατά τη διάρκεια της συνεργασίας."
        },
        "CRD-2": {
          "description": "Οι προγραμματιστές δημιουργούν και καινοτομούν χρησιμοποιώντας μια επαναληπτική διαδικασία σχεδιασμού που εστιάζει στο χρήστη, η οποία ενσωματώνει κύκλους υλοποίησης/ανάδρασης και αφήνει άφθονο χώρο για πειραματισμό και ανάληψη κινδύνων."
        },
        "CRD-2.A": {
          "description": "Περιγράψτε το σκοπό μιας καινοτομίας στον τομέα της πληροφορικής."
        },
        "CRD-2.B": {
          "description": "Εξηγήστε πώς λειτουργεί ένα πρόγραμμα ή τμήμα κώδικα."
        },
        "CRD-2.C": {
          "description": "Αναγνώριση εισόδου (-ων) σε ένα πρόγραμμα."
        },
        "CRD-2.D": {
          "description": "Προσδιορίστε τα αποτελέσματα που παράγονται από ένα πρόγραμμα."
        },
        "CRD-2.E": {
          "description": "Αναπτύξτε ένα πρόγραμμα χρησιμοποιώντας μια διαδικασία ανάπτυξης."
        },
        "CRD-2.F": {
          "description": "Σχεδιάστε ένα πρόγραμμα και τη διεπαφή χρήστη του."
        },
        "CRD-2.G": {
          "description": "Περιγράψτε το σκοπό ενός τμήματος κώδικα ή ενός προγράμματος γράφοντας τεκμηρίωση."
        },
        "CRD-2.H": {
          "description": "Αναγνώριση τμημάτων κώδικα που χρησιμοποιούνται από άλλες πηγές."
        },
        "CRD-2.I": {
          "description": "Για σφάλματα σε έναν αλγόριθμο ή πρόγραμμα: \na. Προσδιορίστε το σφάλμα. \nβ. Διορθώστε το σφάλμα."
        },
        "CRD-2.J": {
          "description": "Προσδιορίστε τις εισροές και τα αντίστοιχα αναμενόμενα αποτελέσματα ή συμπεριφορές που μπορούν να χρησιμοποιηθούν για τον έλεγχο της ορθότητας ενός αλγορίθμου ή προγράμματος."
        },
        "CS": {
          "description": "Υπολογιστικά Συστήματα"
        },
        "CSN-1": {
          "description": "Τα συστήματα υπολογιστών και τα δίκτυα διευκολύνουν τον τρόπο μεταφοράς των δεδομένων."
        },
        "CSN-1.A": {
          "description": "Εξηγήστε πώς οι υπολογιστικές συσκευές συνεργάζονται σε ένα δίκτυο."
        },
        "CSN-1.B": {
          "description": "Εξηγήστε πώς λειτουργεί το Διαδίκτυο."
        },
        "CSN-1.C": {
          "description": "Εξηγήστε πώς αποστέλλονται τα δεδομένα μέσω του Διαδικτύου μέσω πακέτων."
        },
        "CSN-1.D": {
          "description": "Περιγράψτε τις διαφορές μεταξύ του Διαδικτύου και του World Wide Web."
        },
        "CSN-1.E": {
          "description": "Για συστήματα με ανοχή σφαλμάτων, όπως το Διαδίκτυο:\na. Περιγράψτε τα οφέλη της ανοχής σε σφάλματα\nb. Εξηγήστε πώς ένα δεδομένο σύστημα είναι ανεκτικό σε σφάλματα\nγ. Προσδιορίστε τρωτά σημεία σε ένα σύστημα."
        },
        "CSN-2": {
          "description": "Η παράλληλη και κατανεμημένη υπολογιστική χρησιμοποιεί πολλούς υπολογιστές για την ταχύτερη επίλυση σύνθετων προβλημάτων ή την επεξεργασία μεγάλων συνόλων δεδομένων."
        },
        "CSN-2.A": {
          "description": "Συγκρίνετε λύσεις προβλημάτων που χρησιμοποιούν διαδοχικούς, παράλληλους και κατανεμημένους υπολογιστές."
        },
        "CSN-2.B": {
          "description": "Προσδιορίστε την αποτελεσματικότητα των διαδοχικών και παράλληλων λύσεων."
        },
        "CSN-2.C": {
          "description": "Περιγράψτε τα οφέλη και τις προκλήσεις της παράλληλης και κατανεμημένης πληροφορικής."
        },
        "CT": {
          "description": "Αλγοριθμική Σκέψη"
        },
        "D1": {
          "description": "Ανάπτυξη Ερωτήσεις και σχεδιασμός ερωτημάτων"
        },
        "D2.Civ": {
          "description": "Αγωγή του πολίτη"
        },
        "D2.Eco": {
          "description": "Οικονομικά"
        },
        "D3.Claims": {
          "description": "Ανάπτυξη αξιώσεων και χρήση αποδεικτικών στοιχείων"
        },
        "D3.Sources": {
          "description": "Συγκέντρωση και Αξιολόγηση Πηγών"
        },
        "D4.Action": {
          "description": "Λήψη ενήμερης δράσης"
        },
        "D4.Conclusions": {
          "description": "Επικοινωνία και κριτική Συμπεράσματα"
        },
        "DA": {
          "description": "Δεδομένα & Ανάλυση"
        },
        "DAT-1": {
          "description": "Ο τρόπος με τον οποίο ο υπολογιστής αντιπροσωπεύει δεδομένα είναι διαφορετικός από τον τρόπο που τα δεδομένα ερμηνεύονται και εμφανίζονται για το χρήστη. Τα προγράμματα χρησιμοποιούνται για τη μετάφραση των δεδομένων σε μια αναπαράσταση που είναι πιο εύκολα κατανοητή από τους ανθρώπους."
        },
        "DAT-1.A": {
          "description": "Εξηγήστε πώς μπορούν να αναπαρασταθούν τα δεδομένα χρησιμοποιώντας bit."
        },
        "DAT-1.B": {
          "description": "Εξηγήστε τις συνέπειες της χρήσης bit για την αναπαράσταση δεδομένων."
        },
        "DAT-1.C": {
          "description": "Για δυαδικούς αριθμούς:\na. Υπολογίστε το δυαδικό (βάση 2) ισοδύναμο ενός θετικού ακέραιου (με βάση το 10) και αντιστρόφως. \nβ. Σύγκριση και σειρά δυαδικών αριθμών."
        },
        "DAT-1.D": {
          "description": "Συγκρίνετε αλγορίθμους συμπίεσης δεδομένων για να προσδιορίσετε ποια είναι η καλύτερη σε ένα συγκεκριμένο πλαίσιο."
        },
        "DAT-2": {
          "description": "Τα προγράμματα μπορούν να χρησιμοποιηθούν για την επεξεργασία δεδομένων, γεγονός που επιτρέπει στους χρήστες να ανακαλύπτουν πληροφορίες και να δημιουργούν νέες γνώσεις."
        },
        "DAT-2.A": {
          "description": "Περιγράψτε ποιες πληροφορίες μπορούν να εξαχθούν από τα δεδομένα."
        },
        "DAT-2.B": {
          "description": "Περιγράψτε ποιες πληροφορίες μπορούν να εξαχθούν από τα μεταδεδομένα."
        },
        "DAT-2.C": {
          "description": "Προσδιορίστε τις προκλήσεις που σχετίζονται με την επεξεργασία δεδομένων."
        },
        "DAT-2.D": {
          "description": "Εξαγωγή πληροφοριών από δεδομένα χρησιμοποιώντας ένα πρόγραμμα."
        },
        "DAT-2.E": {
          "description": "Εξηγήστε πώς τα προγράμματα μπορούν να χρησιμοποιηθούν για την απόκτηση γνώσης και γνώσης από τα δεδομένα."
        },
        "EE": {
          "description": "Εκφράσεις και εξισώσεις"
        },
        "ESS": {
          "description": "Επιστήμη της Γης και του Διαστήματος"
        },
        "ESS1": {
          "description": "Η θέση της Γης στο Σύμπαν"
        },
        "ESS2": {
          "description": "Γήινα Συστήματα"
        },
        "ESS3": {
          "description": "Γη και Ανθρώπινη Δραστηριότητα"
        },
        "ETS": {
          "description": "Μηχανική στις Επιστήμες"
        },
        "ETS1": {
          "description": "Μηχανολογικός Σχεδιασμός"
        },
        "F": {
          "description": "Συναρτήσεις"
        },
        "G": {
          "description": "Γεωμετρία"
        },
        "GMD": {
          "description": "Γεωμετρική μέτρηση και διάσταση"
        },
        "GPE": {
          "description": "Εκφράζοντας γεωμετρικές ιδιότητες με εξισώσεις"
        },
        "ID": {
          "description": "Ερμηνεία Κατηγορικών και Ποσοτικών Δεδομένων"
        },
        "IF": {
          "description": "Λειτουργίες διερμηνείας"
        },
        "IOC-1": {
          "description": "Ενώ οι καινοτομίες πληροφορικής συνήθως σχεδιάζονται για την επίτευξη ενός συγκεκριμένου σκοπού, μπορεί να έχουν ακούσιες συνέπειες."
        },
        "IOC-1.A": {
          "description": "Εξηγήστε πώς ένα αποτέλεσμα μιας καινοτομίας πληροφορικής μπορεί να είναι τόσο ωφέλιμο όσο και επιβλαβές."
        },
        "IOC-1.B": {
          "description": "Εξηγήστε πώς μια καινοτομία πληροφορικής μπορεί να έχει αντίκτυπο πέρα από τον επιδιωκόμενο σκοπό της."
        },
        "IOC-1.C": {
          "description": "Περιγράψτε ζητήματα που συμβάλλουν στο ψηφιακό χάσμα."
        },
        "IOC-1.D": {
          "description": "Εξηγήστε πώς υπάρχει προκατάληψη στις καινοτομίες υπολογιστών."
        },
        "IOC-1.E": {
          "description": "Εξηγήστε πώς οι άνθρωποι συμμετέχουν σε διαδικασίες επίλυσης προβλημάτων σε κλίμακα."
        },
        "IOC-1.F": {
          "description": "Εξηγήστε πώς η χρήση της πληροφορικής θα μπορούσε να εγείρει νομικές και ηθικές ανησυχίες."
        },
        "IOC-2": {
          "description": "Η χρήση καινοτομιών πληροφορικής μπορεί να ενέχει κινδύνους για την προσωπική σας ασφάλεια και ταυτότητα."
        },
        "IOC-2.A": {
          "description": "Περιγράψτε τους κινδύνους για την ιδιωτική ζωή από τη συλλογή και αποθήκευση προσωπικών δεδομένων σε ένα σύστημα υπολογιστή."
        },
        "IOC-2.B": {
          "description": "Εξηγήστε πώς μπορούν να προστατευθούν και να χρησιμοποιηθούν καταχρηστικά οι υπολογιστικοί πόροι."
        },
        "IOC-2.C": {
          "description": "Εξηγήστε πώς αποκτάται μη εξουσιοδοτημένη πρόσβαση σε υπολογιστικούς πόρους."
        },
        "L": {
          "description": "Γλώσσα"
        },
        "LE": {
          "description": "Γραμμικά, τετράγωνα και εκθετικά μοντέλα ★"
        },
        "LS": {
          "description": "Επιστήμες της Ζωής"
        },
        "LS1": {
          "description": "Από τα μόρια στους οργανισμούς: Δομές και Διεργασίες"
        },
        "LS2": {
          "description": "Οικοσυστήματα: Αλληλεπιδράσεις, Ενέργεια και Δυναμική"
        },
        "LS3": {
          "description": "Κληρονομικότητα: Κληρονομικότητα και διακύμανση γνωρισμάτων"
        },
        "LS4": {
          "description": "Βιολογική Εξέλιξη: Ενότητα και Διαφορετικότητα"
        },
        "MD": {
          "description": "Χρήση πιθανοτήτων για λήψη αποφάσεων"
        },
        "MG": {
          "description": "Μοντελοποίηση με γεωμετρία"
        },
        "MOD-1": {
          "description": "Ορισμένα αντικείμενα ή έννοιες αναπαριστώνται τόσο συχνά ώστε οι προγραμματιστές μπορούν να αντλήσουν από υπάρχοντα κώδικα που έχει ήδη δοκιμαστεί, επιτρέποντάς τους να γράφουν λύσεις πιο γρήγορα και με μεγαλύτερο βαθμό εμπιστοσύνης"
        },
        "MOD-1.A": {
          "description": "Κλήση μεθόδους κλάσης συστήματος για τη δημιουργία εξόδου στην κονσόλα."
        },
        "MOD-1.B": {
          "description": "Εξηγήστε τη σχέση μεταξύ μιας κλάσης και ενός αντικειμένου."
        },
        "MOD-1.C": {
          "description": "Προσδιορίστε, χρησιμοποιώντας την υπογραφή του, τον σωστό κατασκευαστή που καλείται."
        },
        "MOD-1.D": {
          "description": "Για τη δημιουργία αντικειμένου: α. Δημιουργία αντικειμένων καλώντας κατασκευαστές χωρίς παραμέτρους. β. Δημιουργία αντικειμένων καλώντας κατασκευαστές με παραμέτρους."
        },
        "MOD-1.E": {
          "description": "Καλέστε μη στατικές μεθόδους κενού χωρίς παραμέτρους."
        },
        "MOD-1.F": {
          "description": "Κλήση μη στατικών μεθόδων κενού με παραμέτρους"
        },
        "MOD-1.G": {
          "description": "Κλήση μη στατικών μη κενών μεθόδων με ή χωρίς παραμέτρους"
        },
        "MOD-1.H": {
          "description": "Καλέστε στατικές μεθόδους."
        },
        "MOD-2": {
          "description": "Οι προγραμματιστές χρησιμοποιούν κώδικα για να αναπαραστήσουν ένα φυσικό αντικείμενο ή μια μη φυσική έννοια, πραγματική ή φανταστική, ορίζοντας μια τάξη με βάση την ενδυμασία ή/και τις συμπεριφορές του αντικειμένου ή της έννοιας"
        },
        "MOD-2.A": {
          "description": "Καθορίστε περιορισμούς πρόσβασης και ορατότητας σε κατηγορίες, δεδομένα, κατασκευαστές και μεθόδους."
        },
        "MOD-2.B": {
          "description": "Ορίστε μεταβλητές παρουσίας για τα χαρακτηριστικά που θα αρχικοποιηθούν μέσω των κατασκευαστών μιας κλάσης."
        },
        "MOD-2.C": {
          "description": "Desribe τη λειτουργικότητα και τη χρήση του κώδικα του προγράμματος thorugh σχόλια."
        },
        "MOD-2.D": {
          "description": "Ορίστε συμπεριφορές ενός αντικειμένου μέσω μη-κενών μεθόδων χωρίς prameers γραμμένα σε μια τάξη."
        },
        "MOD-2.E": {
          "description": "Ορίστε συμπεριφορές ενός αντικειμένου μέσω κενών μεθόδων με ή χωρίς παραμέτρους γραμμένες σε μια κλάση."
        },
        "MOD-2.F": {
          "description": "Ορίστε συμπεριφορές ενός αντικειμένου μέσω μη-κενών μεθόδων με παραμέτρους γραμμένες σε μια τάξη."
        },
        "MOD-2.G": {
          "description": "Καθορίστε τις συμπεριφορές μιας κλάσης μέσω στατικών μεθόδων."
        },
        "MOD-2.H": {
          "description": "Ορίστε τις στατικές μεταβλητές που ανήκουν στην κλάση."
        },
        "MOD-3": {
          "description": "Όταν mulitple classes περιέχουν κοινά χαρακτηριστικά και συμπεριφορές, οι προγραμματιστές δημιουργούν μια νέα κλάση που περιέχει τα κοινόχρηστα χαρακτηριστικά και συμπεριφορές που σχηματίζουν ένα hierachy. Οι τροποποιήσεις που γίνονται στο υψηλότερο επίπεδο της ιεραρχίας ισχύουν για τις υποκατηγορίες."
        },
        "MOD-3.A": {
          "description": "Καθορίστε ιδιωτική ορατότητα μεταβλητών παρουσίας για να ενσωματώσετε τα χαρακτηριστικά ενός αντικειμένου."
        },
        "MOD-3.B": {
          "description": "Δημιουργήστε μια σχέση μεταβίβασης από μια υποκατηγορία στην υπερκλάση."
        },
        "MOD-3.C": {
          "description": "Ορίστε μεταβλητές αναφοράς μιας υπερκλάσης που θα εκχωρηθούν σε ένα αντικείμενο μιας υποκλάσης στην ίδια ιεραρχία."
        },
        "MOD-3.D": {
          "description": "Μέθοδοι κλήσης σε μια σχέση κληρονομικότητας."
        },
        "MOD-3.E": {
          "description": "Κλήση μεθόδων κλάσης αντικειμένου μέσω μεταβίβασης."
        },
        "MP": {
          "description": "Μαθηματικές πρακτικές"
        },
        "NBT": {
          "description": "Αριθμός και λειτουργίες στη βάση δέκα"
        },
        "NF": {
          "description": "Αριθμός και πράξεις — Κλάσματα"
        },
        "NI": {
          "description": "Δίκτυα & Διαδίκτυο"
        },
        "NS": {
          "description": "Το σύστημα αριθμών"
        },
        "OA": {
          "description": "Λειτουργίες και αλγεβρική σκέψη"
        },
        "PS": {
          "description": "Φυσικές Επιστήμες"
        },
        "PS1": {
          "description": "Η ύλη και οι αλληλεπιδράσεις της"
        },
        "PS2": {
          "description": "Κίνηση και Ευστάθεια: Δυνάμεις και Αλληλεπιδράσεις"
        },
        "PS3": {
          "description": "Ενέργεια"
        },
        "PS4": {
          "description": "Waves και οι Εφαρμογές τους σε Τεχνολογίες Μεταφοράς Πληροφορίας"
        },
        "Q": {
          "description": "Ποσότητες"
        },
        "REI": {
          "description": "Συλλογισμός με εξισώσεις και ανισότητες"
        },
        "RF": {
          "description": "Ανάγνωση Βασικών Δεξιοτήτων"
        },
        "RH": {
          "description": "Ιστορία Ανάγνωσης/Κοινωνικές Σπουδές"
        },
        "RI": {
          "description": "Ανάγνωση Πληροφοριακών"
        },
        "RL": {
          "description": "Ανάγνωση Λογοτεχνίας"
        },
        "RN": {
          "description": "Το σύστημα πραγματικών αριθμών"
        },
        "RP": {
          "description": "Αναλογίες και αναλογικές σχέσεις"
        },
        "RST": {
          "description": "Ανάγνωση Επιστήμη/Τεχνική"
        },
        "SL": {
          "description": "Ομιλία & Ακρόαση"
        },
        "SP": {
          "description": "Στατιστικά και Πιθανότητες"
        },
        "SRT": {
          "description": "Ομοιότητα, ορθά τρίγωνα, και τριγωνομετρία"
        },
        "SSE": {
          "description": "Βλέποντας τη δομή στις εκφράσεις"
        },
        "TF": {
          "description": "Τριγωνομετρικές Συναρτήσεις"
        },
        "VAR-1": {
          "description": "Για να βρείτε συγκεκριμένες λύσεις σε γενικεύσιμων προβλημάτων, οι προγραμματιστές περιλαμβάνουν μεταβλητές στον κώδικά τους, έτσι ώστε ο ίδιος αλγόριθμος να εκτελείται χρησιμοποιώντας διαφορετικές τιμές εισόδου"
        },
        "VAR-1.A": {
          "description": "Δημιουργία αλφαριθμητικών συμβολοσειρών"
        },
        "VAR-1.B": {
          "description": "Προσδιορίστε την καταλληλότερη κατηγορία τύπου δεδομένων για μια συγκεκριμένη προδιαγραφή"
        },
        "VAR-1.C": {
          "description": "Δηλώστε μεταβλητές των σωστών τύπων για την αναπαράσταση πρωτόγονων δεδομένων"
        },
        "VAR-1.D": {
          "description": "Ορίστε μεταβλητές των σωστών τύπων για την αναπαράσταση δεδομένων αναφοράς."
        },
        "VAR-1.E": {
          "description": "Για την κλάση String: a. Δημιουργία αντικειμένων συμβολοσειράς. b. Μέθοδοι συμβολοσειράς κλήσης."
        },
        "VAR-1.F": {
          "description": "Για τάξεις περιτύλιξης: a. Δημιουργία αντικειμένων ακεραίων. b. Μέθοδοι κλήσης ακεραίου. c. Δημιουργία διπλών αντικειμένων. d. Κλήσεις διπλών μεθόδων."
        },
        "VAR-1.G": {
          "description": "Εξηγήστε πού μπορούν να χρησιμοποιηθούν μεταβλητές στον κώδικα του προγράμματος."
        },
        "VAR-1.H": {
          "description": "Αξιολογήστε εκφράσεις αναφοράς αντικειμένου που χρησιμοποιούν τη λέξη-κλειδί αυτό."
        },
        "VAR-2": {
          "description": "Για να διαχειριστείτε μεγάλες ποσότητες δεδομένων ή σύνθετες σχέσεις σε δεδομένα, οι προγραμματιστές γράφουν κώδικα που ομαδοποιεί τα δεδομένα μαζί σε μια ενιαία δομή δεδομένων χωρίς τη δημιουργία μεμονωμένων μεταβλητών για κάθε τιμή."
        },
        "VAR-2.A": {
          "description": "Αντιπροσωπεύουν συλλογές σχετικών πρωτόγονων δεδομένων ή δεδομένων αναφοράς αντικειμένων με χρήση μονοδιάστατων (1D) αντικειμένων πίνακα."
        },
        "VAR-2.B": {
          "description": "Διασχίστε τα στοιχεία σε έναν πίνακα 1D."
        },
        "VAR-2.C": {
          "description": "Διασχίστε τα στοιχεία σε ένα αντικείμενο πίνακα 1D χρησιμοποιώντας ένα βελτιωμένο για βρόχο."
        },
        "VAR-2.D": {
          "description": "Αντιπροσωπεύουν συλλογές σχετικών δεδομένων αναφοράς αντικειμένου χρησιμοποιώντας αντικείμενα ArrayList."
        },
        "VAR-2.E": {
          "description": "Για αντικείμενα ArrayList: • Διασχίστε χρησιμοποιώντας ένα βρόχο για ή while. • Διασχίστε χρησιμοποιώντας έναν ενισχυμένο βρόχο for."
        },
        "VAR-2.F": {
          "description": "Αντιπροσωπεύουν συλλογές σχετικών πρωτόγονων δεδομένων ή δεδομένων αναφοράς αντικειμένων χρησιμοποιώντας δισδιάστατα (2D) αντικείμενα πίνακα."
        },
        "VAR-2.G": {
          "description": "Για 2D αντικείμενα πίνακα: • Διάσχιση με χρήση ένθετων για βρόχους. • Διάσχιση με χρήση ένθετου βελτιωμένου για βρόχους."
        },
        "VM": {
          "description": "Ποσότητες διανυσμάτων και πινάκων"
        },
        "W": {
          "description": "Γραφή"
        },
        "WHST": {
          "description": "Γράφοντας HS/S/T"
        }
      }
    }
  }
}