{
  "ur-PK": {
    "data": {
      "standard_categories": {
        "1": {
          "description": "طلباء ٹیکنالوجی کا استعمال کرتے ہوئے تخلیقی سوچ کا مظاہرہ کرتے ہیں، علم کی تعمیر کرتے ہیں، اور  اختراعی مصنوعات اور پراسسز تیار کرتے ہیں."
        },
        "2": {
          "description": "طلباء، ڈیجیٹل میڈیا اور ماحول کا استعمال کرتے ہوئے، بات چیت کریں اور باہمی تعاون کے ساتھ کام کریں، بشمول فاصلے پر، انفرادی طور پر سیکھنے میں مدد کرنے اور دوسروں کے سیکھنے میں تعاون کرنے کے لیے۔"
        },
        "3": {
          "description": "طلباء معلومات جمع کرنے، اندازہ کرنے اور استعمال کرنے کے لیے ڈیجیٹل ٹولز کا اطلاق کرتے ہیں۔"
        },
        "3-A-i": {
          "description": "سیکھنے کی نوعیت - انسانوں بمقابلہ مشینیں"
        },
        "3-A-ii": {
          "description": "سیکھنے کی نوعیت - اعداد و شمار میں پیٹرن تلاش کرنا"
        },
        "3-A-iii": {
          "description": "سیکھنے کی نوعیت - ایک ماڈل کی تربیت"
        },
        "3-A-iv": {
          "description": "سیکھنے کی نوعیت - ایک وجہ کا استعمال کرتے ہوئے بمقابلہ کی تعمیر"
        },
        "3-A-v": {
          "description": "سیکھنے کی نوعیت - اندرونی نمائندگی کو ایڈجسٹ کرنا"
        },
        "3-A-vi": {
          "description": "سیکھنے کی نوعیت - تجربے سے سیکھنا"
        },
        "3-B-i": {
          "description": "عصبی نیٹ ورک - ایک عصبی نیٹ ورک کی ساخت"
        },
        "3-B-ii": {
          "description": "نیورل نیٹ ورک - وزن ایڈجسٹمنٹ"
        },
        "3-C-i": {
          "description": "ڈیٹا سیٹ - خصوصیت سیٹ"
        },
        "3-C-ii": {
          "description": "ڈیٹا سیٹ - بڑے اعداد و شمار"
        },
        "3-C-iii": {
          "description": "ڈیٹا سیٹ - تعصب"
        },
        "4": {
          "description": "طلباء مناسب ڈیجیٹل اوزار اور وسائل کا استعمال کرتے ہوئے منصوبہ بندی کرنے اور تحقیق کرنے، منصوبوں کا انتظام کرنے، مسائل کو حل کرنے اور باخبر فیصلے کرنے کے لیے تنقیدی سوچ کی مہارت کا استعمال کرتے ہیں."
        },
        "5": {
          "description": "طلبہ ٹیکنالوجی سے متعلق انسانی، ثقافتی اور معاشرتی مسائل کو سمجھتے ہیں اور قانونی اور اخلاقی رویے پر عمل کرتے ہیں۔"
        },
        "6": {
          "description": "طلباء ٹیکنالوجی کے تصورات، سسٹمز اور آپریشنز کے بارے میں اچھی سمجھ کا مظاہرہ کرتے ہیں."
        },
        "AAP-1": {
          "description": "عمومی مسائل کے مخصوص حل تلاش کرنے کے لئے، پروگرامرز متعدد طریقوں سے اعداد و شمار کی نمائندگی کرتے ہیں اور منظم کرتے ہیں."
        },
        "AAP-1.A": {
          "description": "ایک متغیر کے ساتھ ایک قدر کی نمائندگی کرتے ہیں."
        },
        "AAP-1.B": {
          "description": "تفویض کے نتیجے میں متغیر کی قدر کا تعین کریں."
        },
        "AAP-1.C": {
          "description": "ایک متغیر کا استعمال کرتے ہوئے ایک فہرست یا سٹرنگ کی نمائندگی کرتے ہیں."
        },
        "AAP-1.D": {
          "description": "ڈیٹا تجرید کے لئے: \nاے ایک سے زیادہ عناصر کو ذخیرہ کرنے کے لئے فہرستوں کا استعمال کرتے ہوئے ڈیٹا خلاصہ تیار کریں.\nب وضاحت کریں کہ ڈیٹا تجرید کا استعمال پروگرام کوڈ میں پیچیدگی کا انتظام کیسے کرتا ہے."
        },
        "AAP-2": {
          "description": "جس طرح کے بیانات کو ترتیب دیا جاتا ہے اور ایک پروگرام میں مل کر شمار نتیجہ کا تعین کرتا ہے. پروگرام تکرار کی نمائندگی کرنے اور مختلف ان پٹ اقدار کو سنبھالنے کے فیصلے کرنے کے لئے iteration اور انتخاب کی تشکیل کو شامل کرتے ہیں."
        },
        "AAP-2.A": {
          "description": "ایک الگورتھم کا اظہار جو پروگرامنگ زبان کا استعمال کرتے ہوئے بغیر ترتیب کا استعمال کرتا ہے."
        },
        "AAP-2.B": {
          "description": "ترتیب کوڈ بیانات کا استعمال کرتے ہوئے مرحلہ وار الگورتھممک عمل کی نمائندگی کرتے ہیں."
        },
        "AAP-2.C": {
          "description": "اظہار کا اندازہ کریں جو ریاضی آپریٹرز کا استعمال کرتے ہیں."
        },
        "AAP-2.D": {
          "description": "ڈور جوڑتوڑ کہ اظہار کا اندازہ."
        },
        "AAP-2.E": {
          "description": "دو متغیر، اظہار، یا اقدار کے درمیان تعلقات کے لئے: \nاے رشتہ آپریٹرز\nب استعمال کرتے ہوئے نمائندگی کرتے ہیں."
        },
        "AAP-2.F": {
          "description": "بولین اقدار کے درمیان تعلقات کے لئے:\nاے منطقی آپریٹرز کا استعمال کرتے ہوئے نمائندگی کرتے ہیں.\nب تاثرات کا اندازہ کریں جو منطق آپریٹرز کا استعمال کرتے ہیں."
        },
        "AAP-2.G": {
          "description": "ایک الگورتھم کا اظہار کریں جو پروگرامنگ زبان کا استعمال کئے بغیر انتخاب کا استعمال کرتا ہے."
        },
        "AAP-2.H": {
          "description": "انتخاب کے لئے:\nاے مشروط بیانات کا استعمال کرتے ہوئے نمائندگی کرتے ہیں.\nب مشروط بیانات کا نتیجہ مقرر کریں."
        },
        "AAP-2.J": {
          "description": "ایک الگورتھم کا اظہار جو پروگرامنگ زبان کا استعمال کرتے ہوئے بغیر iteration کا استعمال کرتا ہے."
        },
        "AAP-2.L": {
          "description": "ایک سے زیادہ الگورتھم کا موازنہ کریں اس بات کا تعین کرنے کے لئے کہ وہ ایک ہی ضمنی اثر یا نتیجہ پیدا کرتے ہیں."
        },
        "AAP-2.M": {
          "description": "الگورتھم کے لئے: \nاے الگورتھم بنائیں. \nب موجودہ الگورتھم کو یکجا اور ترمیم کریں."
        },
        "AAP-2.O": {
          "description": "ایک فہرست کے عناصر کو شامل الگورتھم کے لئے:\nایک. iterative بیانات کا استعمال کرتے ہوئے کی نمائندگی کرتے ہیں ایک فہرست کو عبور کرنے کے لئے.\nب فہرست traversals کے ساتھ ایک الگورتھم کا نتیجہ کا تعین."
        },
        "AAP-2.P": {
          "description": "بائنری تلاش الگورتھم کے لئے:\nایک ڈیٹا سیٹ میں ایک قدر تلاش کرنے کے لئے درکار تکرار کی تعداد کا تعین. \nب بائنری تلاش مکمل کرنے کے لئے ضروری ضروریات کی وضاحت کریں."
        },
        "AAP-3": {
          "description": "پروگرامرز چھوٹے اور زیادہ انتظام کے ٹکڑے ٹکڑے میں مسائل کو توڑ دیتے ہیں. طریقہ کار بنانے اور پیرامیٹرز کو استعمال کرنے سے، پروگرامرز ان عملوں کو عام بناتے ہیں جو دوبارہ استعمال کیا جا سکتا ہے. طریقہ کار پروگرامرز کو موجودہ کوڈ پر اپنی طرف متوجہ کرنے کی اجازت دیتا ہے جو پہلے سے ہی ٹیسٹ کیا گیا ہے، پروگرامرز کو زیادہ تیزی سے اور زیادہ اعتماد کے ساتھ پروگراموں کو لکھنے کی اجازت دیتا ہے."
        },
        "AAP-3.A": {
          "description": "طریقہ کار کالوں کے لئے:\nاے طریقہ کار کو کال کرنے کے لئے بیانات لکھیں.\nب طریقہ کار کال کا نتیجہ یا اثر کا تعین کریں."
        },
        "AAP-3.B": {
          "description": "طریقہ کار کالوں کے لئے:\nاے طریقہ کار کو کال کرنے کے لئے بیانات لکھیں.\nب طریقہ کار کال کا نتیجہ یا اثر کا تعین کریں."
        },
        "AAP-3.C": {
          "description": "طریقہ کار لکھنے کی طرف سے ایک پروگرام میں پیچیدگی کا انتظام کرنے کے لئے عملدرآمد خلاصہ تیار کریں."
        },
        "AAP-3.D": {
          "description": "نئے پروگراموں کو بنانے میں استعمال کرنے کے لئے مناسب لائبریریوں یا موجودہ کوڈ حصوں کو منتخب کریں."
        },
        "AAP-3.E": {
          "description": "بے ترتیب اقدار پیدا کرنے کے لئے: \na ممکنہ اقدار پیدا کرنے کے لئے اظہار لکھیں. \nب ممکنہ نتائج کا تعین کرنے کے لئے اظہار کا اندازہ کریں."
        },
        "AAP-4": {
          "description": "ایسے مسائل موجود ہیں جن کو کمپیوٹر حل نہیں کر سکتا اور یہاں تک کہ جب کمپیوٹر کسی مسئلے کو حل کر سکتا ہے تب بھی مناسب وقت میں ایسا کرنے کے قابل نہ ہو سکتا ہے۔"
        },
        "AAP-4.A": {
          "description": "ایک الگورتھم کی کارکردگی کا تعین کرنے کے لئے:\nایک. الگورتھم کے درمیان فرق ہے کہ مناسب وقت میں چلانے اور ان لوگوں کو جو مناسب وقت میں نہیں چلاتے ہیں کی وضاحت کریں. \nب ایسے حالات کی شناخت کریں جہاں ایک ہیورسٹک حل زیادہ مناسب ہوسکتا ہے."
        },
        "AAP-4.B": {
          "description": "کمپیوٹر سائنس میں غیر فیصلہ کن مسائل کے وجود کی وضاحت کریں."
        },
        "AP": {
          "description": "الگورتھم اور پروگرامنگ"
        },
        "APR": {
          "description": "Polynomials اور عقلی اظہار کے ساتھ ریاضی"
        },
        "BF": {
          "description": "تعمیراتی افعال"
        },
        "BI-1": {
          "description": "کمپیوٹر سینسر کا استعمال کرتے ہوئے دنیا کو خبر"
        },
        "BI-2": {
          "description": "ایجنٹوں دنیا کی نمائندگی کو برقرار رکھنے اور استدلال کے لئے ان کا استعمال"
        },
        "BI-3": {
          "description": "کمپیوٹر ڈیٹا سے سیکھ سکتے ہیں"
        },
        "BI-4": {
          "description": "ذہین ایجنٹوں کو انسانوں کے ساتھ قدرتی طور پر بات چیت کرنے کے لئے کئی قسم کے علم کی ضرورت ہوتی ہے"
        },
        "BI-5": {
          "description": "AI مثبت اور منفی دونوں طریقوں سے معاشرے پر اثر انداز کر سکتا ہے۔"
        },
        "C": {
          "description": "دائرے"
        },
        "CC": {
          "description": "گنتی اور کارڈینیٹی"
        },
        "CD": {
          "description": "کمپیوٹر اور مواصلاتی آلات"
        },
        "CED": {
          "description": "مساوات بنانا"
        },
        "CI": {
          "description": "کمیونٹی، عالمی، اور اخلاقی اثرات"
        },
        "CL": {
          "description": "باہمی شراکت"
        },
        "CN": {
          "description": "پیچیدہ نمبروں کا نظام"
        },
        "CO": {
          "description": "متماثل"
        },
        "CON-1": {
          "description": "جس طرح متغیر اور آپریٹرز کو ایک اظہار میں ترتیب اور مشترکہ کیا جاتا ہے وہ حساباتی نتیجہ کا تعین کرتا ہے."
        },
        "CON-1.A": {
          "description": "پروگرام کے کوڈ میں ریاضی کے اظہار کا اندازہ کریں"
        },
        "CON-1.B": {
          "description": "تفویض بیان کے ساتھ اظہار کے نتیجے میں متغیر میں ذخیرہ کیا جاتا ہے کا اندازہ کریں"
        },
        "CON-1.C": {
          "description": "کاسٹنگ کا استعمال کرتے ہیں کہ ریاضی اظہار کا اندازہ کریں."
        },
        "CON-1.D": {
          "description": "اظہار کا اندازہ کریں جو ریاضی کلاس کے طریقوں کا استعمال کرتے ہیں."
        },
        "CON-1.E": {
          "description": "بولین اظہار کا اندازہ کریں جو پروگرام کوڈ میں ریلیشنل آپریٹرز کا استعمال کرتے ہیں."
        },
        "CON-1.F": {
          "description": "پروگرام کے کوڈ میں مرکب بولین اظہار کا اندازہ کریں."
        },
        "CON-1.G": {
          "description": "موازنہ کریں اور برابر بولین اظہار کے برعکس."
        },
        "CON-1.H": {
          "description": "پروگرام کے کوڈ میں بولین اظہار کا استعمال کرتے ہوئے اعتراض حوالہ جات کا موازنہ کریں."
        },
        "CON-2": {
          "description": "پروگرامرز شامل iteration اور انتخاب کوڈ میں کمپیوٹر کے لئے ہدایات فراہم کرنے کا ایک طریقہ کے طور پر بہت سے ممکنہ ان پٹ اقدار میں سے ہر ایک پر عمل کرنے کے لئے."
        },
        "CON-2.A": {
          "description": "مشروط بیانات کا استعمال کرتے ہوئے منطقی عمل کی نمائندگی کرتے ہیں."
        },
        "CON-2.B": {
          "description": "گھوںسلا مشروط بیانات کا استعمال کرتے ہوئے منطقی عمل کی نمائندگی کرتے ہیں."
        },
        "CON-2.C": {
          "description": "تھوڑی دیر لوپ کا استعمال کرتے ہوئے تکرار کے عمل کی نمائندگی کرتے ہیں."
        },
        "CON-2.D": {
          "description": "ایک مخصوص تفصیلات کے تناظر میں الگورتھم کے لئے جو traversals کے استعمال کی ضرورت نہیں ہے: • معیاری الگورتھم کی شناخت."
        },
        "CON-2.E": {
          "description": "لوپ کے لئے ایک کا استعمال کرتے ہوئے iterative عمل کی نمائندگی کرتے ہیں."
        },
        "CON-2.F": {
          "description": "ایک مخصوص تفصیلات کے تناظر میں الگورتھم کے لئے سٹرنگ اشیاء شامل ہے • معیاری الگورتھم کی شناخت."
        },
        "CON-2.G": {
          "description": "گھوںسلا تکرار کے عمل کی نمائندگی کرتے ہیں"
        },
        "CON-2.H": {
          "description": "حساب بیان پر عملدرآمد شمار اور تکرار کے بیانات کے غیر رسمی رن ٹائم مقابلے."
        },
        "CON-2.I": {
          "description": "ایک خاص تفصیلات کے تناظر میں الگورتھم کے لئے جو صف traversals کے استعمال کی ضرورت ہے: • معیاری الگورتھم کی شناخت."
        },
        "CON-2.J": {
          "description": "ایک مخصوص تفصیلات کے تناظر میں الگورتھم کے لئے جو ArrayList traversals کے استعمال کی ضرورت ہے: • معیاری الگورتھم کی شناخت کریں."
        },
        "CON-2.K": {
          "description": "صف یا ArrayList اشیاء میں مخصوص معلومات کے لئے تلاش کرنے کے لئے ترتیب/لکیری تلاش الگورتھم کا اطلاق کریں."
        },
        "CON-2.L": {
          "description": "صف یا ArrayList اشیاء کے عناصر کو ترتیب دینے کے لئے انتخاب کی طرح اور اندراج طرح الگورتھم کا اطلاق کریں."
        },
        "CON-2.M": {
          "description": "حساب بیان پر عملدرآمد شمار اور الگورتھم چھانٹ رہا ہے کے غیر رسمی رن ٹائم مقابلے."
        },
        "CON-2.N": {
          "description": "2D صف traversals کے استعمال کی ضرورت ہے کہ ایک خاص تفصیلات کے تناظر میں الگورتھم کے لئے: • معیاری الگورتھم کی شناخت."
        },
        "CON-2.O": {
          "description": "پنراورتی طریقوں پر عمل کرنے کا نتیجہ کا تعین."
        },
        "CON-2.P": {
          "description": "سٹرنگ، 1D صف، یا ArrayList اشیاء میں معلومات کے لئے پنراورتی تلاش الگورتھم کا اطلاق کریں."
        },
        "CON-2.Q": {
          "description": "صف یا ArrayList اشیاء کے عناصر ترتیب پنراورتی یلگوردمز کا اطلاق کریں."
        },
        "CP": {
          "description": "مشروط احتمال اور احتمال کے قواعد"
        },
        "CPP": {
          "description": "کمپیوٹنگ کرنے کے اعمال اور پروگرامنگ"
        },
        "CRD-1": {
          "description": "تعاون کے ذریعے ایک سے زیادہ نقطہ نظر شامل کمپیوٹنگ بدعات تیار کیا جا رہا ہے بہتر بناتا ہے."
        },
        "CRD-1.A": {
          "description": "وضاحت کریں کہ کس طرح تعاون کے ذریعے کمپیوٹنگ بدعات کو بہتر بنایا جاتا ہے."
        },
        "CRD-1.B": {
          "description": "وضاحت کریں کہ کس طرح کمپیوٹنگ بدعات لوگوں کے گروپوں کی طرف سے تیار کی جاتی ہیں."
        },
        "CRD-1.C": {
          "description": "تعاون کے دوران مؤثر باہمی مہارت کا مظاہرہ."
        },
        "CRD-2": {
          "description": "ڈویلپرز ایک تکرار ڈیزائن کے عمل کا استعمال کرتے ہوئے تخلیق اور اختراع کرتے ہیں جو صارف پر توجہ مرکوز کرتا ہے، جس میں نفاذ/رائے کے سائیکل شامل ہوتے ہیں، اور یہ تجربے اور خطرے لینے کے لئے کافی جگہ چھوڑ دیتا ہے."
        },
        "CRD-2.A": {
          "description": "ایک کمپیوٹنگ اختراع کا مقصد بیان کریں."
        },
        "CRD-2.B": {
          "description": "وضاحت کریں کہ کس طرح ایک پروگرام یا کوڈ سیکشن کام کرتا ہے."
        },
        "CRD-2.C": {
          "description": "ایک پروگرام میں ان پٹ (ے) کی شناخت کریں."
        },
        "CRD-2.D": {
          "description": "ایک پروگرام کی طرف سے تیار کردہ پیداوار (ے) کی شناخت کریں."
        },
        "CRD-2.E": {
          "description": "ترقیاتی عمل کا استعمال کرتے ہوئے ایک پروگرام تیار کریں."
        },
        "CRD-2.F": {
          "description": "ایک پروگرام اور اس کے صارف انٹرفیس کو ڈیزائن کریں."
        },
        "CRD-2.G": {
          "description": "دستاویزات لکھ کر کوڈ سیکشن یا پروگرام کا مقصد بیان کریں."
        },
        "CRD-2.H": {
          "description": "دوسرے ذرائع سے استعمال کیا جاتا کوڈ طبقات تسلیم کرتے ہیں."
        },
        "CRD-2.I": {
          "description": "الگورتھم یا پروگرام میں غلطیوں کے لئے: \na غلطی کی شناخت کریں. \nب غلطی کو درست کریں."
        },
        "CRD-2.J": {
          "description": "آدانوں اور اسی متوقع پیداوار یا رویے کی شناخت کریں جو الگورتھم یا پروگرام کی درستی کو چیک کرنے کے لئے استعمال کیا جا سکتا ہے."
        },
        "CS": {
          "description": "کمپیوٹنگ سسٹمز"
        },
        "CSN-1": {
          "description": "کمپیوٹر کے نظام اور نیٹ ورک کو سہولت فراہم کرتا ہے کہ کس طرح ڈیٹا منتقل کیا جاتا ہے."
        },
        "CSN-1.A": {
          "description": "وضاحت کریں کہ کس طرح کمپیوٹنگ آلات ایک نیٹ ورک میں مل کر کام کرتے ہیں."
        },
        "CSN-1.B": {
          "description": "وضاحت کریں کہ انٹرنیٹ کس طرح کام کرتا ہے."
        },
        "CSN-1.C": {
          "description": "وضاحت کریں کہ کس طرح پیکٹ کے ذریعے انٹرنیٹ کے ذریعے ڈیٹا بھیجا جاتا ہے."
        },
        "CSN-1.D": {
          "description": "انٹرنیٹ اور ورلڈ وائڈ ویب کے درمیان اختلافات کی وضاحت کریں."
        },
        "CSN-1.E": {
          "description": "غلطی روادار نظام کے لئے، انٹرنیٹ کی طرح:\nاے غلطی رواداری\nب کے فوائد کی وضاحت کریں اس بات کی وضاحت کریں کہ کس طرح ایک دیا گیا نظام غلطی روادار\nسی ہے ایک نظام میں خطرات کی شناخت کریں."
        },
        "CSN-2": {
          "description": "متوازی اور تقسیم شدہ کمپیوٹنگ ایک سے زیادہ کمپیوٹرز کو زیادہ تیزی سے پیچیدہ مسائل کو حل کرنے یا بڑے ڈیٹا سیٹ پر عملدرآمد کرنے کے لئے لیوریج کرتی ہے."
        },
        "CSN-2.A": {
          "description": "اس مسئلے کے حل کا موازنہ کریں جو ترتیب، متوازی اور تقسیم شدہ کمپیوٹنگ کا استعمال کرتے ہیں۔"
        },
        "CSN-2.B": {
          "description": "ترتیب اور متوازی حل کی کارکردگی کا تعین."
        },
        "CSN-2.C": {
          "description": "فوائد اور متوازی اور تقسیم کمپیوٹنگ کے چیلنجوں کی وضاحت کریں."
        },
        "CT": {
          "description": "کمپیوٹیشنل سوچ"
        },
        "D1": {
          "description": "سوالات اور منصوبہ بندی کے انکوائری تیار کرنا"
        },
        "D2.Civ": {
          "description": "علم العلماء"
        },
        "D2.Eco": {
          "description": "معاشیات۔"
        },
        "D3.Claims": {
          "description": "دعووں کی ترقی اور ثبوت کا استعمال"
        },
        "D3.Sources": {
          "description": "جمع کرنا اور ذرائع کا جائزہ لینا"
        },
        "D4.Action": {
          "description": "باخبر ایکشن لینا"
        },
        "D4.Conclusions": {
          "description": "مواصلات اور تنقید کے نتائج"
        },
        "DA": {
          "description": "ڈیٹا اور تجزیہ"
        },
        "DAT-1": {
          "description": "کمپیوٹر کی جانب دیٹا کی نمائندگی صارف کے لیے ترجمانی اور دکھانے کے طریقے سے مختلف ہوتی ہے. پروگراموں کے ذریعے ڈیٹا کی نمائندگی ایسے انداز میں کی جاتی ہے کہ لوگ اسے زیادہ آسانی سے سمجھ سکیں."
        },
        "DAT-1.A": {
          "description": "وضاحت کریں کہ کس طرح بٹس کا استعمال کرتے ہوئے اعداد و شمار کی نمائندگی کی جا سکتی ہے."
        },
        "DAT-1.B": {
          "description": "اعداد و شمار کی نمائندگی کرنے کے لئے بٹس کا استعمال کرتے ہوئے کے نتائج کی وضاحت کریں."
        },
        "DAT-1.C": {
          "description": "بائنری نمبروں کے لئے:\nایک بائنری (بیس 2) ایک مثبت عددی (بیس 10) اور اس کے برعکس کے برابر حساب کریں. \nب بائنری نمبروں کا موازنہ کریں اور ترتیب دیں."
        },
        "DAT-1.D": {
          "description": "ڈیٹا کمپریشن الگورتھم کا موازنہ کریں اور اس بات کا تعین کریں کہ کسی خاص تناظر میں کون سا بہترین ہے۔"
        },
        "DAT-2": {
          "description": "اعداد و شمار پر عملدرآمد کے لیے پروگراموں کا استعمال کیا جا سکتا ہے، جو صارفین کو معلومات دریافت کرنے اور نیا علم تخلیق کرنے کی اجازت دیتا ہے۔"
        },
        "DAT-2.A": {
          "description": "وضاحت کریں کہ کونسی معلومات ڈیٹا سے نکالا جا سکتا ہے."
        },
        "DAT-2.B": {
          "description": "وضاحت کریں کہ میٹا ڈیٹا سے کونسا معلومات نکالا جا سکتا ہے۔"
        },
        "DAT-2.C": {
          "description": "پروسیسنگ ڈیٹا کے ساتھ منسلک چیلنجوں کی شناخت کریں."
        },
        "DAT-2.D": {
          "description": "ایک پروگرام کا استعمال کرتے ہوئے اعداد و شمار سے معلومات نکالیں."
        },
        "DAT-2.E": {
          "description": "وضاحت کریں کہ ڈیٹا سے بصیرت اور علم حاصل کرنے کے لئے پروگراموں کو کس طرح استعمال کیا جا سکتا ہے."
        },
        "EE": {
          "description": "اظہار اور مساوات"
        },
        "ESS": {
          "description": "زمین اور خلائی سائنس"
        },
        "ESS1": {
          "description": "کائنات میں زمین کی جگہ"
        },
        "ESS2": {
          "description": "زمین کے نظام"
        },
        "ESS3": {
          "description": "زمین اور انسانی سرگرمی"
        },
        "ETS": {
          "description": "سائنس میں انجینئرنگ"
        },
        "ETS1": {
          "description": "انجینئرنگ ڈیزائن"
        },
        "F": {
          "description": "افعال"
        },
        "G": {
          "description": "جیومیٹری"
        },
        "GMD": {
          "description": "ہندسی پیمائش اور طول و عرض"
        },
        "GPE": {
          "description": "مساوات کے ساتھ ہندسی خصوصیات کا اظہار"
        },
        "ID": {
          "description": "واضح اور مقداری ڈیٹا کی تشریح"
        },
        "IF": {
          "description": "افعال کی تشریح"
        },
        "IOC-1": {
          "description": "جبکہ کمپیوٹنگ اختراعات کو عام طور پر کسی مخصوص مقصد کے حصول کے لیے ڈیزائن کیا جاتا ہے، ان کے غیر ارادی نتائج بھی ہوسکتے ہیں۔"
        },
        "IOC-1.A": {
          "description": "وضاحت کریں کہ کس طرح ایک کمپیوٹنگ اختراع کا اثر فائدہ مند اور نقصان دہ دونوں ہو سکتا ہے."
        },
        "IOC-1.B": {
          "description": "وضاحت کریں کہ کس طرح ایک کمپیوٹنگ اختراع اپنے مقصود مقصد سے باہر اثر انداز کر سکتی ہے۔"
        },
        "IOC-1.C": {
          "description": "ڈیجیٹل تقسیم میں اہم کردار ادا کرنے والے مسائل کی وضاحت کریں."
        },
        "IOC-1.D": {
          "description": "وضاحت کریں کہ کس طرح تعصب کمپیوٹنگ بدعات میں موجود ہے."
        },
        "IOC-1.E": {
          "description": "وضاحت کریں کہ کس طرح لوگ پیمانے پر مسئلہ کو حل کرنے کے عمل میں حصہ لیتے ہیں."
        },
        "IOC-1.F": {
          "description": "وضاحت کریں کہ کمپیوٹنگ کا استعمال قانونی اور اخلاقی خدشات کو کیسے بڑھا سکتا ہے."
        },
        "IOC-2": {
          "description": "کمپیوٹنگ اختراعات کے استعمال میں آپ کی ذاتی حفاظت اور شناخت کے لیے خطرات شامل ہو سکتے ہیں۔"
        },
        "IOC-2.A": {
          "description": "کمپیوٹر سسٹم پر ذاتی ڈیٹا جمع کرنے اور ذخیرہ کرنے سے رازداری کے خطرات کی وضاحت کریں."
        },
        "IOC-2.B": {
          "description": "وضاحت کریں کہ کمپیوٹنگ کے وسائل کو کس طرح محفوظ کیا جا سکتا ہے اور کس طرح ان کا غلط استعمال ہو سکتا ہے۔"
        },
        "IOC-2.C": {
          "description": "وضاحت کریں کہ کمپیوٹنگ وسائل تک غیر مجاز رسائی حاصل کی جاتی ہے."
        },
        "L": {
          "description": "زبان"
        },
        "LE": {
          "description": "لکیری، چوکور، اور تخصیص ماڈلز ★"
        },
        "LS": {
          "description": "زندگی سائنس"
        },
        "LS1": {
          "description": "انولیکیو سے حیاتیات: ڈھانچے اور عمل"
        },
        "LS2": {
          "description": "ماحولیاتی نظام: تعامل، توانائی اور حرکیات"
        },
        "LS3": {
          "description": "وراثت: وراثت اور علامات کی تغیرات"
        },
        "LS4": {
          "description": "حیاتیاتی ارتقاء: اتحاد اور تنوع"
        },
        "MD": {
          "description": "فیصلے کرنے کے امکانات کا استعمال کرتے ہوئے"
        },
        "MG": {
          "description": "ہندسہ کے ساتھ ماڈلنگ"
        },
        "MOD-1": {
          "description": "کچھ اشیاء یا تصورات تو اکثر پروگرامرز پہلے سے ہی تجربہ کیا گیا ہے کہ موجودہ کوڈ پر اپنی طرف متوجہ کر سکتے ہیں کی نمائندگی کر رہے ہیں, ان کو چالو کرنے کے حل کو زیادہ تیزی سے اور اعتماد کی ایک بڑی ڈگری کے ساتھ لکھنے کے لئے."
        },
        "MOD-1.A": {
          "description": "کنسول پر آؤٹ پٹ پیدا کرنے کے لئے سسٹم کلاس کے طریقوں کو کال کریں."
        },
        "MOD-1.B": {
          "description": "ایک کلاس اور کسی چیز کے درمیان تعلقات کی وضاحت کریں."
        },
        "MOD-1.C": {
          "description": "شناخت کریں، اس کے دستخط کا استعمال کرتے ہوئے، صحیح ڈویلپر کو بلایا جا رہا ہے."
        },
        "MOD-1.D": {
          "description": "اعتراض پیدا کرنے کے لئے: a پیرامیٹرز کے بغیر constructors بلا کر اشیاء بنائیں."
        },
        "MOD-1.E": {
          "description": "پیرامیٹرز کے بغیر غیر جامد باطل طریقوں کو کال کریں."
        },
        "MOD-1.F": {
          "description": "پیرامیٹرز کے ساتھ غیر جامد باطل طریقوں کو کال کریں"
        },
        "MOD-1.G": {
          "description": "پیرامیٹرز کے ساتھ یا اس کے بغیر غیر جامد غیر باطل طریقوں کو کال کریں"
        },
        "MOD-1.H": {
          "description": "جامد طریقوں کو کال کریں."
        },
        "MOD-2": {
          "description": "پروگرامرز کسی جسمانی اعتراض یا غیر طبعی تصور، حقیقی یا تصور کی نمائندگی کرنے کے لیے کوڈ استعمال کرتے ہیں، کسی کلاس کی وضاحت کرتے ہوئے، کسی چیز یا تصور کی خصوصیات اور/یا رویے کی بنیاد پر"
        },
        "MOD-2.A": {
          "description": "کلاسوں، اعداد و شمار، تعمیراتی، اور طریقوں تک رسائی اور نمائش کی رکاوٹوں کو نامزد کریں."
        },
        "MOD-2.B": {
          "description": "مثال کے طور پر متغیر کی وضاحت کریں صفات کے لئے ایک کلاس کی تشکیل کے ذریعے initialized کیا جا کرنے کے لئے."
        },
        "MOD-2.C": {
          "description": "تبصرے کے ذریعے پروگرام کوڈ کی فعالیت اور استعمال کی وضاحت کریں."
        },
        "MOD-2.D": {
          "description": "ایک کلاس میں لکھا پیرامیٹرز کے بغیر غیر باطل طریقوں کے ذریعے کسی چیز کے رویے کی وضاحت کریں."
        },
        "MOD-2.E": {
          "description": "ایک کلاس میں لکھا پیرامیٹرز کے ساتھ یا بغیر باطل طریقوں کے ذریعے کسی چیز کے رویے کی وضاحت کریں."
        },
        "MOD-2.F": {
          "description": "ایک کلاس میں لکھا پیرامیٹرز کے ساتھ غیر باطل طریقوں کے ذریعہ کسی چیز کے رویے کی وضاحت کریں."
        },
        "MOD-2.G": {
          "description": "جامد طریقوں کے ذریعہ ایک کلاس کے رویے کی وضاحت کریں."
        },
        "MOD-2.H": {
          "description": "جامد متغیر کی وضاحت کریں جو کلاس سے تعلق رکھتے ہیں."
        },
        "MOD-3": {
          "description": "جب کثیر طبقات میں عام صفات اور طرز عمل شامل ہوتے ہیں تو پروگرامرز ایک نیا طبقہ تخلیق کرتے ہیں جس میں مشترک صفات اور طرز عمل ایک ہائے رازی تشکیل دیتے ہیں۔ تنظیمی ڈھانچے کے اعلی ترین سطح پر کی گئی ترمیم ذیلی طبقات پر لاگو ہوتی ہیں."
        },
        "MOD-3.A": {
          "description": "مثال کے طور پر متغیر کی نجی نمائش نامزد کسی چیز کی صفات encapsulate کرنے کے لئے."
        },
        "MOD-3.B": {
          "description": "ایک ذیلی طبقے سے سپر کلاس تک وراثت کا رشتہ تخلیق کریں۔"
        },
        "MOD-3.C": {
          "description": "ایک ہی تنظیمی ڈھانچے میں ایک subclass کے کسی چیز کو تفویض کیا جا کرنے کے لئے ایک superclass کے حوالہ متغیر کی وضاحت کریں."
        },
        "MOD-3.D": {
          "description": "وراثت کے تعلقات میں طریقوں کو کال کریں."
        },
        "MOD-3.E": {
          "description": "وراثت کے ذریعے آبجیکٹ کلاس کے طریقوں کو کال کریں."
        },
        "MP": {
          "description": "ریاضی کی مشقیں"
        },
        "NBT": {
          "description": "اساسی عشرے (Base Ten) کے اعداد اور آپریشنز"
        },
        "NF": {
          "description": "تعداد اور کارروائیاں — مختلف"
        },
        "NI": {
          "description": "نیٹ ورکس اور انٹرنیٹ"
        },
        "NS": {
          "description": "نمبروں کا نظام"
        },
        "OA": {
          "description": "اپریشنز اور الجبری سوچ"
        },
        "PS": {
          "description": "طبعی سائنس"
        },
        "PS1": {
          "description": "معاملہ اور اس کی تعامل"
        },
        "PS2": {
          "description": "تحریک اور استحکام: افواج اور تعاملات"
        },
        "PS3": {
          "description": "توانائی"
        },
        "PS4": {
          "description": "لہریں اور انفارمیشن ٹرانسفر میں ٹیکنالوجیز میں ان کی درخواستیں"
        },
        "Q": {
          "description": "مقدار"
        },
        "REI": {
          "description": "مساوات اور عدم مساوات کے ساتھ استدلال"
        },
        "RF": {
          "description": "بنیاد پرست مہارت پڑھنا"
        },
        "RH": {
          "description": "تاریخ پڑھنا/معاشرتی علوم"
        },
        "RI": {
          "description": "معلوماتی متن پڑھنا"
        },
        "RL": {
          "description": "تحریری مواد پڑھنا"
        },
        "RN": {
          "description": "اصلی عدد نظام"
        },
        "RP": {
          "description": "تناسب اور متناسب تعلقات"
        },
        "RST": {
          "description": "پڑھنا سائنس/تکنیکی"
        },
        "SL": {
          "description": "بولنا اور سننا"
        },
        "SP": {
          "description": "اعداد و شمار اور احتمال"
        },
        "SRT": {
          "description": "مماثلت، صحیح مثلث، اور مثلثیات"
        },
        "SSE": {
          "description": "اظہار میں ڈھانچہ دیکھ کر"
        },
        "TF": {
          "description": "مثلثیاتی افعال"
        },
        "VAR-1": {
          "description": "generalizable مسائل کے مخصوص حل تلاش کرنے کے لئے، پروگرامرز ان کے کوڈ میں متغیر شامل ہیں تاکہ ایک ہی الگورتھم مختلف ان پٹ اقدار کا استعمال کرتے ہوئے چلتا ہے"
        },
        "VAR-1.A": {
          "description": "سٹرنگ لٹریل بنائیں"
        },
        "VAR-1.B": {
          "description": "کسی خاص تفصیلات کے لئے سب سے مناسب ڈیٹا قسم کے زمرے کی شناخت کریں"
        },
        "VAR-1.C": {
          "description": "آدم اعداد و شمار کی نمائندگی کرنے کے لئے صحیح اقسام کے متغیر کا اعلان"
        },
        "VAR-1.D": {
          "description": "حوالہ کے اعداد و شمار کی نمائندگی کرنے کے لئے صحیح اقسام کے متغیر کی وضاحت کریں."
        },
        "VAR-1.E": {
          "description": "سٹرنگ کلاس کے لئے: a String اشیاء بنائیں ب String طریقوں کو کال کریں."
        },
        "VAR-1.F": {
          "description": "لفافے کی کلاسوں کے لیے: a integer اشیاء بنائیں ب انٹیجر طریقے کو کال کریں C ڈبل آبجیکٹ بنائیں d ڈبل طریقے کو کال کریں۔"
        },
        "VAR-1.G": {
          "description": "وضاحت کریں کہ پروگرام کوڈ میں متغیرات کا استعمال کیا جا سکتا ہے."
        },
        "VAR-1.H": {
          "description": "مطلوبہ الفاظ اس کا استعمال کرتے ہیں کہ اعتراض حوالہ اظہار کا اندازہ کریں."
        },
        "VAR-2": {
          "description": "اعداد و شمار میں بڑی مقدار میں ڈیٹا یا پیچیدہ تعلقات کو منظم کرنے کے لئے، پروگرامرز کوڈ لکھتے ہیں جو اعداد و شمار کو ایک ڈیٹا ڈھانچے میں جمع کرتا ہے جو ہر قدر کے لئے انفرادی متغیر پیدا کرنے والے وہٹ آؤٹ میں جمع کرتا ہے."
        },
        "VAR-2.A": {
          "description": "ایک جہتی کا استعمال کرتے ہوئے متعلقہ آدم یا اعتراض حوالہ کے اعداد و شمار کے مجموعے کی نمائندگی کرتے ہیں (1D) صف اشیاء."
        },
        "VAR-2.B": {
          "description": "ایک 1D صف میں عناصر عبور."
        },
        "VAR-2.C": {
          "description": "ایک 1D صف اعتراض میں عناصر عبور لوپ کے لئے ایک بہتر کا استعمال کرتے ہوئے."
        },
        "VAR-2.D": {
          "description": "ArrayList اشیاء کا استعمال کرتے ہوئے متعلقہ اعتراض حوالہ ڈیٹا کے مجموعے کی نمائندگی کرتے ہیں."
        },
        "VAR-2.E": {
          "description": "ArrayList اشیاء کے لئے: • کے لئے یا جبکہ لوپ کا استعمال کرتے ہوئے ٹرورس. • لوپ کے لئے ایک بہتر استعمال کرتے ہوئے ٹرورس."
        },
        "VAR-2.F": {
          "description": "دو جہتی کا استعمال کرتے ہوئے متعلقہ آدم یا اعتراض حوالہ کے اعداد و شمار کے مجموعے کی نمائندگی کرتے ہیں (2D) صف اشیاء."
        },
        "VAR-2.G": {
          "description": "2D صف آبجیکٹ کے لئے: • loops کے لئے گھوںسلا کا استعمال کرتے ہوئے عبور. • loops کے لئے بہتر گھوںسلا کا استعمال کرتے ہوئے ٹرورس."
        },
        "VM": {
          "description": "ویکٹر اور میٹرکس مقدار"
        },
        "W": {
          "description": "لکھنا"
        },
        "WHST": {
          "description": "ایچ ایس/ایس/ٹی لکھنا"
        }
      }
    }
  }
}