{
  "mr-IN": {
    "data": {
      "standard_categories": {
        "1": {
          "description": "विद्यार्थी सर्जनशील विचारांचे प्रात्यक्षिक करतात, ज्ञान तयार करतात आणि तंत्रज्ञानाचा वापर करून नाविन्यपूर्ण उत्पादने आणि प्रक्रिया विकसित करतात."
        },
        "2": {
          "description": "विद्यार्थी डिजिटल मीडिया आणि वातावरणाचा वापर संवाद साधण्यासाठी आणि सहकार्याने कार्य करण्यासाठी करतात, दूर अंतरावर, वैयक्तिक शिक्षणाला पाठिंबा देण्यासाठी आणि इतरांच्या शिकण्यात योगदान देण्यासाठी."
        },
        "4": {
          "description": "विद्यार्थी संशोधनाची योजना आखण्यासाठी आणि आयोजित करण्यासाठी, प्रकल्प व्यवस्थापित करण्यासाठी, समस्या सोडवण्यासाठी आणि योग्य डिजिटल साधने आणि संसाधने वापरून माहितीपूर्ण निर्णय घेण्यासाठी गंभीर विचार कौशल्ये वापरतात."
        },
        "6": {
          "description": "विद्यार्थी तंत्रज्ञानाच्या संकल्पना, सिस्टीम आणि ऑपरेशन्सची चांगली समज दाखवतात."
        },
        "C": {
          "description": "वर्तुळे"
        },
        "CD": {
          "description": "कॉम्प्युटर्स आणि संप्रेषण डिव्हायसेस"
        },
        "CI": {
          "description": "समुदाय, जागतिक आणि नैतिक परिणाम"
        },
        "CL": {
          "description": "सहयोग"
        },
        "CPP": {
          "description": "कॉम्प्युटिंगचा सराव आणि प्रोग्रॅमिंग"
        },
        "CT": {
          "description": "कॉम्प्युटेशनल विचार  "
        },
        "DAT-1": {
          "description": "संगणक डेटाचे प्रतिनिधित्व करण्याचा मार्ग वापरकर्त्यासाठी डेटाचा अर्थ लावण्याच्या आणि प्रदर्शित करण्याच्या मार्गापेक्षा वेगळा आहे. प्रोग्राम्सचा वापर डेटाचे प्रतिनिधित्वामध्ये अनुवाद करण्यासाठी केला जातो जो लोकांना अधिक सहजपणे समजतो."
        },
        "DAT-1.D": {
          "description": "एखाद्या विशिष्ट संदर्भात कोणता सर्वोत्तम आहे हे निर्धारित करण्यासाठी डेटा कम्प्रेशन अल्गोरिदमची तुलना करा."
        },
        "G": {
          "description": "भूमिती"
        },
        "IOC-2": {
          "description": "संगणकीय नवकल्पनांच्या वापरामध्ये तुमची वैयक्तिक सुरक्षितता आणि ओळख धोक्यात येऊ शकते."
        },
        "IOC-2.B": {
          "description": "संगणकीय संसाधनांचे संरक्षण कसे केले जाऊ शकते आणि त्याचा गैरवापर कसा केला जाऊ शकतो हे स्पष्ट करा."
        },
        "L": {
          "description": "भाषा"
        },
        "MP": {
          "description": "गणिती पद्धती"
        },
        "NBT": {
          "description": "दहा पाया असलेल्या संख्या आणि क्रिया"
        },
        "OA": {
          "description": "क्रिया आणि बीजगणिती विचार"
        },
        "RI": {
          "description": "माहिती वाचणे"
        },
        "RL": {
          "description": "वाचन साहित्य"
        },
        "SL": {
          "description": "बोलणे आणि ऐकणे"
        },
        "W": {
          "description": "लेखन"
        }
      }
    }
  }
}