{
  "zh-TW": {
    "data": {
      "standard_categories": {
        "1": {
          "description": "Pseudoloc-丝提迪伊提丝迪伊哦娜提儿提 西伊诶艾维 提艾娜艾娜，西哦丝提吾西 开哦尔伊迪伊 诶迪 伊维勒哦 艾娜哦诶艾维 屁哦迪西提 诶迪 儿西伊丝伊 吾艾娜 提西尺哦哦吉。"
        },
        "2": {
          "description": "Pseudoloc-丝提迪伊提丝吾丝 迪吉艾诶 马迪艾 诶迪 娜维儿哦马娜提 提 西马马娜艾诶提 娜迪尔哦开 哦勒诶比儿诶艾伊勒， 娜西吾迪娜吉诶提诶迪艾提诶西伊 提 丝屁屁儿 艾迪艾艾迪诶勒勒伊儿娜娜 诶迪 哦娜儿艾吾提 提 尺伊勒伊儿娜娜吉哦弗哦提伊丝。"
        },
        "3": {
          "description": "Pseudoloc-丝提迪伊提丝诶屁勒吾迪艾艾诶勒提哦勒丝提哦吉诶尺伊，伊维勒吾提伊 诶迪 丝伊艾弗哦马诶艾哦。"
        },
        "3-A-i": {
          "description": "Pseudoloc-娜诶吾儿 哦 勒诶儿艾娜  尺马诶丝 丝 诶西艾娜丝"
        },
        "3-A-ii": {
          "description": "Pseudoloc-娜诶吾儿 哦 勒诶儿艾娜  弗娜迪娜吉屁诶提伊娜丝艾 迪提诶"
        },
        "3-A-iii": {
          "description": "Pseudoloc-娜诶吾儿 哦 勒诶儿艾娜  提诶艾艾娜 诶马哦伊勒"
        },
        "3-A-iv": {
          "description": "Pseudoloc-娜诶吾儿 哦 勒诶儿艾娜  西娜丝儿吾提艾维 丝 丝娜吉诶 伊诶哦娜儿"
        },
        "3-A-v": {
          "description": "Pseudoloc-娜诶吾儿 哦 勒诶儿艾娜  诶杰吾提艾吉 娜提儿娜勒儿伊儿伊伊娜诶提哦娜"
        },
        "3-A-vi": {
          "description": "Pseudoloc-娜诶吾儿 哦 勒诶儿艾娜  勒诶儿艾娜 弗哦马伊斯伊艾伊西伊"
        },
        "3-B-i": {
          "description": "Pseudoloc-娜伊儿诶 娜提尔儿开 一丝儿吾提吾伊 弗  娜吾儿勒娜伊尔哦开"
        },
        "3-B-ii": {
          "description": "Pseudoloc-娜伊儿诶 娜提尔儿开 一尔艾吉提 迪杰丝提伊娜"
        },
        "3-C-i": {
          "description": "Pseudoloc-迪诶诶丝提丝一 伊诶吾儿 伊提"
        },
        "3-C-ii": {
          "description": "Pseudoloc-迪诶诶丝提丝一 诶儿伊 诶诶丝提丝"
        },
        "3-C-iii": {
          "description": "Pseudoloc-迪诶诶丝提丝一 艾诶"
        },
        "4": {
          "description": "Pseudoloc-丝提迪伊提丝吾丝 西艾提西勒 尺艾开艾吉 开艾勒丝提 屁诶娜诶娜 西娜迪西提儿丝伊儿西， 诶娜吉伊屁儿杰西提， 哦勒伊 儿哦勒伊丝 诶迪 诶开 艾弗哦马伊 伊西丝艾娜丝吾丝娜吉诶屁儿屁儿诶提 迪吉艾诶勒提哦勒 诶迪 伊丝吾儿伊丝"
        },
        "5": {
          "description": "Pseudoloc-丝提迪伊提丝吾娜伊儿提诶迪尺吾诶娜 西勒提儿诶， 娜 丝西艾提诶 艾丝吾丝 伊诶提迪 哦 伊西娜哦哦吉 娜迪屁儿西提西伊勒伊诶勒诶迪 提尺西诶 比尺诶艾哦。"
        },
        "6": {
          "description": "Pseudoloc-丝提迪伊提丝迪伊哦娜提儿提 诶丝哦娜迪吾娜伊儿提诶迪娜吉哦弗提伊尺娜勒哦吾 哦西伊提丝 丝丝提马丝 诶迪哦屁儿诶艾哦丝。"
        },
        "AAP-1": {
          "description": "Pseudoloc-提哦弗艾迪 屁伊艾弗西 哦吾提哦娜 提 吉娜伊诶勒德比勒 屁哦比伊马， 儿哦儿马马儿丝儿伊儿伊伊娜 诶迪哦儿诶娜德伊迪诶诶 娜 吾提艾勒伊尔诶丝。"
        },
        "AAP-1.A": {
          "description": "Pseudoloc-儿伊儿伊伊娜 诶维诶吾伊尔提尺诶 诶儿诶比伊。"
        },
        "AAP-1.B": {
          "description": "Pseudoloc-迪伊伊儿艾娜 提伊 诶勒伊哦弗诶 诶儿诶比伊 丝  伊丝勒提哦弗诶娜诶丝艾吉马娜提"
        },
        "AAP-1.C": {
          "description": "Pseudoloc-儿伊儿伊伊娜 诶勒艾提 儿丝提艾娜 吾艾娜 诶维诶艾比勒。"
        },
        "AAP-1.D": {
          "description": "Pseudoloc-弗哦 迪提诶诶比提儿西提哦： 诶。迪伊伊勒屁 诶提 比丝儿诶提艾娜 丝艾吉 艾提丝提哦丝提儿伊马吾提艾勒 伊伊马娜提。\n。 伊斯勒艾娜尺哦 提伊 丝伊哦弗迪提诶诶比提儿西提哦娜马诶诶伊丝西哦屁勒斯艾吾 娜 儿吉儿马 哦迪。"
        },
        "AAP-2": {
          "description": "Pseudoloc-提尺 尔吾 提诶伊马娜提 儿伊丝伊吾伊西伊 诶迪 哦比艾伊迪艾娜诶 儿哦儿诶 伊提儿马娜伊 提伊 哦马吾伊迪儿伊吾勒。 儿哦儿诶丝艾娜哦儿哦儿提伊艾提儿诶艾娜 娜迪丝伊伊西艾哦 西娜提儿西提 提 儿屁儿丝伊提儿伊伊提提艾娜 娜迪马诶伊迪伊艾丝哦娜 提 尺娜迪伊维诶艾伊 艾屁吾 维勒吾丝"
        },
        "AAP-2.A": {
          "description": "Pseudoloc-伊斯儿伊丝 娜 勒吉儿艾尺 提诶提吾丝丝 伊吾伊娜艾吉 艾提哦吾 吾艾娜 诶屁哦吉诶马艾娜 勒娜吉诶吉。"
        },
        "AAP-2.B": {
          "description": "Pseudoloc-儿伊儿伊伊娜 诶丝提屁一吾丝提屁 勒吉儿艾尺马西 儿西伊丝 丝艾吉 伊吾伊娜艾勒 哦迪 丝诶提马伊提丝"
        },
        "AAP-2.C": {
          "description": "Pseudoloc-伊维勒吾提伊伊斯儿伊丝艾娜 提诶提吾丝 诶艾提马伊艾 哦伊儿提哦丝。"
        },
        "AAP-2.D": {
          "description": "Pseudoloc-伊维勒吾提伊伊斯儿伊丝艾娜 提诶提马诶艾屁勒诶伊 提艾娜丝。"
        },
        "AAP-2.E": {
          "description": "Pseudoloc-弗哦 儿勒诶艾哦丝尺屁丝比提尔伊娜提尔 维儿艾比勒丝 伊屁儿丝丝哦娜， 儿 诶吾伊： 诶。儿伊儿伊伊娜 丝艾吉 伊勒提艾娜诶 哦伊诶提儿丝比。伊维勒吾提伊伊屁儿丝丝哦娜 提诶提吾丝 伊勒提艾娜诶 哦伊儿提哦丝"
        },
        "AAP-2.F": {
          "description": "Pseudoloc-弗哦 儿勒诶艾哦丝尺屁丝比提尔伊娜比哦勒伊娜 诶勒伊：\n。 伊屁伊丝娜提吾丝娜 勒吉艾诶勒哦屁儿诶哦儿。比。伊维勒吾提伊伊斯儿伊丝哦娜 提诶提吾丝 勒吉艾 屁伊诶提儿丝"
        },
        "AAP-2.G": {
          "description": "Pseudoloc-伊斯儿伊丝 娜 勒吉儿艾尺 提诶提吾丝丝 伊勒西提哦 尔提尺吾提吾丝娜吉诶 儿吉儿马马娜吉勒诶吉吾吉伊"
        },
        "AAP-2.H": {
          "description": "Pseudoloc-弗哦 丝勒伊提艾娜：诶。儿屁儿丝伊提 丝艾吉 哦娜艾艾哦诶勒丝提提伊伊娜丝。比 迪提伊马艾伊 尺伊儿伊吾提 弗 哦娜艾提哦娜勒 提提伊伊娜丝。"
        },
        "AAP-2.I": {
          "description": "Pseudoloc-弗哦 娜丝提迪 伊勒西提哦：\n。 伊屁伊丝娜提吾丝娜 娜丝提迪 哦娜艾提哦娜勒丝提提伊伊娜丝。\n比 迪提儿马娜伊提尺 儿丝吾提 弗娜伊提伊 西娜迪提艾娜诶 提诶伊马娜提。"
        },
        "AAP-2.J": {
          "description": "Pseudoloc-伊斯儿伊丝 娜 勒吉儿艾尺 提诶提吾丝丝 提伊诶提哦 尔提尺吾提吾丝娜吉诶 儿吉儿马马娜吉勒诶吉吾吉伊"
        },
        "AAP-2.K": {
          "description": "Pseudoloc-弗哦 艾伊儿提艾娜：诶。儿屁儿丝伊提 丝艾吉 提伊诶艾哦 丝诶提马伊提丝\n比 伊提儿马娜伊提尺 儿丝吾提哦儿丝艾伊一弗弗西提哦弗艾伊儿提艾娜 提诶伊马娜提。"
        },
        "AAP-2.L": {
          "description": "Pseudoloc-西哦屁诶伊 吾勒艾屁伊 勒哦儿提尺丝 哦 伊提儿马娜 艾 提伊吾吾艾勒迪提尺 诶马 丝迪伊伊弗伊西 哦 伊丝勒提"
        },
        "AAP-2.M": {
          "description": "Pseudoloc-弗哦 诶吉哦艾提马丝 \n。西儿诶提 诶吉哦艾提马丝 比。西哦比艾伊 娜迪马哦艾吾 斯艾提艾吉 勒吉儿艾尺丝。"
        },
        "AAP-2.N": {
          "description": "Pseudoloc-弗哦 勒丝提哦屁儿诶艾哦丝\n诶 尔艾提 伊屁儿丝丝哦丝 尺诶 吾伊 艾丝 艾迪斯艾吉 娜迪勒艾提 儿哦伊吾儿丝。比。伊维勒吾提伊伊屁儿丝丝哦娜 提诶提吾丝 艾丝 艾迪伊艾娜 诶迪 艾提 儿哦伊迪儿伊。"
        },
        "AAP-2.O": {
          "description": "Pseudoloc-弗哦 诶吉哦艾提马丝艾娜哦维艾吉 勒伊伊娜丝 弗  艾丝：\n。 伊屁伊丝娜提吾艾娜 艾伊儿提艾伊 提诶伊伊娜丝 哦 儿诶伊儿伊  艾丝。\n。 伊提儿马娜伊提伊 伊丝勒提哦弗诶娜诶勒哦艾提马 艾提 勒丝提提儿维儿丝勒丝"
        },
        "AAP-2.P": {
          "description": "Pseudoloc-弗哦 比娜诶吾 伊诶西尺诶吉哦艾提马丝\n诶 迪提伊马娜伊提尺 娜马比儿 弗 提儿诶艾哦丝 伊吾艾儿迪 哦弗艾迪  维勒吾 艾 诶迪提诶丝伊。 比。伊斯勒诶娜提尺 儿吾吾儿伊伊娜丝 伊伊丝诶儿 提 西马屁伊提  比娜诶吾 伊诶西尺"
        },
        "AAP-3": {
          "description": "Pseudoloc-屁儿吉儿马马儿丝比儿诶开迪尔娜屁儿比勒马丝艾娜哦 马勒勒儿 娜迪马哦伊 诶娜吉诶比伊 艾伊伊丝 比 西伊提艾吉 儿哦伊迪儿伊 诶迪勒伊伊儿吉艾吉 诶儿马伊伊丝，屁儿吉儿马马儿丝吉伊伊诶勒德伊屁儿西伊丝伊 提诶 西娜 伊 伊吾伊迪 屁哦伊迪儿伊 诶勒哦 屁哦吉诶马伊丝 哦 儿诶 吾哦娜伊艾丝艾娜 西迪伊提尺提 诶 诶儿伊迪吾比伊娜 伊丝伊， 勒勒尔艾吉 儿哦儿诶马儿丝提哦尔儿提伊屁儿吉儿马 马儿伊吾吾西开吾 娜迪尔提尺马哦伊 哦娜艾迪娜西。"
        },
        "AAP-3.A": {
          "description": "Pseudoloc-弗哦 屁哦西迪吾伊 诶勒丝\n诶 尔艾提 丝诶提马伊提 提 西勒勒屁儿西伊吾儿丝\n比 迪提伊马艾伊 尺伊儿丝吾提 儿 弗弗西提哦弗诶屁儿西伊吾儿 西勒勒"
        },
        "AAP-3.B": {
          "description": "Pseudoloc-弗哦 屁哦西迪吾伊 诶勒丝\n诶 尔艾提 丝诶提马伊提 提 西勒勒屁儿西伊吾儿丝\n比 迪提伊马艾伊 尺伊儿丝吾提 儿 弗弗西提哦弗诶屁儿西伊吾儿 西勒勒"
        },
        "AAP-3.C": {
          "description": "Pseudoloc-迪伊伊勒屁 儿哦伊迪儿诶 比丝儿诶提艾娜丝提哦马诶诶伊 哦马勒伊艾提 艾 诶屁哦吉诶马比吾尔儿提艾吉 儿西伊吾儿丝。"
        },
        "AAP-3.D": {
          "description": "Pseudoloc-丝伊伊西 诶屁儿屁儿诶提 艾比诶儿伊丝哦儿伊斯丝提娜 西迪伊丝伊马伊提丝提哦吾伊 娜 儿伊提艾吉 伊尔屁哦吉诶马。"
        },
        "AAP-3.E": {
          "description": "Pseudoloc-弗哦 吉娜伊诶提娜吉儿诶迪马 诶勒伊丝 \n。 儿艾伊伊斯儿伊丝艾娜丝提哦吉伊伊诶提 屁丝丝比勒 维勒吾丝 \n。 维诶吾诶伊 斯屁伊丝艾娜丝提哦迪伊伊儿艾娜 尺伊屁哦丝艾勒伊儿伊吾勒丝"
        },
        "AAP-3.F": {
          "description": "Pseudoloc-弗哦 丝马吾诶提哦娜：\n。伊斯勒诶娜 哦尔西哦屁吾伊丝 诶娜比伊吾丝迪 哦 伊儿伊伊娜 儿诶勒尔哦勒迪屁伊娜马伊诶 儿 吾提哦马丝 \n。 哦马诶儿 提伊 丝 哦 丝马吾诶提哦娜 尔提 儿诶勒尔哦勒迪西哦提伊提。"
        },
        "AAP-4": {
          "description": "Pseudoloc-提尺儿伊伊斯丝提屁儿比勒马 提诶提提尺 西马屁提伊 诶娜哦提丝哦维伊 诶迪 维娜 尺伊 提伊 哦马吾提儿西诶 丝勒维 诶屁儿比勒马 艾 马吾 哦提比伊诶比伊提哦迪哦丝哦艾娜诶 伊诶哦诶比伊 马哦娜提哦弗提艾伊"
        },
        "AAP-4.A": {
          "description": "Pseudoloc-弗哦 迪提伊马艾艾娜 提伊伊弗艾西伊娜吾 弗 娜 勒哦儿提尺：\n。 斯屁诶艾 尺伊迪艾弗伊伊娜伊 伊提伊娜 勒吉儿艾尺马 提诶提儿娜 娜 伊诶哦娜比勒 提马 诶迪 尺哦伊 尺诶 迪 哦提儿吾 艾 儿诶丝娜诶勒 提马伊 \n。 迪伊提艾吾丝艾吾诶艾哦丝 尺伊伊  伊吾艾丝艾西丝哦吾提哦娜马吾 伊 哦儿 诶屁儿屁儿诶伊。"
        },
        "AAP-4.B": {
          "description": "Pseudoloc-伊斯勒诶娜 尺伊伊斯丝提娜伊 弗 娜迪西艾诶比伊 儿比勒马丝艾娜西哦屁吾伊儿丝艾伊西伊"
        },
        "AP": {
          "description": "Pseudoloc-诶勒哦儿提尺丝  屁哦吉诶马艾吉"
        },
        "APR": {
          "description": "Pseudoloc-诶儿提尺伊提西 艾提 屁勒娜哦艾诶丝 娜迪儿诶艾哦诶 伊屁儿丝丝哦娜"
        },
        "BF": {
          "description": "Pseudoloc-比吾勒迪娜吉弗吾西提哦娜"
        },
        "BI-1": {
          "description": "Pseudoloc-西哦屁吾伊儿 屁儿西艾维 尺伊尔哦勒迪吾丝娜吉丝伊丝儿丝"
        },
        "BI-2": {
          "description": "Pseudoloc-诶吉娜提 马艾娜诶艾 儿屁伊丝娜提提艾娜丝哦弗提尺 哦儿迪 娜迪吾丝 提伊马弗儿 伊诶哦娜娜吉"
        },
        "BI-3": {
          "description": "Pseudoloc-西哦屁吾伊儿 西娜 伊诶娜弗儿马 诶提"
        },
        "BI-4": {
          "description": "Pseudoloc-艾娜伊勒艾吉娜提诶吉娜提 伊吾艾儿 马娜吾开艾迪丝哦 开哦尔伊迪伊 哦 娜提儿西提娜诶吾儿勒勒 尔提尺尺马诶丝"
        },
        "BI-5": {
          "description": "Pseudoloc-诶艾西诶 艾屁诶提 哦西伊吾 娜 哦提 屁丝艾艾维 娜迪娜伊诶提维伊尔诶丝"
        },
        "C": {
          "description": "Pseudoloc-西艾西勒丝"
        },
        "CC": {
          "description": "Pseudoloc-西哦娜提娜吉诶娜 西儿迪娜勒艾吾"
        },
        "CD": {
          "description": "Pseudoloc-西哦屁吾伊儿 &西哦马吾艾诶提哦娜迪伊艾西丝"
        },
        "CED": {
          "description": "Pseudoloc-西儿诶提娜吉伊吾诶提哦娜"
        },
        "CI": {
          "description": "Pseudoloc-西哦马吾艾提， 勒哦诶勒 娜迪伊提艾西勒 马屁西提"
        },
        "CL": {
          "description": "Pseudoloc-西哦勒诶哦儿提艾娜"
        },
        "CN": {
          "description": "Pseudoloc-提尺 西马屁伊斯娜吾比伊 吾丝伊马"
        },
        "CO": {
          "description": "Pseudoloc-西哦吉儿伊娜伊"
        },
        "CON-1": {
          "description": "Pseudoloc-提尺 尔吾 诶儿诶比伊丝诶迪 屁伊诶提儿丝诶儿 丝吾伊娜伊迪诶娜 西马比娜伊 娜 娜 斯屁伊丝艾哦 迪提儿马娜伊 提伊 哦马吾提迪儿伊吾勒。"
        },
        "CON-1.A": {
          "description": "Pseudoloc-伊维勒吾提伊诶儿提尺伊提西伊斯儿伊丝艾娜丝艾娜诶 儿吉儿马 哦迪"
        },
        "CON-1.B": {
          "description": "Pseudoloc-伊维勒吾提伊尔尺提 丝 提儿伊 艾 诶维诶艾诶勒伊诶 诶儿伊吾勒 哦 诶 伊屁伊丝艾哦 尔提尺诶娜诶丝艾娜马娜提丝提提伊伊娜"
        },
        "CON-1.C": {
          "description": "Pseudoloc-伊维勒吾提伊诶儿提尺伊提西伊斯儿伊丝艾娜丝提尺提 丝 西丝提娜吉"
        },
        "CON-1.D": {
          "description": "Pseudoloc-伊维勒吾提伊伊斯儿伊丝艾娜 提诶提吾丝 提伊 诶提 勒诶丝 伊提哦迪。"
        },
        "CON-1.E": {
          "description": "Pseudoloc-伊维勒吾提伊比哦勒伊娜 斯儿伊丝艾娜丝提尺提 丝伊儿勒诶艾哦诶勒哦屁儿诶哦儿 娜 儿哦儿诶 西迪伊"
        },
        "CON-1.F": {
          "description": "Pseudoloc-伊维勒吾提伊西哦屁哦迪娜比哦勒诶娜伊斯儿伊丝艾娜丝艾 屁哦吉诶马西哦伊。"
        },
        "CON-1.G": {
          "description": "Pseudoloc-西哦屁诶伊 娜迪西哦提儿丝 伊吾艾诶勒娜提比哦勒伊娜伊斯儿伊丝艾娜丝"
        },
        "CON-1.H": {
          "description": "Pseudoloc-西哦屁诶伊 比杰西提儿伊伊伊娜伊丝吾丝娜吉比哦勒伊娜伊斯儿伊丝艾娜丝艾娜屁儿吉诶马西哦伊。"
        },
        "CON-2": {
          "description": "Pseudoloc-屁儿吉儿马马儿丝艾娜哦儿哦诶提 艾伊儿提艾娜 娜迪丝勒伊提艾娜 娜提 西迪伊诶 诶尔诶 哦 屁哦维迪艾吉艾娜提儿西提哦娜 弗儿 尺 西马屁提伊 提 屁哦西丝 伊西尺哦弗提尺 马娜吾屁丝丝比勒 艾屁吾 维勒吾丝"
        },
        "CON-2.A": {
          "description": "Pseudoloc-儿伊儿伊伊娜 比诶娜尺艾吉勒哦艾西勒 儿哦伊丝伊丝比 吾艾娜 西娜迪提艾娜诶 提诶伊马娜提。"
        },
        "CON-2.B": {
          "description": "Pseudoloc-儿伊儿伊伊娜 比诶娜尺艾吉勒哦艾西勒 儿哦伊丝伊丝比 吾艾娜 娜丝提迪 哦娜艾艾哦诶勒丝提提伊伊娜丝。"
        },
        "CON-2.C": {
          "description": "Pseudoloc-儿伊儿伊伊娜 艾伊儿提艾伊屁儿西伊丝伊 吾艾娜 诶尔艾勒勒哦屁。"
        },
        "CON-2.D": {
          "description": "Pseudoloc-弗哦 诶吉哦艾提马丝艾娜提伊 哦娜伊斯 哦 诶屁诶提西吾诶儿丝屁西艾艾西提艾娜提尺提 哦伊 娜提 伊吾艾伊 尺伊吾丝 哦 提诶维儿诶勒：  艾伊娜艾弗 丝诶迪诶迪 勒吉儿艾尺马。  哦迪弗吾丝提娜迪儿迪诶勒哦艾提马丝 •迪伊伊勒屁 娜诶勒哦儿提尺。"
        },
        "CON-2.E": {
          "description": "Pseudoloc-儿伊儿伊伊娜 艾伊儿提艾伊屁儿西伊丝伊 吾艾娜 诶弗儿 哦哦。"
        },
        "CON-2.F": {
          "description": "Pseudoloc-弗哦 诶吉哦艾提马丝艾娜提伊 哦娜伊斯 哦 诶屁诶提西吾诶儿丝屁西艾艾西提艾娜提尺提 娜维勒维丝 提儿娜 哦杰伊提丝• 迪伊提艾吾丝提娜迪儿迪诶勒哦儿提尺丝 •马哦艾弗 丝诶娜诶儿 勒吉儿艾尺马。  迪维伊哦 诶 诶吉哦艾提马。"
        },
        "CON-2.G": {
          "description": "Pseudoloc-儿伊儿伊伊娜 娜丝提迪 提儿诶艾维 屁哦西丝丝丝"
        },
        "CON-2.H": {
          "description": "Pseudoloc-西哦屁吾伊 提诶伊马娜提伊伊西提艾娜 哦吾提丝诶娜 娜弗儿马勒 吾娜提艾伊 哦屁诶艾丝娜 弗 提伊诶提维 丝诶提马伊提丝"
        },
        "CON-2.I": {
          "description": "Pseudoloc-弗哦 诶吉哦艾提马丝艾娜提伊 哦娜伊斯 哦 诶屁诶提西吾诶儿丝屁西艾艾西提艾娜提尺提 伊吾艾儿丝 尺伊吾伊 弗 儿儿吾 儿诶伊儿诶丝：• 迪伊提艾吾 提诶迪儿迪诶勒哦儿提尺丝。• 哦艾弗 丝诶娜诶儿 诶吉哦艾尺马。  迪维伊哦屁诶娜诶吉哦艾提马。"
        },
        "CON-2.J": {
          "description": "Pseudoloc-弗哦 诶吉哦艾提马丝艾娜提伊 哦娜伊斯 哦 诶屁诶提西吾诶儿丝屁西艾艾西提艾娜提尺提 伊吾艾儿丝 尺伊吾伊 弗 儿儿吾勒丝提提儿维儿丝勒丝 •艾迪娜提弗吾丝诶娜诶儿 诶吉哦艾提马丝  马迪艾吾 提诶迪诶迪 勒哦儿提尺丝。• 伊维勒哦 娜 勒吉儿艾尺马"
        },
        "CON-2.K": {
          "description": "Pseudoloc-诶屁勒吾丝伊吾伊提艾勒/艾伊诶 丝诶儿尺 勒吉儿艾尺丝 哦 伊诶西尺弗哦 丝伊艾弗西 娜弗儿马提艾娜 娜诶儿诶吾哦儿诶儿诶吾艾丝 比杰西提。"
        },
        "CON-2.L": {
          "description": "Pseudoloc-诶屁勒吾丝伊伊西艾哦 丝儿 诶迪 娜丝儿提哦娜丝哦提诶勒哦儿提尺丝 哦 哦儿 尺伊伊勒马伊提丝哦弗诶儿诶 哦 诶儿诶勒艾提 比杰西丝。"
        },
        "CON-2.M": {
          "description": "Pseudoloc-西哦屁吾伊 提诶伊马娜提伊伊西提艾娜 哦吾提丝诶娜 娜弗儿马勒 吾娜提艾伊 哦屁诶艾丝娜 弗 哦儿艾娜 勒吉儿艾尺马。"
        },
        "CON-2.N": {
          "description": "Pseudoloc-弗哦 诶吉哦艾提马丝艾娜提伊 哦娜伊斯 哦 诶屁诶提西吾诶儿丝屁西艾艾西提艾娜提尺提 伊吾艾儿丝 尺伊吾伊 弗 迪 儿儿吾 儿诶伊丝诶丝：• 迪伊提艾吾 提娜迪儿迪诶勒哦儿提尺丝。•马哦艾弗 丝诶娜诶儿 诶吉儿艾尺马。  迪维伊哦屁诶 诶吉哦艾提马。"
        },
        "CON-2.O": {
          "description": "Pseudoloc-迪伊伊儿艾娜 提伊 伊丝勒 哦 伊伊西提艾吉 伊西儿艾维 马提尺迪丝"
        },
        "CON-2.P": {
          "description": "Pseudoloc-诶屁勒吾儿伊吾儿艾维 丝诶西尺诶勒哦儿提尺丝 哦 娜哦儿诶提哦娜艾娜丝提艾娜，1迪诶儿诶吾 哦 诶儿诶勒丝提哦比伊西丝。"
        },
        "CON-2.Q": {
          "description": "Pseudoloc-诶屁勒吾儿伊吾儿艾维 诶吉儿艾尺马 提 丝儿提伊勒马娜提 哦 诶儿诶 哦 诶儿吾勒丝提哦比伊西丝。"
        },
        "CP": {
          "description": "Pseudoloc-西哦迪艾艾哦诶勒屁儿比诶艾艾提 诶迪 尺伊儿吾伊丝哦 屁哦比比艾艾提"
        },
        "CPP": {
          "description": "Pseudoloc-西哦屁吾艾娜 屁诶西艾西  屁哦吉诶马艾娜"
        },
        "CRD-1": {
          "description": "Pseudoloc-艾娜哦儿哦儿提艾吉 吾勒艾勒伊屁伊丝屁西提维伊 提儿吾吉 西勒勒比哦诶提哦娜艾屁儿维伊 提伊 哦马吾提娜 艾娜哦诶提哦娜 比艾娜 伊维勒哦伊迪"
        },
        "CRD-1.A": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔西哦屁吾艾吉 娜娜维诶艾哦丝 儿伊艾屁儿维伊 提儿哦吉尺西哦勒比哦诶提哦娜"
        },
        "CRD-1.B": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔西哦屁吾艾吉 娜娜维诶艾哦丝 儿伊迪维伊哦屁迪 吾 儿哦屁丝哦 屁哦屁伊。"
        },
        "CRD-1.C": {
          "description": "Pseudoloc-迪伊哦娜提儿提伊伊弗伊西艾伊 娜提儿屁儿丝娜诶 丝艾勒丝迪吾艾娜 西勒勒比哦诶艾哦。"
        },
        "CRD-2": {
          "description": "Pseudoloc-迪伊伊勒屁伊丝 儿伊提伊诶迪 娜娜维诶伊 丝艾吉 娜艾提儿诶艾维 迪丝艾娜 儿西伊丝 尺诶 艾 吾伊儿弗西吾伊迪 提诶提艾娜哦儿哦诶提丝 马屁伊马娜提提艾娜/伊迪比西开西吾勒伊， 娜 提诶提勒伊维伊 诶屁勒 哦哦 弗儿 斯屁儿艾伊娜诶艾哦 诶迪 艾丝一提开艾吉"
        },
        "CRD-2.A": {
          "description": "Pseudoloc-迪伊西儿比伊提尺 屁儿屁丝 哦 诶西哦屁吾艾娜 艾娜维诶艾哦。"
        },
        "CRD-2.B": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔诶 儿哦儿马 儿 哦迪 丝吉马娜提弗娜西艾哦丝。"
        },
        "CRD-2.C": {
          "description": "Pseudoloc-艾迪娜提弗吾艾娜吾提()提 诶屁儿吉儿马。"
        },
        "CRD-2.D": {
          "description": "Pseudoloc-艾迪娜提弗吾哦吾屁吾(丝)儿哦吾西迪 吾  屁哦吉诶。"
        },
        "CRD-2.E": {
          "description": "Pseudoloc-迪伊伊勒屁  屁哦吉诶马吾艾娜 诶迪伊伊勒屁马娜提屁哦西丝丝"
        },
        "CRD-2.F": {
          "description": "Pseudoloc-迪伊艾吉 诶屁儿吉儿马 娜 艾丝 丝伊 艾提伊弗诶伊"
        },
        "CRD-2.G": {
          "description": "Pseudoloc-迪伊西儿比伊提尺 屁儿屁丝 哦 诶西哦伊 伊吉伊娜 儿 儿哦儿诶 比 尔艾提娜 迪西吾伊娜诶提哦娜"
        },
        "CRD-2.H": {
          "description": "Pseudoloc-诶西娜哦勒伊吉伊西哦伊 伊马伊提丝吾丝迪 儿哦 哦尺儿 哦吾西伊。"
        },
        "CRD-2.I": {
          "description": "Pseudoloc-弗哦 伊儿哦丝 娜 娜 勒哦儿提尺 哦 屁哦吉诶马 诶。艾迪娜提弗吾提尺 伊儿儿。\n比 西儿儿西提提尺 儿儿儿。"
        },
        "CRD-2.J": {
          "description": "Pseudoloc-艾迪娜提弗吾艾娜吾提 诶迪西哦儿伊屁哦迪艾吉 斯屁西伊迪哦吾屁吾 哦 比尺诶艾儿丝提尺提 诶娜比伊吾丝迪提哦西尺西开提尺 西儿儿西娜伊丝 弗 娜 勒吉儿艾尺 哦 屁哦吉诶马"
        },
        "CS": {
          "description": "Pseudoloc-西哦屁吾艾娜 丝丝提马丝"
        },
        "CSN-1": {
          "description": "Pseudoloc-西哦屁吾伊儿丝吾提伊丝 娜 娜提尔儿开 弗西艾艾提提 尺尔 诶提 艾 提诶娜弗儿儿迪。"
        },
        "CSN-1.A": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔西哦屁吾艾吉 伊维西伊 尔儿开提哦伊尺伊 艾 诶娜伊尔哦开。"
        },
        "CSN-1.B": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔提尺 艾提儿娜提 哦儿丝。"
        },
        "CSN-1.C": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔迪诶诶 丝丝伊提 尺儿吾吉 提伊 娜伊儿伊提维艾 屁西开提丝"
        },
        "CSN-1.D": {
          "description": "Pseudoloc-迪伊西儿比伊提尺 迪弗弗儿娜西丝 伊提伊伊 提伊 娜伊儿伊提诶娜 提伊 哦儿迪尔艾伊 伊比"
        },
        "CSN-1.E": {
          "description": "Pseudoloc-弗哦 弗吾勒一提勒伊诶娜 吾丝伊马， 艾开 提伊 娜伊儿伊提\n诶 迪丝西艾比 尺伊比伊伊弗提丝哦弗弗诶勒一提勒伊诶娜伊\n。 斯屁诶娜 哦尔诶 艾维娜 吾丝伊 艾 弗吾勒一提勒伊诶娜\n。 迪伊提艾吾 吾勒伊儿比勒艾艾伊 艾 诶丝吾提伊。"
        },
        "CSN-2": {
          "description": "Pseudoloc-屁诶诶勒伊勒诶娜 迪丝提艾吾提迪 哦马吾提娜吉勒伊伊诶吉丝 吾勒艾屁伊 哦马吾伊儿 提 马儿伊吾吾西开吾丝哦维伊西哦屁勒斯 儿哦勒马丝哦儿屁儿西伊丝 诶儿伊迪诶诶 伊提。"
        },
        "CSN-2.A": {
          "description": "Pseudoloc-西哦屁诶伊 儿哦勒伊 丝勒提艾娜丝提尺提 丝伊丝伊吾娜提诶勒 屁儿诶勒伊， 娜 迪丝提艾比提伊 西马屁提娜吉"
        },
        "CSN-2.B": {
          "description": "Pseudoloc-迪伊伊儿艾娜 提伊 弗弗西伊娜吾 弗 伊吾伊娜艾诶 娜迪屁诶诶勒伊勒丝哦吾提哦丝。"
        },
        "CSN-2.C": {
          "description": "Pseudoloc-迪伊西儿比伊比伊伊弗提丝诶迪 尺诶勒伊吉伊 哦 屁儿勒勒勒 娜迪迪艾提儿比吾伊 西马屁提艾吉。"
        },
        "CT": {
          "description": "Pseudoloc-西哦屁吾诶提哦娜勒 尺艾开娜吉"
        },
        "D1": {
          "description": "Pseudoloc-迪伊伊勒屁艾吉 吾伊提艾娜 诶迪 勒诶娜艾吉 娜吾伊艾伊"
        },
        "D2.Civ": {
          "description": "Pseudoloc-西艾艾西"
        },
        "D2.Eco": {
          "description": "Pseudoloc-伊西娜哦艾西"
        },
        "D2.Geo": {
          "description": "Pseudoloc-吉伊吉儿屁尺"
        },
        "D2.His": {
          "description": "Pseudoloc-尺艾提哦吾"
        },
        "D3.Claims": {
          "description": "Pseudoloc-迪伊伊勒屁艾吉 勒诶马丝诶迪 丝艾吉 维艾伊娜伊"
        },
        "D3.Sources": {
          "description": "Pseudoloc-吉诶尺伊艾娜 诶迪 维诶吾提艾吉 哦吾西伊"
        },
        "D4.Action": {
          "description": "Pseudoloc-提诶艾娜 艾弗哦马伊 诶提哦娜"
        },
        "D4.Conclusions": {
          "description": "Pseudoloc-西哦马吾艾西提艾吉 娜迪西艾提吾吾娜吉西哦西勒丝艾娜"
        },
        "DA": {
          "description": "Pseudoloc-迪诶诶  诶诶勒丝艾"
        },
        "DAT-1": {
          "description": "Pseudoloc-提尺 尔吾 尺诶 提伊 哦屁吾伊儿儿伊儿伊伊娜丝 诶诶 丝 艾弗伊儿娜提弗儿马提尺 尔吾 尺诶 提伊 诶诶 儿伊艾娜伊儿儿伊伊迪诶迪 艾丝勒诶伊迪弗哦 提伊吾丝儿。屁儿吉儿马丝诶儿 丝伊 提 提诶娜勒诶伊 诶诶 娜提 诶儿伊儿伊伊娜诶艾哦 提诶提艾丝马哦伊 诶艾勒 吾迪伊丝提哦迪比吾屁哦屁伊。"
        },
        "DAT-1.A": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔迪诶诶 诶 比 儿屁儿丝伊提伊 吾艾吉 艾提。"
        },
        "DAT-1.B": {
          "description": "Pseudoloc-伊斯勒诶娜 尺伊西哦丝伊吾娜西丝 弗 丝艾吉 艾提 哦 伊屁伊丝娜提迪诶诶。"
        },
        "DAT-1.C": {
          "description": "Pseudoloc-弗哦 比娜诶吾 吾马伊儿：诶。西诶西吾诶提 提伊 艾诶儿 (诶丝 2)伊吾艾诶伊娜 哦 诶屁哦艾提维伊艾提伊伊儿(比丝伊10)诶迪维艾伊 伊儿诶。\n比 西马诶儿 诶迪 儿迪儿 艾娜儿 娜马比儿丝"
        },
        "DAT-1.D": {
          "description": "Pseudoloc-西哦屁诶伊 诶提 西马屁伊丝艾娜 勒吉儿艾尺马 提 伊提儿马娜伊尔尺西尺艾丝比丝提艾娜诶 诶儿艾西勒诶 哦娜伊斯。"
        },
        "DAT-2": {
          "description": "Pseudoloc-屁儿吉儿马丝西诶 比 吾伊 提 屁哦西丝丝迪诶诶，尔艾西 诶勒哦丝 丝伊丝 哦迪艾西哦伊儿艾娜哦儿诶提哦 诶迪 儿伊提伊娜伊 开哦勒伊吉伊"
        },
        "DAT-2.A": {
          "description": "Pseudoloc-迪伊西儿比伊尔尺提 娜弗儿诶提哦娜西诶 比 伊提儿西伊迪弗儿马 诶提。"
        },
        "DAT-2.B": {
          "description": "Pseudoloc-迪伊西儿比伊尔尺提 娜弗儿诶提哦娜西诶 比 伊提儿西伊迪弗儿马 伊提迪诶诶。"
        },
        "DAT-2.C": {
          "description": "Pseudoloc-艾迪娜提弗吾提尺 西诶勒伊吉伊 诶丝哦艾诶伊迪尔艾尺屁儿西伊丝艾吉 诶提。"
        },
        "DAT-2.D": {
          "description": "Pseudoloc-伊斯儿诶提 娜弗儿马提艾娜弗儿马 诶提 吾艾娜 诶屁哦吉诶马"
        },
        "DAT-2.E": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔屁儿吉儿马 西娜 伊 丝伊 提 吉艾 艾丝艾尺提诶娜 开哦尔伊吉伊弗儿马 诶提。"
        },
        "EE": {
          "description": "Pseudoloc-伊斯儿伊丝艾娜丝诶娜 伊吾提艾娜丝"
        },
        "ESS": {
          "description": "Pseudoloc-伊诶提尺诶娜 丝诶西 丝艾娜西"
        },
        "ESS1": {
          "description": "Pseudoloc-伊诶提尺' 勒诶伊 娜 尺 吾艾维儿丝"
        },
        "ESS2": {
          "description": "Pseudoloc-伊诶提尺' 吾丝伊马"
        },
        "ESS3": {
          "description": "Pseudoloc-伊诶提尺诶娜 尺马诶 诶提维艾吾"
        },
        "ETS": {
          "description": "Pseudoloc-伊娜艾娜伊儿娜吉艾娜提尺 西艾娜西丝"
        },
        "ETS1": {
          "description": "Pseudoloc-伊娜艾娜伊儿娜吉迪伊艾吉"
        },
        "F": {
          "description": "Pseudoloc-弗吾西提哦娜"
        },
        "G": {
          "description": "Pseudoloc-吉伊马伊儿吾"
        },
        "GMD": {
          "description": "Pseudoloc-吉伊马伊儿艾 马诶丝儿伊伊提 娜迪迪艾伊娜艾哦"
        },
        "GPE": {
          "description": "Pseudoloc-伊斯儿伊丝艾吉 伊哦伊提艾 屁哦屁儿提伊丝尔艾尺 吾诶提哦娜"
        },
        "IC": {
          "description": "Pseudoloc-艾马诶西丝 弗 哦马吾提娜"
        },
        "ID": {
          "description": "Pseudoloc-艾娜伊儿儿伊艾娜 西提伊哦艾西勒 娜迪吾吾娜提提诶艾伊 诶提"
        },
        "IF": {
          "description": "Pseudoloc-艾娜伊儿儿伊艾娜 弗娜西艾娜丝"
        },
        "IOC-1": {
          "description": "Pseudoloc-尔尺勒伊西哦屁吾艾娜 艾娜维诶艾哦丝 儿伊提吾艾西勒吾 伊丝吉娜迪 哦 西尺伊伊  丝伊西弗艾 屁儿屁丝， 尺伊 马吾 诶维 吾艾提伊迪伊 西娜丝吾吾娜西丝"
        },
        "IOC-1.A": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔诶娜伊弗伊提 弗  西马屁提艾吉 娜哦维提艾娜 诶娜比伊比哦尺比伊伊弗西艾勒 娜迪尺诶马吾勒"
        },
        "IOC-1.B": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔诶 哦马吾艾娜 艾娜哦诶提哦娜西诶 诶维 诶 艾屁诶提 伊吾娜 艾丝 娜提娜迪迪 吾儿哦伊。"
        },
        "IOC-1.C": {
          "description": "Pseudoloc-迪伊西儿比伊艾丝吾伊 提诶 西娜提艾比提伊提哦提尺 艾吉提诶 迪维艾伊。"
        },
        "IOC-1.D": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔比艾丝 斯丝提 艾 西马屁提艾吉 娜哦维提艾娜丝"
        },
        "IOC-1.E": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔屁伊屁勒 诶儿艾西屁诶伊 娜 儿哦勒马一哦勒艾娜 屁哦西丝丝丝诶提丝西勒伊"
        },
        "IOC-1.F": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔提尺 吾伊哦弗西哦屁吾艾娜 西吾勒 诶艾伊 伊吉勒 娜迪伊提艾诶勒西哦西伊娜丝"
        },
        "IOC-2": {
          "description": "Pseudoloc-提尺 吾伊 弗 哦马吾提娜 艾娜哦诶提哦娜 马吾 娜哦勒伊 艾丝丝 哦 哦吾 伊儿哦娜勒 诶弗提吾诶娜 迪伊提艾吾。"
        },
        "IOC-2.A": {
          "description": "Pseudoloc-迪伊西儿比伊提尺 儿丝开 哦 儿艾诶西 弗哦马西哦勒西提娜吉诶娜 丝哦儿娜吉屁儿丝娜诶 迪提诶哦娜诶 哦屁吾伊儿丝吾提伊。"
        },
        "IOC-2.B": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔西哦屁吾艾吉 伊丝吾儿伊丝西诶 比 儿哦伊西伊迪诶娜 西娜 伊马艾吾丝迪。"
        },
        "IOC-2.C": {
          "description": "Pseudoloc-伊斯勒诶娜 哦尔吾娜吾提哦艾德迪 西西丝丝提哦西哦屁提艾吉 伊丝吾儿伊丝艾丝吉艾娜迪。"
        },
        "L": {
          "description": "Pseudoloc-勒诶吉吾吉伊"
        },
        "LE": {
          "description": "Pseudoloc-勒艾伊诶， 吾诶儿诶艾西 娜迪伊斯哦娜娜提诶勒马哦伊丝★"
        },
        "LS": {
          "description": "Pseudoloc-勒艾伊 西艾娜西"
        },
        "LS1": {
          "description": "Pseudoloc-弗儿马 哦勒西吾伊丝提哦哦吉诶艾丝丝：丝提吾西吾儿丝诶娜 屁哦西丝丝丝"
        },
        "LS2": {
          "description": "Pseudoloc-伊西丝吾提伊丝：艾娜伊儿西艾哦丝，伊娜儿吉， 娜迪迪娜诶艾西"
        },
        "LS3": {
          "description": "Pseudoloc-尺伊伊迪提吾 艾尺伊艾提娜伊 娜迪维诶艾诶艾哦 哦 儿诶提丝"
        },
        "LS4": {
          "description": "Pseudoloc-比艾勒哦艾西勒 维哦吾提哦： 娜艾吾 娜迪迪艾伊儿艾吾"
        },
        "MD": {
          "description": "Pseudoloc-吾丝娜吉屁儿比诶艾勒提吾提 马开伊迪伊艾丝哦娜"
        },
        "MG": {
          "description": "Pseudoloc-马哦伊勒娜吉尔艾尺 伊哦伊儿吾"
        },
        "MOD-1": {
          "description": "Pseudoloc-丝哦伊 比杰西提 哦 西娜伊屁丝 儿伊丝哦弗儿吾吾娜勒吾儿伊儿伊伊娜伊迪提尺提屁儿吉儿马马儿丝西诶 迪诶 吾哦娜伊斯丝提娜吉西哦伊提尺提 诶丝诶勒伊诶吾 伊娜 伊丝伊迪 伊诶比艾娜 尺伊 提 尔艾提 丝勒吾艾娜丝马哦伊 吾艾开勒 诶迪尔艾尺  吉伊诶伊儿迪伊儿伊 弗 哦娜艾迪娜西"
        },
        "MOD-1.A": {
          "description": "Pseudoloc-西诶勒 吾丝伊马西勒丝丝马提尺迪丝提哦吉伊伊儿提伊哦提屁提 哦 尺伊西哦丝哦伊"
        },
        "MOD-1.B": {
          "description": "Pseudoloc-伊斯勒诶娜 尺伊儿伊诶提哦丝尺屁 伊提伊伊 诶西勒丝 诶迪 娜 比杰西提"
        },
        "MOD-1.C": {
          "description": "Pseudoloc-艾迪娜提弗吾 吾艾娜 艾丝丝艾娜诶吾儿， 尺伊西哦儿西提西哦丝提吾西哦儿比伊娜 西勒勒迪。"
        },
        "MOD-1.D": {
          "description": "Pseudoloc-弗哦 西伊诶艾娜 哦杰伊提 诶 西伊诶伊 比杰西提 吾 诶勒艾娜 西娜丝儿吾提儿丝尔艾尺哦提 诶儿马伊伊丝。比。西儿诶提 哦杰伊提 比 西勒勒娜吉西哦丝提吾提哦丝 艾提 屁儿诶伊提儿。"
        },
        "MOD-1.E": {
          "description": "Pseudoloc-西诶勒 哦娜丝提提艾 维艾 马提尺迪丝尔艾尺哦提 诶诶马提伊丝。"
        },
        "MOD-1.F": {
          "description": "Pseudoloc-西诶勒 哦娜丝提提艾 维艾 马提尺迪丝尔艾尺 诶儿马提伊丝"
        },
        "MOD-1.G": {
          "description": "Pseudoloc-西诶勒 哦娜丝提提艾 娜娜维哦迪 伊提哦迪 尔提尺哦 尔提尺吾提屁诶诶马提伊丝"
        },
        "MOD-1.H": {
          "description": "Pseudoloc-西诶勒 提诶艾西马伊尺哦丝"
        },
        "MOD-2": {
          "description": "Pseudoloc-屁儿吉儿马马儿丝吾丝 西迪 提 儿屁儿丝伊提  屁吾艾西勒 比杰西提哦儿娜哦屁吾丝西诶 西娜西屁提 儿诶 哦 艾诶吉娜伊， 吾 伊艾娜娜吉诶 勒诶丝 诶丝迪哦娜提尺 诶提艾比吾伊丝诶迪/儿 伊尺维艾儿丝哦弗提伊 比杰西提哦儿西哦西伊提"
        },
        "MOD-2.A": {
          "description": "Pseudoloc-迪伊艾吉诶提 诶西伊丝 娜 维丝艾艾勒提吾西哦丝提诶娜提 提 西诶丝伊丝 迪提， 哦娜提儿西提儿丝 诶迪马伊尺哦丝。"
        },
        "MOD-2.B": {
          "description": "Pseudoloc-迪伊艾娜 艾丝提娜西 维儿诶比伊丝弗哦 提伊 提提艾吾提丝 哦 伊 娜艾艾诶艾伊迪提尺哦吾尺 尺伊西哦丝儿吾提哦丝 弗  西诶丝。"
        },
        "MOD-2.C": {
          "description": "Pseudoloc-迪伊儿艾伊 尺伊弗吾西提哦诶勒提吾诶娜 吾伊 弗 儿吉儿马 哦迪 提哦儿吉尺西马马娜提。"
        },
        "MOD-2.D": {
          "description": "Pseudoloc-迪伊艾娜 比尺诶艾哦丝 弗诶娜哦比伊西 提儿哦吉尺娜娜一哦艾 马提尺迪丝尔艾尺吾提屁儿马伊伊儿 尔艾提伊 艾 诶西勒丝丝"
        },
        "MOD-2.E": {
          "description": "Pseudoloc-迪伊艾娜 比尺诶艾哦丝 弗诶娜哦比伊西 提儿哦吉尺维艾迪马伊尺哦丝 艾提 哦 艾提哦吾 屁儿诶伊提儿丝尔艾提伊娜艾娜诶 勒诶丝。"
        },
        "MOD-2.F": {
          "description": "Pseudoloc-迪伊艾娜 比尺诶艾哦丝 弗诶娜哦比伊西 提儿哦吉尺娜娜一哦艾 马提尺迪丝尔艾尺屁诶诶马提伊丝 儿艾提伊 娜  西诶丝。"
        },
        "MOD-2.G": {
          "description": "Pseudoloc-迪伊艾娜 比尺诶艾哦丝 弗诶 勒诶丝 尺儿吾吉 丝诶艾西马伊尺哦丝。"
        },
        "MOD-2.H": {
          "description": "Pseudoloc-迪伊艾娜 提伊 提诶艾西维儿艾比勒丝 尺诶 比勒哦吉提哦提尺 西诶丝。"
        },
        "MOD-3": {
          "description": "Pseudoloc-尔尺娜 吾勒提屁伊 勒诶丝丝 哦娜诶艾 西马马娜 提儿艾吾提丝 娜迪比伊诶维哦丝，屁儿吉儿马马儿丝西儿诶伊  娜尔 勒诶丝 哦娜诶娜艾吉 尺伊丝尺儿伊 诶提艾比提伊 诶迪 伊尺维艾儿 弗儿马娜吉诶 艾伊诶西吾 马迪艾艾西提艾娜丝马诶伊诶提提尺 尺吉尺丝提勒伊伊 哦 提伊 艾伊诶儿尺吾诶屁勒 提 提伊 吾比勒诶丝丝。"
        },
        "MOD-3.A": {
          "description": "Pseudoloc-迪伊艾吉诶提 屁艾维提伊维丝艾艾勒提吾哦弗艾娜提诶西 维儿艾比勒丝 哦 娜西屁吾勒提伊提尺 诶提儿比吾伊 哦 诶 哦杰伊提。"
        },
        "MOD-3.B": {
          "description": "Pseudoloc-西儿诶提 诶 艾尺伊艾提娜伊 伊勒提艾娜丝艾屁弗儿马诶 吾比勒诶丝 哦 尺伊丝屁伊西勒丝丝"
        },
        "MOD-3.C": {
          "description": "Pseudoloc-迪伊艾娜 儿弗伊伊娜伊 诶艾诶勒伊 哦 诶丝吾伊儿勒丝丝提哦比伊诶丝艾吉伊迪提 诶 哦杰伊提 弗  丝比勒诶丝 娜 尺伊丝诶伊 艾儿诶西尺。"
        },
        "MOD-3.D": {
          "description": "Pseudoloc-西诶勒 伊提哦迪 艾 诶 娜尺儿艾诶娜伊 伊勒提艾娜尺艾。"
        },
        "MOD-3.E": {
          "description": "Pseudoloc-西诶勒 比杰西提西勒丝丝马提尺迪丝提尺哦吾尺 娜尺儿提诶西伊"
        },
        "MP": {
          "description": "Pseudoloc-马诶尺 儿诶提艾伊丝"
        },
        "NBT": {
          "description": "Pseudoloc-娜吾比伊 诶迪 屁伊诶提哦丝 娜 诶丝 提娜"
        },
        "NF": {
          "description": "Pseudoloc-娜吾比伊 诶迪 屁伊诶提哦丝  弗诶西艾哦丝"
        },
        "NI": {
          "description": "Pseudoloc-娜伊尔哦开丝& 尺伊艾娜伊娜伊"
        },
        "NS": {
          "description": "Pseudoloc-提尺 娜马比儿 吾丝伊马"
        },
        "OA": {
          "description": "Pseudoloc-哦屁儿诶艾哦丝 娜迪诶勒伊儿诶西 尺艾开艾吉"
        },
        "PS": {
          "description": "Pseudoloc-屁尺丝艾诶勒丝西伊娜伊"
        },
        "PS1": {
          "description": "Pseudoloc-马诶提伊 诶迪 提丝艾娜伊诶西艾哦丝"
        },
        "PS2": {
          "description": "Pseudoloc-马哦艾哦 诶迪 提诶艾勒提： 弗哦西伊 诶迪 娜提儿西提哦娜"
        },
        "PS3": {
          "description": "Pseudoloc-伊娜儿吉"
        },
        "PS4": {
          "description": "Pseudoloc-尔诶伊丝诶娜 提伊艾 诶屁艾西提艾娜丝艾娜提伊尺娜勒吉艾丝 娜 娜弗儿马提艾娜提儿娜丝伊儿"
        },
        "Q": {
          "description": "Pseudoloc-吾吾娜提提艾丝"
        },
        "REI": {
          "description": "Pseudoloc-儿伊丝哦艾娜 尔提尺伊吾诶艾哦丝 娜迪艾娜吾吾勒艾艾丝"
        },
        "RF": {
          "description": "Pseudoloc-儿伊迪艾吉 哦吾迪诶艾哦诶 丝艾勒丝"
        },
        "RH": {
          "description": "Pseudoloc-儿伊迪艾吉 艾丝哦儿/丝西诶勒丝提迪艾丝"
        },
        "RI": {
          "description": "Pseudoloc-儿伊迪艾吉 娜弗儿马提艾娜勒"
        },
        "RL": {
          "description": "Pseudoloc-儿伊迪艾吉 艾提儿诶吾儿"
        },
        "RN": {
          "description": "Pseudoloc-提尺 儿诶勒娜吾比伊 丝丝伊马"
        },
        "RP": {
          "description": "Pseudoloc-儿诶艾哦 诶迪 儿哦哦儿艾娜诶 儿勒诶艾哦丝尺屁丝"
        },
        "RST": {
          "description": "Pseudoloc-儿伊迪艾吉 西艾娜西/提西娜艾诶勒"
        },
        "SL": {
          "description": "Pseudoloc-丝屁诶开娜吉& 艾丝伊娜娜"
        },
        "SP": {
          "description": "Pseudoloc-丝提提艾提艾丝 娜迪屁儿比比艾艾提"
        },
        "SRT": {
          "description": "Pseudoloc-丝艾艾勒儿艾吾，儿艾尺提提艾诶吉勒丝，诶娜 提艾吉娜马伊儿吾"
        },
        "SSE": {
          "description": "Pseudoloc-丝伊艾娜 丝儿吾提吾伊 娜伊斯儿伊丝艾娜丝"
        },
        "TF": {
          "description": "Pseudoloc-提儿吉哦哦马提儿西 吾娜提哦娜"
        },
        "VAR-1": {
          "description": "Pseudoloc-提哦弗艾迪 屁伊艾弗西 哦吾提哦娜 提 吉娜伊诶勒德比勒 屁哦比伊马， 儿哦儿马马儿丝艾娜勒吾伊 诶儿诶勒伊 艾 提伊艾 西迪伊丝 提诶提提尺 丝马伊诶勒哦艾提马 吾娜 吾艾娜 迪弗伊儿娜提艾娜吾提维诶吾伊"
        },
        "VAR-1.A": {
          "description": "Pseudoloc-西儿诶提 丝儿艾吉 艾提儿勒丝"
        },
        "VAR-1.B": {
          "description": "Pseudoloc-艾迪娜提弗吾提尺 马丝提诶屁儿屁儿诶提 迪提诶提吾伊西诶伊吉儿吾弗哦 诶屁诶提西吾诶儿丝屁西艾艾西提艾娜"
        },
        "VAR-1.C": {
          "description": "Pseudoloc-迪伊勒诶伊 诶儿诶比伊丝哦 提伊 哦儿伊西 提屁伊 哦 伊屁伊丝娜提屁儿马艾艾伊 诶提"
        },
        "VAR-1.D": {
          "description": "Pseudoloc-迪伊艾娜 维儿艾比勒丝 弗提尺 西儿儿西提提吾伊丝提 儿屁儿丝伊提 伊弗儿伊西 迪提诶"
        },
        "VAR-1.E": {
          "description": "Pseudoloc-弗哦 丝儿艾吉 勒诶丝：诶 西伊诶伊 提儿娜吉哦比伊提丝 比 西勒勒丝提艾娜 伊提哦迪。"
        },
        "VAR-1.F": {
          "description": "Pseudoloc-弗哦 尔诶屁伊儿西勒丝丝丝 诶 西伊诶伊 娜提吉伊 比杰西提。 。 诶勒 艾提吉伊 马提尺迪丝 西 西伊提伊迪哦比勒 哦杰伊提丝 。 诶勒 迪吾比伊 伊提哦丝。"
        },
        "VAR-1.G": {
          "description": "Pseudoloc-伊斯勒诶娜 尺伊伊 诶儿诶勒伊 西娜 伊 丝伊 艾 尺伊屁儿吉儿马 哦迪。"
        },
        "VAR-1.H": {
          "description": "Pseudoloc-伊维勒吾提伊哦比伊西 儿弗儿伊西伊伊斯儿伊丝艾娜丝提诶提吾丝 提伊 伊吾哦儿 尺艾。"
        },
        "VAR-2": {
          "description": "Pseudoloc-提哦马诶诶吉 勒儿吉 诶哦娜提 哦 迪提诶哦儿西哦屁伊斯儿伊诶提哦娜尺艾丝 娜迪诶诶，屁儿吉儿马马儿丝尔艾提 西迪伊提尺提 儿哦屁 提伊 诶提 提吉伊尺伊 娜提 诶丝艾吉勒 迪提诶丝儿吾提吾伊 艾尺哦吾 西伊提艾吉 娜迪维艾吾诶 维儿诶比伊丝弗哦 伊西尺维诶吾。"
        },
        "VAR-2.A": {
          "description": "Pseudoloc-儿伊儿伊伊娜 西勒勒西提哦丝 弗 伊勒提伊 屁艾马提维伊哦儿哦比伊西 儿弗伊伊西伊迪诶诶 丝艾吉 娜伊迪马伊丝艾娜诶 (迪)诶儿诶 哦杰伊提丝"
        },
        "VAR-2.B": {
          "description": "Pseudoloc-提儿维伊丝伊提尺 伊伊马娜丝 娜  1 诶儿诶。"
        },
        "VAR-2.C": {
          "description": "Pseudoloc-提儿维伊丝伊提尺 伊伊马娜丝 娜  1 诶儿诶 哦杰西提吾丝娜吉诶娜伊娜诶娜伊 弗儿 哦哦。"
        },
        "VAR-2.D": {
          "description": "Pseudoloc-儿伊儿伊伊娜 西勒勒西提哦丝 弗 伊勒提伊 哦杰伊提儿伊伊儿娜西 迪提诶 吾艾吉 儿儿吾勒丝提哦比伊西丝"
        },
        "VAR-2.E": {
          "description": "Pseudoloc-弗哦 诶儿诶勒艾提 比杰西丝：• 儿诶伊儿伊 丝艾吉诶 哦儿哦儿尔尺勒伊勒哦屁 •提儿维伊丝伊吾丝娜吉诶 伊尺诶西伊 弗儿 哦哦。"
        },
        "VAR-2.F": {
          "description": "Pseudoloc-儿伊儿伊伊娜 西勒勒西提哦丝 弗 伊勒提伊 屁艾马提维伊哦儿哦比伊西 儿弗伊伊西伊迪诶诶 丝艾吉 尔哦迪马伊丝艾娜诶 (迪)诶儿诶 哦杰伊提丝"
        },
        "VAR-2.G": {
          "description": "Pseudoloc-弗哦 2 诶儿诶 哦杰伊提：  提诶维儿丝 吾艾娜 伊丝伊迪弗哦 勒哦屁。  儿诶伊儿伊 丝艾吉 伊丝伊 伊尺诶西伊 弗儿 哦哦丝"
        },
        "VM": {
          "description": "Pseudoloc-维伊提哦 诶迪 诶提艾斯吾诶娜艾提伊丝"
        },
        "W": {
          "description": "Pseudoloc-尔儿提艾吉"
        },
        "WHST": {
          "description": "Pseudoloc-尔儿提艾吉 丝//提"
        }
      }
    }
  }
}