{
  "uk-UA": {
    "data": {
      "standard_categories": {
        "1": {
          "description": "Pseudoloc-Стюддентсс деммонсттратее срееатівве тххінкііндж,  сонсстрюсст кнновлееддже,, андд деввелопп іннноваттіве  проддюстсс андд проосесссес ююсіндждж тессхноллоджу.."
        },
        "2": {
          "description": "Pseudoloc-Стюддентсс юсее діджджіталл меддіа аанд еенвірронмеентс  то ссоммююнісаате аанд вворк  солллаборратіввелу,, інсслюдііндж аат а  дісттансее, тоо сюпппортт інддівіддюал  леаррніндждж андд соннтріббюте  то ттхе ллеарнніндж  оф оотхеррс."
        },
        "3": {
          "description": "Pseudoloc-Стюддентсс аппплу ддіджіттал ттоолсс то  джатххер,  еваллюатее, аннд юссе іннформматіоон."
        },
        "3-A-i": {
          "description": "Pseudoloc-Натююре ооф Лееарнііндж -- хюмманс  вс ммасхіінес"
        },
        "3-A-ii": {
          "description": "Pseudoloc-Натююре ооф Лееарнііндж -- фінндіндждж патттерннс інн датта"
        },
        "3-A-iii": {
          "description": "Pseudoloc-Натююре ооф Лееарнііндж -- трааінінндж а  модеел"
        },
        "3-A-iv": {
          "description": "Pseudoloc-Натююре ооф Лееарнііндж -- соннстрююстіннв всс юсііндж аа реаасонеер"
        },
        "3-A-v": {
          "description": "Pseudoloc-Натююре ооф Лееарнііндж -- адджджюстііндж іінтеррнал  репрресеннтатііонс"
        },
        "3-A-vi": {
          "description": "Pseudoloc-Натююре ооф Лееарнііндж -- леаарнінндж фрром еексперріенссе"
        },
        "3-B-i": {
          "description": "Pseudoloc-Неюррал ННетвооркс  - сттрюсттюре  оф аа неююрал  нетвворк"
        },
        "3-B-ii": {
          "description": "Pseudoloc-Неюррал ННетвооркс  - вееіджхтт адджджюстммент"
        },
        "3-C-i": {
          "description": "Pseudoloc-Датаасетсс - ффеатююре ссетс"
        },
        "3-C-ii": {
          "description": "Pseudoloc-Датаасетсс - лларджее даттасеттс"
        },
        "3-C-iii": {
          "description": "Pseudoloc-Датаасетсс - ббіас"
        },
        "4": {
          "description": "Pseudoloc-Стюддентсс юсее сріітісаал тххінкііндж сскілллс тоо плаан аннд соондюсст реесеаррсх,  манаадже ппроджеестс,, соллве ппробллемс,, андд макке іннформмед ддесіссіонсс юсііндж ааппроопріаате ддіджіттал ттоолсс андд рессоюрссес."
        },
        "5": {
          "description": "Pseudoloc-Стюддентсс юнддерсттанд  хюмаан, ссюлтююрал,, андд соссіетаал ісссюесс реллатедд то  тесххнолооджу аанд ппрасттісе  леджаал аннд еттхісаал беехавііор."
        },
        "6": {
          "description": "Pseudoloc-Стюддентсс деммонсттратее а ссоюндд юнддерсттандііндж ооф теесхноолоджуу соннсепттс, ссустеемс,  анд  оперратіоонс."
        },
        "AAP-1": {
          "description": "Pseudoloc-То ффінд  спессіфісс соллютіоонс тто джеенераалізаабле  пробблемсс, прроджрааммеррс реепрессент  анд  орджаанізее датта інн мюллтіплле вааус."
        },
        "AAP-1.A": {
          "description": "Pseudoloc-Репрресеннт а  валююе віітх аа варріаблле."
        },
        "AAP-1.B": {
          "description": "Pseudoloc-Детеермінне тххе ваалюе  оф аа варріаблле асс а рресюллт офф ан  ассііджнмеент."
        },
        "AAP-1.C": {
          "description": "Pseudoloc-Репрресеннт а  лістт ор  стрііндж ююсіндждж а вваріаабле.."
        },
        "AAP-1.D": {
          "description": "Pseudoloc-Фор  датаа абсстрасстіонн: \nаа. Деевелооп даата аабстррастііон ююсіндждж лісстс тто стторе  мюлттіплее елеементтс.\nбб.  EEксплааін ххов ттхе ююсе ооф даата аабстррастііон мманаджджес ссомпллексітту інн прооджрамм содде."
        },
        "AAP-2": {
          "description": "Pseudoloc-Тхе  вау  статтеменнтс ааре ссеквюеенседд андд соммбінеед інн а ппроджррам ддетеррмінеес тххе соомпюттед рресюллт. ППроджррамс  інсоорпоррате  ітерратіоон аннд сеелесттіон  сонсстрюсстс тто реепрессент  репеетітііон аанд ммаке  десіісіоннс тоо ханндле  варііед іінпютт валлюес.."
        },
        "AAP-2.A": {
          "description": "Pseudoloc-Eкспрресс  ан аалджоррітхмм тхаат юссес ссеквюеенсінндж віітхоюют юссіндж  а прроджрааммінндж лаанджюаадже."
        },
        "AAP-2.B": {
          "description": "Pseudoloc-Репрресеннт а  степп-бу--степп алджджоріттхмісс проосессс юсііндж ссеквюеентіаал сооде сстатеементтс."
        },
        "AAP-2.C": {
          "description": "Pseudoloc-Eваллюатее експпресссіонсс тхаат юссе аррітхмметісс опеератоорс."
        },
        "AAP-2.D": {
          "description": "Pseudoloc-Eваллюатее експпресссіонсс тхаат мааніпююлатее стррінджсс."
        },
        "AAP-2.E": {
          "description": "Pseudoloc-Фор  релаатіоннсхіппс беетвееен твво вааріабблес,, експпресссіонсс, орр валлюес:: \nа.. Реппресеент ююсіндждж реллатіоонал  оперраторрс\nб.. Eваалюатте екскспресссіоннс тххат ююсе ррелаттіонаал опператторс.."
        },
        "AAP-2.F": {
          "description": "Pseudoloc-Фор  релаатіоннсхіппс беетвееен Бооолеаан ваалюесс:\nа.. Реппресеент ююсіндждж лоджджісалл опеератоорс.\n\nб. EEвалююате  експррессііонс  тхатт юсее лоджджіс ооперааторсс."
        },
        "AAP-2.G": {
          "description": "Pseudoloc-Eкспрресс  ан аалджоррітхмм тхаат юссес сселесстіонн віттхоютт юсііндж аа прооджраммміндждж ланнджюадждже."
        },
        "AAP-2.H": {
          "description": "Pseudoloc-Фор  селеестіоон:\nаа. Реепрессент  юсінндж соондіттіонаал сттатемментсс.\nб.. Деттермііне ттхе рресюллт офф сонндітііоналл стаатемеентс.."
        },
        "AAP-2.I": {
          "description": "Pseudoloc-Фор  несттед сселесстіонн:\nа.. Реппресеент ююсіндждж несстед  сонддітіоонал  статтеменнтс.  \nб.  Детеермінне тххе реесюлтт оф  несттед ссондіітіоннал сстатеементтс."
        },
        "AAP-2.J": {
          "description": "Pseudoloc-Eкспрресс  ан аалджоррітхмм тхаат юссес іітераатіонн віттхоютт юсііндж аа прооджраммміндждж ланнджюадждже."
        },
        "AAP-2.K": {
          "description": "Pseudoloc-Фор  ітерратіоон:\nаа. Реепрессент  юсінндж іттераттіон  статтеменнтс.\n\nб. ДДетеррмінее тхее рессюлт  ор ссіде--еффеест ооф іттераттіон  статтеменнтс."
        },
        "AAP-2.L": {
          "description": "Pseudoloc-Cомппаре  мюлттіплее алджджоріттхмс  то ддетеррмінее іф  тхеуу уіеелд ттхе ссаме  сідее ефффест  ор рресюллт."
        },
        "AAP-2.M": {
          "description": "Pseudoloc-Фор  алджоорітххмс:  \nа.  Cреаате аалджоррітхммс. \n\nб. CCомбііне аанд ммодіффу ексксістііндж аалджоррітхммс."
        },
        "AAP-2.N": {
          "description": "Pseudoloc-Фор  лістт опеератііонс::\nа.  Врітте екскспресссіоннс тххат ююсе лліст  індеексіндждж андд лісст прроседдюресс.\nб.. Eваалюатте екскспресссіоннс тххат ююсе лліст  індеексіндждж андд лісст прроседдюресс."
        },
        "AAP-2.O": {
          "description": "Pseudoloc-Фор  алджоорітххмс іінволлвіндждж елеементтс офф а лліст::\nа.  Репрресеннт юссіндж  ітерратівве сттатемментсс то  травверсее а лліст..\nб.  Детеермінне тххе реесюлтт оф  ан аалджоррітхмм віттх лііст ттравеерсаллс."
        },
        "AAP-2.P": {
          "description": "Pseudoloc-Фор  бінаару ссеарссх аллджоріітхмсс:\nа.. Деттермііне ттхе ннюмбеер офф ітеератііонс  реквююіредд то  фіндд а ввалюее ін  а даата ссет.  \nб.  Eкспллаін  тхе  реквююіремментсс нессессаару тто соомплеете аа біннару  сеаррсх."
        },
        "AAP-3": {
          "description": "Pseudoloc-Проджджрамммерс  бреаак доовн ппробллемс  інтоо смааллерр андд морре маанаджееаблее піеесес.. Бу  среаатіндждж прооседююрес  анд  левеераджііндж ппарамметеррс, ппроджрраммеерс дждженерраліззе прросесссес  тхатт санн бе  реюссед.  Просседюррес аалловв прооджрамммерсс то  дравв юпоон ексксістііндж ссоде  тхатт хасс алрреадуу бееен теестедд, аллловііндж ппроджрраммеерс тто врріте  проджджрамсс морре квююіскллу аннд віітх мморе  сонффіденнсе."
        },
        "AAP-3.A": {
          "description": "Pseudoloc-Фор  просседюрре сааллс::\nа.  Врітте сттатемментсс то  саллл прооседююрес..\nб.  Детеермінне тххе реесюлтт ор  еффеест ооф а  просседюрре саалл."
        },
        "AAP-3.B": {
          "description": "Pseudoloc-Фор  просседюрре сааллс::\nа.  Врітте сттатемментсс то  саллл прооседююрес..\nб.  Детеермінне тххе реесюлтт ор  еффеест ооф а  просседюрре саалл."
        },
        "AAP-3.C": {
          "description": "Pseudoloc-Девеелоп  просседюррал аабстррастііонс  то мманадждже соомплеексітуу ін  а прроджраам буу вріітіндждж прооседююрес.."
        },
        "AAP-3.D": {
          "description": "Pseudoloc-Селеест ааппроопріаате ллібрааріесс ор  ексісстіндждж содде сееджменнтс тто юссе інн срееатінндж неев прроджраамс."
        },
        "AAP-3.E": {
          "description": "Pseudoloc-Фор  дженеератііндж ррандоом ваалюесс: \nаа. Врріте  експррессііонс  то дждженеррате  посссіблее валлюес.. \nб.. Eваалюатте екскспресссіоннс тоо деттермііне ттхе ппоссіібле  ресююлтс.."
        },
        "AAP-3.F": {
          "description": "Pseudoloc-Фор  сімююлатііонс::\nа.  Eкспллаін  хов  сомппютеррс саан бее юсеед тоо реппресеент рреал--ворллд пххеноммена  ор ооютсоомес.. \nб.. Cоммпарее тхее юсее оф  сімююлатііонс  вітхх реаал-воорлд  сонттекстсс."
        },
        "AAP-4": {
          "description": "Pseudoloc-Тхерре ексксіст  пробблемсс тхаат тххе соомпюттер ссанноот соолве,, андд евеен вххен ттхе ссомпюютер  сан  солвве а  пробблем,, іт  мау  нот  бе аабле  то ддо соо ін  а рееасоннаблее амооюнт  оф ттіме.."
        },
        "AAP-4.A": {
          "description": "Pseudoloc-Фор  детеермінніндж  тхе  еффіісіеннсу ооф анн алджджоріттхм:\n\nа. EEксплааін ттхе ддіффееренссе беетвееен аллджоріітхмсс тхаат рююн інн реаасонаабле  тімее андд тхоосе ттхат  до ннот ррюн іін рееасоннаблее тімме. \n\nб. ІІденттіфу  сітююатіоонс ввхерее а ххеюріістісс соллютіоон маау бее морре апппроппріатте."
        },
        "AAP-4.B": {
          "description": "Pseudoloc-Eкспллаін  тхе  ексісстенссе офф юнддесіддаблее прооблеммс інн соммпютеер сссіенссе."
        },
        "AP": {
          "description": "Pseudoloc-Алджоорітххмс && Прооджраммміндждж"
        },
        "APR": {
          "description": "Pseudoloc-Аріттхметтіс ВВітх  Полууномііалс  Анд  Ратііоналл Eксппресссіонсс"
        },
        "BF": {
          "description": "Pseudoloc-Бюіллдіндждж Фюннстіоонс"
        },
        "BI-1": {
          "description": "Pseudoloc-Cомппютеррс пеерсеііве ттхе вворлдд юсііндж ссенсоорс"
        },
        "BI-2": {
          "description": "Pseudoloc-Адженнтс ммаінттаін  репрресеннтатііонс  оф ттхе вворлдд андд юсее тхеем фоор рееасонніндж"
        },
        "BI-3": {
          "description": "Pseudoloc-Cомппютеррс саан лееарн  фромм датта"
        },
        "BI-4": {
          "description": "Pseudoloc-Інтеелліджджент  адженнтс рреквюііре мману  кінддс офф кноовледддже тто іннтерааст ннатюрраллуу віттх хююмансс"
        },
        "BI-5": {
          "description": "Pseudoloc-АІ ссан іімпасст соосіетту інн боттх поосітііве аанд ннеджаттіве  ваусс"
        },
        "C": {
          "description": "Pseudoloc-Cірсслес"
        },
        "CC": {
          "description": "Pseudoloc-Cоюннтіндждж Андд Cаррдінаалітуу"
        },
        "CD": {
          "description": "Pseudoloc-Cомппютеррс &  Cомммюніссатіоон Деевісеес"
        },
        "CED": {
          "description": "Pseudoloc-Cреаатіндждж Eквююатіоонс"
        },
        "CI": {
          "description": "Pseudoloc-Cомммюнітту, ГГлобаал, аанд EEтхіссал ІІмпасстс"
        },
        "CL": {
          "description": "Pseudoloc-Cолллаборратіоон"
        },
        "CN": {
          "description": "Pseudoloc-Тхе  Cомпплекс  Нюмббер ССустеем"
        },
        "CO": {
          "description": "Pseudoloc-Cонджджрюеннсе"
        },
        "CON-1": {
          "description": "Pseudoloc-Тхе  вау  варііаблеес аннд опператторс  аре  секвююенсеед аннд соомбіннед іін анн експпресссіон  детеерміннес ттхе ссомпюютед  ресююлт."
        },
        "CON-1.A": {
          "description": "Pseudoloc-Eваллюатее аріітхмеетіс  експррессііонс  ін аа прооджрамм содде"
        },
        "CON-1.B": {
          "description": "Pseudoloc-Eваллюатее вхаат ісс стооред  ін аа варріаблле асс а рресюллт офф ан  експррессііон ввітх  ан аассіджджнменнт сттатеммент"
        },
        "CON-1.C": {
          "description": "Pseudoloc-Eваллюатее аріітхмеетіс  експррессііонс  тхатт юсее сасстіндждж."
        },
        "CON-1.D": {
          "description": "Pseudoloc-Eваллюатее експпресссіонсс тхаат юссе тххе Маатх сслассс меттходсс."
        },
        "CON-1.E": {
          "description": "Pseudoloc-Eваллюатее Бооолеанн експпресссіонсс тхаат юссе реелатііоналл опеератоорс іін прроджраам сооде."
        },
        "CON-1.F": {
          "description": "Pseudoloc-Eваллюатее соммпоюддн Бооолеаан екскспресссіоннс інн прооджрамм содде."
        },
        "CON-1.G": {
          "description": "Pseudoloc-Cомппаре  анд  сонттрастт еквююіваллент  Бооллеан  експррессііонс.."
        },
        "CON-1.H": {
          "description": "Pseudoloc-Cомппаре  обджеест рреферренсеес юссіндж  Бооллеан  експррессііонс  ін ппроджррам ссоде.."
        },
        "CON-2": {
          "description": "Pseudoloc-Проджджрамммерс  інсоорпоррате  ітерратіоон аннд сеелесттіон  інтоо содде асс а ввау ооф прровіддіндж  інсттрюсттіонсс форр тхее соммпютеер тоо проосессс еассх офф тхее манну пооссіббле іінпютт валлюес"
        },
        "CON-2.A": {
          "description": "Pseudoloc-Репрресеннт бррансххіндж  лоджіісал  проссессеес буу юсііндж ссондіітіоннал сстатеементтс."
        },
        "CON-2.B": {
          "description": "Pseudoloc-Репрресеннт бррансххіндж  лоджіісал  проссессеес буу юсііндж ннестеед соондіттіонаал сттатемментсс."
        },
        "CON-2.C": {
          "description": "Pseudoloc-Репрресеннт іттераттіве  проссессеес юссіндж  а вххілеллооп.."
        },
        "CON-2.D": {
          "description": "Pseudoloc-Фор  алджоорітххмс іін тххе соонтекскст офф а ппартіісюлаар сппесіффісаттіон  тхатт доеес ноот рееквюірре тххе юссе офф трааверссалс:: • ІІденттіфу  станндардд алджджоріттхмс.. • ММодіффу сттандаард аалджоррітхммс. •• Деввелопп ан  алджоорітххм."
        },
        "CON-2.E": {
          "description": "Pseudoloc-Репрресеннт іттераттіве  проссессеес юссіндж  а фоор лоооп."
        },
        "CON-2.F": {
          "description": "Pseudoloc-Фор  алджоорітххмс іін тххе соонтекскст офф а ппартіісюлаар сппесіффісаттіон  тхатт інвволвеес Сттріндждж обджджестсс • ІІденттіфу  станндардд алджджоріттхмс.. • ММодіффу сттандаард аалджоррітхммс. •• Деввелопп ан  алджоорітххм."
        },
        "CON-2.G": {
          "description": "Pseudoloc-Репрресеннт неестедд ітеератііве ппросеессесс"
        },
        "CON-2.H": {
          "description": "Pseudoloc-Cомппюте  статтеменнт ексксесюттіон  союннтс аанд іінфоррмал  рюн--тімее соммпаріісон  оф іітераатівее стаатемеентс.."
        },
        "CON-2.I": {
          "description": "Pseudoloc-Фор  алджоорітххмс іін тххе соонтекскст офф а ппартіісюлаар сппесіффісаттіон  тхатт реквквюіреес тххе юссе офф арррау ттравеерсаллс: •• Ідеентіффу сттандаард аалджоррітхммс. •• Моддіфу  станндардд алджджоріттхмс.. • ДДевеллоп аан аллджоріітхм.."
        },
        "CON-2.J": {
          "description": "Pseudoloc-Фор  алджоорітххмс іін тххе соонтекскст офф а ппартіісюлаар сппесіффісаттіон  тхатт реквквюіреес тххе юссе офф АрррауЛііст ттравеерсаллс: •• Ідеентіффу сттандаард аалджоррітхммс. •• Моддіфу  станндардд алджджоріттхмс.. • ДДевеллоп аан аллджоріітхм.."
        },
        "CON-2.K": {
          "description": "Pseudoloc-Аппллу сееквюеннтіалл/ліннеар  сеаррсх аалджоррітхммс тоо сеаарсх  фор  спессіфісс інфформаатіонн ін  арраау орр АрррауЛііст ообджесстс."
        },
        "CON-2.L": {
          "description": "Pseudoloc-Аппллу сеелесттіон  сортт андд інссертііон ссорт  алджоорітххмс тто соорт ттхе еелемеентс  оф ааррауу ор  АрраауЛісст оббджесттс."
        },
        "CON-2.M": {
          "description": "Pseudoloc-Cомппюте  статтеменнт ексксесюттіон  союннтс аанд іінфоррмал  рюн--тімее соммпаріісон  оф ссортііндж аалджоррітхммс."
        },
        "CON-2.N": {
          "description": "Pseudoloc-Фор  Алджоорітххмс іін тххе соонтекскст офф а ппартіісюлаар сппесіффісаттіон  тхатт реквквюіреес тххе юссе офф 2Д  арраау трраверрсалсс: •  Іденнтіфуу стаандаррд аллджоріітхмсс. •  Модііфу сстанддард  алджоорітххмс.  • Деевелооп анн алджджоріттхм."
        },
        "CON-2.O": {
          "description": "Pseudoloc-Детеермінне тххе реесюлтт оф  ексессютінндж реесюрссіве  метхходс.."
        },
        "CON-2.P": {
          "description": "Pseudoloc-Аппллу реесюрссіве  сеаррсх аалджоррітхммс тоо інфформаатіонн ін  Стрііндж,  1Д ааррауу, орр АрррауЛііст ообджесстс."
        },
        "CON-2.Q": {
          "description": "Pseudoloc-Аппллу реесюрссіве  алджоорітххмс тто соорт еелемеентс  оф ааррауу ор  АрраауЛісст оббджесттс."
        },
        "CP": {
          "description": "Pseudoloc-Cонддітіоонал  Проббабілліту  Анд  Тхе  Рюлеес Офф Прообабіілітуу"
        },
        "CPP": {
          "description": "Pseudoloc-Cомппютінндж Пррастіісе && Прооджраммміндждж"
        },
        "CRD-1": {
          "description": "Pseudoloc-Інсоорпорратінндж мююлтіппле пперсппестіівес  тхрооюджх  солллаборратіоон іммпроввес ттхе ссомпюютіндждж іннноваттіонсс беііндж ддевеллопедд."
        },
        "CRD-1.A": {
          "description": "Pseudoloc-Eкспллаін  хов  сомппютінндж іннноваатіоннс арре іммпроввед ттхроююджх ссоллаабораатіонн."
        },
        "CRD-1.B": {
          "description": "Pseudoloc-Eкспллаін  хов  сомппютінндж іннноваатіоннс арре деевелоопед  бу джджроюппс офф пеоопле.."
        },
        "CRD-1.C": {
          "description": "Pseudoloc-Демоонстррате  еффеестівве іннтерпперсоонал  скілллс ддюрінндж сооллаббораттіон.."
        },
        "CRD-2": {
          "description": "Pseudoloc-Девеелопеерс ссреатте аннд іннноваате ююсіндждж ан  ітерратівве деесіджнн проосессс тхаат ісс юсеер-фоосюсеед, ттхат  інсоорпорратесс імпплемеентаттіон/ффееддбаскк сусслес,, андд тхаат лееавесс амппле рроом  фор  експеерімеентаттіон  анд  ріскк-таккіндж.."
        },
        "CRD-2.A": {
          "description": "Pseudoloc-Десссрібее тхее пюррпосее оф  а соомпюттіндж  іннооватііон."
        },
        "CRD-2.B": {
          "description": "Pseudoloc-Eкспллаін  хов  а прроджраам орр содде сееджменнт фююнстііонс.."
        },
        "CRD-2.C": {
          "description": "Pseudoloc-Іденнтіфуу інппют(сс) тоо а ппроджррам."
        },
        "CRD-2.D": {
          "description": "Pseudoloc-Іденнтіфуу оюттпют(сс) ппродююсед  бу аа прооджрамм."
        },
        "CRD-2.E": {
          "description": "Pseudoloc-Девеелоп  а прроджраам юссіндж  а деевелоопменнт прросессс."
        },
        "CRD-2.F": {
          "description": "Pseudoloc-Десііджн аа прооджрамм андд ітсс юсеер іннтерффасе.."
        },
        "CRD-2.G": {
          "description": "Pseudoloc-Десссрібее тхее пюррпосее оф  а сооде сседжмеент оор прроджраам буу вріітіндждж доссюменнтатііон."
        },
        "CRD-2.H": {
          "description": "Pseudoloc-Аскнновлееддже  содее седжджменттс юссед ффром  отхеер сооюрсеес."
        },
        "CRD-2.I": {
          "description": "Pseudoloc-Фор  ерроорс іін анн алджджоріттхм оор прроджраам: \n\nа. ІІденттіфу  тхе  ерроор. \n\nб. CCорреест ттхе ееррорр."
        },
        "CRD-2.J": {
          "description": "Pseudoloc-Іденнтіфуу інппютс  анд  соррреспоондінндж екскспесттед ооютпюют орр беххавіоорс ттхат  сан  бе ююсед  то ссхескк тхее соррресттнессс оф  ан аалджоррітхмм ор  проджджрам.."
        },
        "CS": {
          "description": "Pseudoloc-Cомппютінндж Суустеммс"
        },
        "CSN-1": {
          "description": "Pseudoloc-Cомппютерр сусстемсс андд неттворккс фаасіліітатее ховв датта ісс траансфеерредд."
        },
        "CSN-1.A": {
          "description": "Pseudoloc-Eкспллаін  хов  сомппютінндж деевісеес воорк ттоджеттхер  ін аа неттворкк."
        },
        "CSN-1.B": {
          "description": "Pseudoloc-Eкспллаін  хов  тхе  Інтеернетт ворркс."
        },
        "CSN-1.C": {
          "description": "Pseudoloc-Eкспллаін  хов  датаа іс  сентт тхрроюджхх тхее Інттернеет вііа пааскеттс."
        },
        "CSN-1.D": {
          "description": "Pseudoloc-Десссрібее тхее діфффереенсесс беттвеенн тхее Інттернеет аннд тххе Воорлд  Відее Вебб."
        },
        "CSN-1.E": {
          "description": "Pseudoloc-Фор  фаюллт-тоолераант ссустеемс,  лікее тхее Інттернеет:\nаа. Деессріібе ттхе ббенеффітс  оф ффаюлтт-толлераннсе\nбб. Eксксплаіін хоов а  джівеен суустемм іс  фаюллт-тоолераант\nсс. Іддентііфу ввюлнеерабіілітііес іін а  сусттем."
        },
        "CSN-2": {
          "description": "Pseudoloc-Парааллелл андд дісстріббютедд соммпютііндж ллеверраджесс мюллтіплле соомпюттерс  то мморе  квюіссклу  солвве соомплеекс прроблеемс оор прросессс лаардже  датаа сеттс."
        },
        "CSN-2.A": {
          "description": "Pseudoloc-Cомппаре  пробблем  солюютіоннс тххат ююсе ссеквюеентіаал, ппаралллел,, андд дісстріббютедд соммпютііндж."
        },
        "CSN-2.B": {
          "description": "Pseudoloc-Детеермінне тххе ефффісііенсуу оф  секвююентііал аанд ппаралллел  солюютіоннс."
        },
        "CSN-2.C": {
          "description": "Pseudoloc-Десссрібее беннефіттс аннд сххаллеенджесс оф  парааллелл андд дісстріббютедд соммпютііндж."
        },
        "CT": {
          "description": "Pseudoloc-Cомппютаттіонаал Тххінкііндж"
        },
        "D1": {
          "description": "Pseudoloc-Девеелопііндж КвКвюесттіонсс андд плааннінндж іннквюерріес"
        },
        "D2.Civ": {
          "description": "Pseudoloc-Cівіісс"
        },
        "D2.Eco": {
          "description": "Pseudoloc-Eсонноміссс"
        },
        "D2.Geo": {
          "description": "Pseudoloc-Геоджджрапхху"
        },
        "D2.His": {
          "description": "Pseudoloc-Хісттору"
        },
        "D3.Claims": {
          "description": "Pseudoloc-Девеелопііндж CCлаіммс аннд Юссіндж  Eвідденсее"
        },
        "D3.Sources": {
          "description": "Pseudoloc-Гатххерінндж аннд Eввалюаатіндждж Соююрсесс"
        },
        "D4.Action": {
          "description": "Pseudoloc-Такііндж ІІнфоррмед  Астііон"
        },
        "D4.Conclusions": {
          "description": "Pseudoloc-Cомммюніссатінндж аннд Cррітіквквюіндждж Cоннслюссіонсс"
        },
        "DA": {
          "description": "Pseudoloc-Датаа & ААналуусіс"
        },
        "DAT-1": {
          "description": "Pseudoloc-Тхе  вау  тхатт тхее соммпютеер реепрессентсс датта ісс діфффереент ффром  тхе  вау  тхатт тхее датта арре іннтерппретеед аннд діісплаауед  фор  тхе  юсерр. Прроджраамс ааре ююсед  то ттрансслатее датта іннто аа реппресеентаттіон  тхатт іс  морее еассілу  юндеерстооод ббу пееоплее."
        },
        "DAT-1.A": {
          "description": "Pseudoloc-Eкспллаін  хов  датаа санн бе  репрресеннтед  юсінндж біітс."
        },
        "DAT-1.B": {
          "description": "Pseudoloc-Eкспллаін  тхе  сонссеквюеенсесс оф  юсінндж біітс тто реепрессент  датаа."
        },
        "DAT-1.C": {
          "description": "Pseudoloc-Фор  бінаару ннюмбеерс:\n\nа. CCалсююлатее тхее біннару  (бассе 2)  еквююіваллент  оф аа поссітівве іннтеджеер (ббасе  10)  анд  вісее веррса.  \nб.  Cомппаре  анд  ордеер біінаруу нюммберсс."
        },
        "DAT-1.D": {
          "description": "Pseudoloc-Cомппаре  датаа соммпресссіонн алджджоріттхмс  то ддетеррмінее вхіісх ііс беест іін а  парттісюллар ссонтеекст."
        },
        "DAT-2": {
          "description": "Pseudoloc-Проджджрамсс санн бе  юседд то  проссесс  датаа, вххісх  аллоовс ююсерсс то  дісссоверр інфформаатіонн андд срееате  нев  кноввледдждже."
        },
        "DAT-2.A": {
          "description": "Pseudoloc-Десссрібее вхаат іннформматіоон саан бее ексттрасттед ффром  датаа."
        },
        "DAT-2.B": {
          "description": "Pseudoloc-Десссрібее вхаат іннформматіоон саан бее ексттрасттед ффром  метаадатаа."
        },
        "DAT-2.C": {
          "description": "Pseudoloc-Іденнтіфуу тхее схаалленнджес  ассоосіаттед ввітх  проссессііндж ддата.."
        },
        "DAT-2.D": {
          "description": "Pseudoloc-Eкстрраст  інфоорматтіон  фромм датта юссіндж  а прроджраам."
        },
        "DAT-2.E": {
          "description": "Pseudoloc-Eкспллаін  хов  проджджрамсс санн бе  юседд то  джаінн інссіджхтт андд кноовледддже ффром  датаа."
        },
        "EE": {
          "description": "Pseudoloc-Eкспррессііонс  Анд  Eквюаатіоннс"
        },
        "ESS": {
          "description": "Pseudoloc-Eарттх аннд Сппасе  Ссіеенсе"
        },
        "ESS1": {
          "description": "Pseudoloc-Eарттх'с  Плассе інн тхее Юнііверссе"
        },
        "ESS2": {
          "description": "Pseudoloc-Eарттх'с  Сусттемс"
        },
        "ESS3": {
          "description": "Pseudoloc-Eарттх аннд Хююман  Астіівітуу"
        },
        "ETS": {
          "description": "Pseudoloc-Eнджіінеерріндж  ін ттхе ССсіеннсес"
        },
        "ETS1": {
          "description": "Pseudoloc-Eнджіінеерріндж  Десііджн"
        },
        "F": {
          "description": "Pseudoloc-Фюнсстіоннс"
        },
        "G": {
          "description": "Pseudoloc-Геомметруу"
        },
        "GMD": {
          "description": "Pseudoloc-Геомметрііс Мееасюрременнт Аннд Дііменссіон"
        },
        "GPE": {
          "description": "Pseudoloc-Eкспррессііндж ГГеомеетрісс Прооперттіес  Вітхх Eквююатіоонс"
        },
        "IC": {
          "description": "Pseudoloc-Імпаастс  оф CCомпюютіндждж"
        },
        "ID": {
          "description": "Pseudoloc-Інтеерпреетіндждж Cаттеджоррісалл Андд Квюаантіттатівве Даата"
        },
        "IF": {
          "description": "Pseudoloc-Інтеерпреетіндждж Фюннстіоонс"
        },
        "IOC-1": {
          "description": "Pseudoloc-Вхілле соомпюттіндж  іннооватііонс  аре  тупіісалллу деесіджннед тто ассхіевве а  спессіфісс пюррпосее, тххеу ммау ххаве  юніннтенддед ссонсееквюеннсес.."
        },
        "IOC-1.A": {
          "description": "Pseudoloc-Eкспллаін  хов  ан ееффесст офф а ссомпюютіндждж іннноваттіон  сан  бе бботх  бенеефісііал аанд ххармффюл."
        },
        "IOC-1.B": {
          "description": "Pseudoloc-Eкспллаін  хов  а соомпюттіндж  іннооватііон ссан ххаве  ан іімпасст бееуондд ітсс інттендеед пююрпоссе."
        },
        "IOC-1.C": {
          "description": "Pseudoloc-Десссрібее ісссюес  тхатт соннтріббюте  то ттхе ддіджіттал ддівідде."
        },
        "IOC-1.D": {
          "description": "Pseudoloc-Eкспллаін  хов  біасс ексіістс  ін ссомпюютіндждж іннноваттіонсс."
        },
        "IOC-1.E": {
          "description": "Pseudoloc-Eкспллаін  хов  пеоппле ппартіісіпаате іін прроблеем-соолвінндж прросесссес  ат сссалее."
        },
        "IOC-1.F": {
          "description": "Pseudoloc-Eкспллаін  хов  тхе  юсе  оф ссомпюютіндждж соююлд рраісее леджджал аанд еетхіссал ссонсеернс.."
        },
        "IOC-2": {
          "description": "Pseudoloc-Тхе  юсе  оф ссомпюютіндждж іннноваттіонсс мауу інвволвее рісскс тто уооюр пперсоонал  сафеету аанд ііденттіту.."
        },
        "IOC-2.A": {
          "description": "Pseudoloc-Десссрібее тхее рісскс тто пррівассу фрром ссоллеестінндж аннд стторінндж пеерсоннал ддата  он аа соммпютеер суустемм."
        },
        "IOC-2.B": {
          "description": "Pseudoloc-Eкспллаін  хов  сомппютінндж реесоюррсес  сан  бе ппротеестедд андд санн бе  місююсед.."
        },
        "IOC-2.C": {
          "description": "Pseudoloc-Eкспллаін  хов  юнаюютхоррізедд асссесс  то ссомпюютіндждж рессоюрссес ііс джааінедд."
        },
        "L": {
          "description": "Pseudoloc-Ланджджюаджее"
        },
        "LE": {
          "description": "Pseudoloc-Лінееар,  Квюаддратііс, ААнд EEкспоннентііал ММоделлс★"
        },
        "LS": {
          "description": "Pseudoloc-Ліфее Ссііенсее"
        },
        "LS1": {
          "description": "Pseudoloc-Фромм Моллесюллес тто Оррджаніісмс:: Стррюстююрес  анд  Проссессеес"
        },
        "LS2": {
          "description": "Pseudoloc-Eсоссустеемс:  Інтеерасттіонсс, Eннерджуу, аннд Дуунаміісс"
        },
        "LS3": {
          "description": "Pseudoloc-Хереедітуу: Іннхеріітанссе аннд Вааріаттіон  оф ТТраіттс"
        },
        "LS4": {
          "description": "Pseudoloc-Біоллоджіссал EEволюютіонн: Юнніту  анд  Дівеерсітту"
        },
        "MD": {
          "description": "Pseudoloc-Юсінндж Прробаббілітту Тоо Макке Деесісііонс"
        },
        "MG": {
          "description": "Pseudoloc-Модееліндждж Віттх Гееометтру"
        },
        "MOD-1": {
          "description": "Pseudoloc-Сомее обджджестсс ор  сонссептсс арее со  фреквквюенттлу ррепреесенттед ттхат  проджджрамммерс  сан  дравв юпоон ексксістііндж ссоде  тхатт хасс алрреадуу бееен теестедд, еннаблііндж ттхем  то вврітее соллютіоонс мморе  квюіссклу  анд  вітхх а джджреаттер ддеджреее офф соннфідеенсе"
        },
        "MOD-1.A": {
          "description": "Pseudoloc-Cаллл Сусстем  слассс меетходдс тоо дженнератте оюютпютт то  тхе  сонссоле.."
        },
        "MOD-1.B": {
          "description": "Pseudoloc-Eкспллаін  тхе  релаатіоннсхіпп беттвеенн а сслассс андд ан  обджеест."
        },
        "MOD-1.C": {
          "description": "Pseudoloc-Іденнтіфуу, юссіндж  ітс  сіджннатюрре, ттхе ссорреест ссонсттрюсттор ббеіндждж салллед.."
        },
        "MOD-1.D": {
          "description": "Pseudoloc-Фор  среаатіндждж обджджест:: а.  Cреаате ообджесстс ббу сааллінндж соонстррюстоорс ввітхооют ппарамметеррс. бб. Cрреатее обджджестсс бу  саллліндж  сонсстрюссторсс віттх паарамеетерсс."
        },
        "MOD-1.E": {
          "description": "Pseudoloc-Cаллл нонн-стаатіс  воідд меттходсс віттхоютт парраметтерс.."
        },
        "MOD-1.F": {
          "description": "Pseudoloc-Cаллл нонн-стаатіс  воідд меттходсс віттх паарамеетерсс"
        },
        "MOD-1.G": {
          "description": "Pseudoloc-Cаллл нонн-стаатіс  нон--воідд меттходсс віттх орр віттхоютт парраметтерс"
        },
        "MOD-1.H": {
          "description": "Pseudoloc-Cаллл стаатіс  метхходс.."
        },
        "MOD-2": {
          "description": "Pseudoloc-Проджджрамммерс  юсе  содее то  репрресеннт а  пхуссісалл обджджест  ор ннонпххусіссал ссонсеепт,  реалл ор  імаджджінедд, буу деффінінндж а  слассс баасед  он ттхе ааттіррбютеес аннд/орр беххавіоорс ооф тххе оббджестт ор  сонссепт"
        },
        "MOD-2.A": {
          "description": "Pseudoloc-Десііджнатте асссессс андд віссібілліту  сонсстраіінтс  то ссласссес,  датаа, соонстррюстоорс,  анд  метхходс.."
        },
        "MOD-2.B": {
          "description": "Pseudoloc-Дефііне іінстаансе  варііаблеес фоор тххе атттріббютесс то  бе іінітііаліззед ттхроююджх ттхе ссонсттрюстторс  оф аа слаасс."
        },
        "MOD-2.C": {
          "description": "Pseudoloc-Десррібе  тхе  фюнсстіонналітту аннд юссе офф прооджрамм содде тххорюджджх соомменнтс."
        },
        "MOD-2.D": {
          "description": "Pseudoloc-Дефііне ббехаввіорсс оф  ан ообджесст тххроюджджх ноон-вооід мметхоодс ввітхооют ппрамеетерсс врііттенн ін  а слласс.."
        },
        "MOD-2.E": {
          "description": "Pseudoloc-Дефііне ббехаввіорсс оф  ан ообджесст тххроюджджх вооід мметхоодс ввітх  ор ввітхооют ппарамметеррс врріттеен інн а сслассс."
        },
        "MOD-2.F": {
          "description": "Pseudoloc-Дефііне ббехаввіорсс оф  ан ообджесст тххроюджджх ноон-вооід мметхоодс ввітх  парааметеерс вврітттен іін а  слассс."
        },
        "MOD-2.G": {
          "description": "Pseudoloc-Дефііне ббехаввіорсс оф  а слласс  тхрооюджх  статтіс мметхоодс."
        },
        "MOD-2.H": {
          "description": "Pseudoloc-Дефііне ттхе сстатііс вааріабблес  тхатт беллондж  то ттхе сслассс."
        },
        "MOD-3": {
          "description": "Pseudoloc-Вхенн мюллітплле сллассеес соонтаіін сооммонн атттрібюютес  анд  бехаавіоррс, ппроджрраммеерс ссреатте а  нев  слассс соонтаіініндждж тхее схааред  аттррібюттес аанд ббехаввіорсс форрміндждж а ххіераасху.. Моддіфіссатіоонс ммаде  ат ттхе ххіджхеест ллевелл оф  тхе  хіеррарсхху аппплу  то ттхе ссюбсллассеес."
        },
        "MOD-3.A": {
          "description": "Pseudoloc-Десііджнатте прріватте віісібіілітуу оф  інсттансее варріабллес тто еннсапссюлатте тххе атттріббютесс оф  ан ообджесст."
        },
        "MOD-3.B": {
          "description": "Pseudoloc-Cреаате аан іннхеріітанссе реелатііонсххіп ффром  а сююбслаасс тто тххе сююперсслассс."
        },
        "MOD-3.C": {
          "description": "Pseudoloc-Дефііне рреферренсее варріабллес ооф а  сюпеерслаасс тто бее асссіджнеед тоо ан  обджеест ооф а  сюбсслассс ін  тхе  самее хіеерарссху."
        },
        "MOD-3.D": {
          "description": "Pseudoloc-Cаллл меттходсс ін  ан іінхеррітаннсе ррелаттіонссхіп.."
        },
        "MOD-3.E": {
          "description": "Pseudoloc-Cаллл Обджджест  слассс меетходдс тххроюджджх іннхеріітанссе."
        },
        "MP": {
          "description": "Pseudoloc-Матхх Праастіссес"
        },
        "NBT": {
          "description": "Pseudoloc-Нюмббер ААнд ООпераатіоннс Інн Бассе Теен"
        },
        "NF": {
          "description": "Pseudoloc-Нюмббер ААнд ООпераатіоннс –  Фрасстіоннс"
        },
        "NI": {
          "description": "Pseudoloc-Нетвворксс & ттхе ІІнтеррнет"
        },
        "NS": {
          "description": "Pseudoloc-Тхе  Нюмббер ССустеем"
        },
        "OA": {
          "description": "Pseudoloc-Оперратіоонс ААнд ААлджеббраісс Тхіінкінндж"
        },
        "PS": {
          "description": "Pseudoloc-Пхуссісалл Ссііенсее"
        },
        "PS1": {
          "description": "Pseudoloc-Матттер аанд іітс ІІнтеррастііонс"
        },
        "PS2": {
          "description": "Pseudoloc-Мотііон аанд ССтабіілітуу:  ФФорсеес аннд Іннтераастіоонс"
        },
        "PS3": {
          "description": "Pseudoloc-Eнеррджу"
        },
        "PS4": {
          "description": "Pseudoloc-Вавеес аннд тххеір  Аппллісаттіонсс ін  Тесххнолооджіесс ін  Інфоорматтіон  Траннсферр"
        },
        "Q": {
          "description": "Pseudoloc-Квюаннтітііес"
        },
        "REI": {
          "description": "Pseudoloc-Реассонінндж Віітх EEквюаттіонсс Андд Інееквюаллітіеес"
        },
        "RF": {
          "description": "Pseudoloc-Реаддіндж  Фоюнндатііоналл Скііллс"
        },
        "RH": {
          "description": "Pseudoloc-Реаддіндж  Хісттору/ССосііал ССтюдііес"
        },
        "RI": {
          "description": "Pseudoloc-Реаддіндж  Інфоорматтіонаал"
        },
        "RL": {
          "description": "Pseudoloc-Реаддіндж  Літеератююре"
        },
        "RN": {
          "description": "Pseudoloc-Тхе  Реалл Нюммбер  Сусттем"
        },
        "RP": {
          "description": "Pseudoloc-Ратііос ААнд ППропоортіоонал  Релаатіоннсхіппс"
        },
        "RST": {
          "description": "Pseudoloc-Реаддіндж  Ссіеенсе/ТТесххнісаал"
        },
        "SL": {
          "description": "Pseudoloc-Спеаакіндждж & ЛЛістееніндждж"
        },
        "SP": {
          "description": "Pseudoloc-Статтістіісс ААнд ППробаабілііту"
        },
        "SRT": {
          "description": "Pseudoloc-Сімііларііту,  Ріджххт Трріанджджлес,, Андд Трііджоноометрру"
        },
        "SSE": {
          "description": "Pseudoloc-Сееііндж ССтрюсстюрее Ін  Eкспррессііонс"
        },
        "TF": {
          "description": "Pseudoloc-Тріджджономметрііс Фююнстііонс"
        },
        "VAR-1": {
          "description": "Pseudoloc-То ффінд  спессіфісс соллютіоонс тто джеенераалізаабле  пробблемсс, прроджрааммеррс іннслюдде вааріабблес  ін ттхеірр содде соо тхаат тххе сааме аалджоррітхмм рюннс юссіндж  діффференнт іннпют  валююес"
        },
        "VAR-1.A": {
          "description": "Pseudoloc-Cреаате сстрінндж ліітераалс"
        },
        "VAR-1.B": {
          "description": "Pseudoloc-Іденнтіфуу тхее мосст апппроппріатте даата ттупе  сатееджоруу форр а ппартіісюлаар сппесіффісаттіон"
        },
        "VAR-1.C": {
          "description": "Pseudoloc-Деслларе  варііаблеес офф тхее сорррестт туппес тто реепрессент  пріммітівве даата"
        },
        "VAR-1.D": {
          "description": "Pseudoloc-Дефііне вваріааблесс оф  тхе  сорррест  тупеес тоо реппресеент рреферренсее датта."
        },
        "VAR-1.E": {
          "description": "Pseudoloc-Фор  Стрііндж сслассс: а.. Cрееате  Стрііндж ообджесстс.  б. CCалл  Стрііндж мметхоодс."
        },
        "VAR-1.F": {
          "description": "Pseudoloc-Фор  врапппер  сласссес:: а.  Cреаате ІІнтеджджер ообджесстс.  б. CCалл  Інтееджер  метхходс.. с.  Cреаате ДДоюблле оббджесттс. дд. Cаалл ДДоюблле меетходдс."
        },
        "VAR-1.G": {
          "description": "Pseudoloc-Eкспллаін  вхерре вааріабблес  сан  бе ююсед  ін ттхе ппроджррам ссоде.."
        },
        "VAR-1.H": {
          "description": "Pseudoloc-Eваллюатее обджджест  рефееренссе екскспресссіоннс тххат ююсе ттхе ккеувоорд ттхіс.."
        },
        "VAR-2": {
          "description": "Pseudoloc-То мманадждже лаардже  амоююнтс  оф ддата  ор ссомпллекс ррелаттіонссхіпсс ін  датаа, прроджрааммеррс врріте  содее тхаат джрроюпсс тхее датта тооджетххер іінто  а сіінджлее датта сттрюсттюре  віхттоют  среаатіндждж інддівіддюал  варііаблеес фоор еаасх ввалюее."
        },
        "VAR-2.A": {
          "description": "Pseudoloc-Репрресеннт сооллесстіоннс офф реллатедд пріімітііве оор оббджестт рефференнсе ддата  юсінндж онне-дііменссіонаал (11Д) ааррауу обджджестсс."
        },
        "VAR-2.B": {
          "description": "Pseudoloc-Травверсее тхее елеементтс інн а 11Д арррау.."
        },
        "VAR-2.C": {
          "description": "Pseudoloc-Травверсее тхее елеементтс інн а 11Д арррау  обджеест ююсіндждж ан  енхаанседд форр лоооп."
        },
        "VAR-2.D": {
          "description": "Pseudoloc-Репрресеннт сооллесстіоннс офф реллатедд обджджест  рефееренссе даатат  юсінндж АрррауЛЛіст  обджеестс.."
        },
        "VAR-2.E": {
          "description": "Pseudoloc-Фор  АрраауЛісст оббджесттс: •• Трааверссе юссіндж  а фоор орр вхііле ллооп.. • ТТравеерсе  юсінндж анн енххансеед фоор лоооп."
        },
        "VAR-2.F": {
          "description": "Pseudoloc-Репрресеннт сооллесстіоннс офф реллатедд пріімітііве оор оббджестт рефференнсе ддата  юсінндж твво-дііменссіонаал (22Д) ааррауу обджджестсс."
        },
        "VAR-2.G": {
          "description": "Pseudoloc-Фор  2Д ааррауу обджджестсс: •  Травверсее юсііндж ннестеед фоор лооопс.. • ТТравеерсе  юсінндж неестедд енххансеед фоор лооопс.."
        },
        "VM": {
          "description": "Pseudoloc-Весттор ААнд ММатріікс Квююантіітіесс"
        },
        "W": {
          "description": "Pseudoloc-Вріттіндж"
        },
        "WHST": {
          "description": "Pseudoloc-Вріттіндж  ХС/СС/Т"
        }
      }
    }
  }
}