{
  "th-TH": {
    "data": {
      "standard_categories": {
        "DAT-1": {
          "description": "วิธีที่คอมพิวเตอร์แสดงข้อมูลจะแตกต่างจากวิธีตีความและแสดงข้อมูลสำหรับผู้ใช้งาน โปรแกรมใช้เพื่อแปลข้อมูลเป็นสิ่งทดแทนที่ผู้คนเข้าใจได้ง่ายขึ้น"
        },
        "IOC-2": {
          "description": "การใช้นวัตกรรมการคำนวณอาจมีความเสี่ยงต่อความปลอดภัยส่วนบุคคลและตัวตนของคุณ"
        },
        "DAT-1.D": {
          "description": "เปรียบเทียบอัลกอริธึมการบีบอัดข้อมูลเพื่อพิจารณาว่าวิธีใดดีที่สุดในบริบทเฉพาะ"
        },
        "IOC-2.B": {
          "description": "อธิบายว่าทรัพยากรการคำนวณสามารถป้องกันและนำไปใช้ในทางที่ผิดได้อย่างไร"
        },
        "CD": {
          "description": "คอมพิวเตอร์และอุปกรณ์สื่อสาร"
        },
        "CI": {
          "description": "ผลกระทบต่อชุมชน ทั่วโลก และจริยธรรม"
        },
        "CL": {
          "description": "การทำงานร่วมกัน"
        },
        "CPP": {
          "description": "การฝึกการคำนวณด้วยคอมพิวเตอร์และการเขียนโปรแกรม"
        },
        "CT": {
          "description": "คิดคำนวณ"
        },
        "L": {
          "description": "ภาษา"
        },
        "RI": {
          "description": "ข้อมูลการอ่าน"
        },
        "RL": {
          "description": "วรรณกรรมการอ่าน"
        },
        "SL": {
          "description": "การพูดและการฟัง"
        },
        "W": {
          "description": "การเขียน"
        },
        "C": {
          "description": "อุโมงค์"
        },
        "F": {
          "description": "ฟังก์ชัน"
        },
        "G": {
          "description": "เรขาคณิต"
        },
        "MD": {
          "description": "ใช้ความน่าจะเป็นในการตัดสินใจ"
        },
        "MP": {
          "description": "การฝึกด้านคณิตศาสตร์"
        },
        "NBT": {
          "description": "จำนวนและการดำเนินงานในเลขฐานสิบ"
        },
        "OA": {
          "description": "การดำเนินการและการคิดในเชิงพีชคณิต"
        },
        "1": {
          "description": "นักเรียนสาธิตความคิดสร้างสรรค์ สร้างความรู้ และพัฒนาผลิตภัณฑ์และกระบวนการที่เป็นนวัตกรรมโดยใช้เทคโนโลยี"
        },
        "2": {
          "description": "นักเรียนใช้สื่อดิจิทัลและสภาพแวดล้อมในการสื่อสารและทำงานร่วมกัน รวมทั้งจากระยะไกล เพื่อสนับสนุนการเรียนรู้ส่วนบุคคลและมีส่วนร่วมในการเรียนรู้ของผู้อื่น"
        },
        "4": {
          "description": "นักเรียนใช้ทักษะการคิดอย่างมีวิจารณญาณในการวางแผนและดำเนินการค้นคว้าวิจัย จัดการโครงการ แก้ปัญหา และตัดสินใจอย่างมีข้อมูลโดยใช้เครื่องมือและทรัพยากรดิจิทัลที่เหมาะสม"
        },
        "6": {
          "description": "นักเรียนแสดงความเข้าใจที่ถูกต้องเกี่ยวกับแนวคิด ระบบ และการดำเนินงานของเทคโนโลยี"
        }
      }
    }
  }
}