{
  "cs-CZ": {
    "data": {
      "teacher_markdown": {
        "Dance Party 3_2021": "Tato lekce obsahuje **miniprojekt**. Tento postup je možná velmi odlišný od toho, co jste Vy i Vaši studenti zažívali dříve v průběhu projektu. Tyto úrovně mají určité nové vlastnosti, které možná budete chtít prozkoumat, než začnete.\n\n-   Kód, který Vaši studenti napíšou na jedné úrovni, bude automaticky převeden do jiných úrovní. To jim umožní postupně budovat a stupňovat myšlenky, jak se budou postupně učit.\n-   Tyto úrovně umožňují otevřenější kreativitu. Dejte svým studentům moc určit si sami, kdy dokončili své jednotlivé úkoly. Není na to jediná správná odpověď! \n-   Pro tento krok postupu jsou k dispozici příklady řešení, které lze zobrazit otevřením učitelského panelu na pravé straně.\n\nTato úroveň bude studentův kód ověřovat kontrolou splnění následujících podmínek:\n\n-   Student musí vytvořit sprajt růžového vetřelce.\n-   Tento sprajt růžového vetřelce musí zahájit nějaké chování, když se na něj klikne.",
        "Dance Party 4_2021": "Tato lekce obsahuje **miniprojekt**. Tyto úrovně mají některé nové vlastnosti, které možná budete chtít prozkoumat, než začnete.\n\n-   Kód, který Vaši studenti napíšou na jedné úrovni, bude automaticky převeden na jiné úrovně. To jim umožní postupně budovat a stupňovat myšlenky, jak se budou postupně učit.\n-   Tyto úrovně umožňují otevřenější kreativitu. Dejte svým studentům moc určit si sami, kdy dokončili jednotlivé úkoly. Není na to jediná správná odpověď! \n-   Pro tento krok postupu jsou k dispozici příklady řešení, které lze zobrazit otevřením panelu učitele na pravé straně.\n\nTato úroveň bude studentův kód ověřovat kontrolou splnění následujících podmínek:\n\n-   Student musí vytvořit sprajt růžového vetřelce.\n-   Tento sprajt růžového vetřelce musí zahájit nějaké chování, když se na něj klikne.",
        "Dance Party 6_2021": "Tato lekce obsahuje **miniprojekt**. Tento postup je možná velmi odlišný od toho, co jste Vy i Vaši studenti zažívali dříve v průběhu projektu. Tyto úrovně mají určité nové vlastnosti, které možná budete chtít prozkoumat, než začnete.\n\n-   Kód, který Vaši studenti napíšou na jedné úrovni, bude automaticky převeden do jiných úrovní. To jim umožní postupně budovat a stupňovat myšlenky, jak se postupně budou učit.\n-   Tyto úrovně umožňují otevřenější kreativitu. Dejte svým studentům moc určit si sami, kdy dokončili své jednotlivé úkoly. Není na to jediná správná odpověď! \n-   Pro tento krok postupu jsou k dispozici příklady řešení, které lze zobrazit otevřením učitelského panelu na pravé straně.\n\nTato úroveň bude studentův kód ověřovat kontrolou splnění následujících podmínek:\n\n-   Všechny sprajty vetřelců musejí ukončit své chování.",
        "Dance Party 7_2021": "Tato lekce obsahuje **miniprojekt**. Tento postup je možná velmi odlišný od toho, co jste Vy i Vaši studenti zažívali dříve. Tyto úrovně mají určité nové vlastnosti, které možná budete chtít prozkoumat, než začnete.\n\n-   Kód, který Vaši studenti napíšou na jedné úrovni, bude automaticky převeden do jiných úrovní. To jim umožní postupně budovat a stupňovat myšlenky, jak se postupně budou učit.\n-   Tyto úrovně umožňují otevřenější kreativitu. Dejte svým studentům moc určit si sami, kdy dokončili své jednotlivé úkoly. Není na to jediná správná odpověď! \n-   Pro tento krok postupu jsou k dispozici příklady řešení, které lze zobrazit otevřením učitelského panelu na pravé straně.\n\nTato úroveň bude studentův kód ověřovat kontrolou splnění následujících podmínek:\n\n-   Sprajt musí zahájit nové chování, když se ho dotkne jiný sprajt.",
        "Dance Party Freeplay_2021": "Tato lekce obsahuje **miniprojekt**. Tento postup je možná pro Vás i pro Vaše studenty velmi odlišný od toho, co jsme udělali v kurzu dříve. Tyto úrovně mají nějaké nové vlastnosti, které možná budete chtít prozkoumat, než začnete.\n\n-   Kód, který Vaši studenti napíšou na jedné úrovni, je automaticky převede do dalších úrovní. To jim umožní postupně budovat své myšlenky a rozvíjet je, jak se postupně budou učit.\n-   Tyto úrovně umožňují mnohem otevřenější kreativitu. Dejte svým studentům šanci určit si sami, kdy dokončili jednotlivé úkoly. Není na to jediná správná odpověď!\n-   Pro tento krok jsou k dispozici příklady řešení postupu, který lze zobrazit otevřením učitelského panelu vpravo.",
        "Fish Tank 4-validated_2021": "Tato lekce obsahuje **miniprojekt**. Tento postup je možná velmi odlišný od toho, co jste Vy i Vaši studenti zažívali dříve. Tyto úrovně mají určité nové vlastnosti, které možná budete chtít prozkoumat, než začnete.\n\n-   Kód, který Vaši studenti napíšou na jedné úrovni, bude automaticky převeden do jiných úrovní. To jim umožní postupně budovat a stupňovat myšlenky, jak se postupně budou učit.\n-   Tyto úrovně umožňují mnohem otevřenější kreativitu. Dejte svým studentům moc určit si sami, kdy dokončili své jednotlivé úkoly. Není na to jediná správná odpověď! \n-   Pro tento krok postupu jsou k dispozici příklady řešení, které lze zobrazit otevřením učitelského panelu na pravé straně.\n\nTato úroveň ověří studentův kód kontrolou splnění následujících podmínek:\n\n-   Student musí změnit pozadí na něco jiného než bílou barvu.",
        "Virtual Pet 2_2021": "Tato lekce obsahuje **miniprojekt**. Tento postup je možná pro Vás i pro Vaše studenty velmi odlišný od toho, co jsme udělali v kurzu dříve. Tyto úrovně mají nějaké nové vlastnosti, které možná budete chtít prozkoumat, než začnete.\n\n-   Kód, který Vaši studenti napíšou na jedné úrovni, je automaticky převede do dalších úrovní. To jim umožní postupně budovat své myšlenky a rozvíjet je, jak se postupně budou učit.\n-   Tyto úrovně umožňují mnohem otevřenější kreativitu. Dejte svým studentům šanci určit si sami, kdy dokončili jednotlivé úkoly. Není na to jediná správná odpověď!\n-   Pro tento krok jsou k dispozici příklady řešení postupu, který lze zobrazit otevřením učitelského panelu vpravo.",
        "courseE_aboutme_2_2021": "Tato lekce obsahuje **miniprojekt**. Tento postup je možná pro Vás i pro Vaše studenty velmi odlišný od toho, co jsme udělali v kurzu dříve. Tyto úrovně mají nějaké nové vlastnosti, které možná budete chtít prozkoumat, než začnete.\n\n-   Kód, který Vaši studenti napíšou na jedné úrovni, je automaticky převede do dalších úrovní. To jim umožní postupně budovat své myšlenky a rozvíjet je, jak se postupně budou učit.\n-   Tyto úrovně umožňují mnohem otevřenější kreativitu. Dejte svým studentům šanci určit si sami, kdy dokončili jednotlivé úkoly. Není na to jediná správná odpověď!\n-   Pro tento krok jsou k dispozici příklady řešení postupu, který lze zobrazit otevřením učitelského panelu vpravo.",
        "courseA_artist_loops12_2021": "Toto je úroveň volného hraní. Toto místo je vynikající nejen k tomu, abyste na něj nasměrovali studenty, kteří rychle postupují, ale je místem, na kterém mohou všichni studenti opravdu rozvinout svoji  tvořivost. Ačkoli se od studentů ve skutečnosti nevyžaduje, aby na této úrovni psali nějaký kód, když tak učiní, umožní jim to aplikovat to, co se naučili, pro ně smysluplnějším způsobem. Doporučte svým studentům, aby tuto aktivitu neuspěchali.\n\n-   Tyto úrovně jsou **bez ověřování správnosti**, aby umožňovaly volnější tvořivost. Dejte svým studentů moc, aby si sami určili, kdy se jim podařilo vytvořit něco, co se jim líbí. Není žádná jediná správná odpověď!\n-   Pro tuto úroveň jsou dostupné příklady řešení, které lze zobrazit  otevřením učitelského panelu vpravo.",
        "courseA_artist_loops_challenge1_2021": "Tato přídavná lekce představuje „volné hraní“. Tyto úrovně mají některé vlastnosti, které si budete možná chtít prozkoumat, než začnete. \n\n-   Tyto úrovně mají **neověřenou správnost**, aby umožňovaly volnější tvořivost. Dejte svým studentům moc určit si sami, kdy už vytvořili něco, co se jim líbí. Není na to jen jedna správná odpověď! \n-   Pro tuto úroveň jsou k dispozici příklady řešení, které lze zobrazit otevřením učitelského panelu vpravo.",
        "courseA_playLab_events7_2021": "Tato úroveň je „volné hraní“. Tyto úrovně mají některé charakteristiky, které možná budete chtít přezkoumat, než začnete. \n\n-   Tyto úrovně jsou **nekontrolované z hlediska správnosti**, aby umožňovaly volnější tvořivost. Dejte svým studentům moc sami si určit, kdy už vytvořili něco, co se jim líbí. Není na to jen jedna správná odpověď! \n-   Pro tuto úroveň jsou k dispozici příklady řešení, které si můžete zobrazit otevřením učitelského panelu na pravé straně.",
        "courseB_playlab_events_challenge1_2021": "Tato přídavná lekce představuje „volné hraní“. Tyto úrovně mají některé vlastnosti, které si budete možná chtít prozkoumat, než začnete.\n\n-   Tyto úrovně mají **neověřenou správnost**, aby umožňovaly volnější tvořivost. Dejte svým studentům moc určit si sami, kdy už vytvořili něco, co se jim líbí. Není na to jen jedna správná odpověď! \n-   Pro tuto úroveň jsou k dispozici příklady řešení, které lze zobrazit otevřením učitelského panelu vpravo.",
        "courseB_artist_loops10_2021": "Toto je úroveň volného hraní. Toto místo je vynikající nejen k tomu, abyste na něj nasměrovali studenty, kteří rychle postupují, ale je místem, na kterém mohou všichni studenti opravdu vyjádřit svou  tvořivost. Ačkoli se od studentů ve skutečnosti nevyžaduje, aby na této úrovni psali nějaký kód, když tak učiní, umožní jim to aplikovat to, co se naučili, způsobem pro ně smysluplnějším. Doporučte svým studentům, aby tuto aktivitu neuspěchali.\n\n-   Tyto úrovně jsou **bez ověřování správnosti**, aby umožňovaly volnější tvořivost. Dejte svým studentů moc, aby si sami určili, kdy se jim podařilo vytvořit něco, co se jim líbí. Není žádná jediná správná odpověď!\n-   Pro tuto úroveň jsou dostupné příklady řešení, které lze zobrazit otevřením učitelského panelu vpravo.",
        "courseB_playLab_events1_2021": "Toto je úroveň volného hraní. Protože se vyskytuje na začátku lekce, je určeno, aby sloužilo jako „pískoviště“, kde mohou studenti experimentovat s novými bloky. Ačkoli se na této úrovni po studentech nevyžaduje, aby psali nějaký kód, když tak učiní, umožní jim to začít objevovat dříve, než budou požádáni, aby plnili nějaké konkrétní úkoly. Doporučte svým studentům, aby tuto aktivitu neuspěchali.",
        "courseB_playlab_eventsFP_2021": "Toto je úroveň volného hraní. Je to nejen vynikající místo pro studenty, kteří rychle postupují, ale je to místo pro všechny studenty, kde mohou opravdu vyjádřit svou tvořivost. Ačkoli na této úrovni ještě není po studentech požadováno, aby opravdu napsali nějaký kód, když tak učiní, umožní jim to aplikovat to, co se naučili, způsobem, který je pro ně smysluplnější. Doporučte svým studentům, aby tuto aktivitu neuspěchali."
      }
    }
  }
}