---
title: שותפים
---

שעת הקוד מונעת ע"י הועדה לסקירת שעת הקוד

￼וועדת הסקירה￼ מורכבת מ-12 מחנכי עבר ומחנכים בהווה משלל שכבות K-12, המעריכים וממליצים על פעילויות תוך שימוש בסולם שנקבע ע"י ועדה מייעצת. מחנכים אלו סוקרים פעילויות המונחות ע"י סטודנטים ומערכי שיעור מונחים ע"י מורים, הנשלחים ע"י מאות שותפי פעילות, המעריכים את הערכים החינוכיים של הפעילויות, את היכולת לקשור בין הלומדים ואת המשיכה הפוטנציאלית למגוון סטודנטים.

עבודת ומסירות הועדה תרמו להצלחת שעת הקוד וחזונה למתן מבוא למדעי המחשב לכל סטודנט.

# שותפים מרכזיים ותומכים תאגידיים

{{ partners/major_partners_corporate_supporters }}

* * *

# שותפים בינלאומיים

{{ partners/international_partners }}

* * *

# תוכנית הלימודים ושותפים להדרכה

{{ partners/curriculum_tutorial_partners }}

* * *

# שותפי וכלי תשתית

{{ partners/infrastructure_partners_tools }}

* * *

# שותפים נוספים

{{ partners/additional_partners }}

{{ signup_button }}