---
title: భాగస్వాములు
---

అవర్ ఆఫ్ కోడ్ సమీక్షా కమిటీచే అవర్ ఆఫ్ కోడ్ నడపబడుతుంది

ఈ [సమీక్షా కమిటీ]({{ urls/review_committee }}), ఒక సలహా సంఘముచే నెలకొల్పబడిన నియమావళిని ఉపయోగించుకొని కార్యక్రమాలను అంచనా వేసి మరియు సిఫార్సు చేసే K-12 గ్రేడ్ బ్యాండ్స్ వ్యాప్తంగా 12 ప్రస్తుత మరియు మునుపటి విద్యావేత్తలను కలిగి ఉంటుంది. ఈ విద్యావేత్తలు, కార్యక్రమాల యొక్క విద్యా విలువను, అభ్యాసకులను నిమగ్నం చేసే సామర్థ్యము, మరియు విద్యార్థుల యొక్క వైవిధ్య కూర్పుకు సంభావ్య అప్పీలును మదింపు చేస్తూ, వందలాది యాక్టివిటీ భాగస్వాములచే సమర్పించబడిన విద్యార్థి-నాయకత్వ కార్యక్రమాలు మరియు టీచర్-ఆధారిత పాఠ్య ప్రణాళికలను సమీక్షిస్తారు.

కమిటీ యొక్క పని మరియు అంకిత భావము అవర్ ఆఫ్ కోడ్ మరియు ప్రతి విద్యార్థికీ కంప్యూటర్ సైన్సు యొక్క పరిచయమును అందజేసే దాని దార్శనికత యొక్క విజయానికి ఎంతగానో దోహదపడ్డాయి.

# ప్రధాన భాగస్వాములు మరియు కార్పొరేట్ మద్దతుదారులు

{{ భాగస్వాములు/ప్రధాన_భాగస్వాములు_కార్పొరేట్_మద్దతుదారులు }}

* * *

# అంతర్జాతీయ భాగస్వాములు

{{ భాగస్వాములు/అంతర్జాతీయ_భాగస్వాములు }}

* * *

# పాఠ్యాంశాలు మరియు బోధనా భాగస్వాములు

{{ భాగస్వాములు/పాఠ్యాంశాలు_బోధనా_భాగస్వాములు }}

* * *

# మౌలికవసతుల భాగస్వాములు మరియు సాధనాలు

{{ భాగస్వాములు/మౌలికవసతులు‌_భాగస్వాములు_ సాధనాలు }}

* * *

# అదనపు భాగస్వాములు

{{ భాగస్వాములు/అదనపు_భాగస్వాములు }}

{{ సైనప్_బటన్ }}