---
title: Computer Science Fundamentals Transition Guide
theme: responsive
style_min: true
---

# Учебные курсы A-F

## Содержание

* [Общие Сведения](#overview)
* [Обучение по новым курсам](#newcourses)
* [Рассказы для работы в группе (Курсы A и B)](#circletime)
* [Последовательность уроков и сложные задачи (все возраста)](#scaffolding)
* [Связующая деятельность для уроков без компьютера (все возраста)](#unplugged)
* [Завершающий курсовой проект (Курсы E и F)](#endofcourse)
* [Заключение](#conclusion)
* [Часто задаваемые вопросы](#faq)

<a id="overview"></a>

## Общие Сведения
Подход к обучению информатике сильно изменился с момента создания первоначальных курсов по основам информатики. Изначально, Курсы 1-4 были разработаны, как отправная точка для погружения в основы, независимо от возраста обучающегося.  Теперь, когда гораздо больше районов, городов и штатов внедрили курсы информатики, начиная с детского сада, учителя просят больше контента, чтобы довести учеников до уровня средней школы.

Курсы по основам информатики A-F - наш ответ на эту потребность.  Создание учебных планов для каждого класса позволяет нам сделать шаг назад и переосмыслить способ подачи материала.  Также это позволило получить искреннюю обратную связь от преданного сообщества учителей, которое поддержало нас в этой миссии. Для разработки Курсов A-F были привлечены одних из лучших специалистов по информатике в начальной школе со всей страны. Курсы A-F должны быть достаточно знакомыми, чтобы учителя могли работать по ним без дополнительного профессионального обучения, но быть достаточно свежими для учеников, которые выполняли наши уроки в прошлом.

* Курс А: дошкольники
* Курс B: первый класс
* Курс С: второй класс
* Курс D: третий класс
* Курс E: четвертый класс
* Курс F: пятый класс
* Подготовительный экспресс-курс: дошкольники - 1 класс
* Экспресс-курс: 2 - 5 классы

Самое большое обновление в курсе по Основам информатики заключается в том, что содержимое четырех курсов (Курсы 1-4) было разбито на 6 курсов в соответствии с каждым годом обучения с 1 по 5 класс (Курсы A-F).  Таким образом, уроки стали более адаптированы к соответствующим уровням чтения, математики и общего познавательного развития.  Обратите внимание на добавление двух разных «Экспресс» курсов, один для тех, кто не умеет читать (дошкольники и первый класс), и один для остальных классов (2-5 классы).  Они похожи на «ускоренную» версию предыдущего комплекта.

<a id="newcourses"></a>

## Обучение по новым курсам
Как упоминалось ранее, курсы очень похожи на предыдущие, но всё же другие.  Если вы были на профессиональном развивающем семинаре Code.org, то вы уже готовы преподавать по новым курсам. Есть небольшое количество изменений, но общая платформа, учебные планы и педагогическая философия остались без изменений. Если вы еще не принимали участие, Code.org предлагает однодневный бесплатный семинар, который поможет вам научиться понимать учебный план, ориентироваться в платформе Code.org и проводить уроки без компьютера.

Основные обновления в курсах:

* Рассказы для работы в группе для младших учеников
* Новый подход к последовательности и проработке/принятии понятий
* Связующая деятельность для совершенствования перехода от уроков без компьютера к урокам за компьютером
* Завершающий курсовой проект для старших учеников

Остальная часть этого руководства представит каждую идею более подробно, предлагая советы и приемы для реализации изменений в вашем классе.

<a id="circletime"></a>

## Рассказы для работы в группе (Курсы A и B)
Некоторым понятиям трудно научить, используя только виды деятельности и задачи, это особенно трудно для младших учеников.  Именно поэтому мы добавили немного рассказов для работы в группе в учебный план дошкольников и учеников 1 класса. Эти рассказы предназначены для чтения учителем всему классу с остановками для обсуждения таких важных тем, как отладка, настойчивость и разочарование.  Мы надеемся, что возможность прочувствовать эти сложные понятия с помощью персонажей рассказов поможет учащимся распознавать те же понятия, когда они возникнут в будущих уроках.

Несколько примеров, как рассказы для работы в группе могут быть использованы:

### Прочитайте соответствующий рассказ вашему классу
  - Заодно не забудьте проверить понимание с помощью вопросов и комментариев в подходящие моменты на протяжении всего действия.
  - Позже обсудите рассказ. Что ваши ученики услышали? Есть какие-то темы, на которых они застряли?
  - Постарайтесь, чтобы ученики ассоциировали себя с персонажами.  Есть ли что-то, что они делают в повседневной жизни, что напоминает им об одном из персонажей рассказа?

### Напомните ученикам о рассказе перед тем, как они начнут следующую деятельность.
  - Вы помните основную идею, которую мы обсуждали?
  - Как вы поймете, что эта идея встретилась вам сегодня?
  - Что сделал герой, чтобы справиться с этой проблемой? Что вы сделаете?

### Во время упражнений укажите на сходства между рассказом и ситуациями у учеников, когда они пересекаются.
  - Объясните ученикам, как положение, в котором они находятся, напоминает ситуацию из книги.
  - Попросите одного из учеников подумать о героях и выяснить, что они могут сделать.  Поможет ли это ученику сделать следующий шаг?

Если вы не можете собрать весь свой класс вместе, Code.org предоставил видео вариант в начале соответствующего урока, который показывает рассказы с ограниченным количеством анимаций. Хотя эти видео не передают такие же ощущения, они позволят ученикам познакомиться с понятиями и персонажами, прежде чем продолжить с остальным курсом.

<a id="scaffolding"></a>

## Последовательность уроков и сложные задачи (все возраста)
Курсы A-F менее ограничены, чем все наши предыдущие курсы.  Это означает, что мы стараемся, чтобы студенты создавали свой код с самого начала как можно чаще, если только они специально не учатся отлаживать.  Как часть этой разработки, большинство наших онлайн уроков следуют направлению - мы показываем простую задачу в начале урока, затем медленно продвигаемся к новым понятиям до тех пор, пока ученики не поймут основную тему урока.  Далее мы даем им измененную задачу, которая предназначена для того, чтобы ученики задумались над темой в новом и более сложном виде.

Сложные и интересные задачи - новинки в Курсе A-F.  Задача сложных головоломок состоит в том, чтобы поднять учеников на более высокую планку, где они смогут практиковать настойчивость и независимое мышление.  Сложные головоломки намеренно трудны и разработаны таким образом, чтобы только ученики, которые действительно понимают тему, могли решить их в разумные сроки.  Это означает, что много учеников не справятся с комплексом задач, с которым они столкнулись впервые. Чтобы добиться успеха, потребуется особое отношение как ученика, так и учителя.

1. Ученики должны много пытаться, затем отложить задания и снова вернуться к ним.  Эта практика позволяет две очень важные вещи:
2. Ученики лучше понимают, когда и почему использовать концепцию, которую они изучают. Следующие задачи кажутся более легкими после прохождения, хотя они сами по себе являются сложными.

Помните, что ученики могут перескакивать уроки и возвращаться к невыполненным задачам в любое время.  Иногда очень помогает хорошо выспаться перед тем, как вернуться к решению проблемы.

После того, как ученики преодолеют испытание, они найдут несколько упражнений, которые похожи на то, что они могли встречать в первой половине комплекса. Задачи специально были расположены таким образом, чтобы проверить на сколько четко ученик понял тему урока.  Они могут показаться слишком простыми, учитывая, что задачи были решены ранее, но они были созданы для того, чтобы продемонстрировать точный уровень компетентности, требуемый от соответствующей стадии.

В некоторых случаях мы заканчиваем наши уроки уровнями со свободными играми.  Эти уровни могут либо не иметь «неправильного» ответа, либо они могут иметь несколько различных способов решения.  Пожалуйста, вовлеките учеников, чтобы они показали свой лучший результат, а не просто нажимали "Далее", даже если у них есть возможность пройти дальше.

Несколько заключительных тезисов для этого раздела:

* Напоминайте ученикам, что нужно быть настойчивыми и использовать навыки отладки при решении задач.
* Видео часто помогают.  Если ученик застопорился, пусть он пересмотрит видео второй, третий и даже четвертый раз.
* Заставляйте учеников читать инструкции.  Если возникли трудности, предложите ученику прочитать инструкции вслух своему однокласснику.
* Использовать подсказки - это нормально!  Ученикам следует использовать то количество подсказок, которое им нужно. Но обязательно пытайтесь решить задачу после каждой новой подсказки.

<a id="unplugged"></a>

## Связующая деятельность для уроков без компьютера (все возраста)
Деятельность без компьютера проводится там, где находятся ученики, в контексте того, как они уже используют важные понятия информатики в своей повседневной жизни.  Как только учащиеся смогут определить фундаментальные идеи, такие как циклы и условные выражения, они смогут преодолеть ментальные преграды, которые могут возникнуть при первой попытке использовать их в онлайн программировании.

Опыт без компьютера настолько важен, что мы решили сделать еще один шаг вперед и создать деятельность, которая соединит уроки без компьютера с их онлайн аналогами.  В Курсах A-F вы увидите, что планы уроков содержат примеры, как выполнять упражнения офлайн и переводить уроки в соответсвующий набор онлайн задач.  Соответственно, мы называем это "Связующая деятельность".

По большей части, связующая деятельность может быть создана либо путем взятия темы из упражнения без компьютера и выполнения его с бумажными блоками, либо путем взятия онлайн задачи и решения ее с использованием описания из упражнения без компьютера.  В некоторых случаях бывают другие соотношения, но все примеры предназначены для того, чтобы офлайн опыт не был слишком абстрактным или несвязанным.

<a id="endofcourse"></a>

## Завершающий курсовой проект (Курсы E и F)
Для старших школьников по окончанию курса мы добавили проекты в Курсах E и F. Хотя Code.org предоставляет возможность создавать «проекты» в течение достаточно долгого времени, мы чувствовали, что следует добавить нужное направление для учеников, чтобы они имели возможность планировать и выполнять свои проекты в формальном контексте.

Заканчиваются курсовые проекты относительно просто.  В течение 4 - 5 недель ученики будут искать идеи для проектов, планировать свои приложения, программировать, пересматривать их на основе обратной связи (5-й класс), а затем презентовать свои завершенные работы.  Каждый из этих шагов сопровождается полезным раздаточным материалом, а также планом урока для учителя, который подчеркивает общую картину.

**Review:** Students will take a look at a handful of aspirational projects, built to showcase the amazing things that can be done with the skills that they have learned up to this point.  Эти проекты были построены либо в Лаборатории Игр, либо в Artist, но ученики могут искать проекты и в Tynker, Scratch или даже написанные на текстовых языках программирования, если учитель сочтет это целесообразным.

**Plan:** The intention here is for students to sit back and think about what is really possible.  Им нужно задуматься об играх, которые они видели, и об ограничениях, с которыми они столкнуться при редактировании их.  После этого они набросают план по созданию чего-то уникального.  Возможно, ученикам придется напоминать, чтобы они оставались реалистичными, поскольку у них будет ограниченное время и ресурсы для воплощения своих идей в жизнь.  Материалы здесь предполагают использование Artist или Лаборатории Игр, но проекты могут быть перемещены на любую платформу, подходящую для каждого конкретного класса.

**Build:** One day is not a whole lot of time to execute a plan that has been laid out on paper.  Ученики столкнуться с трудным выбором, когда они попытаются заставить код работать, встречая одно препятствие за другим.  Они научатся редактировать и приспосабливаться по мере того, как ошибки и ограничения программы изменят их представления о том, что может быть реально выполнено в ограниченные сроки.

**Revise:** For older students, a day of revising their programs based on the feedback of classmates can help them improve their final product, and lets them inspire others with the things that they have achieved.  Ученики будут практиковать конструктивную критику, а также групповой мозговой штурм и настойчивость.

**Present:** Nearly a month in the making, this is the chance for students to stand-up and be proud of how far they have come.  Наш план урока подразумевает устную презентацию, но учитель взамен может предложить написать или сделать мультимедийную презентацию.

Независимо от того, насколько тщательно учащиеся погружаются в свои проекты, они обязательно узнают что-то полезное о процессе творчества и решения проблем в информатике.

<a id="conclusion"></a>

## Заключение
Как вы можете видеть, Курсы A-F по основам информатики содержат существенные улучшения, созданные под влиянием откликов от учителей, обучающих основам информатики, и организаторов сообществ.

Надеемся, что обзор был информативным.  Если у вас есть какие-нибудь вопросы или комментарии, касающиеся этих изменений, пожалуйста, перейдите по ссылке http://forum.code.org/c/csf и напишите на нашем форуме.  Мы обязательно ответим на них как можно быстрее.  А пока несколько ответов на наиболее часто-задаваемые вопросы о Курсах A-F.

<a id="faq"></a>

## Часто задаваемые вопросы

| Вопрос                                                                                                                                                                                                     | Ответ                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |
| ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |
| **Вы запускаете новый набор курсов. Значит ли это, что Курсы 1-4 больше не будут использоваться?**                                                                                                         | Нет. Также как наш оригинальный 20-часовой курс по-прежнему доступен и используется на сайте, мы планируем оставить Курсы 1-4 для тех, кто считает, что они больше подходят для их учеников / детей.                                                                                                                                                                                                                                                                      |
| **Когда мы можем начать пользоваться Курсами A-F?**                                                                                                                                                        | Курсы A-F уже доступны!                                                                                                                                                                                                                                                                                                                                                                                                                                                   |
| **Некоторые мои любимые уроки/задачи исчезли из Курсов A-F!**                                                                                                                                              | Не переживайте! Они всё ещё существуют там, где и были, - Курсы 1-4 или ускоренном 20-часовом курсе.                                                                                                                                                                                                                                                                                                                                                                      |
| **Эти задачи выглядят гораздо сложнее.  Я переживаю, что они слишком сложны для моих малышей.**                                                                                                            | Основа этих новых курсов - желание заставить учеников думать, решать проблемы и развивать усердие.  Ничего из этого не требуется, если задачи очень легкие.  По этой причине мы сделали задачи более сложными.  Пожалуйста, обратите внимание на руководство для учителя, которое поможет провести ваш класс при развитии этих навыков.  Как всегда, не стоит недооценивать важность использования уроков без компьютера, прежде чем приступать к онлайн задачам.         |
| **Для решения некоторых задач можно использовать определенное количество заданных блоков.  Что, если мои учение хотят программировать длинными конструкциями перед тем, как начнут разбираться в циклах?** | Есть несколько задач, которые ограниченны определенными блоками. Это один из наших новых способов пошагового обучения.  Это способ дать направление ученику, не перегружая его в рабочем процессе.  Для учеников, которые любят решать задачи длинным путем перед тем, как они оптимизируют (и по факту для всех учеников, все время), полезно иметь блокнот или лист для заметок рядом с клавиатурой, где они смогут нарисовать алгоритм любым удобным для них способом. |

