---
title: Computer Science Fundamentals Transition Guide
theme: responsive
style_min: true
---

# تدريس الدورات A-F

## الفهرس

* [نظرة عامة](#overview)
* [تدريس دورات جديدة](#newcourses)
* [قصص الجلسة المستديرة (دورات A وB)](#circletime)
* [درس تسلسلي&تحدي الألغاز(جميع الأعمار)](#scaffolding)
* [أنشطة انتقالية لدروس غير موفق فيها (جميع الأعمار)](#unplugged)
* [نهاية مشاريع الدورة (دورات E & F)](#endofcourse)
* [خاتمة](#conclusion)
* [الأسئلة الشائعة](#faq)

<a id="overview"></a>

## نظرة عامة
بانوراما تعليم علوم الكمبيوتر تغيرت كثيرا منذ إنشاء دورات علوم الكمبيوتر الأساسية الأصلية. أصلا، الدورات 1-4 صممت كنقطة انطلاق لتعلم الأساسيات، بغض النظر عن سن متعلم هذه المادة.  الآن بعد إنجاز الكثير من المقاطعات، والمدن، والدول دورات علوم الكمبيوتر ابتداء من الرياض، يطلب المدرسون مزيدا من المحتويات لأجل تلاميذ الإعدادي والثانوي.

دورات علوم الكمبيوتر الأساسية A-F، هي جوابنا على هذه المسألة.  إنشاء منهج صف بعد صف يسمح لنا بالعودة إلى الوراء وإعادة التفكير في الطريقة التي نقدم بها المواد.  كما يسمح لنا بإدراج وبإخلاص اقتراحات المدرسين الذين يدعمون مهمتنا.  مصممة بمساعدة بعض المتخصصين في تدريس علوم الكمبيوتر عبر البلاد، الدورات A-F في المتناول للإنجاز دون حاجة إلى معرفة كبيرة بالبرمجة، لكن في المستوى لتقدَّم للطلاب الذين أنجزوا دروسنا من قبل.

* دورة A: رياض الأطفال
* دورة B: الصف الأول
* دورة C: الصف الثاني
* دورة D: الصف الثالث
* دورة E: الصف الرابع
* دورة F: الصف الخامس
* قراءة قبل الدورة السريعة: رياض الأطفال - الصف الأول
* الدورة السريعة: الصف الأول - الصف الخامس

التحديث الأكبر لأساسيات علوم الكمبيوتر أنه سيتم نقل المحتوى من دورات (دورات 1-4) إلى ست دورات موازية لكل K-5 رتبة (دورات A-F).  بذلك، تصبح الدروس أكثر ملاءمة لمستوى القراءة، والرياضيات، وغيرها من تنمية المعارف.  هناك دورتان سريعتان، واحدة لما قبل القراءة وواحدة لكل الصفوف.  هذه مشابهة لنسخة الدورة السريعة السابقة.

<a id="newcourses"></a>

## تدريس دورات جديدة
كما تمت الإشارة إليه سابقا، فالدروس يجب أن تكون مألوفة، ومختلفة.  إن كنتم قد أنجزتم ورشة تنمية مهنية Code.org،فأنتم على استعداد لتدريس دورات جديدة. هناك تغييرات قليلة، لكن المنصة، و المنهاج والفلسفة البيداغوجية لم تتغير. إن لم تُوَفق بعد، يقدم Code.org يوما واحدا من حلقات عمل مجانية لمساعدتك على تعلم كيفية تصفح منصة Code.org، وفهم المناهج الدراسية وتعليم الدروس التي لم التوفق فيها.

التحديثات الرئيسية للدورات هي:

* قصص الجلسة المستديرة للمتعلمين الصغار
* مقاربة جديدة للترقي وممارسة/تطبيق المفاهيم
* أنشطة لتعزيز الدروس وتجاوز التعثرات
* نهاية مشاريع الدورة للمتعلمين الكبار

تتمة هذه الدليل ستقدم المزيد من التفاصيل، النصائح والحيل لإدراج التغييرات داخل فصلك الدراسي.

<a id="circletime"></a>

## قصص الجلسة المستديرة (دورات A وB)
بعض المفاهيم يصعب تعليمها عبر الأنشطة والألغاز وحدها، خصوصا للمتعلمين الصغار.  لهذا السبب أدرجنا بعض قصص الجلسات المستديرة في المناهج الخاصة بالرياض والصف الأول. هذه القصص يقدمها المدرس أو المدرسة للفصل، مع توقفات لمناقشة الأفكار المهمة كتصحيح الأخطاء والثبات والإحباط.  أملنا أن نسمح للمتعلمين بتجريب هذه المفاهيم في سياقات عبر القصص لمساعدتهم على تعرفها عند مصادفتها ضمن دروس جديدة.

هذا هو انتظارنا من اعتماد قصص الجلسات-المستديرة:

### اقرأ القصة المناسبة لمتعلميك
  - يجب التأكد من الفهم عبر أسئلة وتعليقات أثناء تقديم القصة.
  - مناقشة القصة بعد القراءة. ماذا يسمع تلاميذك؟ هل هناك أفكار غير مفهومة؟
  - حاول دفع المتعلمين لتعرف شخصيات.  هل هناك أشياء يعيشونها في حياتهم وتذكرهم بالشخصيات الواردة في القصة؟

### أذكر المتعلمين بالقصة قبل بدء النشاط التالي.
  - هل تتذكرون الفكرة الرئيسية التي ناقشناها؟
  - كيف ستعلم إن كنت فكرت في هذه الفكرة اليوم؟
  - ماذا فعلت الشخصية للتعامل مع الفكرة؟ ماذا كنت ستفعل؟

### أشر إلى أوجه التشابه بين القصص ووضعيات المتعلمين عندما تتقاطع في نشاط معين.
  - صف للمتعلم الموقف الذي يشبه موقفهم في وضعية من الكتاب.
  - أطلب من أحد المتعلمين التفكير في أحد شخصيات القصة ومعرفة ماذا ستقوم به.  هل هذا سيساعد المتعلم لمعرفة الخطوة التالية؟

إن كنت غير قادر على جمع القم كاملا، Code.org قدم في بداية الدرس فيديو مناسبا له يعرض القصة مع تأثيرات وحركات محدودة. رغم أن هذه الفيديوهات لا تقدم إضافات كافية، فهي ستسمح للمتعلمين بالتعرض للمفاهيم والشخصيات قبل مواصلة الدورة.

<a id="scaffolding"></a>

## درس تسلسلي&تحدي الألغاز(جميع الأعمار)
دورات A-F أقل رتبة من الدورات السابقة.  هذا بعني أننا نحاول كلما أمكن ذلك أن نجعل المتعلمين ينشئون لغة برمجة خاصة بهم منذ البداية، ما لم يكونوا في تعلم لتصحيح الأعطاب.  كجزء من هذا التصميم، معظم دروسنا على شبكة الإنترنت تتبع اتجاها حيث نقدم لغزا بسيطا لبدء الدرس، ثم نتعمق ببطء في مفهوم جديد حتى يفهم المتعلمون الفكرة تحته.  بعدها، نقدم لغزا صعبا، يسعى إلى جعل المتعلمين يفكرون في المفهوم بطريقة جديدة ومعقدة.

الألغاز الصعبة جديدة في الدورات A-F.  مرمى الألغاز الصعبة هو جعل المتعلمين أمام عائق كبير يدفعهم إلى ممارسة الثبات والاستقلالية في التفكير.  الألغاز الصعبة مصممة بطريقة تسمح فقط للمتعلمين الذين تمكنوا من معرفة المفهوم بحلها في زمن قصير.  هذا يعني أن عددا من المتعلمين لن يمكنوا من حل هذه الألغاز الصعبة منذ المرة الأولى. هذا يتطلب تدخلا خاصا من المدرس والمتعلم لتجاوزه.

1. ينبغي للمتعلمين أن يجروا محاولات جادة، لتجاوزها والمواصلة.  هذه الممارسة تسمح لأمرين اثنين بالتحقق:
2. معرفة المتعلمين لشيئين هما متى ولماذا نستعمل هذا المفهوم. الألغاز التالية ستصبح أسهل، على الرغم من أنها صعبة في حد ذاتها.

للتذكير، فالمتعلمون يمكنهم إعادة المحاولة لحل الألغاز في أي وقت.  في بعض الأحيان يمكن أن يكون النوم الجيد قبل مراجعة مسألة شيئا مساعدا.

عندما يحل المتعلمون الألغاز، سيكون في انتظارهم عدد من التمارين التي يمكن أن تكون مماثلة للتي أنجزوها في النصف الأول من المرحلة. هذه الألغاز وضعت عمدا لاختبار وضوح الهدف المدروس للمتعلمين.  قد تبدو الألغاز المقدمة سهلة جدا، لكنها قد وضعت لقياس مستوى الكفاءة المرجوة من المرحلة الموافقة لها.

في بعض الحالات، ننهي الدروس بألعاب مجانية ذات المستويات.  هذه المستويات قد لا يكون لها جواب، أو أنها تسمح بحلها بطرق مختلفة لحل مشكلها الأساسي.  المرجو تشجيع المتعلمين بإعطائهم فرصة الحل وليس فقط النقر على "مواصلة".

بعض الملاحظات لهذه المحطة:

* ذكر المتعلمين بالاستمرار واستخدام مهاراتهم في تصحيح الأخطاء في حالة وجودها.
* الفيديوهات مفيدة بما فيه الكفاية.  عندما يصلدف المتعلمون عائق، فدعهم يشاهدوا الفيدو عدة مرات.
* اطلب من المتعلمين قراءة التعليمات.  إن واجهوا مشكلة، فاجعل أحد زملائهم يقرأ التعليمات بصوت عال.
* لا بأس في استخدام التلميحات!  المتعلمون يمكن أن يعتمدوا كل التلميحات التي هم بحاجة إليها، لكن يجب التأكد من التوصل في النهاية إلى حل لغز واحد على الأقل بعد كل عرض.

<a id="unplugged"></a>

## أنشطة انتقالية لدروس غير موفق فيها (جميع الأعمار)
الأنشطة غير المتوفق فيها تجعل الطلاب يعودون إلى تعلم المفاهيم الأساسية لعلوم الكمببوتر في حياتهم اليومية.  عندما يتعرف المتعلمون الأفكار الأساسية كالحلقات والشرطيات، فيمكنهم تجاوز كل العقبات التي يصادفونها عند محاولة استعمالها في البرمجة على الأنترنت لأول مرة.

التجارب غير الناجحة مهمة جدا في اختيار أنشطة لتجاوز تعثرات الدروس وتحميلها إلى الأنترنت.  في الدورات A-F، ستجد خطاطات هذا الدرس توفر أمثلة لكيفية تنزيل التمارين وترجمة دروس الألغاز التالية دون حاجة إلى الأنترنت لرفعها إلى الأنترنت فيما بعد.  نسمي هذه "أنشطة العبور."

في الغالب، أنشطة الدعم يمكن أن يتم إعدادها انطلاقا من التمارين التي لم يتم التوفق فيها وإنجازها على الورق، أو استعمال الألغاز وحلها مباشرة على الأنترنت باستعمال لغة البرمجة المستعملة في التمرين.  في بعض الأحيان، يتم عرض علاقات مختلفة، لكن الهدف منها هو الحفاظ على التجارب لكي لا تبقى مجردة

<a id="endofcourse"></a>

## نهاية مشاريع الدورة (دورات E & F)
قد أدخلنا إنجازا نهائيا من دورة المشاريع في دورات  E & F. على كل حال Code.org يوفر إمكانية بناء "المشاريع" لفترة طويلة، ارتأينا بأن ذلك سيعطي رؤية للمتعلمين ليتمكنوا من التخطيط لتنفيذ وإنجاز مشاريعهم في سياق رسمي.

نهاية دورة المشاريع تكون بسيطة نسبيا.  على مدى أربعة أو خمسة أسابيع سيتمكن المتعلمون من استعراض أفكار مشاريعهم، التخطيط لتطبيقها، تشفير برنامجهم، مراجعتها باعتماد التغذية الراجعة (المستوى الخامس)، ثم تقديم عملهم النهائي.  كل خطوة من هذه الخطوات لها دليها، إضافة إلى الدرس الذي يسلط ضوءا أكثر على الصورة.

**Review:** Students will take a look at a handful of aspirational projects, built to showcase the amazing things that can be done with the skills that they have learned up to this point.  تم بناء هذه المشاريع في مختبر الألعاب والفن، لكن الطلبة يمكنهم عرضها على Tynker، Scratch أو على أي برنامج يراه المدرس مناسبا.

**Plan:** The intention here is for students to sit back and think about what is really possible.  سيفكرون في الألعاب التي يشاهدونها، وفي العراقيل التي يواجهونها عند تعديلها.  بعد ذلك،سيفكرون في خطة لإنشاء عمل فريد.  الطلبة قد يحتاجون إلى تذكير ليبقوا أكثر واقعيين، بالمقارنة مع محدودية الوقت والأدوات عند التفكير في تكوين رؤية مستقبلية.  الأدوات هنا تسمح باستعمالها في مختبر منصتنا، لكن المشاريع يمكن نقلها والعمل عليها في منصات أخرى خاصة بكل فصل.

**Build:** One day is not a whole lot of time to execute a plan that has been laid out on paper.  الطلاب سيواجهون خيارات صعبة عندما يحاولون تنفيذ مشاريعهم ومواجهة حاجز بعد آخر.  سيتعلمون كيفية تعديل وتكييف العوائق وحدودية البرامج لتصوراتهم لما يمكن إنجازه بشكل مريح في وقت قصير.

**Revise:** For older students, a day of revising their programs based on the feedback of classmates can help them improve their final product, and lets them inspire others with the things that they have achieved.  الطلاب سيتدربون على نقد بناء، في إطار عصف ذهني.

**Present:** Nearly a month in the making, this is the chance for students to stand-up and be proud of how far they have come.  خطة درسنا تتضمن تقديما شفويا، لكنه يبقى للمدرسين إمكانية اختيار تقديم مكتوب أو بواسطة وسائط أخرى.

بغض النظر عن اندماج الطلاب في مشاريعهم، فهم يتعلمون شيئا مؤكدا حول عمليات الإبداع وحل مشاكل علوم الكمبيوتر.

<a id="conclusion"></a>

## خاتمة
كما ترون، فدورات A-F في أساسيات علوم الكمبوتر تحتوي على تعديلات، اعتمدت في ذلك على تعليقات واقتراحات والمدرسين & الميسرين لجماعات الطلاب.

نتمنى أن تكوب هذه اللمحة جد مفيدة.  إذا كان لديك أي أسئلة أو تعليقات حول هذا التغيير، يرجى زيارة http://forum.code.org/c/csf وقم بنشرها ونشرها على منتدانا.  سنكون متأكدين على حصول أسئلتكم على أجوبة بأقصى سرعة ممكنة.  إلى ذلك الوقت، هنا بعض الأسئلة المتداولة حول دورات A-f.

<a id="faq"></a>

## الأسئلة الشائعة

| سؤال                                                                                                       | الإجابة                                                                                                                                                                                                                                                                                                                                                                                                                                     |
| ---------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |
| **أنت تبدأ مجموعة جديدة من الدورات-- هل هذا يعني أنك غادرت الدورات 1-4؟**                                  | لا. كون 20ساعة الأصلية ما تزال مستمرة وفي طور الاستثمار على موقعنا، فنحن نخطط لاستمرار الدورات 1-4 في سبيل من يعتبرونها أفضل التجارب للتعلم.                                                                                                                                                                                                                                                                                                |
| **متى يمكن بدء استخدام الدورات A-F؟**                                                                      | الدورات A-F متوفرة الآن!                                                                                                                                                                                                                                                                                                                                                                                                                    |
| **بعض من دروسي/ألغازي المفضلة مفقودة من الدورات A-F!**                                                     | لا تخف! ما تزال موجدودة حيث تركتها في الدورات 1-4 أو دورة 20 ساعة السريعة.                                                                                                                                                                                                                                                                                                                                                                  |
| **الألغاز تبدو صعبة أكثر.  أقلق كثيرا لكونها صعبة شيئا ما لصغاري.**                                        | الأساس من هذه الدورات الجديدة هو الرغبة في جعل الطلاب يفكرون، في حل المشاكل، والممارسة باستمرار.  لا شء من هذه الأشياء ضروري عندما يكون حل الألغاز سهل الحل.  لهذا السبب، كان علينا جعل الألغاز بصعوبة أكثر.  يرجى الاطلاع على دليل المدرس للحصول على تعليمات لقيادة فصلكم في بناء هذه المهارات.  كما هو الحال دائما، فلا يجب الاستخفاف بأهمية استثمار الدروس التي لم يتم التوفق فيها قبل الانتقال إلى تجاوزها لإنجاز الألغاز على الأنترنت. |
| **بعض الألغاز تسمح فقط بعدد معين من الإطارات.  ماذا لو أراد الطلاب استعمال البرمجة قبل إتمام كل الحلقات؟** | هناك بعض الألغاز التي تختزل إطارات معينة. هذه واحدة من طرقنا الجديدة في الترقي.  إنها طريقة في تقديم التوجيهات، دون تركيم الأجزاء في مساحة العمل نفسها.  للطلاب الذين يحبون برمجة الألغاز اكثر قبل التخلي عنها (و في الواقع، لكل الطلاب، كل وقت) فمفيد التوفر على مذكرة أو مسودة إلى جانب لوحة المفاتيح حيث يمكنهم إنجاز الخوارزميات كيفما كانت.                                                                                            |

