{
  "clicked": "",
  "clickedSprite": "",
  "subject": "",
  "subjectSprite": "",
  "object": "",
  "objectSprite": "",
  "errorLoadingAnimation": "Бид таны \"{animationName}\" анимейшнийг ачаалахад асуудалтай байгаа юм шиг байна. Интернет холболт сайн байгаа эсэхийг шалгаад хуудсыг дахин ачаалж үзээрэй. Энэ асуудал үргэлжилсээр байвал энэ анимэйшн эвдэрч магадгүй юм. Энэ тохиолдолд та анимэйшнийг устгах замаар үргэлжлүүлэх шаардлагатай болж магадгүй юм.",
  "reinfFeedbackMsg": "Та дууссан! Дараагийн түвшинд шилжихийн тулд \"Үргэлжлүүлэх\" дээр дараарай.",
  "shareGame": "Тоглоомоо хуваалцаарай:",
  "spritelabFeedbackCreateFishWithBehavior": "Та дор хаяж нэг загасан шидтэн хийж, түүнд зан төлөв өгөх хэрэгтэй.",
  "spritelabFeedbackMoveFishLeftRight": "Таны загасан шидтэн зүүн эсвэл баруун тийш шилжих хэрэгтэй. Түүний зан байдлыг өөрчилж үзээрэй.",
  "spritelabFeedbackChangeBackgroundColor": "Та суурь дэвсгэрийг цагаанаас өөр өнгө болгон өөрчлөх хэрэгтэй.",
  "spritelabFeedbackCreateTwoSprites": "Та яг хоёр шидтэн үүсгэх шаардлагатай.",
  "spritelabFeedbackTwoSpritesWithCostumes": "Таны хоёр шидтэнд өөр өөр хувцас хэрэгтэй.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Та зан авиртай, өөр өөр хувцастай хоёр шидтэнг үүсгэх хэрэгтэй.",
  "spritelabFeedbackClickSprite": "\"Ажиллуулах\" товчийг дарсны дараа шидтэн дээр дарахаа мартуузай.",
  "spritelabFeedbackUseSpinningBehavior": "Таны загасан шидтэн эргэлдэж эхлэх хэрэгтэй. Түүний зан байдлыг өөрчилж үзээрэй.",
  "spritelabFeedbackPinkAlienBehavior": "Таны ягаан харийн шидтэн зан авираа эхлүүлээгүй байна.",
  "spritelabFeedbackCreateThreeAliens": "Та хөх харийн амьтан, ягаан харийн амьтан, шар харийн амьтанг бий болгох хэрэгтэй.",
  "spritelabFeedbackAliensNotInLine": "Таны гурван харийн шидтэнг хэвтээ шугамаар (50 пиксель дотор) зохион байгуулах шаардлагатай.",
  "spritelabFeedbackYellowAlienBehavior": "Шар харийн амьтан зан авираа эхлүүлээгүй байна.",
  "spritelabFeedbackNoAlienColor": "Таны харийн амьтны дор хаяж нэг нь өнгөө өөрчлөөгүй байна.",
  "spritelabFeedbackNeedAlienStopBehavior": "Таны харийн шидтэнгүүд бүх зан авираа зогсоох хэрэгтэй.",
  "spritelabFeedbackBlueAlienBehavior": "Таны хөх харийн амьтан шинэ зан авир эхлүүлэх хэрэгтэй.",
  "spritelabFeedbackUseCostume": "Та дор хаяж нэг хувцас хэрэглэх хэрэгтэй.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Та өөр өөр хувцас бүхий 3 шидтэн үүсгэх хэрэгтэй.",
  "spritelabFeedbackMoveUpNotDown": "Таны шидтэн доош (урд)-н оронд дээш (хойд) явах хэрэгтэй.",
  "spritelabFeedbackRobotFasterThanRover": "Робот явахаасаа өмнө дэлгэцийн баруун талд хүрч ирэв.",
  "spritelabFeedbackDifferentStarRotation": "Хоёр одны хувцастай шидтэнгүүд ижил хэмжээгээр эргэх шаардлагатай.",
  "spritelabFeedbackAstronautMoveToCorner": "Сансрын нисгэгч шидтэн нь дөрвөн булангийн аль нэг рүү шилжих хэрэгтэй."
}
