{
  "https://studio.code.org/s/applab-2hour/lessons/1/levels/1": {
    "dsls": {
      "markdown": "# Welcome to App Lab Design Mode\nIn App Lab \"Design Mode\" lets you drag and drop User Interface elements into the app.\n\n### Vocabulary\n**User Interface (UI)** - The \"User Interface\" or **UI** of an app refers to how a person (user) interacts with the computer or app.  There are common patterns to user interfaces that you probably know about just from experience:\n\n* **UI Elements** or objects, like buttons, images, text boxes, pull down menus, screens and so on.\n* **UI Events** or controls, like *click*, *scroll*, *move mouse*, *type keyboard key*, etc.\n\nApp Lab let's you easily add UI Elements to your app, and then add code to respond when a user interacts with those elements.  It's kind of two-step process, but we'll learn all about it in this lesson.\n\nTo start let's just look at Design Mode and add a single UI element (a button) to our app.  We'll add code later on.\n\n<div style=\"column-count: 4; column-gap: 20px; column-rule: 0.5px solid #00adbc; -moz-column-count: 3; width: 100%\">\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\"><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">1.</span>\nYou'll see a new set of switches above the app area that let you flip back and forth between \"Design Mode\" and Code Mode\".</p>\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\"><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">2.</span>Adding an element is as easy as dragging and dropping it into the app where ever you want. Once it's on the app screen you can reposition it, resize it and change lots of other properties about it </p>\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\"><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">3.</span>The <em>Properties</em> tab shows you everything you can change about the look and feel of a UI element.</p>\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\"><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">4.</span>The <strong>element ID</strong> is important because it's how you refer to the element in your code. We'll discuss element IDs later on.</p>\n</div>\n\n![](https://images.code.org/01a31ac3be66deb6d01a92a1edfffd21-image-1476726587662.png)\n\n\n<div style=\"column-count: 2; column-gap: 20px; column-rule: 0.5px solid #00adbc; -moz-column-count: 3; width: 66%; float: right\">\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\"><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">5.</span>You can make the text that the user sees on the button text be whatever you like.</p>\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\"><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">6.</span><strong>Note:</strong> Scroll down to see other properties for a UI element might be \"hiding\" down below.</p>\n</div>\n\n<div style=\"clear: both\"></div>\n<hr>\n\n**Now you try!**\n",
      "teacher_markdown": "### Design First\n\nSome students may be tempted to start playing around in Code Mode early on, but for this lesson we are going to focus solely on mocking up a User Interface. Let students know that they'll get to the code soon enough. These first few levels will allow students to build up a screen of their own design using all of the elements available in App Lab without worrying about the actual app they are creating.\n"
    }
  },
  "https://studio.code.org/s/applab-2hour/lessons/1/levels/2": {
    "display_name": "Intro to Design Mode"
  },
  "https://studio.code.org/s/applab-2hour/lessons/1/levels/3": {
    "long_instructions": "# Design Mode\n\nWelcome to Design Mode in AppLab! This will allow you to easily create a digital version of your sketched wireframes by adding UI elements from the toolbox and and styling them the way you want!\n\n**Goal:** Add a large red button to your app using Design Mode.\n\n# Do This:\n\n-   **Find <img src=\"https://images.code.org/278f146396c80c97d0b5d73f24d48aec-image-1444335461720.png\"> in the Design Toolbox** and drag out a button and resize it. \n\n-   **Change the button text** to say \"Click Me\".\n\n-   **Set the color for the button** to be red.\n\n<img src=\"https://images.code.org/4cab6a5233cf07df0d8e312932762012-image-1444314797615.gif\" style=\"width: 500px; float: middle\">"
  },
  "https://studio.code.org/s/applab-2hour/lessons/1/levels/4": {
    "short_instructions": "Improve the button by choosing a descriptive and meaningful ID. (Click to see full instructions)",
    "long_instructions": "# IDs\n\nThe `id` (we'll typically write **ID**) is a **unique identifier** used for each element in the app.\n\nEach element that appears in the app must have a **unique ID**. In fact, if you try to run a program that has two buttons with same ID you will get a warning message in the console.\n\n# Do This\n\nWhile each element you drag out in Design Mode gets a default ID, they aren't really that helpful (like `button1` and `button2`), so you should get in the habit of creating your own IDs.\n\n-   Change the ID of your \"click me\" button to something useful (like `redButton`)\n-   Drag out a second button\n-   Make the second button blue and give it an ID of `blueButton`"
  },
  "https://studio.code.org/s/applab-2hour/lessons/1/levels/5": {
    "dsls": {
      "markdown": "# Choosing Good IDs\n\n**Good IDs** are **meaningful and descriptive**.\n\nJust like you want good names for functions, you will want an ID to describe the intended purpose of the element.  \n\nFor example, if you have many buttons in your program, you will want to give each an ID that describes what the button does. \n\nSo, instead of this:\n \n * `button1` and `button2`\n\nYou might make IDs that convey not only that it's a button but what you intend the button to be used for, like:\n\n * `homeButton` and `saveButton` or\n * `buttonHome` and `buttonSave` or\n * `homeBtn` and `saveBtn`\n * it's up to you!\n\n<img src=\"https://images.code.org/b33be9ee1521f2aa80fedcf22c929d44-image-1476910499958.png\" style=\"display: block; margin: auto;\">\n\n# Rules About IDs\nIn making descriptive and meaningful IDs there **are some rules about IDs** you need to know.  IDs...\n\n* are case-sensitive.\n* cannot contain spaces.\n* *must* begin with a letter (A-Z or a-z) and may be followed by any number of digits and letters.\n* can contain hyphens (\"-\"), underscores (\"_\"), colons (\":\"), or periods (\".\").\n\n**Case-sensitive?**\n\nThis means there is a difference between `HomeButton` and `homeButton`  (notice the Capital H on the first one).\n\nThese differences seem annoying at first, but you get used to it, and actually appreciate the fact that the computer requires such precision.\n\nThere are a few common styles for capitalizing and spelling multi-word IDs:\n\n* **\"Camelcase\"** -- `aCamelcaseNameMightLookLikeThis`\n* **Underscores** -- `Some_people_like_to_use_underscores_to_separate_words`\n* **dashes** -- `Others-like-to-use-hyphens-or-dashes`\n\nWhatever you choose is up to you.  It's your style.  It just helps to be consistent.\n\n\n\n\n",
      "teacher_markdown": "#### Developing Good Programming Habits\n\nFollowing clear and consistent naming conventions is an important habit to develop, but the benefits are rarely immediately obvious to students. It really pays off in the long term to be a stickler for well named IDs, particularly because it will save your own sanity when it comes time to read your students' programs, but it will also simplify the process of combining each student's screen into a full team app.\n"
    }
  },
  "https://studio.code.org/s/applab-2hour/lessons/1/levels/6": {
    "long_instructions": "# Adding Text\n\n<img src=\"https://images.code.org/86ba633e04f90f3ca47dff3dcd064847-image-1469812708683.15.36.png\" style=\"float: right; width: 75px\"/>\nThe label element lets you add any text you'd like to your app. Just drag out a label block and set its \"text\" property. \n\n# Do This\n\nUse a label element to create a title for this app.\n\n-   Drag out a label and place it on the top of the screen\n-   Change the id to \"titleLabel\"\n-   Change the text to \"My App\"\n-   Increase the font size\n-   Choose a color you like for the title"
  },
  "https://studio.code.org/s/applab-2hour/lessons/1/levels/7": {
    "long_instructions": "# Input Elements\n\n<img src=\"https://images.code.org/108fcc6fc89bf88edde00353afb33d75-image-1469814642375.49.23.png\" style=\"float: right; width: 150px\"/>\n\nButtons are a great way to navigate around your app, and text labels are the primary way to display content in your app. When it comes to taking input from your users, sometimes you need a place for them to type or boxes to check. The **Text Input**, **Dropdown**, **Radio Button**, and **Checkbox** elements all provide ways for your users to input information to your app.\n\n# Do This\n\nChoose at least two of the input elements, and for each one:\n\n-   Drag it out and position it on the screen\n-   Change the id to something meaningful\n-   Read through the properties and experiment with them\n-   Add a label element next to each that describes what they do (don't forget to give it an id too!)"
  },
  "https://studio.code.org/s/applab-2hour/lessons/1/levels/8": {
    "long_instructions": "# Adding Images\n\nSometimes the functionality you want to represent in your prototype is too complicated to do with just the default buttons and fields. If you want to mock up more advanced interfaces (like a map), the easiest way to do it is with an image\n\n# Do This\n\n-   Find and download an image of a map you like\n-   Drag an image element into your app [][0]\n-   Choose your image [][1]\n    -   **URLs** can be added directly into the \"picture\" field.  \n    -   **Upload images** by clicking \"Choose\".\n    -   **Note:** You can always see all the files you've uploaded by clicking the gear at the top of the toolbox. [][2]\n-   Make sure to give your image a good ID!"
  },
  "https://studio.code.org/s/applab-2hour/lessons/1/levels/9": {
    "long_instructions": "<img src=\"https://images.code.org/2b405319f597910b1563ae607958171c-image-1475866226306.49.51.png\" style=\"width: 200px; float:right\">\n\n# Icons\n\nIcons help users find the right functionality while also making your app feel more polished.\n\n# Do This\n\nAdd a few icons to your app. For each icon:\n\n-   Drag out an image element\n-   Next to the \"Picture\" field click \"Choose...\"\n-   Click on the \"Icons\" tab and select one\n-   Make sure to give your image a good ID! (do we still need to say it?)"
  },
  "https://studio.code.org/s/applab-2hour/lessons/1/levels/10": {
    "short_instructions": "Fix the layout of the bullseye game. (Click to see full instructions)",
    "long_instructions": "# Layering and Deleting\n\n<img src=\"https://images.code.org/9e620f70869de438c4f0c66663686876-image-1444678130772.gif\" style=\"width: 200px; float: right\">User interface elements can overlap one another, so you'll want the ability to change the order or **depth** at which each one is rendered. \n\nIf you **scroll to the bottom of the Properties tab** you'll find buttons which allow you to easily **delete or change the depth** of an element.\n\n-   **Delete an Element** by selecting it (clicking on it) in the design view and then clicking **Delete** in the properties tab.\n-   **Change the depth** of elements by using the double or single arrows.\n    -   Click the double arrow to send all the way to front or back.\n    -   Click the single arrow to move up or down one layer.\n\n# Do This:\n\nUse the **delete** and **depth** tools to **create the \"After\" image**\n\n<table>\n<tr>\n\t<th style=\"text-align:center\">Before</th>\n    <th style=\"text-align:center\">After</th>\n</tr>\n<tr>\n\t<td align=center><img src=\"https://images.code.org/023f749ecb58c91869a4eacab6701203-image-1444685187662.png\" style=\"width:200px ; border: solid 1px black\"></td>\n    <td style=\"text-align:center\"><img src=\"https://images.code.org/e45fc7d451c071683fd3b59466b106b0-image-1444684677212.png\" style=\"width:200px; border: solid 1px black\"></td>\n</tr>\n</table>"
  },
  "https://studio.code.org/s/applab-2hour/lessons/2/levels/1": {
    "dsls": {
      "markdown": "# Responding to User Input\n\nDesign Mode makes it really easy to lay out the User Interface for your app, but we'll need to dive into Code Mode to make it actually respond to users.\n\nIn Game Lab the Draw loop just constantly ran code, using conditionals to check for interactions from the user. App Lab, on the other hand, waits to respond to certain **events** that occur in a program. It's App Lab's way of saying \"Hey! something just happened!\". This means that there doesn't need to be any code running when you aren't directly interacting with an app, and your code can respond to each of these events as they happen.\n\nCollectively, the coding tasks involved in making your app respond to events by triggering functions are called **Event Handling**.  \n\nIn App Lab all event handling starts by adding a special block of code called `onEvent`.  Here is how to do it:\n\n<br><br>\n\n<div style=\"column-count: 4; column-gap: 20px; column-rule: 0.5px solid #00adbc; -moz-column-count: 4; width: 100%\">\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">1.</span>\nSwitch into Code Mode</p>\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">2.</span>\nDrag an <code>onEvent</code> block from the toolbox into the workspace.</p>\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">3.</span>\nUse the pulldown menu to select the <em>ID</em> of the UI element you want to setup to respond to some event. The IDs of all UI elements added in design mode will be listed here.</p>\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">4.</span>\nUse the pulldown menu to select the <em>type</em> of event you want to respond to. (Just use \"click\" for now).</p>\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">5.</span>\nAdd code inside the function that you want to run <em>when</em> the user triggers the event.  The function will run once every time the user triggers the specific event.</p>\n\n</div>\n\n![](https://images.code.org/9b506faaaadf61338dc738a4eafb66b2-image-1476740205599.png)\n\n### Changing Screens with a \"Click\"\n\nIt's important to understand in Event-Driven programming that:\n\n* **Users trigger events** - Events occur when users click a button, tap the screen, move the mouse, type a key on the keyboard, etc.\n* **Events trigger code** - When an event occurs or \"fires\" it can be used to trigger a particular javascript function.\n\nApp Lab's `onEvent` block is a type of event-handling function called an **Event Listener**. It wraps all of the setup up you need to do event handling into one command that has several parts. Here is an example with everything labeled:\n\n<img src=\"//curriculum.code.org/images/applab/onEvent_diagram.png\" style=\"display: block; margin: 20px auto\">\n\n<div style=\"column-count: 3; column-gap: 20px; column-rule: 0.5px solid #00adbc; -moz-column-count: 3; width: 100%\">\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">1.</span>\nCode to execute when callback function is triggered when the user clicks <em>button1</em>.  In this case, simply move the turtle forward 25 pixels. Event handling code will typically be more than one line. This is just a simple example to start.</p>\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">2.</span>\nNotice that this function, unlike others we've seen, does not have a name. It is also called a <em>callback function</em> which is an odd term. A callback function is only different from a normal function in that you don't call it directly from your code. Instead a callback function is <strong>called by the system</strong> at the time the specified event occurs. Callback functions are a common pattern in a lot of event-driven programming.</p>\n</div>\n\n\n### You'll try this next!\n\n",
      "teacher_markdown": "#### Just the Facts\n\nThere's a lot to consume here and many of the details about how events work in App Lab are not totally necessary to understand for our needs in this unit. If students are struggling with how programming works in App Lab, focus on these essentials:\n\n* There is no `draw` loop that runs forever\n* The `onEvent()` block specifies:\n\t* an element ID\n    * an event (such as \"click\" or \"mouseover\")\n    * code that should be run when the event occurs (this code is technically an anonymous callback function, represented by the green block)\n* Code inside `onEvent()` blocks runs any time the specified event occurs\n\n#### Compared to Game Lab\n\nIn Game Lab, we might use the following code to check if a sprite named \"button\" was clicked and do something about it:\n\n    function draw() {\n    \tif (mousePressedOver(button)) {\n       \t\t// Do something\n       \t}\n    }\n\n\nIn App Lab, given a button with the ID \"button\", we could write the following code to achieve the same goal:\n\n\n    onEvent(\"button\", \"click\", function () {\n    \t// Do something\n    });\n\nIn the App Lab example, the function is just another argument passed to the onEvent function, it just so happens that the argument must be a function itself. We could also define the function separately and write this same program as follows:\n\n    function doSomething() {\n    \t// Do something\n    }\n    \n    onEvent(\"button\", \"click\", doSomething);\n\n\nIn the second example, notice that when we pass the function `doSomething` to the `onEvent` function we _don't_ include the parenthesis at the end. This is because we're actually passing the whole function as an object.\n"
    }
  },
  "https://studio.code.org/s/applab-2hour/lessons/2/levels/2": {
    "short_instructions": "Add an event handler for the button using the \"Insert and show\" link in the Design Mode Events tab. (Click to see full instructions).",
    "long_instructions": "# Activate Your Button\n\nIn the last lesson you focused on laying out a page of your app in Design Mode. This is a great, quick way to get the visual side of an app figured out, but it's not very functional. If you click any of the buttons you added, nothing happens. Now you're work towards adding some basic functionality by making the buttons in your app actually _do_ something!\n\n**Goal:** Add code using Design Mode to make the button respond to a click.\n\n# Do This\n\nYour starter app has two elements, a _label_ with the id `titleLabel` and a _button_ with the id `changeTitleButton`. To start with, you're going to make the button log a message to the console when it's clicked.\n\n-   In Design Mode, **click on the provided button to edit its properties**\n-   Click on the **Events** tab\n-   Insert an `onEvent` from Design Mode by clicking **Insert and show code** under the **Events Tab**.\n-   Take a look at the block that was added to the **Code Mode** tab.\n-   Run the program, click your button and **look for the output in the _Debug Console_** below the workspace instead of the app window. We will discuss the _Debug Console_ on the next level."
  },
  "https://studio.code.org/s/applab-2hour/lessons/2/levels/3": {
    "long_instructions": "# How Do Events Work?\n\nEvent-driven apps are made up of elements that can trigger events (such as buttons) and pieces of code called **event handlers**. Event handlers are commands that \"watch\" for certain events to occur in your program, and then run some function when an event occurs.\n\nWhen you first create an event handler from Design Mode, puts a `console.log()` block inside to help you test the event, but you can put just about any code you want inside the event hander.\n\n# Do This\n\nThe toolbox has a new block called `setText` which allows you to change the text of an element on the screen. You're going to modify the button event handler so that it changes the title text when clicked.\n\n-   Drag out a `setText()` block to the _inside_ of the `onEvent()` callback function (where the `console.log()` block currently is)\n-   From the block's dropdown, select \"titleLabel\" (the id of the element you want to change)\n-   In the block's second input, replace \"text\" with a new title for the app\n-   Run your program and click the button to see it work",
    "callouts": {
      "": "Use the setText block to change the text of titleLabel"
    }
  },
  "https://studio.code.org/s/applab-2hour/lessons/2/levels/4": {
    "short_instructions": "Update the ID names and `console.log` messages to match the correct button. (Click to see full instructions.)",
    "long_instructions": "# Updating IDs and Debugging with Console Log\n\nHere we have a couple buttons with event handlers and `console.log` statements, but they are all switched around!\n\nWe should have given the buttons better ID names so we could tell the difference based on the ID. **Can you update the ID names and `console.log` messages to match the correct button?**\n\n# Do This\n\n-   **Change the IDs** of the buttons in Design Mode to more descriptive names.\n\n-   Switch to Code Mode and notice that the **ID pulldowns have been updated to include the new IDs**. (You still need to select the correct ID from the pulldown menu.)\n\n-   **Update the `console.log` messages** to match the buttons."
  },
  "https://studio.code.org/s/applab-2hour/lessons/2/levels/5": {
    "dsls": {
      "content1": "description here",
      "markdown": "# Making Multiple Screens\n\nYou may imagine that a typical app has a number of \"screens\" or views that user goes through as part of using your app.  Below is a typical example with a welcome screen, a screen that plays a game and a game over screen.\n\n<img src=\"https://images.code.org/27065f81b2bf53dea099a76868f66e8e-image-1477324003598.png\" style=\"display: block; margin: auto\">\n\n## What's a screen, anyway?\n\nA screen is just a UI element like anything else in Design Mode.  But it has a few special properties:\n\n1. A screen is a UI element that contains other UI elements.\n2. Only one screen can be visible at a time\n3. Only elements that \"belong\" to a screen will visible when that screen is active.\n4. **Multiple screens, but only one coding workspace**\n  * Even though your *design elements* might be spread across multiple screens, your code does not get broken up like that.\n  * There is only one coding workspace, that will still house all of your code for the app.\n\n## How to Make a new Screen\n\n<div style=\"float: left; width: 33%\">\nThere are two ways to add a screen to your app.  First, make sure you're in <em>Deisgn Mode</em>.\n<br><br>\n<span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">1.</span>\nEither choose <em>New Screen...</em> from the pulldown menu at the top of the display area. <strong>Note:</strong> you also use this pulldown menu to switch between screens in design mode.\n<br><br>\n<span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">2.</span>\nOr drag and drop a Screen UI element from the toolbox. <strong>Heads-up: </strong>As soon as you release the screen element, the app will show you a <strong>new blank screen.</strong> You can get back to other screens using the pulldown menu at the top.\n\n</div>\n\n![](https://images.code.org/ed8f45d70a65329597c1623ddd756249-image-1477165123570.png)\n\n## Set a Screen's Properties\n\n<div style=\"column-count: 4; column-gap: 20px; column-rule: 0.5px solid #00adbc; -moz-column-count: 4; width: 100%\">\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">1.</span>\nUse this pulldown menu to select the screen you want to work on. The list will contain the IDs of all the screens you've created.</p>\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\"><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">2.</span>\nClick on a blank area of the background to select the screen and set its properties. </p>\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\"><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">3.</span>\nScreens also have IDs.  Like other UI elements, it's a good idea to <em>give your screens descriptive and meaningful IDs</em>.  It makes writing code so much easier.</p>\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">4.</span>\nIf your screen is full with UI elements and there's no blank area to click to select it, use this pulldown menu. It lists all the UI elements that are part of this screen, including the screen itself.</p>\n</div>\n\n<img src=\"https://images.code.org/5f8934e6ae0fc2d9dfde8c9a0d93eec2-image-1477249243769.png\" style=\"display: block; margin: auto;\">\n\n<div style=\"column-count: 2; column-gap: 20px; column-rule: 0.5px solid #00adbc; -moz-column-count: 2; width: 50%; float: right\">\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">5.</span>\nClick this button to make this screen the \"default screen\" which means the screen that will show first when the app is run.</p>\n\n\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">6.</span>\nScreens don't have many properties but you can set the background of the screen to a color or an image. Images are stretched or squeezed to fit the screen.</p>\n\n</div>\n<div style=\"clear: both\">&nbsp;</div>\n\n## Using the *setScreen* command to change screens with code\n\nThe `setScreen` command changes the screen to show whatever screen you want.  You specify the screen by its ID.\n\n<img src=\"https://images.code.org/005222ed01ade7940963ce149d637286-image-1477168080948.png\" style=\"display: block; margin: auto\">\n\n<div style=\"column-count: 3; column-gap: 20px; column-rule: 0.5px solid #00adbc; -moz-column-count: 3; width: 100%\">\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">1.</span>\nFind <em>setScreen</em> in the UI Elements toolbox and drag it into the code workspace.</p>\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\"><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">2.</span>\nMost of the time you change the screen in response to some user-event. In this case <em>setScreen</em> is being added to a \"click\" event handler for the image with id: <em>smileyFace</em></p>\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\"><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">3.</span>\nSelect the ID of the screen you want to change to. In this case, when smiley face is clicked on the screen that says \"hello\" we want to change to the screen that says \"goodbye.\"</p>\n\n<p><span style=\"font-weight: bold; color: #00adbc; font-size: 200%;\">4.</span>\n<strong>Key idea: Multiple Screens - One Coding Workspace.</strong> This is the code that handles a \"click\" event for an <em>image that is on a different screen</em> - the <em>goodbyeScreen</em>. You can't see that image right now, or that screen, because the screen isn't selected.  However, the code for it still goes here.</p>\n\n</div>\n",
      "teacher_markdown": "#### Cards to Screens\n\nTo simplify the prototyping process, teams can think of each card that they created in the Paper Prototyping as a separate screen in the App Lab iteration of their app. In reality, screens that are very similar can often be developed as a single screen with content that changes based on user interaction. In the next lesson students will see some examples of how that could work, but it's not expected that they incorporated that kind of functionality in this project.\n"
    }
  },
  "https://studio.code.org/s/applab-2hour/lessons/2/levels/6": {
    "long_instructions": "# Second Screen\n\nMost apps have more than one screen or page that each have different contents. With Design Mode you can quickly add new screen to your app.\n\n# Do This\n\nYou're going to add a second screen to your app and add a button to that screen. Make sure you're using good IDs!\n\n-   Drag out <img src=\"https://images.code.org/4337b39cfd797ed9289b70fb6cb365fb-image-1444353631083.17.39 PM.png\" style=\"width: 50px\"> from the Design Toolbox into your app. You now have two screens!\n-   Using Design Mode create a button in your new screen.  <img src=\"https://images.code.org/bbf464e2fc94bacba39407d6842f2336-image-1478300698068.04.35 PM.png\" style=\"width: 150px\"> \n-   Set the IDs for your screens and buttons to something meaningful, for example _\"homeScreen\"_, _\"detailsScreen\"_, _\"homeButton\"_, and _\"detailsButton\"_\n\nYou can always use the screen dropdown menu at the top of the app window to switch between your screens <img src=\"https://images.code.org/404e0b3f520a413c8a5e62e74b70bb19-image-1478300388689.58.59 PM.png\" style=\"width: 150px\"> "
  },
  "https://studio.code.org/s/applab-2hour/lessons/2/levels/7": {
    "long_instructions": "# Switching Screens\n\nYou can set which screen is showing in your app with the `setScreen()` command. If you're working in blocks you can select which screen you want to switch to from a dropdown.\n\n[][0]\n\n# Do This\n\nYou'll use an `onEvent()` block with `setScreen()` to make the two buttons in your app switch between the two screen.\n\n-   Drag out two `onEvent()` blocks\n-   Set the IDs for your `onEvent()` blocks for each of your two buttons\n-   Place a `setScreen` block inside each of the `onEvent` blocks.\n-   Choose the appropriate screen from the dropdown of each `setScreen` block.\n-   Test out your app to make sure your buttons let you switch back and forth between the two screens"
  },
  "https://studio.code.org/s/applab-2hour/lessons/2/levels/8": {
    "long_instructions": "# Navigating\n\nOnce you start adding multiple screens to an app, you need to make sure that users can always get where they want to go. In the next two levels you'll learn how to make sure a user can always get back to the \"homepage\" of your app.\n\n# Do This\n\nHere's an app with four different pages, but only the \"red\" screen is linked so far. In this level you'll make the other two buttons take the user to the correct screen.\n\n-   Add two `onEvent()` blocks, one each for the \"greenButton\" and \"blueButton\"\n-   Use the `setScreen()` block to make each button switch to the appropriate screen\n-   Test your app to make sure both buttons work. For example, when you click the green button you should go to the green screen."
  },
  "https://studio.code.org/s/applab-2hour/lessons/2/levels/9": {
    "long_instructions": "# Navigating Back\n\nSomeone using your app can now get to each of the red, green, and blue pages, but they can't get back to the homepage. You can add buttons and event handlers of your own to help them do this.\n\n# Do This\n\nCreate buttons and event handlers to help a user navigate back to the \"home\" screen\n\n-   Use Design Mode to create a button inside each of the \"red\", \"green\", and \"blue\" screens. Make sure to give them descriptive IDs.\n-   Back in your code drag in three `onEvent()` blocks, one for each of the three buttons you made.\n-   Inside each `onEvent()` block use the `setScreen()` block that switches back to your \"home\" screen.\n-   Test your app. You should now be able to navigate back to the home screen from each of the other three."
  },
  "https://studio.code.org/s/applab-2hour/lessons/3/levels/1": {
    "long_instructions": "# Controlling Visibility\n\nEarlier in this lesson, when we were proposing ways to simplify the quiz app, we mentioned that it was possible to show or hide design elements with code. App Lab has two functions that let you control the visibility of an element:\n\n-   `hideElement()` makes the specified element invisible\n-   `showElement()` makes the specified element visible\n\n# Do This\n\nThe provided app has an image and two buttons.\n\n-   Attach an event handler to the \"Hide\" button that hides the image when clicked\n-   Attach an event handler to the \"Show\" button that shows the image when clicked"
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/1": {
    "dsls": {
      "markdown": "# Getters and Setters\n\n# Setters\n\nSetters are commands which **set** or change information. Setters all require at least one thing as input : what it wants to change the information to.\n\nYou have used `setScreen()` before.  `setScreen()` changes the screen that the user is viewing. The one input `setScreen()` takes is the new screen to change to.\n\nAnother example of a setter that you will be using is `setText()`.\n\n<img src=\"//curriculum.code.org/images/applab/setText.png\" style=\"margin: 20px auto\">\n\n# Getters\n\nGetters are commands which **get** or retrieve information. Getters often require at least one input: the place you want to retrieve information from.\n\n`getText()` is a common getter you will use. It can be used to get the text from something like a text input. \n\n<img src=\"//curriculum.code.org/images/applab/getText.png\" style=\"margin: 20px auto\">\n\nOften when you use a getter it is a good idea to save the result in a variable so that you can use it throughout your program.\n"
    }
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/2": {
    "long_instructions": "# setScreen\n\nLets start with a setter you have used before `setScreen()`. \n\n-   Make the About Me button on the Home page go to the About Me page.\n-   Make the Back button on the About Me go to the Home page."
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/3": {
    "long_instructions": "# setText\n\nWe are going to start making an alarm app. We have already set up an event handler for the \"triggerAlarmButton\" which will change the \"statusLabel\" text to ON when clicked. Can you make the stop alarm button change the text to OFF when clicked?"
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/4": {
    "long_instructions": "# Hide and Show\n\nIt is a little weird that both buttons are on the screen at the same time. You don't need the stop alarm button until the alarm is on. Can you make the buttons only show when they are needed?\n\n-   You will want the stop alarm button to be hidden when the program starts. You can do this in design mode.\n\nHint: When you click the trigger alarm button, you should change the text, hide the trigger alarm button, _and_ show the stop alarm button."
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/5": {
    "long_instructions": "# getText\n\nTry to set up an event handler that gets the text from the dropdown whenever a user selects a new item from the dropdown. You will need to use the getter `getText()`. Whenever you use a getter you should save it in a variable. Use `console.log()` to make sure it is working."
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/6": {
    "long_instructions": "# setText and getText\n\nOften you will want to get the text of a UI Element and use it to set the text of another element on the screen. Can you get the text from the dropdown when the user picks a new input and use it to set the text of the \"choiceDisplay\" label."
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/7": {
    "long_instructions": "# setText and getText\n\nYou've seen how to use getText and setText already. Can you make this app get the text the user typed once they hit enter and show it in the text area at the bottom?\n\n_Tip: The \"change\" event is triggered when the user clicks \"enter\" in a field. Use an event handler for the text input watching for the \"change\" event._"
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/8": {
    "long_instructions": "# getNumber\n\n**Starter Code:** The program tries to update the valueDisplay whenever the slider value changes but it always sets the value to 10.\n\nCan you use `getNumber()` to get the value of the slider and update the valueDisplay as it changes?"
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/9": {
    "dsls": {
      "markdown": "# getText vs getNumber\n\nComputers store information in different ways. Two different ways a computer stores information are strings and numbers. \n\n`getNumber()` tries to get the value of whatever you are asking about as a number.\n\n`getText()` gets the value of whatever you are asking about as a string. Strings are often marked in your programs with `\" \"`. For example all the names of your IDs are strings. You can use `getText()` to retrieve a number but just know that it will be surrounded by `\" \"`.\n\n## Why does that matter?\n\nUsually it is fine to get everything as a string but when you want to do mathematical operations you need numbers not strings.  When you try to add two strings together the computer thinks you want to combine the two strings together into one string. \n\nSo when you say `\"2\" + \"2\"` the computer evaluates that to `\"22\"`.\n\nWhere as when you say `2 + 2` (notice no `\" \"`) the computer evaluates that to `4`.\n"
    }
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/10": {
    "display_name": "getNumber",
    "long_instructions": "# getNumber\n\n**Starter Code:** This program creates a simple calculator but **there is something wrong with it. Try putting in 2 + 2.**\n\nWe can fix this by using `getNumber()` instead of `getText()`. Can you fix the program by changing `getText()` to `getNumber()`?"
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/11": {
    "dsls": {
      "markdown": "# How setProperty Works\n\n`setProperty` is the code that lets you set properties of UI elements like color, width, font size, etc.  Any property you can set in Design Mode can also be set in code using `setProperty`\n\n<br><br>\n\n<div style=\"column-count: 3; column-gap: 20px; column-rule: 0.5px solid #00adbc; -moz-column-count: 3; width: 100%\">\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\">\n\n\t<span style=\"color: #00adbc; font-size: 150%\">1.</span> In Code Mode you can find <code>setProperty</code> in the UI Controls toolbox.<br>\n\n\t<span style=\"color: #00adbc; font-size: 150%\">2.</span> Choose the id of the UI element you want to change a property of\n</p>\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\">\n\n\t<span style=\"color: #00adbc; font-size: 150%\">3.</span> The pulldown menu shows a list of properties that you can set for that element. It matches the list of properties that you see for an element in <strong>Design Mode</strong>\n</p>\n\n<p style=\"break-after: always; -moz-column-break-after: always; -webkit-column-break-after: always;\">\n\n\t<span style=\"color: #00adbc; font-size: 150%\">4.</span> The last parameter is the value you want to set for that property. We're interested in background-color which has a variety of values you can give it.\n</p>\n\n\n</div>\n\n<img src=\"https://images.code.org/b7736bdcbde48f7951ebdc87135dd46c-image-1480536740764.png\" style=\"display: block; margin: auto\">\n\n\n## How to set the \"background-color\"\n\n<span style=\"color: #00adbc; font-size: 150%\">1.</span> *background-color* is a string (in quotes) that represents the color. Typically you state the color as a hex value or as three decimal RGB values like *\"rgb(255,0,0)\"*\n\n<img src=\"https://images.code.org/43291bf1c067145771bf88a147d74d26-image-1480538343306.png\" style=\"display: block; margin: auto\">\n"
    }
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/12": {
    "long_instructions": "# setProperty\n\n**Starter Code:** There is one call to `setProperty()` which sets the text-color to blue when you run the program.\n\nCan you add more calls to `setProperty()` that change other things about the text when you run the program? Try to change at least 3 more things."
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/13": {
    "long_instructions": "# setProperty image\n\n**Note:** This level starts in Design Mode.\n\nThere is an image element set up for you but it does not show when you leave Design Mode because it has not been told what image to display. \n\n-   Use the `setProperty()` command to set the image of the UI Image Element on the screen."
  },
  "https://studio.code.org/s/applab-2hour/lessons/4/levels/14": {
    "long_instructions": "# setProperty background-color\n\nChange the `background-color` of a button to a new random color each time it is clicked using `setProperty()`."
  }
}