---
title: <%= hoc_s(:title_how_to).inspect %>
layout: wide
nav: how_to_nav
---
<%= view :signup_button %>

# Πως να διδάξετε την Ώρα του Κώδικα σε τάξεις και ομάδες εκτός σχολικού ωραρίου

### Γίνετε μέλος του κινήματος και εισάγετε μια ομάδα μαθητών στην πρώτη τους ώρα Επιστήμης Υπολογιστών με αυτά τα βήματα. Η Ώρα του Κώδικα είναι εύκολο να υλοποιηθεί - ακόμα και για αρχάριους! Αν θα θέλατε επιπλέον βοήθεια, μπορείτε να βρείτε έναν [τοπικό εθελοντή](<%=resolve_url('https://code.org/volunteer/local')%>) για να σας βοηθήσει να πραγματοποιήσετε μια Ώρα Κώδικα στην τάξη ή την ομάδα σας εκτός σχολικού ωραρίου.

---

## 1) Παρακολουθήστε το επεξηγηματικό βίντεο <iframe width="500" height="255" src="//www.youtube.com/embed/SrnvvWDm73k" frameborder="0" allowfullscreen mark="crwd-mark"></iframe> 

## 2. Επιλέξτε έναν οδηγό εκμάθησης

Παρέχουμε ποικιλία διασκεδαστικών οδηγών εκμάθησης, διάρκειας μιας ώρας για συμμετέχοντες όλων των ηλικιών, που δημιουργήθηκαν από διάφορους συνεργάτες μας. [Δοκιμάστε τους!](<%= resolve_url('/learn') %>)

**Όλα τα εκπαιδευτικά μαθήματα της Ώρας του Κώδικα** δεν απαιτούν παρά ελάχιστο χρόνο προετοιμασίας από τους διοργανωτές και είναι αυτο-καθοδηγούμενα, επιτρέποντας στα παιδιά να δουλεύουν με ανάλογα με το ρυθμό που προτιμούν και με τις δικές τους δεξιότητες.

[![](/images/fit-700/tutorials.png)](<%= resolve_url('/learn') %>)

**Χρειάζεστε ένα σχέδιο μαθήματος για την Ώρα του Κώδικα;** Ρίξτε μια ματιά σε αυτό το [ πρότυπο](/files/AfterschoolEducatorLessonPlanOutline.docx)!

## 3. Προωθήστε τη δική σας Ώρα του Κώδικα

Προωθείστε τη δική σας ώρα του κώδικα [με αυτά τα εργαλεία](<%= resolve_url('/promote') %>) και ενθαρρύνεται και άλλους να φιλοξενήσουν τις δικές τους εκδηλώσεις.

## 4. Σχεδιάστε τις ανάγκες σας όσον αφορά τα τεχνολογικά μέσα που θα χρειαστείτε - η χρήση των υπολογιστών είναι προαιρετική

Για την καλύτερη εμπειρία στην Ώρα του Κώδικα απαιτούνται υπολογιστές που συνδέονται στο διαδίκτυο. Αλλά **δεν** χρειάζεστε υπολογιστή για κάθε συμμετέχοντα, και μπορείτε επίσης να κάνετε την Ώρα του Κώδικα ακόμη και χωρίς υπολογιστή.

Δοκιμάστε τους οδηγούς εκμάθησης στους υπολογιστές ή τις συσκευές. Βεβαιωθείτε ότι δουλεύουν σωστά στα προγράμματα περιήγησης με τον ήχο και τα βίντεο. **Έχεις αργή σύνδεση στο δίκτυο;** Δείξε τα βίντεο κεντρικά σε όλη την τάξη ώστε να μη χρειάζεται ο κάθε μαθητής να κατεβάζει το δικό του βίντεο. Ή δοκίμασε εκπαιδευτικούς οδηγούς που δεν απαιτούν σύνδεση στο διαδίκτυο. Ή δοκίμασε τους εκπαιδευτικούς οδηγούς που δουλεύουν χωρίς σύνδεση (offline).

Παρέχετε ακουστικά για την τάξη σας, ή ζητήστε από τους μαθητές να φέρουν μόνοι τους, αν το μάθημα που επιλέγετε λειτουργεί καλύτερα με ήχο.

**Δεν έχετε αρκετές συσκευές;** Χρησιμοποιήστε την τεχνική του [προγραμματισμού σε ζεύγη](https://www.youtube.com/watch?v=vgkahOzFH2Q). Όταν οι μαθητές συνεργάζονται, βοηθούν ο ένας τον άλλο και να βασίζονται λιγότερο στον εκπαιδευτικό. Καταλαβαίνουν επίσης ότι η Επιστήμη των Υπολογιστών είναι κοινωνική και συνεργατική.

## 5. Ξεκινήστε την δική σας Ώρα του Κώδικα με ένα εμπνευσμένο βίντεο

Ξεκινήστε την Ώρα του Κώδικα δίνοντας έμπνευση στους συμμετέχοντες και συζητώντας μαζί τους τον τρόπο με τον οποίο η επιστήμη των υπολογιστών επηρεάζει κάθε μέρος της ζωής μας.

**Δείξτε ένα βίντεο που να εμπνέει:**

- Το αρχικό βίντεο του Code.org, με τον Bill Gates, τον Mark Zuckerberg και τον παίχτη του ΝΒΑ Chris Bosh (Υπάρχουν εκδόσεις [1 λεπτού](https://www.youtube.com/watch?v=qYZF6oIZtfc), [5 λεπτών](https://www.youtube.com/watch?v=nKIu9yen5nc) και [9 λεπτών](https://www.youtube.com/watch?v=dU1xS07N-FA)).
- Το [διεθνές βίντεο για την Ώρα του Κώδικα](https://www.youtube.com/watch?v=KsOIlDT145A)
- [Ο Πρόεδρος Obama καλεί όλους τους μαθητές να ασχοληθούν με την επιστήμη των υπολογιστών](https://www.youtube.com/watch?v=6XvmhE1J9PY).
- Βρείτε περισσότερα εμπνευσμένα βίντεο [εδώ](https://www.youtube.com/playlist?list=PLzdnOPI1iJNfpD8i4Sx7U0y2MccnrNZuP).

**Δεν υπάρχει πρόβλημα αν είστε καινούργιος στην επιστήμη της πληροφορικής. Εδώ θα βρείτε μερικές ιδέες για να εισαγάγετε τη δραστηριότητά σας:**

- Εξηγήστε τρόπους με τους οποίους η τεχνολογία επηρεάζει τις ζωές μας, με παραδείγματα, που ενδιαφέρουν αγόρια και κορίτσια (μιλήστε για τις εφαρμογές και την τεχνολογία που σώζει ζωές, που βοηθά τους ανθρώπους, που συνδέει τους ανθρώπους).
- Κάντε μια λίστα με τα πράγματα που χρησιμοποιούν Κώδικα στην καθημερινή ζωή.
- Δείτε συμβουλές για να προκαλέσετε το ενδιαφέρον των κοριτσιών στην επιστήμη των υπολογιστών [εδώ](<%= resolve_url('https://code.org/girls') %>).

**Χρειάζεστε περισσότερη καθοδήγηση;** Κατεβάστε αυτό το [ πρότυπο σχέδιο μαθήματος](/files/AfterschoolEducatorLessonPlanOutline.docx).

## 6. Δημιουργήστε Κώδικα!

**Δώστε οδηγίες στους συμμετέχοντες** - Γράψτε στον πίνακα τον σύνδεσμο του εκπαιδευτικού οδηγού. Θα βρεις τον σύνδεσμο στις [πληροφορίες για τον επιλεγμένο οδηγό](http://code.org/learn) κάτω από τον αριθμό των συμμετεχόντων.

**Όταν κάποιος συναντά δυσκολίες μπορείτε απλώς να απαντήσετε:** - «Δεν ξέρω. Ας το ψάξουμε μαζί.» - «Η τεχνολογία δεν δουλεύει πάντα όπως θέλουμε εμείς.» - «Η εκμάθηση προγραμματισμού είναι όπως η εκμάθηση μιας νέας γλώσσας. Δεν τη μιλάς άνετα αμέσως.»

**Αν κάποιοι τελειώσουν νωρίτερα;** - Ενθαρρύνετέ τους να δοκιμάσουν άλλη δραστηριότητα Ώρας Κώδικα στη διεύθυνση [hourofcode.com/learn](<%= resolve_url('/learn') %>) - Ή ζητήστε τους να βοηθήσουν άλλους που μπορεί να δυσκολεύονται.

## 7. Γιορτάστε το

- [Τυπώστε πιστοποιητικά](<%= codeorg_url('/certificates') %>) για τους μαθητές σας.
- Εκτυπώστε αυτοκόλλητα για τους μαθητές σας.
- [Παραγγείλτε σχετικά t-shirts](http://blog.code.org/post/132608499493/hour-of-code-shirts-and-more) για τους συμμετέχοντες.
- Μοιραστείτε φωτογραφίες και βίντεο της εκδήλωσής σας στα μέσα κοινωνικής δικτύωσης. Χρησιμοποιήστε #HourOfCode και @codeorg, ώστε να μπορούμε να αναδείξουμε την επιτυχία σας επίσης!

## Άλλοι πόροι για την Ώρα του Κώδικα για εκπαιδευτικούς

- Δείτε [βέλτιστες πρακτικές](http://www.slideshare.net/TeachCode/hour-of-code-best-practices-for-successful-educators-51273466) από παλαιότερους διοργανωτές ώρας του Κώδικα.
- Παρακολουθήστε σε βίντεο το [webinar "Οδηγός Εκπαιδευτικών για την Ώρα του Κώδικα"](https://youtu.be/EJeMeSW2-Mw).
- Επισκεφθείτε το [ Φόρουμ της Ώρας του Κώδικα](http://forum.code.org/c/plc/hour-of-code) για να πάρετε συμβουλές, προτάσεις και υποστήριξη από άλλους διοργανωτές. <% if @country == 'us' %>
- Συμβουλευτείτε τη σελίδα [Συχνές ερωτήσεις για την Ώρα του Κώδικα](https://support.code.org/hc/en-us/categories/200147083-Hour-of-Code). <% end %>

## Τι γίνεται μετά την Ώρα του Κώδικα;

Η Ώρα του Κώδικα είναι μόνο το πρώτο βήμα σε ένα ταξίδι μάθησης σχετικά με το πώς λειτουργεί η τεχνολογία και πώς δημιουργούνται οι εφαρμογές λογισμικού. Βοηθήστε τους μαθητές να συνεχίσουν το ταξίδι τους και να [μάθουν ακόμα περισσότερα online](<%= codeorg_url('/learn/beyond') %>)!

<%= view :signup_button %>