---
title: '"Πώς να" οδηγός για τους γονείς'
---

# Πώς να υλοποιήσετε μια Ώρα του Κώδικα μαζί με το παιδί σας
Η Ώρα του Προγραμματισμού είναι ένας απλός και διασκεδαστικός τρόπος να γνωρίσει το παιδί σας την επιστήμη των υπολογιστών, ίσως και για πρωταρχική φορά- μια δοκιμή θα σας πείσει. Η επιστήμη των υπολογιστών όχι μόνο είναι θεμελιώδης σε όλα τα πεδία μελέτης, αλλά <a href="https://medium.com/@codeorg/cs-helps-students-outperform-in-school-college-and-workplace-66dd64a69536">πρόσφατες μελέτες καταδεικνύουν ότι </a>: παιδιά που μελετούν την επιστήμη των υπολογιστών αποδίδουν καλύτερα σε άλλα μαθήματα, είναι άριστοι στην επίλυση προβλημάτων, και είναι<font color="00adbc">17% πιο πιθανό να εγγραφούν σε κολέγιο</b></font>.

Μπορείς και εσύ να έρθεις στην παρέα των δεκάδων εκατομμυρίων μαθητών από όλον τον κόσμο σε αυτό το παγκόσμιο γεγονός. Μαζί, μπορούμε να εμπνεύσουμε τα παιδιά να μαθαίνουν, να σπάνε στερεότυπά, και να βοηθάμε τα παιδιά να ανακαλύπτουν ενδιαφέροντα που δεν είχαν ανακαλύψει πριν. Το καλύτερο από όλα, έχετε ήδη ό,τι χρειάζεστε για να φέρετε την Ώρα του Προγραμματισμού μέσα στο σπίτι σας!

[<img src="/images/fit-600/Marketing/mother-helping-her-daughter-use-a-laptop-4260325.jpg" />]({{ urls/learn }})

<h3>Τι χρειαζόμαστε για να ξεκινήσουμε;</h3>
Η Ώρα του Προγραμματισμού είναι απλή σε εκτέλεση - ακόμα και για αρχάριους. Δεν χρειάζεστε εμπειρία στην επιστήμη των υπολογιστών ή στην διδασκαλία προκειμένου να προσφέρετε μια διασκεδαστική δραστηριότητα στα παιδιά σας που θα τα κάνει και να μαθαίνουν και να γελάνε ταυτόχρονα.

Μπορείτε να δοκιμάσετε την Ώρα του Προγραμματισμού με έναν υπολογιστή, ένα τάμπλετ, ένα έξυπνο τηλέφωνο ή παντελώς χωρίς ρεύμα/βύσμα. Σας παραθέτουμε εδώ έναν τρόπο για να ξεκινήσετε.

***

## 1)Εξερευνήστε δραστηριότητες και εκπαιδευτικά βίντεο.

[<img src="/images/fit-600/tutorials.png" />]({{ urls/learn }})

Υπάρχουν πολλές<a href="https://hourofcode.com/us/learn">δραστηριότητες Ώρας του Προγραμματισμού</a>διαθέσιμες για εσάς που δουλεύετε με υπολογιστές με πρόσβαση στο διαδίκτυο. Σας ενθαρρύνουμε να ρίξετε μια ματιά σε κάποιες από τις επιλογές που διαθέτουμε για εσάς προκαταβολικά έτσι ώστε να μπορείτε να οδηγήσετε το παιδί σας προς τις ασκήσεις που θα απολαμβάνει.

Όλες οι δραστηριότητες που διαθέτουμε συνδυάζουν την επίλυση προβλημάτων και την κριτική σκέψη με διασκέδαση και δημιουργικότητα, αλλά σας παραθέτουμε εδώ κάποιες από τις αγαπημένες δραστηριότητες των μαθητών:

- Για παιδιά που τους αρέσει να παίζουν:<a href="https://code.org/minecraft">Ναρκαλιευτής</a> ή <a href="https://code.org/dance">Πάρτι Χορού</a>
- Για τα παιδιά που τους αρέσει ο Ντίσνεϊ:<a href="https://code.org/starwars">Ο Πόλεμος των Άστρων</a><a href="https://studio.code.org/s/frozen/stage/1/puzzle/1">Ψυχρά και Ανάποδα</a> ή <a href="https://partners.disney.com/hour-of-code?cds&cmp=vanity%7Cnatural%7Cus%7Cmoanahoc%7C">Μοάνα</a>
- Για το παιδί που του αρέσει να μαθαίνει:<a href="https://code.org/oceans">Al για τους Ωκεανούς<a href="https://scratch.mit.edu/projects/editor/?tutorial=music&utm_source=codeorg">Φτιάξτε Μουσική από το μηδέν</a></li> </ul> 
  
  <p spaces-before="0">
    

<h3>Περιορισμένη ή καθόλου τεχνολογία;</h3>
Αν θα χρησιμοποιείτε περιορισμένη ή και καθόλου τεχνολογία, μπορείτε να φιλτράρετε<a href="https://hourofcode.com/us/learn">δραστηριότητες της Ώρας του Προγραμματισμού</a> επιλέγοντας "Καθόλου υπολογιστές ή συσκευές" στην ενότητα <em>τεχνολογία τάξης</em>.
  </p>
  
  <p spaces-before="0">
    <a href="{{ urls/learn }}"><img src="/images/fit-500/Marketing/filtering-activities-hoc.jpg" /></a>
  </p>
  
  <p spaces-before="0">
    Μπορείτε επίσης να ρίξετε μια ματιά σε αυτά τα<a href="https://www.youtube.com/playlist?list=PLzdnOPI1iJNcpfa4LtbaIl35gqir_5XUu"> σύντομα βίντεο</a>για περισσότερες ιδέες διευκόλυνσης μιας δραστηριότητας χωρίς τη χρήση ρεύματος/βύσματος στο σπίτι!
  </p>

<h2 spaces-before="0">
  2) Ετοιμαστείτε από πριν
</h2>

<p spaces-before="0">
  Τώρα που έχετε κάποια εκπαιδευτικά βίντεο στο μυαλό σας, μπορεί να σας βοηθήσει αν δοκιμάσετε αυτές τις δραστηριότητες στην συσκευή σας πριν φέρετε το παιδί σας σε επαφή με αυτές.
</p>

<p spaces-before="0">
  <a href="{{ urls/learn }}"><img src="/images/fit-600/Marketing/father-and-children-looking-at-a-laptop-4260749.jpg" /></a>
</p>

<p spaces-before="0">
  

<h3>Πάνω από ένα παιδί στο σπίτι;</h3>
Αναλογιστείτε να παρέχετε σε κάθε ένα από τα παιδιά σας με ακουστικά κεφαλής αν θα δουλεύουν σε ξεχωριστές συσκευές. Κατά αυτόν τον τρόπο, θα μπορούν να ασχολούνται παίζοντας με τις δραστηριότητες χωρίς να αποσπάται η προσοχή του ενός από το άλλο.
</p>

<p spaces-before="0">
  Αν θα χρησιμοποιείτε μόνο μια συσκευή, ή απλώς θέλετε να κάνετε την Ώρα του Προγραμματισμού που διαθέτετε πιο διαδραστική, δοκιμάστε<a href="https://www.youtube.com/watch?v=vgkahOzFH2Q">τον προγραμματισμό σε ζεύγη</a>. Ο προγραμματισμός σε ζεύγη ενθαρρύνει τα παιδιά να δουλεύουν μαζί. Όταν συνεργάζονται, αλληλοβοηθούνται στην επίλυση προβλημάτων. Καταλαβαίνουν επίσης ότι η Επιστήμη των Υπολογιστών είναι κοινωνική και συνεργατική.
</p>

<p spaces-before="0">
  

<h3>Κάντε τα παιδιά να ενθουσιαστούν! </h3>
Αυτή είναι μια καλή ευκαιρία να προσθέσετε ένα νέο τύπο δραστηριότητας στην ημέρα του παιδιού σας. Μπορείτε να επεκτείνετε την διασκέδαση πέραν από ένα εκπαιδευτικό βίντεο με αυτές τις προτάσεις:
</p>

<ul>
  <li>
    Δείξτε τους ένα<a href="https://www.youtube.com/playlist?list=PLzdnOPI1iJNcadqJAZnbDYShie4gLZQQJ">εμπνευσμένο βίντεο που θα τα εμπνεύσει</a>στο οποίο συμμετέχει ένα από τα αγαπημένα τους πρότυπα προς μίμηση
  </li>
  <li>
    Εμπνεύστε τους με ένα βίντεο σε μία από τις<a href="https://www.youtube.com/playlist?list=PLzdnOPI1iJNfpD8i4Sx7U0y2MccnrNZuP">πολλές σταδιοδρομίες</a>που μπορούν να οδηγήσουν οι δεξιότητες στην επιστήμη των υπολογιστών
  </li>
  <li>
    <a href="https://store.code.org/">Παραγγείλετε κάποια επώνυμα προϊόντα που φέρουν το εμπορικό μας σήμα</a>! Μπορείτε να επιλέξετε από μπλουζάκια, αυτοκόλλητα, ή ακόμα και προσωρινά τατουάζ. Μοιραστείτε αμέσως μαζί τους ό,τι και αν πάρετε για να τα κάνετε να ενθουσιαστούν, ή φυλάξτε ό,τι και αν πάρετε για το τέλος της Ώρας του Προγραμματισμού για να πάρει τη μορφή ενός ξεχωριστού βραβείου.
  </li>
</ul>

<a href="https://store.code.org/" target="_blank"><img src="/images/fit-500/Marketing/hourofcodestore.jpg"></a>

<h2 spaces-before="0">
  3)Κολπάκια για να φέρετε σε επαφή το παιδί σας με την Επιστήμη των Υπολογιστών
</h2>

<p spaces-before="0">
  Δεν πειράζει αν και εσείς και το παιδί σας είστε παντελώς ανίδεοι αναφορικά με την επιστήμη των υπολογιστών. Σας παραθέτουμε εδώ κάποιες ιδέες για να γνωρίσετε την δική σας δραστηριότητα της Ώρα του Προγραμματισμού και να σας βάλει και τους δύο σε σκέψεις γύρω από την επιστήμη των υπολογιστών:
</p>

<ul>
  <li>
    Να εξηγείτε τους τρόπους με τους οποίους η τεχνολογία επηρεάζει την ζωή μας, με συγκεκριμένα παραδείγματα που μπορεί να κινήσουν το ενδιαφέρον των παιδιών σας. Για παράδειγμα, μπορείτε να μιλήσετε για την ιατρική ή την εικονική σύνδεση ανθρώπων. Επίσης, ρίξτε μια ματιά <a href="https://code.org/csforgood">(στον Οργανισμό Προγραμματισμού)Code.org/CSforGood</a> για προτεινόμενες ερωτήσεις συζήτησης.
  </li>
  <li>
    Μαζί, απαριθμήστε καθημερινά πράγματα που χρησιμοποιούν προγραμματισμό προκειμένου να λειτουργήσουν κατάλληλα.
  </li>
</ul>

<p spaces-before="0">
  <a href="{{ urls/learn }}"><img src="/images/fit-600/Marketing/girl-sitting-on-sofa-while-using-tablet-computer-4144035.jpg" /></a>
</p>

<p spaces-before="0">
  

<h3>Έχετε κορίτσια στο σπίτι;</h3>
<a href="https://code.org/girls">Σας παραθέτουμε εδώ τις προτάσεις μας</a>για να κινήσουμε το ενδιαφέρον τους στην επιστήμη των υπολογιστών. <strong x-id="1">Μια συμβουλή από επαγγελματίες</strong>:Μπορείτε να αρχίσετε λέγοντάς τους ότι θα είναι καταπληκτικοί σε αυτήν την δραστηριότητα!
</p>

<p spaces-before="0">
  

<h3>Επιλύστε προβλήματα μαζί</h3>
Τέλος, όταν το παιδί σας συναντήσει δυσκολίες, μπορούμε κάλλιστα να του αποκριθούμε:
</p>

<ul>
  <li>
    “I don’t know. Let’s figure this out together.”
  </li>
  <li>
    «Η Τεχνολογία δεν λειτουργεί πάντα με τον τρόπο που θέλουμε.»
  </li>
  <li>
    «Η εκμάθηση προγραμματισμού είναι όπως η εκμάθηση μιας νέας γλώσσας. Δεν τη μιλάς άνετα αμέσως."
  </li>
</ul>

<p spaces-before="0">
  Η επιστήμη των υπολογιστών περιστρέφεται γύρω από την εκμάθηση "διόρθωσης" καταστάσεων που δεν τελείωσαν με τον τρόπο που σκεφτόμασταν ότι θα τελείωναν.  Μαζί, εσείς και το παιδί σας μπορείτε να σκεφτείτε δημιουργικούς τρόπους για να επιλύσετε το πρόβλημα!
</p>


<h2 spaces-before="0">
  4) Μην ξεχάσατε να γιορτάσετε!
</h2>

<p spaces-before="0">
  Η Ώρα του Προγραμματισμού είναι μια παγκόσμια εκδήλωση, και η οικογένεια σας αξίζει να το γιορτάσει. Σας παραθέτουμε εδώ κάποιους τρόπους να κάνετε την δική σας Ώρα του Προγραμματισμού εξαιρετικά διαφορετική:
</p>

<ul>
  <li>
    Τυπώστε<a href="https://staging.code.org/certificates">Πιστοποιητικά της Ώρας του Προγραμματισμού</a>που θα τα απονέμετε όταν το παιδί σας ολοκληρώσει την δραστηριότητά του
  </li>
  <li>
    <a href="https://staging.hourofcode.com/us/promote/resources#stickers">Τυπώστε αυτοκόλλητα</a>στο σπίτι ή<a href="https://store.code.org/">αγοράστε τα διαδικτυακά</a>, ως μια επιπρόσθετη έκπληξη.
  </li>
  <li>
    Μοιραστείτε φωτογραφίες και βίντεο στα μέσα κοινωνικής δικτύωσης από την δική σας "σπιτική" Ώρα του Προγραμματισμού. Use #HourOfCode and @codeorg so we can highlight your success, too!
  </li>
</ul>

<p spaces-before="0">
  <a href="{{ urls/learn }}"><img src="/images/fit-600/Marketing/g8TUlHzF.jpeg" /></a>
</p>

<h2>Τι γίνεται μετά την Ώρα του Κώδικα;</h2>

<p spaces-before="0">
  Computer science doesn’t have to end with the Hour of Code! Ενώ 90% των γονέων θέλουν το παιδί τους να μάθει επιστήμη υπολογιστών, μολαταύτα τα περισσότερα σχολεία δεν την διδάσκουν ακόμη. Tο σχολικό πρόγραμμα είναι βασισμένο πάνω στον Παγκόσμιο Ιστό (Web) και η χρήση του είναι δωρεάν, για πάντα, ως μια βοήθεια. <a href="https://code.org/yourschool">Μάθετε τον τρόπο με τον οποίο</a>να φέρετε την επιστήμη των υπολογιστών στο σχολείο του παιδιού σας σήμερα.
</p>