---
title: Πως-να-το-κάνω οδηγός για εθελοντές Κώδικα
layout: wide
nav: how_to_nav
---

{{ signup_button }}

# Οδηγός για εθελοντές

### Κάντε τη διαφορά στην τάξη σήμερα!

* * *

## Γιατί να γίνω εθελοντής;

Διαβάστε μερικές εμπειρίες προηγούμενων εθελοντών:

- "Το καλύτερο κομμάτι της εμπειρίας μου ήταν πως όλη η τάξη ήταν έγχρωμα κορίτσια. Αυτό δένει με το μέλλον του τομέα ώστε να υπάρχει η δυνατότητα να εντοπίσουν και να κινήσουν των ενδιαφέρων αυτών των παιδιών."
- "Χάρηκα ιδιαίτερα που μου δόθηκε η ευκαιρία να ενθαρρύνω τα νέα κορίτσια προς την τεχνολογία. Αισθάνθηκα πως βοήθησα την νέα γενιά στην περιοχή μου."
- "ΛΑΤΡΕΨΑ το πόσο ενθουσιασμένα ήταν τα παιδιά. Ήταν καταπληκτικό πως οι δάσκαλοι παρατηρούσαν πως κάποιοι μαθητές, οι οποίοι δεν απέδιδαν ιδιαίτερα καλά στα σχολικά μαθήματα, ήταν πολύ καλοί στον τρόπο σκέψης του προγραμματισμού και στο να βοηθούν τους άλλους να μάθουν - δίνοντάς τους μια ευκαιρία να νιώσουν αυτοπεποίθηση."

## Όλοι μπορούν να γίνουν εθελοντές

### Εθελοντές και ομιλητές στην τεχνολογία:

Έχετε επαφή με την επιστήμη των υπολογιστών ή την τεχνολογια; Εάν εργάζεστε ως μηχανικός υπολογιστών, σε μια εταιρεία τεχνολογίας σε οποιοδήποτε θέση (μηχανικός ή μη-μηχανικός), ή αν έχετε ακολουθήσει μαθήματα επιστήμης των υπολογιστών, μπορείτε να βοηθήσετε να εμπνευσθούν οι μαθητές! Πολλοί μαθητές δεν έχουν γνωρίσει ποτέ κάποιον που δουλεύει στον τομέα της τεχνολογίας και οι δάσκαλοί μας χαίρονται ιδιαίτερα να φέρνουν σε επαφή τις τάξεις τους με επαγγελματίες και φοιτητές.

Μπορείτε να συμμετάσχετε ως ομιλητής σε μια τάξη, ή να βοηθήσετε έναν δάσκαλο σε ενα μάθημα. Επισκεφθείτε μια τοπική τάξη και εμπνεύστε τους μαθητές να συνεχίσουν να μαθαίνουν επιστήμη των υπολογιστών. <br /> <br />

<a href="https://code.org/volunteer"><button>Εγγραφείτε σήμερα ως εθελοντής τεχνολογίας!</button> <br /> <br /></p> 

<h3>
  Οποιοσδήποτε έχει πάθος για μάθηση:
</h3>

<p>
  Πιστεύετε πως η εκμάθηση της επιστήμης των υπολογιστών μπορεί να ανοίξει νέες πόρτες στους μαθητές; Βοηθήστε μια τοπική τάξη να διοργανώση μια εκδήλωση μετά το σχολείο! Δεν χρειάζεται να έχετε προηγούμενες γνώσεις στην επιστήμη των υπολγιστών για να διοργανώσετε μια Ώρα του Κώδικα. Συχνά αρκεί το να βοηθήσετε στο να πείσετε τον δάσκαλο του παιδιού σας, έναν φίλο ή μια οργάνωση να δοκιμάσουν την Ώρα του Κώδικα.
</p>

<h3>
  Πώς μπορείτε να ξεκινήσετε;
</h3>

<ol>
  <li>
    <a href="{{ promote/help_schools }}">Στείλτε αυτό το μήνυμα</a> στον δάσκαλο του παιδιού σας, προσφέροντας βοήθεια στο να διοργανώσουν την Ώρα του Κώδικα.
  </li>
  
  <li>
    Προσφερθείτε να διοργανώσετε μια εκδήλωση της Ώρας του Κώδικα μετά το σχολείο σε ενα τοπικό σχολείο. <a href="{{ urls/how_to_guide }}">Χρησιμοποιήστε αυτό τον οδηγό</a> για τα βήματα για την οργάνωση.
  </li>
</ol>

<h2>
  Παρακινήστε τους συναδέλφους σας να γίνουν εθελοντές
</h2>

<p>
  Ενημερώστε τους φίλους και συναδέλφους σας σχετικά με την Ώρα του Κώδικα. Χιλιάδες δάσκαλοι αναζητούν εθελοντές, επομένως ζητήστε τους να <a href="https://code.org/volunteer">εγγραφούν ως εθελοντές</a>. Ζητήστε από τον εργοδότη σας να συμμετάσχει. <a href="{{ promote/sample_emails }}">Στείλτε αυτό το μήνυμα</a> στον υφιστάμενο ή διευθυντή σας ώστε να τους παρακινήσετε όλους.
</p>

<h2>
  Πως να προετοιμαστείτε
</h2>

<ul>
  <li>
    <a href="{{ promote/videos }}">Επιλέξτε ένα βίντεο</a> για να προβάλλετε, ώστε να βοηθήσετε την τάξη να συγκεντρωθεί και να ενθουσιαστεί για την Ώρα του Κώδικα.
  </li>
  <li>
    Δείτε <a href="/files/hoc-volunteer-toolkit.pdf">το Εγχειρίδιο Εθελοντών στην Ώρα του Κώδικα</a> που περιλαμβάνει περίληψη, χρονοδιάγραμμα, υλικό προετοιμασίας και διαφήμισης. Όλα όσα χρειάζεστε για να είστε έτοιμοι για την εθελοντική εμπειρία σας!
  </li>
  <li>
    Εάν πρόκειται να κάνετε μια άσκηση, αφιερώστε τουλάχιστον 30 λεπτά ώστε να δοκιμάσετε τουλάχιστον ένα <a href="{{ urls/learn }}">μάθημα της Ώρας του Κώδικα</a>.
  </li>
  <li>
    Αν θα επισκεφτείτε ένα σχολείο, ολοκληρώστε οποιοδήποτε προηγούμενο ελέγχο ή την απαραίτητη γραφική εργασία.
  </li>
  <li>
    <a href="https://code.org/files/CSTT_Volunteers.pdf"> Διαβάστε αυτές τις συμβουλές</a> για το πώς να αλληλεπιδράσετε με τους μαθητές.
  </li>
  <li>
    Συμμετέχετε σε μια συζήτηση στο Fb, Twitter, Instagram και Tumblr με #HourOfCode.
  </li>
  <li>
    Επικοινωνήστε με τον δάσκαλο για να συζητήσετε τι σκοπεύετε να αναφέρετε κατά τη διάρκεια της παρουσίας σας.
  </li>
  <li>
    Εάν είστε εθελοντής μέσω βιντεοκλήσης, δοκιμάστε εκ των προτέρων τον ήχο, την εικόνα και την δυνατότητά σας να μοιράζεστε την οθόνη σας κατά τη διάρκεια της κλήσης.
  </li>
</ul>

<h2>
  Εκδήλωση Ώρας του Κώδικα
</h2>

<p>
  Κατά τη διάρκεια της εκδήλωσης της Ώρας του Κώδικα, ακολουθήστε το παρακάτω παράδειγμα προγράμματος για την ημέρα. Πριν την αρχή της εκδήλωσης, ενημερώστε το σχολείο για την άφιξή σας και συναντήστε τον δάσκαλο. Επιβεβαιώστε το πρόγραμμα της ημέρας και συζητήστε οποιαδήποτε θέματα της ομιλίας.
</p>

<h3>
  Παράδειγμα προγράμματος:
</h3>

<table>
  <tr>
    <th>
      Ώρα
    </th>
    
    <th>
      Πρόγραμμα
    </th>
  </tr>
  
  <tr>
    <td>
      1-5 λεπτά
    </td>
    
    <td>
      <a href="{{ promote/videos }}">Προβάλλετε ένα εμπνευσμένο βίντεο</a>.
    </td>
  </tr>
  
  <tr>
    <td>
      5-10 λεπτά
    </td>
    
    <td>
      Συστηθείτε στους μαθητές και μάθετε περισσότερα γι αυτούς: </ul>
      
      <li>
        Τι δουλειά κάνετε, τι αρμοδιότητες έχετε και τι σας αρέσει περισσότερο στη δουλειά σας;
      </li>
      
      <li>
        Τι ή ποιος σας ενέπνευσε;
      </li>
      
      <li>
        Πώς γεννήθηκε το ενδιαφέρον σας στην επιστήμη των υπολογιστών;
      </li>
      
      <li>
        Είχατε κάποιον μέντορα;
      </li>
      
      <li>
        Μοιραστείτε μια ιστορία σχετικά με το πώς η τεχνολογία επηρεάζει τους πάντες.
      </li>
      
      <br />Ρωτήστε τους μαθητές ερωτήσεις και αφήστε χρόνο για δικές τους ερωτήσεις.</br> 
      
      <li>
        Τι επαγγέλματα τους ενδιαφέρουν, ποιες είναι οι αγαπημένες τους εφαρμογές και πως πιστεύουν πως δημιουργήθηκαν;
      </li>
      
      <li>
        Έχουν ερωτήσεις για εσάς οι μαθητές;</ul></td> </tr> <tr>
          <td>
            30 - 60 λεπτά
          </td>
          
          <td>
            <strong>Προγραμματίστε!</strong> Κινηθείτε μέσα στην τάξη, απαντήστε ερωτήσεις και καθοδηγήστε τους μαθητές στις δύσκολες ασκήσεις. Προσπαθήστε να μη δίνετε κατευθείαν τη λύση στους μαθητές αλλά να τους κάνετε ερωτήσεις ώστε να αναρωτηθούν τι πήγε λάθος και ενθαρρύντε τους να ρωτάνε ο ένας τον άλλον εάν έχουν απορίες. Το να μάθουν ο ένας από τον άλλον είναι ένας σπουδαίος τρόπος μάθησης.
          </td>
        </tr>
        
        <tr>
          <td>
            1-3 λεπτά
          </td>
          
          <td>
            Ευχαριστήστε όλους και μοιραστείτε κάποιες λέξεις για κλείσιμο. Μοιράστε υλικό της εταιρείας σας (τα αυτοκόλλητα είναι υπέροχα)!
          </td>
        </tr>
        
        <tr>
          <td>
            Μετά το κλείσιμο
          </td>
          
          <td>
            <strong>Κάντε μια αλλαγή που διαρκεί:</strong> Μιλήστε με τον δάσκαλα σχετικά με την εξέλιξη της Ώρας του Κώδικα σε ένα ολοκληρωμένο μάθημα επιστήμης υπολογιστών! Επισκεφθείτε τον ιστότοπο <a href="https://code.org/yourschool">code.org/yourschool</a> μαζί με τον δάσκαλο και συμπληρώστε τι διδάσκει το σχολείο σήμερα και ενθαρρύντε τους να δεσμευθούν να φέρουν την επιστήμη των υπολογιστών στην τάξη τους.
          </td>
        </tr></tbody> </table> 
        
        <h3>
          Μετά την εκδήλωση:
        </h3>
        <ul>
          <li>
            Μοιραστείτε τις φωτογραφίες και ιστορίες σας με την Code.org μέσω του giving@code.org.
          </li>
          <li>
            Remember to enter in your volunteer hours in your company’s volunteer tracking portal.
          </li>
          <li>
            Μοιραστείτε την εμπειρία σας στα μέσα κοινωνικής δικτύωσης #HourOfCode!
          </li>
          <li>
            Εάν βγάλετε φωτογραφίες/βίντεο κατά τη διάρκεια της εκδήλωσης, <strong>κυρίως με μαθητές</strong>, βεβαιωθείτε πως έχετε την έγκριση του δασκάλου/γονέα σε περίπτωση που θελήσετε να αναρτήσετε τις ιστορίες σας στα μέσα κοινωνικής δικτύωσης.
          </li>
          <li>
            Τέλος, επικοινωνήστε ξανά σε ένα μήνα: Ενδιαφέρεται ο δάσκαλος να διδάξει ένα μάθημα επιστήμης υπολογιστών; Μοιραστείτε <a href="https://code.org/yourschool">υλικό και δυνατότητες επαγγελματικής κατάρτισης για να τους βοηθήσετε</a>.
          </li>
        </ul>
        <h2>
          Πώς επιλέγεστε ως τεχνικός εθελοντής ή ομιλητής
        </h2>
        <ul>
          <li>
            Οι εκπαιδευτικοί θα αναζητούν για εθελοντές στο <a href="/volunteer/local"> χάρτη εθελοντών </a>.
          </li>
          <li>
            Προσπαθήστε να έχετε όσο το δυνατόν πιο ολοκληρωμένο προφίλ, ώστε να αυξήσετε τις πιθανότητες να σας διαλέξει ένας δάσκαλος.
          </li>
          <li>
            Ο δάσκαλος θα επικοινωνήσει μαζί σας μέσω αυτής της φόρμας (η διεύθυνση του ηλεκτρονικού ταχυδρομείου σας δεν θα είναι ποτέ διαθέσιμη στον δάσκαλο). <em>Εάν δέχεστε πολλά αιτήματα από δασκάλους, μπορείτε να αλλάξετε τις προτιμήσεις σας πατώντας το λινκ για αλλαγή των πληροφοριών σας ή για διαγραφή από τη λίστα που βρίσκεται στο τέλος κάθε μηνύματος από τον δάσκαλο.</em>
          </li>
        </ul>
        <h2>
          Συχνές ερωτήσεις σχετικά με τον εθελοντισμό για την Ώρα του Κώδικα
        </h2>
        <h3>
          Δεν έχει επικοινωνήσει μαζί μου κανένας δάσκαλος. Πώς μπορώ να βοηθήσω αλλιώς;
        </h3>
        <p>
          Προσπαθήστε να αναζητήσετε τοπικά σχολεία και τηλεφωνήστε στον διευθυντή/δάσκαλο/γραμματέα και ρωτήστε τους πως μπορείτε να βοηθήσετε.
        </p>
        <h3>
          Πόσο διαρκεί μια επίσκεψη στην τάξη;
        </h3>
        <p>
          Μια επίσκεψη στην τάξη διαρκεί συνήθως 60-90 λεπτά, ενώ μια βιντεοκλήση διαρκεί συνήθως 20-30 λεπτά.
        </p>
        <h3>
          Για τι ηλικίες είναι κατάλληλη η Ώρα του Κώδικα;
        </h3>
        <p>
          Η Code.org και οι συνεργάτες μας σχεδιάζουν όλες τις δραστηριότητες της Ώρας του Κώδικα με σκοπό να απευθυνθούν σε μαθητές όλων των τάξεων (Κ-12), αγόρια και κορίτσια, από οποιοδήποτε υπόβαθρο. Όλοι, ακόμα και ενήλικοι, μπορούν να διασκεδάσουν παίζοντας!
        </p>
        <p>
          {{ signup_button }}
        </p>