{
  "key": "formatting-html",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-coding",
  "parent_reference_guide_key": "html",
  "display_name": "Formatting HTML",
  "content": "When you write your web page, you should organize your code in a way that makes it easier to read.  This is called **formatting**.  When you format your code, you'll have an easier time finding and fixing bugs.\r\n\r\n## Whitespace\r\n\r\nWhitespace refers to any character that shows up as a blank space on the screen, such as a space, a tab, or a new line. Whitespace helps separate different parts of the document to make it easier to read. For example, in HTML code new elements are usually put on a new line, even though it doesn't make any difference in how the page is displayed.\r\n\r\nFor example, compare the code in the two boxes below.\r\n\r\n<pre >\r\n&lt;body&gt;\r\n   &lt;h1&gt;Here's my list&lt;/h1&gt;\r\n   &lt;ol&gt;\r\n      &lt;li&gt;Item 1&lt;/li&gt;\r\n      &lt;li&gt;Item 2&lt;/li&gt;\r\n   &lt;/ol&gt;\r\n&lt;/body&gt;\r\n</pre>\r\n<pre>\r\n&lt;body&gt;&lt;h1&gt;Here's my list&lt;/h1&gt;&lt;ol&gt;&lt;li&gt;Item 1&lt;/li&gt;&lt;li&gt;Item 2&lt;/li&gt;&lt;/ol&gt;&lt;/body&gt;\r\n</pre>\r\n\r\nBoth will display the same web page, but the code in the top box is much easier to read.  It's best to start off new elements in a new line.\r\n\r\n## Indentation\r\nA very common type of formatting in HTML is **indentation**.  Indentation is the placement of text farther to the right, or left, to separate it from surrounding text. Indentation helps to convey the program's structure. In HTML, elements that are inside other elements are usually indented. \r\n\r\nHere is an example:\r\n\r\n<pre>\r\n   &lt;body&gt;\r\n      &lt;p&gt;This paragraph is inside the \"body\" element.&lt;/p&gt;\r\n   &lt;/body&gt;\r\n</pre>\r\n\r\nIndentation can help you remember whether or not you've closed a tag, and it also makes it clear which tags are inside others.  \r\n\r\n## Commenting\r\n\r\nAs your web pages get more complicated, you'll want to use **comments**.  Comments explain the different parts of the code and what it should create.  Comments can help you to debug, and will also help other people who are trying to understand your code.\r\n\r\n<pre>\r\n&lt;!-- this is a comment --&gt;\r\n</pre>",
  "position": 8
}