{
  "key": "hyperlinks",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-coding",
  "parent_reference_guide_key": "html",
  "display_name": "Hyperlinks",
  "content": "Hyperlinks can connect to local web pages or external web pages. To add navigation to your website you will need to add hyperlinks which connect your individual web pages. You can **add hyperlinks to your web page using the `<a>` element**. The text you want to display as the hyperlink goes between the opening and closing hyperlink tags. The `<a>` element has an attribute `href` which is the location to link to. The location of a local page is just the file path for that page. \n\n## Using Hyperlinks\n\nAssuming you have a website that includes a second page with the filename `houses.html`, you could create a link to that page like this:\n\n<img alt=\"Link to houses html\" src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/a_tag.png\" class=\"center\" style=\"max-width: 600px; margin: 20px auto;\">\n\n[diagram_nums]\n\n1. The `<a>` tag wraps the text that you want to turn into a clickable link. _A_ is short for _anchor_.\n2. The `href` attribute, short for _hypertext reference_, determines where your link should go to. In this case, `houses.html`.\n3. The closing tag ends your link.\n\n[/diagram_nums]\n\n## FAQ\n\n1) **What are good rules for naming links?**\n   - Link names should make it easy for the user to know where they are going. Some good rules are:\n      1) Give the link a good description that makes sense even without reading all the text around it. For example, \"go here\" or \"learn more\" don't tell you where you are going or what you are learning.\n      2) Give a link name in regular text, rather than just repeating the URL in the link name. For example, \"Home\" or \"Home Page\" is easier to read than \"index.html\".\n      3) Don't link too much text. Readers will not understand specifically what the link is about.\n2) **How do I make external links?**\n   - Put the entire url (including \"http://\") into the **href attribute** of the `<a>` tag, like this:\n```\n<a href=\"https://www.google.com\">Click me to go to Google</a>\n```\n3) **How do I find the URL for a website?**\n   - Go to whatever website you want to link to and copy the text in the address bar (e.g. \"https://www.google.com\" for Google). Then you can use that address for your own links.\n\n**W3 Schools Link**\n\n* [&lt;a&gt;](https://www.w3schools.com/tags/tag_a.asp)",
  "position": 6
}