{
  "key": "images-in-html",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-coding",
  "parent_reference_guide_key": "html",
  "display_name": "Images in HTML",
  "content": "The _image_ tag allows you to add images to your page. You might notice that this tag looks a little different than those you've seen before. Unlike paragraph, header, or list tags, the image tag _doesn't require a closing tag_. All of the information needed to display your image is contained within the tag itself.\n\n## Image Source and Alternate Text\n\nIn order to tell the browser which file to use, extra information, called an attribute, is added to the image tag inside the brackets. The attribute **src** stands for source and tells the name of the image, and the attribute **alt** describes the image.\n\n<img src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/img_tag.png\" class=\"center\" style=\"max-width: 500px; margin-top: 20px; margin-bottom: 20px;\"/>\n\n[diagram_nums]\n\n1. Create an image tag using the abbreviation **img**. This is considered a _self closing_ tag, since it doesn't need to wrap text as many other tags do. \n2. The **src** attribute is short for **source**. This tells the tag which image to load. In this case, the page will look for an image with the filename `dog.jpg` in the same directory as the page. Image file names include extensions that tell the computer which type of image they are working with. Common extensions are `.jpg`, `.jpeg`, and `.png`. Make sure to put quotation marks around your image filename. \n3. The **alt** attribute is short for **alternative text**. While you won't see this text on your web page, it provides a backup in case your image doesn't download properly or for visually impaired users. In this example, if your browser failed to load the image you would see <img src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/broken_image.png\" style=\"height: 50px;\">\n\n\n[/diagram_nums]\n\n## FAQ\n\n1) **Why does an image tag not have a closing tag?**\n   - An image tag doesn't need a closing tag because there is no text content that must be wrapped in tags. The content that shows on the screen is specified through the tag attributes.\n2) **What is an attribute?**\n   - Attributes are extra information included in a tag. Attributes have **names** and **values**. The **name** tells what type of information is being provided and then the **value** gives the specific information for that tag.\n   - For example `<img>` tags have two attributes, **src** and **alt**. The **src** attribute specifies the name of the image file and **alt** tells the browser in readable text what the image is.\n3) **Do I need to include a `/` at the end of an image tag?**\n   - You do not have to include the slash but you might see this in the HTML code for some webpages or even in our Web Lab tool because it is a remnant of pre-HTML5. Both versions of the `<img>` tag (with and without a `/` ) are technically accepted and can be read by HTML5.\n\n\n**W3 Schools Links**\n\n* [&lt;img&gt;](https://www.w3schools.com/tags/tag_img.asp)",
  "position": 4
}