{
  "key": "microbit-circuits-leds",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-coding",
  "parent_reference_guide_key": "microbit-parent",
  "display_name": "External LEDs on a micro:bit",
  "content": "<img src=\"https://images.code.org/766895a5debf8fcb1e2552ff47f94c18-Micro_bit Circuits and LEDs.png\" style=\"width: 350px; float: right; margin: 10px\" />\n\nOn the bottom edge of the micro:bit there are 5 gold strips called pins. These pins allow you to create circuits, or connect external things like LEDs or buttons.\n\n- The **Input/Output Pins** on the micro:bit are “0”, “1”, and “2.” These allow you to connect LEDs or buttons. \n- The **\"3V\" pin** is the 3 volt power pin that you can use to power external LEDs and other electronics.\n- The **GND pin** is the ground pin. It’s used to complete electrical circuits when you connect headphones, LEDs, or external switches to the micro:bit.\n\n\nUsing the numbered pins on the micro:bit, you can create circuits of your own that include external components, such as LEDs and buttons. The specifics of how a circuit gets wired depends on the specific hardware you're trying to add, but all circuits will use some combinations of a 3 volt power pin (which provide power), a ground pin (which is the end point of a circuit), and numbered data pins (which can either send an output signal, or read an input). \n\n<div style=\"clear:both;\"></div>\n\n<img src=\"https://images.code.org/be63617cd479aabe4351a8d07abe1d00-microbit-led.png\" style=\"width: 300px; float: right; margin: 10px\" />\n\n## Creating LED Circuits\n\nOne of the simplest circuits that you can make with your micro:bit is to add an LED. To create this circuit you'll need a numbered pin, two wires, an LED, and a ground pin.\n\n1. Make sure your micro:bit is unplugged from the computer. This helps make sure there isn't any accidental electricity that can damage your board.\n2. Attach a wire so one end is connected to the 0 pad on the micro:bit, and the other end is connected to the positive end of an LED\n3. Attach a wire so one end is connected to the GND pad on the micro:bit, and the other end is connected to the negative end of an LED\n\n<div style=\"clear:both;\"></div>\n\n## LED Debugging\n\nLEDs are pretty simple to use, but there are a couple of tricks to keep in mind. You need to pay attention to which direction the electricity is flowing, because LEDs only work in one direction. Always connect the positive side of your LED to your power source and the negative side to ground.\n",
  "position": 5
}