{
  "key": "multi-screen-apps",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-coding",
  "parent_reference_guide_key": "app-lab",
  "display_name": "Multi-Screen Apps",
  "content": "You may imagine that a typical app has a number of \"screens\" or views that a user goes through as part of using your app.  Below is a typical example with a welcome screen, a screen that plays a game and a game over screen.\n\n![](https://images.code.org/27065f81b2bf53dea099a76868f66e8e-image-1477324003598.png)\n\n## What's a screen, anyway?\n\nA screen is just a UI element like anything else in Design Mode.  But it has a few special properties:\n\n* A screen is a UI element that contains other UI elements.\n* Only one screen can be visible at a time\n* Only elements that \"belong\" to a screen are visible when that screen is active.\n* Even though your *design elements* might be spread across multiple screens, your code is all in one place.\n\n## How to Make a new Screen\n\n<img src=\"https://images.code.org/ed8f45d70a65329597c1623ddd756249-image-1477165123570.png\" style=\"float: right;\">\n\nThere are two ways to add a screen to your app.  First, make sure you're in <em>Design Mode</em>.\n\n[diagram_nums]\n\n1. Either choose _New Screen..._ from the pulldown menu at the top of the display area. **Note:** you also use this pulldown menu to switch between screens in design mode.\n2. Or drag and drop a Screen UI element from the toolbox. **Heads-up:** As soon as you release the screen element, the app will show you a **new blank screen.** You can get back to other screens using the pulldown menu at the top.\n\n[/diagram_nums]\n\n\n## Set a Screen's Properties\n\n[diagram_nums]\n\n1. Use this pulldown menu to select the screen you want to work on. The list will contain the IDs of all the screens you've created.\n2. Click on a blank area of the background to select the screen and set its properties.\n3. Screens also have IDs.  Like other UI elements, it's a good idea to _give your screens descriptive and meaningful IDs_. It makes writing code so much easier.\n4. If your screen is full with UI elements and there's no blank area to click to select it, use this pulldown menu. It lists all the UI elements that are part of this screen, including the screen itself.\n5. Click this button to make this screen the \"default screen\" which means the screen that will show first when the app is run.\n6. Screens don't have many properties but you can set the background of the screen to a color or an image. Images are stretched or squeezed to fit the screen.\n\n[/diagram_nums]\n\n\n\n![](https://images.code.org/5f8934e6ae0fc2d9dfde8c9a0d93eec2-image-1477249243769.png)",
  "position": 3
}