{
  "key": "web-lab",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-coding",
  "parent_reference_guide_key": "html",
  "display_name": "Web Lab",
  "content": "# Web Lab\n\nTo help you be successful when using our tool, you will find some common questions users have had with Web Lab.\n\n## General Information\n\n### The Inspector Tool\n\nThe Inspector Tool is a great way to learn more about unfamiliar code in Web Lab. To turn on the Inspector Tool, click <img src=\"https://images.code.org/188579d7c6e7645d0d2edd203a33bd63-image-1480361561351.31.56 PM.png\" style=\"width:100px\">. You will know that the Inspector Tool is on because the button will turn white and say \"Inspector: On\". Once you turn on the Inspector Tool, you can hover over anything in the preview area and Web Lab will highlight the code that is making that part of the page appear.\n\n![](https://images.code.org/6babf8ac680030aafde4e8cd5d787483-inspector-tool.gif)\n\n### File Organization\n\nYou’ll notice that files are color-coded by their type and have new icons. Hopefully, this makes it easier to quickly tell the difference between a CSS file, an HTML file, or an image.\n\n<img src=\"https://images.code.org/64255c7e081f479a042e9e23e5bb1cf2-fileOrg.png\" style=\"width:100px\">\n\n### Code Selector\n\nWhen adding colors within a CSS file, you will notice a purple icon that appears when you click on a color name. This icon opens a color selector widget, which makes it easier to select new colors for your website. See it in action below!\n\n<img src=\"https://images.code.org/c54abfd05f80fee79cfd9489bd1bcb59-filter.gif\" style=\"width:400px\">\n\n### Image Metadata and Filters\n\nAfter you upload an image, you can view additional information about the image, such as its dimensions, starter code to use the image in your project, and prominent colors that appear in the image. There is also a cool feature to apply filters to the image directly within Web Lab. See these in action below!\n\n<img src=\"https://images.code.org/0aae6fadac85f866dbf88c7beca6f541-Image.gif\" style=\"width:400px\">\n\n### Project Size Limits\n\nWeb Lab now has a limit to how large projects can be - at most 20mb. You can keep track of how big your projects are using the progress meter at the top of each project. Most projects will remain under this limit unless you are using lots of images. If so, you may want to use an outside image hosting program.\n\n<img src=\"https://images.code.org/8e88dc0ed5bdab512f7a02a39c7ac7cf-projectSize.png\" style=\"width:200px\">\n\n## FAQ\n\n1) **Why does HTML seem to work even when it's broken?**\n   - HTML is read by your web browser to generate web pages. Since people often make little mistakes when writing their web pages, browsers are programmed to make a \"best guess\" of what you intended to do. Sometimes different browsers are even programmed to make different guesses! The only way to ensure your code looks like you intend is to make sure you're always using tags correctly.\n2) **Why does the code sometimes turn pink?**\n   - Web Lab is programmed to automatically detect some mistakes in HTML. When it notices a mistake, it turns that code pink. The mistake might be in pink, or it might be somewhere before the pink code. You'll need to carefully debug to find your mistake.\n3) **How do I switch between files?**\n   - Click the name of the file you want to look at in the menu on the left side of the screen.\n4) **How do I rename a file?**\n   - To rename a file, you can right-click (or control-click) on the file name and choose the \"Rename\" option. This will allow you to type in a new file name. Clicking on a file name after it is already highlighted will also allow you to rename the file.",
  "position": 1
}