{
  "key": "naming-variables",
  "course_version_key": "2024",
  "course_offering_key": "web-development",
  "parent_reference_guide_key": "javascript",
  "display_name": "Naming Variables",
  "content": "Variable labels should be meaningful, but you can choose almost any label you like. There are just a few rules and guidelines to be aware of.\n\n## Naming Rules\n\nThere are a **few rules** when choosing labels:\n\n* Labels **cannot include spaces**. For example, `width of rectangle` would generate an error.\n* Labels **cannot begin with a number**. `4sides` and `2morrow` will generate errors.\n* Be very careful with **spelling**.  If labels are not spelled exactly the same way, the computer will not realize that they refer to the same variable.\n* Labels are **case-sensitive**. `size` is not the same as `Size` or `SIZE`.\n\n## Using Meaningful Labels\n\nWhen you see a variable in your program, you'll want to know exactly what's in it without having to search around.  Make sure you label your variable something meaningful.  `score` and `lives` are great labels that tell you exactly what that variable is used for.  [`number`(#bbb3ce)](/docs/spritelab/codestudio_number/) and `a` are not as helpful.\n\n## camelCase\n\nLabels with multiple words can be easier to read in **camelCase**. A camelCase label looks like `sizeOfRectangle` or `aReallyLongLabelName`.  The first letter of the variable name is usually lower case, each new word starts with a capital letter.  This helps you see the start of new words without using spaces, which are not allowed in variable names.\n\n## using_underscores\n\nAnother common way to put multiple words in a variable label is to use underscores between the words.  When using underscores, programmers usually don't use capital letters at all.  These types of variables look like `size_of_rectangle` or `my_frog_sprite`.\n\n## Consistency\n\nThe most important thing when you choose how to label your variables is to use a consistent style so it's easy for you to remember the exact spelling and capitalization of your variables.\n",
  "position": 8
}