{
  "key": "the-accelerometer",
  "course_version_key": "2024",
  "course_offering_key": "web-development",
  "parent_reference_guide_key": "maker-toolkit",
  "display_name": "The Accelerometer",
  "content": "<img src=\"https://curriculum.code.org/media/uploads/cp_accel.png\" style=\"float: right; margin: 20px; width: 300px;\">\n\nMost of the inputs provided by the Circuit Playground or micro:bit are relatively simple devices, which give a single value. The accelerometer is a more complex kind of sensor, which measures a number of different things all at once, and therefore provides more complex information to the user. \n\nAn accelerometer is commonly used to detect movement and position in devices like laptops, phones, virtual reality controllers, and health trackers. For example, pedometers use the movement from accelerometers to track how many steps you take. \n\n## Measuring Orientation\n\nThe accelerometer can determine the _orientation_ of the board to figure out how the board is positioned. \n\n| Orientation  |  Type of Motion Being Tracked | Range of Values|\n|---|---| --- |\n| **Pitch**  | Forward and back motion  | -90 to 90 |\n| **Roll** | Side to side motion   |  -90 to 90 |\n|  **Inclination** | Rotational motion  | -180 to 180 |\n\n<br>\n\nUsing the [`accelerometer.getOrientation()`(#f78183)](/docs/applab/accelerometer.getOrientation/) block, we write programs that respond to changes in pitch, roll, and inclination. This block returns a number for each of these orientations which indicates which way the board is tilting. For example, pitch is positive when it's being tilted back, and negative when being tilted forward. \n\n<div style=\"clear:both;\"></div>\n\n<img src=\"https://images.code.org/1f7f2429d4994c541d3cfea784bf6eb8-Micro_bit Accelerometer.png\" style=\"float: right; margin: 20px; width: 300px;\">\n\n## Acelerometer Events\n\nJust like the other sensors, the accelerometer has the `data` and `change` events. These are particularly useful because they allow you to constantly track the updated values of the accelerometer, like the orientation. \n\n| Event  |  Description |\n|---|---|\n| `data`  |  Fires every 100ms to check for data from the accelerometer. |\n| `change`  | Fires whenever the accelerometer detects a change in motion. This checks to see if the current data from sensor is the same as it was 100ms ago. If this is the case, the event won't trigger. Otherwise, the event triggers.|\n| `shake` |  Fires whenever the board is shaken. |\n\nSometimes we don't care what the orientation of the board is, we just cared that it moved at all. This is where events like `change` and `shake` come in. \n\n",
  "position": 10
}