{
  "key": "codestudio_definingFunction",
  "name": "Defining a Function",
  "category": "Functions",
  "category_key": "functions",
  "block_name": "procedures_defnoreturn",
  "content": "When you *define* a function you give a name to a set of actions you want the computer to perform. When you *call* a function you are telling the computer to run that set of actions.\r\n\r\nClick `Create a Function` to define a new function. A pop-up will open that takes a function name, description of what the function does, and the code blocks for the function.  Basically, when you define a function you give a name to a group of code you want the computer to perform. The new function will show up in the function toolbox.\r\n\r\n<img src=\"https://curriculum.code.org/media/uploads/CreateFunction_02vtqz1.png\" height=175px>\r\n\r\nClicking on the `edit` button in any function block will reopen the pop-up and allow the function to be edited or deleted.\r\n\r\n<img src=\"https://curriculum.code.org/media/uploads/FunctionExample.png\" height=250px>",
  "examples": [
    {
      "name": "Example 1",
      "description": "Click `edit` to see how the function “switchBackgrounds” is defined.\r\n",
      "app": "https://studio.code.org/projects/spritelab/qgi6Fjhv4dMzxJPux-yJObPtxRLlTW6q9tkaxQGj3Fw",
      "image": null,
      "appDisplayType": "embedAppWithCode",
      "embedAppWithCodeHeight": 310
    },
    {
      "name": "Example 2",
      "description": "Press different keys and touch other sprites to change the crab’s property. The project uses a “reset” function that can be called with various events to return the crab to its original properties.",
      "app": "https://studio.code.org/projects/spritelab/iKX5KyOzeDYm_Fu1SGD3beI7ULezMbchXd0bUp77gRs",
      "image": null,
      "appDisplayType": "embedAppWithCode",
      "embedAppWithCodeHeight": 310
    }
  ],
  "short_description": "When you define a function you give a name to a set of actions you want the computer to perform. When you call a function you are telling the computer to run that set of actions.",
  "syntax": "procedures_defnoreturn",
  "tips": "- The purpose of a function is to help you organize your code and to avoid writing the same code twice. You can you define a function once, and then call the function a number of times.\r\n- Make sure your function name is descriptive. It should be easy to understand what a behavior does without having to look at its code.\r\n- You can call a function within the definition of another function."
}