{
  "key": "codestudio_variableName",
  "name": "variable name",
  "category": "Variables",
  "category_key": "variables",
  "block_name": "variables_get",
  "content": "Gets the value of the specified variable. \n\nVariables are used to store values such as numbers or words. Variables allow for a lot of freedom in programming. Instead of having to type out a phrase many times or remember a number, computer scientists can use variables to reference them. Variable values can change throughout a program. Each time the variable name is used, it gets the current value of the given variable and passes it to the block it is attached to. ",
  "examples": [
    {
      "name": "Example 1",
      "description": "This bunny can count by twos! Each time the bunny is clicked, the variable is updated and the new value of the variable is printed.\r\n",
      "app": "https://studio.code.org/projects/spritelab/NYkhX-P1oDhkPg6Eqx0kGxHNA3VRs0NaXbpV1suLRMY",
      "image": null,
      "app_display_type": "embedAppWithCode",
      "embed_app_with_code_height": 310
    },
    {
      "name": "Example 2",
      "description": "A variable can be used several times in a program. Here, the variable “spriteSize” is used to set all the food sprites to the same size when the apple is clicked. \n",
      "app": "https://studio.code.org/projects/spritelab/3QoJfDGrL7UbjFQl7G72ZMChOQxkxYSgAaVram0d8BA",
      "image": null,
      "app_display_type": "embedAppWithCode",
      "embed_app_with_code_height": "500"
    }
  ],
  "image_url": "https://curriculum.code.org/media/blocks/Screen_Shot_2019-08-06_at_11.49.29_AM.png",
  "palette_params": [
    {
      "name": "variable",
      "type": "",
      "required": true,
      "description": "The name of the variable whose value is being called"
    }
  ],
  "short_description": "Gets the value of the specified variable. ",
  "syntax": "variables_get",
  "tips": "- If you decide to change a variable name while working on your project, you do not have to change all the other matching the block individually. Choosing to “rename all” variables with that name will automatically rename all the matching blocks used in your project."
}