{
  "key": "codestudio_setVariable",
  "name": "set variable",
  "category": "Variables",
  "category_key": "variables",
  "block_name": "variables_set",
  "content": "Assigns the input value to a variable.\r\n\r\nVariables are used as placeholders for values such as numbers or strings of text. Variables allow for a lot of freedom in programming. Instead of having to type out a phrase many times or remember a number, computer scientists can use variables to reference them. Variable values can change throughout a program.\r\n\r\nIf no variable with the specified name has been created, this block can create a new named variable with the given value. If the variable already exists, its new value will replace its old value.",
  "examples": [
    {
      "name": "Example 1",
      "description": "Change the color input given to the variable “spriteColor.” See how changing the variable value changes what the variable then passes to the `change color` block.\r\n",
      "app": "https://studio.code.org/projects/spritelab/zOzSXi7WUid8owiJSoTk5UCz4grLc_91o-UN0bQi2AA",
      "image": null,
      "app_display_type": "embedAppWithCode",
      "embed_app_with_code_height": 310
    },
    {
      "name": "Example 2",
      "description": "A variable can be used several times in a program. Here, the variable “spriteSize” sets all the food sprites to the same size. \r\n",
      "app": "https://studio.code.org/projects/spritelab/3QoJfDGrL7UbjFQl7G72ZMChOQxkxYSgAaVram0d8BA",
      "image": null,
      "app_display_type": "embedAppWithCode",
      "embed_app_with_code_height": 310
    },
    {
      "name": "Example 3",
      "description": "If the variable value changes, it only affects the code after it. In this case, \"spriteSize\" passes one value to the apple and mushroom. It is then set to a new value that it is used in the code for the cherry and beet, but not in the code before it.\r\n",
      "app": "https://studio.code.org/projects/spritelab/fMJPwkFGVx5hLN1nV_iZ0npBuFZzaT_qFoqECML21bI",
      "image": null,
      "app_display_type": "embedAppWithCode",
      "embed_app_with_code_height": 310
    }
  ],
  "image_url": "https://curriculum.code.org/media/blocks/setVariable.PNG",
  "palette_params": [
    {
      "name": "value input",
      "type": "",
      "required": true,
      "description": "The value the variable is being set to"
    },
    {
      "name": "variable name",
      "type": "",
      "required": true,
      "description": "The name of the variable. The name can be chosen from a drop-down list or customized using the rename option."
    }
  ],
  "short_description": "Assigns the input value to a variable.",
  "syntax": "variables_set",
  "tips": "- Using a descriptive variable name helps best identify a specific variable and makes it easier for anyone else reading the code to understand what is happening. \r\n- If you decide to change a variable name while working on your project, you don’t have to change all the other matching blocks individually. Choosing to “rename all” variables with that name will automatically rename all the matching blocks used in your project."
}