{
  "key": "codestudio_defining-behaviors",
  "name": "Defining Behaviors",
  "category": "Behaviors",
  "category_key": "behaviors",
  "content": "When you define a behavior you give a name to a set of actions you want a sprite to perform over and over. When a sprite begins that behavior you are telling the computer to run that set of actions on the sprite over and over until the behavior stops.\n\nSprite lab provides some premade behaviors, but there is also an option to create a custom behavior. Selecting the “Create a Behavior” button opens a pop-up that takes a behavior name, description of what the behavior does, and the code blocks for the behavior. The “this sprite” block is given so that the behavior can apply to whichever sprite is used in the `sprite begins` or `sprite stops` block with it.\n\n<img src=\"https://curriculum.code.org/media/uploads/CreateBehavior.png\" height=150px>\n\nClicking on the “edit” button in any behavior block will reopen the pop-up and allow the behavior to be edited or deleted.\n\n<img src=\"https://curriculum.code.org/media/uploads/abducting.png\" height=200px>\n\n\nTo delete a behavior, click on the behavior’s block and select delete in the top right corner. This will remove the behavior from the toolbox. If the block still exists in the workspace or any other behavior or function definitions, it will no longer work.\n\nTo use behaviors once they are defined, review `Adding and Removing Behaviors`.",
  "examples": [
    {
      "name": "Example 1",
      "description": "A behavior has been created to make a sprite move northwest across the display area. Click on the `edit` button to see how this behavior has been defined.\n",
      "app": "https://studio.code.org/projects/spritelab/3mvIX2h-BgJZi7OK4GK9BmLTAWfO1O7KejWBxfDzBoA",
      "appEmbedHeight": "430"
    },
    {
      "name": "Example 2",
      "description": "Multiple behaviors have been defined to make this space scene come to life. One behavior is also applied to multiple sprites.\n",
      "app": "https://studio.code.org/projects/spritelab/-BCg7UOrQsIwRB5KkPLZtW5NX3Nimoqf_CH5YHH2BWg",
      "appEmbedHeight": "560"
    }
  ],
  "short_description": "When you define a behavior you give a name to a set of actions you want a sprite to perform over and over. When a sprite begins that behavior you are telling the computer to run that set of actions on the sprite over and over until the behavior stops.",
  "tips": "- Make sure your behavior name is descriptive. It should be easy to understand what a behavior does without having to look at its code.\n- Look at the existing behaviors given in the toolbox for ideas of how to create new ones.\n- Existing behaviors in the toolbox can be edited to change the way sprites move, rotate, and change size or color."
}