{
  "key": "codestudio_ifStatement",
  "name": "if",
  "category": "Logic",
  "category_key": "logic",
  "block_name": "controls_if_if",
  "content": "Runs a sequence of code if the specified condition is true.\r\n\r\nPrograms often need to check if a condition is true before running code. If the condition is true, the sequence of code inside of the block will run. If the condition is false, the code will be skipped over. \r\n\r\nClicking on the star brings up options to add “else if” and “else” conditions. “Else if” allows multiple conditions to be checked. If the first “if” condition is not true, the program will go down the line and check for the first “else if” condition that is true. If none of the conditions are true, and an “else” section exists, then the code inside of “else” will run. ",
  "examples": [
    {
      "name": "Example 1",
      "description": "This simple program checks if a number is greater than another.\nClick on the gold coin, and the green critter will guess a random number between 1 and 25. If the green critter guesses a number that is higher than the one the princess critter was thinking of, he will get her gold coin!\n",
      "app": "https://studio.code.org/projects/spritelab/sOXRJcZJe-z5xSkg_AapcMIhbU1JkjzNUm4Zu4rKRbA",
      "image": null,
      "app_display_type": "embedAppWithCode",
      "embed_app_with_code_height": "500"
    },
    {
      "name": "Example 2",
      "description": "The bear is looking for the perfect sized stew. Help it check the stews until it finds the right one. \r\nIf the stew is too big or small, the bear will let you know. Else, the stew is the perfect size.\r\n",
      "app": "https://studio.code.org/projects/spritelab/PRSgJeT7JYSp69gJQt0nLcGS6pTsUc1HnjMVnE451Mw",
      "image": null,
      "app_display_type": "embedAppWithCode",
      "embed_app_with_code_height": 310
    }
  ],
  "image_url": "https://curriculum.code.org/media/blocks/if.PNG",
  "palette_params": [
    {
      "name": "condition",
      "type": "",
      "required": true,
      "description": "A sequence of blocks, including logic blocks, that the computer can evaluate as either true or false"
    }
  ],
  "short_description": "Runs a sequence of code if the specified condition is true.",
  "syntax": "controls_if_if",
  "tips": "- Unlike an event, an if statement does not constantly monitor the program to check if the condition is true or false. An if statement is an instruction just like any other that gets executed by line in order from top to bottom."
}