{
  "key": "codestudio_for",
  "name": "for",
  "category": "Loops",
  "category_key": "loops",
  "block_name": "controls_for",
  "content": "Repeats a sequence of code a specified number of times, and tracks a value each time the loop is run.\n\nSometimes we want to repeat things a certain number of times, but we want to keep track of values as we do. For loops are different than repeat loops because they use a counter variable to track a value. That value can then be used in the code inside the block.\n\nThe counter variable begins with the starting value. Each time the program goes through the loop, the sequence of code inside the block is run. The step value is then added to the counter variable, and the loop continues to run until the counter reaches the stopping value. Once the for loop is finished, the program will continue down the blocks after the for loop.\n\n**Examples:**\n \nfor **counter** from **1** to **4** count by **1**  \nThe loop will run 4 times.\n\n1. counter = 1\n\n2. counter = 2\n\n3. counter = 3\n\n4. counter = 4\n\nfor **counter** from **3** to **9** count by **3**  \nThe loop will run 3 times.\n\n1. counter = 3\n\n2. counter = 6\n\n3. counter = 9",
  "examples": [
    {
      "name": "Example 1",
      "description": "The sprite will say the value of the counter. \r\n",
      "app": "https://studio.code.org/projects/spritelab/nhudy1zTMMbtzEezjWBQXj0lbF3UnOWDqsOWiaHt0j0",
      "image": null,
      "app_display_type": "embedAppWithCode",
      "embed_app_with_code_height": 310
    },
    {
      "name": "Example 2",
      "description": "The x position of sprites is determined by the value of the counter in the loop. \r\n",
      "app": "https://studio.code.org/projects/spritelab/uL5gfcrOzDNgU-g7Z5h0qkgXHKij5IqA9UakDl2svmg",
      "image": null,
      "app_display_type": "embedAppWithCode",
      "embed_app_with_code_height": 310
    }
  ],
  "image_url": "https://curriculum.code.org/media/blocks/for.PNG",
  "palette_params": [
    {
      "name": "variable",
      "type": "",
      "required": true,
      "description": "The name of the variable that keeps track of the number that controls the loop. Default name is “counter”"
    },
    {
      "name": "starting value",
      "type": "",
      "required": true,
      "description": "The value the counter variable starts at"
    },
    {
      "name": "ending value",
      "type": "",
      "required": true,
      "description": "The value the counter variable must reach before the loop will end"
    },
    {
      "name": "step value",
      "type": "",
      "required": true,
      "description": "The value to add to the counter variable each time the loop is run"
    }
  ],
  "short_description": "Repeats a sequence of code a specified number of times, and tracks a value each time the loop is run.",
  "syntax": "controls_for",
  "tips": "- The counter variable will be increased after the sequence of code is run, and the loop will stop when the value is equal to or greater than the stopping value. For example, if a counter starts at 3, ends at 6, and has an interval of 2, the loop will run twice - when the counter value is 3 and 5. The counter will end with a value of 7, but the loop will not run again because it is greater than the stopping value. "
}