{
  "key": "gamelab_getThisSprite",
  "name": "this / other sprite",
  "category": "Sprites",
  "category_key": "sprites",
  "block_name": "gamelab_getThisSprite",
  "content": "Gets a specific sprite from an event.\n\nUsing the [`costume`(#df9399)](/docs/spritelab/gamelab_allSpritesWithAnimation/) block, you can program with events to check for interactions involving any sprite with the same costume(s). This block allows you to program an action to only affect the sprite that triggered the event. In an event that involves two sprites, “this” refers to the first sprite in the event, and “other” refers to the second sprite. Using this block makes it possible to apply actions to specific sprites after an event without having to use a sprite name or affect the whole costume group.",
  "examples": [
    {
      "name": "Example 1",
      "description": "Using “this” lets an action apply to just one sprite in a costume group without creating a name for every sprite. In this example, any sun that is clicked will disappear when clicked without affecting the others.\r\n",
      "app": "https://studio.code.org/projects/spritelab/BB02x207ZceIeJqOAVLuDtpMBlbR_eIvs111X6gZjLU",
      "image": null,
      "app_display_type": "embedAppWithCode",
      "embed_app_with_code_height": 310
    },
    {
      "name": "Example 2",
      "description": "“Other” only works if more than one sprite is involved. When two sprites touch, “this” and “other” can be used to make a different action occur for each sprite.  Press 'up' and 'down' arrows to have the middle sprite eat the pizza.\r\n",
      "app": "https://studio.code.org/projects/spritelab/vpJR48129a0EGLyJbsA01C1eH-ij1qDPLNggqQc-sN8",
      "image": null,
      "app_display_type": "embedAppWithCode",
      "embed_app_with_code_height": 570
    }
  ],
  "image_url": "https://curriculum.code.org/media/blocks/thisSprite.PNG",
  "palette_params": [
    {
      "name": "this/other",
      "type": "",
      "required": false,
      "description": "Two options: this or other. Default is this."
    }
  ],
  "short_description": "Gets a specific sprite from an event.",
  "syntax": "getThisSprite",
  "tips": "- “This” sprite can be used in any action that is triggered by an event with a sprite. However, “other” only works with two sprites. Like the names suggest, there is “this” main sprite and a secondary “other” sprite."
}