{
    "fishvtrash-training-init1": "Denize atılan çöpler deniz yaşamını kötü etkiler. Bu aktivitede balık veya çöpleri ayırmak için AI  (yapay zeka) programlayacak veya eğiteceksiniz. Okyanusu temizleyelim! Devam etmek için ekranın herhangi bir yerine tıklayın.",
    "fishvtrash-training-init2": "Ai ile tanışalım.",
    "fishvtrash-training-init3": "Ai, bir nesnenin balık veya çöp olup olmadığını bilmez, ancak görüntüleri işleyebilir ve kalıpları tanımlayabilir.",
    "fishvtrash-training-init4": "Ai'yı programlamak için, düğmeleri görüntüyü “Balık” veya “Balık Değil” olarak etiketlemek için kullanın. Verdiğiniz eğitim Ai'ya kalıpları kendi başına tanımayı öğretecektir. Başlayalım!",
    "fishvtrash-training-pause1": "Her yıl 8 milyar kilo plastik okyanusa giriyor.",
    "fishvtrash-training-pause2": "Her bir tıklama ile Ai programlıyor veya eğitiyorsunuz. Devam edin.",
    "fishvtrash-training-pause3": "Okyanus kirliliğinin %80'i toprak döküntüsünden kaynaklanmaktadır ve yılda 13 milyar dolara mal olduğu tahmin edilmektedir.",
    "fishvtrash-training-pause4": "Ai seçimlerinizden öğrenir. “Yanlış” seçimler yaparsanız Ai hatalarınızı tekrarlar. Eğitimi devam ettirin.",
    "fishvtrash-training-pause5": "Harika iş! Ai'ya ne kadar çok veri sağlarsanız o kadar çok öğrenir. Ai eğitimini devam ettirin veya hazır olduğunuzda devam edin.",
    "fishvtrash-predicting-init1": "Şimdi Ai'nın “balık”ın neye benzediğini bilip bilmediğini görelim.",
    "fishvtrash-predicting-init2": "Ai, rastgele bir nesne kümesini analiz eder ve eğitiminize göre etiketler.",
    "fishvtrash-predicting-init3": "Hadi gidelim!",
    "fishvtrash-pond-init1": "Eğitiminize dayanarak, Ai'nın “balık” olarak tanımladığı bazı nesneler. Ai nasıl yaptı?",
    "fishvtrash-pond-recall": "“Balık” ve “balık değil” olarak tanımlanan nesneler arasında geçiş yapmak için buraya tıklayın.",
    "fishvtrash-pond-init2": "Ai'yı daha fazla eğitebilirsiniz...",
    "fishvtrash-pond-init3": "...veya Devam.",
    "creaturesvtrashdemo-predicting-init1": "Şimdiye kadar Ai'yı nesneleri “balık” ya da “balık değil” olarak tanımlamak için eğittik.",
    "creaturesvtrashdemo-predicting-init2": "Ya bu eğitim verileri suya neyin ait olduğuna karar vermek için kullanıldıysa?",
    "creaturesvtrashdemo-predicting-init3": "Diğer deniz canlılarına ne olur? Eğitim yaklaşımımız istenmeyen sonuçlara neden oluyor mu?",
    "creaturesvtrashdemo-predicting-init4": "Bakalım.",
    "creaturesvtrashdemo-predicting-pause1": "Ai'nın bazı deniz canlılarını “balık değil” olarak tanımladığını fark ettiniz mi?",
    "creaturesvtrashdemo-predicting-pause2": "Bu deniz canlıları balık olmasa da suya aittirler.",
    "creaturesvtrashdemo-predicting-pause3": "Ai sadece öğrettiğimizi öğrenir.",
    "creaturesvtrashdemo-predicting-pause4": "Ai'yı tekrar eğitelim.",
    "creaturesvtrash-training-init1": "Ai'nın hangi nesnelerin suda olması gerektiğini öğrenmesini sağlayalım.",
    "creaturesvtrash-training-init2": "Okyanusta plastik kalıntılar balıklara, deniz kuşlarına ve deniz memelilerine zarar verebilir. Deniz kuşlarını ve deniz yaşamını korumak, okyanusları temiz tutmak için birçok nedenden biridir.",
    "creaturesvtrash-training-init3": "Ne kadar fazla eğitim verisi sağlarsanız, Ai o kadar çok öğrenir. Eğitimi devam ettirin.",
    "creaturesvtrash-training-init4": "Deniz plastik kirliliği, tüm deniz kaplumbağası türlerinin %86'sı dâhil olmak üzere dünya çapında en az 267 türü etkilemiştir.",
    "creaturesvtrash-training-init5": "Ai'ya suya neyin ait olduğunu öğretmek için eğitime devam edin.",
    "creaturesvtrash-training-init6": "Harika iş! Ai'ya ne kadar çok veri sağlarsanız, o kadar iyi olur. Ai eğitimine devam edin veya hazır olduğunuzda devam edin.",
    "creaturesvtrash-predicting-init1": "Ai şimdi suda ne olması gerektiğini belirleyerek daha iyi bir iş çıkaracak mı? Hadi izleyelim.",
    "creaturesvtrash-pond-init1": "Eğitiminize dayanarak, Ai'nın “suya ait” olarak tanımladığı bazı nesneler. Ai nasıl yaptı?",
    "fishshort-words-init1": "Yapay zekâ ve makine öğrenimi bir bilgisayara yeni kalıplar öğretmek için kullanılabilir.",
    "fishshort-words-init2": "Ai'ya bu tür balık örneklerini göstererek yeni bir kelime öğretelim.",
    "fishshort-words-training-pause1": "Ai yeterli eğitim verisine sahip mi? Öğrenmek için Devam'a tıklayabilirsiniz.",
    "fishshort-words-training-pause2": "Harika iş! Ai eğitimini devam ettirin veya hazır olduğunuzda devam edin.",
    "fishshort-predicting-init1": "Pratik verilerinizle Ai'yı “{word}” balığı tanıyacak şekilde programladınız.",
    "fishshort-predicting-init2": "Ai'nın “{word}” balığı tanımladığını görelim.",
    "fishshort-pond-init1": "Eğitiminize dayanarak AI, {n, plural,one {bu} other {bunlar}} balığı “{word}” olarak tanımladı. AI nasıl yaptı? Sonuçları iyileştirmek istiyorsanız Daha Fazla Eğitebilirsiniz.\n",
    "fishshort-pond-init2": "Ai'nın ne öğrendiğini görmek için bilgi düğmesine tıklayın.",
    "fishlong-words-init1": "Şimdi Ai'nın daha az belirgin bir kelime öğrenip öğrenemeyeceğini görelim.",
    "fishlong-words-init2": "Ai'ya görüşünüze bağlı bir kelime öğretelim. Kelimenize uygun balık seçmek size kalmıştır.",
    "fishlong-training-pause1": "Bir balığı görünüşüne göre yargılamak için yapay zekâ kullanmak adil midir? AI adil ve tarafsız görünse de, analizi verdiğimiz eğitimden geliyor. Bu hangi istenmeyen önyargıya neden olabilir?",
    "fishlong-training-pause2": "Daha fazla eğitim verisi Ai'nın kelimenizi öğrenmesine yardımcı olacaktır. Eğitimi devam ettirin.",
    "fishlong-training-pause3": "Yaptığınız her seçim Ai'nın öğrenmesine yardımcı olabilir. Eğitimi devam ettirin.",
    "fishlong-training-pause4": "Ai yeterli eğitim verisine sahip mi? Ai çok fazla veriyle daha iyisini yapacaktır. Ai'nin hazır olduğunu düşündüğünüzde devam edin.",
    "fishlong-training-many": "Vay. Bu çok balık!",
    "fishlong-predicting-init1": "Pratik verilerinizle Ai'yı “{word}” balığı tanıyacak şekilde programladınız.",
    "fishlong-predicting-init2": "Ai'nın “{word}” balığı tanımladığını görelim.",
    "fishlong-pond-init1": "Eğitiminize dayanarak AI, {n, plural,one {bu} other {bunlar}} balığı “{word}” olarak tanımladı. AI nasıl yaptı?\n",
    "fishlong-pond-init2": "Sonuçları iyileştirmek istiyorsanız Daha Fazla Eğitebilirsiniz.",
    "fishlong-pond-init3": "Veya Yeni Kelime'yi seçerek Ai'ya yeni bir kelime öğretebilirsiniz.",
    "didYouKnow": "Biliyor muydunuz?",
    "continue": "Devam",
    "areYouSure": "Emin misiniz?",
    "eraseWarning": "Ai verilerinin silinmesi tüm eğitimi kalıcı olarak silecektir. Yapmak istediğiniz bu mu?",
    "erase": "Sil",
    "cancel": "İptal",
    "yes": "Evet",
    "no": "Hayır",
    "notWord": "{word} değil",
    "run": "Çalıştır",
    "mostImportantParts": "Bunlar en önemli balık parçalarıydı:",
    "clickIndividualFish": "Bilgilerini görmek için tek tek balıklara tıklayın.",
    "mostImportantPartsDescription": "Bunlar bunun balık olup olmadığını belirlemedeen önemli balık parçalarıydı.“*{word}*” veya“**{notWord}**”.",
    "newWord": "Yeni Kelime",
    "finish": "Bitiş",
    "trainMore": "Daha Fazla Eğitin",
    "wordQuestionShort": "Ai'yı ne tür balıklar tespit etmek üzere eğitmek istiyorsunuz?",
    "wordQuestionLong": "Ai'ya öğretmek için yeni bir kelime seçin.",
    "isThisFish": "Bu balık {word} mi?",
    "isThisAFish": "Bu bir balık mı?",
    "doesThisBelongInWater": "Bu suya ait mi?",
    "fish": "Balık",
    "waterCreature": "Su canlısı",
    "blue": "Mavi",
    "green": "Yeşil",
    "red": "Kırmızı",
    "circular": "Daire biçiminde",
    "rectangular": "Dikdörtgen biçiminde",
    "triangular": "Üçgen biçiminde",
    "angry": "Kızgın",
    "awesome": "Müthiş",
    "delicious": "Lezzetli",
    "endangered": "Nesli tükenmekte",
    "fast": "Hızlı",
    "fierce": "Sert",
    "fun": "Eğlence",
    "glitchy": "Kusurlu",
    "happy": "Mutlu",
    "hungry": "Aç",
    "playful": "Şakacı",
    "scary": "Korkutucu",
    "silly": "Saçma",
    "spooky": "Ürpertici",
    "wild": "Yabani",
    "dorsalFins": "sırt yüzgeci",
    "pectoralFinsFront": "göğüs yüzgeçleri",
    "tails": "kuyruk",
    "bodies": "gövde",
    "scales": "ölçekler",
    "eyes": "gözler",
    "mouths": "ağız",
    "colors": "renkler"
}
