---
title: ایک گھنٹے بعد کوڈ ٹکنالوجی کے ساتھ مکمل کیا جارہا ہے
---

# ایک گھنٹے بعد کوڈ ٹکنالوجی کے ساتھ مکمل کیا جارہا ہے

کوئی بھی کمپیوٹر سائنس تعلیم ہفتے کے دوران ایک گھنٹہ کوڈ کوشش کر سکتے ہیں ۔

## نابینا استعمال کرتے ہوئے

اگر آپ ایک اسکرین ریڈر استعمال، [کورم ٹیوٹوریل کے لئے beginners](https://quorumlanguage.com/hourofcode/astro1.html) یا [کورم ٹیوٹوریل کے لئے آرام دہ اور پرسکون طلباء](https://quorumlanguage.com/hourofcode/part1.html) ہیں ایک گھنٹے کے کوڈ کو شروع کرنے کے لئے عظیم مقامات ہیں ۔ کورم اصل سکرین کے ذریعے قارئین کی رسائی کے لئے ڈیزائن کیا گیا ایک انٹرپریٹد زبان کے طور پر شروع کر دیا ۔ یہ ایک عمومی مقاصد پروگرامنگ زبان کسی بھی صارف کے لئے ڈیزائن کیا گیا بن گیا ہے ۔ اور اگر ایک گھنٹہ کوڈ سے آگے جانا چاہتے ہیں تو ٹیم کورم پر اضافی آلات اور نصاب ہے ۔

[![Beginners کے لئے ٹیوٹوریل](https://code.org/images/fill-480x360/tutorials/hoc2017/quorum_astronomy.jpg)](https://quorumlanguage.com/hourofcode/astro1.html) [![آرام دہ اور پرسکون طالب علموں کے لئے ٹیوٹوریل](https://code.org/images/fill-480x360/quorum.jpg)](https://quorumlanguage.com/hourofcode/part1.html)

## آڈیو کے بغیر Code.org کے سبق

[Code.org سبق](https://studio.code.org/courses) سب کے ساتھ یا بغیر آواز استعمال کیا جا سکتا ہے ۔ تمام ویڈیوز کیپشن ہے ۔

## جوڑا پروگرامنگ

پروگرامنگ کی جوڑی سائنسدانوں کا ایک جوڑا یا ٹیم کے طور پر مسائل حل کرنے کے لئے استعمال ایک آلہ کمپیوٹر ہے ۔ کسی دوست یا ہم جماعت کے ساتھ گھنٹے کے کوڈ کو درپیش چیلنجوں پر کام کرنے کی کوشش کریں ۔ کو یہ ویڈیو</a> چیک جوڑی پروگرامنگ کے لئے سب سے بہترین تراکیب کو جاننے کے لئے نہیں بھولنا.</p>