{
  "clicked": "",
  "clickedSprite": "",
  "subject": "",
  "subjectSprite": "",
  "object": "",
  "objectSprite": "",
  "errorLoadingAnimation": "Det ser ud til, at vi har problemer med at loade din animation \"{animationName}\". Undersøg om du har en god internet forbindelse og prøv igen at loade siden. Hvis dette problem fortsætter, så kan det være fordi din animation er i stykker. Hvis dette er tilfældet må du slette animationen.",
  "reinfFeedbackMsg": "Du er færdig. Klik på fortsætte til næste level.",
  "shareGame": "Del dit spil:",
  "spritelabFeedbackCreateFishWithBehavior": "Du må lave mindst en fiske figur og five den en 'adfærd'",
  "spritelabFeedbackMoveFishLeftRight": "Din fiske figur må bevæge sig til venstre eller højre. Prøv at ændre figurens adfærd.",
  "spritelabFeedbackChangeBackgroundColor": "Du må skifte baggrund til en anden farve end hvid.",
  "spritelabFeedbackCreateTwoSprites": "Du må oprette bare to figurer.",
  "spritelabFeedbackTwoSpritesWithCostumes": "Dine to figurer må have forskellig udseende.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Du skal oprette to figurer med forskellig udseende som hver har en adfærd.",
  "spritelabFeedbackClickSprite": "Sørg for at klikke på din figur efter du har trykket på 'Kør'.",
  "spritelabFeedbackUseSpinningBehavior": "Din figur burde begynde at dreje rundt. Prøv at ændre på adfærden.",
  "spritelabFeedbackPinkAlienBehavior": "Din pink alien figur begyndte ikke på sin adfærd.",
  "spritelabFeedbackCreateThreeAliens": "Du må oprette en blå alien, en pink alien og en gul alien.",
  "spritelabFeedbackAliensNotInLine": "Dine tre alien figurer må placeres på en vandret linje (inden for 50 pixels).",
  "spritelabFeedbackYellowAlienBehavior": "Den gule alien startede ikke på sin adfærd.",
  "spritelabFeedbackNoAlienColor": "Mindst en af dine aliens skiftede ikke farve.",
  "spritelabFeedbackNeedAlienStopBehavior": "Dine alien figurer må stoppe alle deres adfærd.",
  "spritelabFeedbackBlueAlienBehavior": "Din blå alien må starte en ny adfærd.",
  "spritelabFeedbackUseCostume": "Du må bruge mindst et udseende.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Du skal oprette 3 figurer med forskellige udseender.",
  "spritelabFeedbackMoveUpNotDown": "Din figur må bevæge sig op (nord) i stedet for ned (syd).",
  "spritelabFeedbackRobotFasterThanRover": "Robotten kommer til den højre side af skærmen før roveren.",
  "spritelabFeedbackDifferentStarRotation": "Figurer med begge begge stjerne udseender må roterer lige meget.",
  "spritelabFeedbackAstronautMoveToCorner": "Astronaut figuren må bevæges til et af de fire hjørner."
}
