---
title: شرکا
---

ساعت کد توسط کمیته بررسی ساعت کد اداره می شود.

[کمیته بررسی]({{ urls/review_committee }}) از 12 مربی کنونی و پیشین کلاسهای K-12 تشکیل شده که با کمک سیستم امتیازدهی که کمیته مشاوران ایجاد کرده است فعالیت دانش‌آموزان رو ارزیابی و نقطه نظراتش رو اعلام میکند. این مربیان فعالیت‌های دانش آموز محور و برنامه های آموزشی معلم محور رو که توسط صدها نفر از شرکای همکار ارائه شده‌اند بررسی می‌کنند و ارزش آموزشی فعالیت‌ها، توانایی تعامل با دانش‌آموزان و درخواست‌های تجدیدنظر گروه‌های مختلف دانش آموزان رو ارزیابی می کنند.

کار و تعهد کمیته به موفقیت ساعت کدنویسی (Hour of Code) و ارائه‌ی مقدمه‌ای بر علوم کامپیوتر برای هر دانش‌آموز کمک کرده است.

# شرکای اصلی و حاميان شرکتی

{{ partners/major_partners_corporate_supporters }}

* * *

# شرکای بین‌المللی

{{ partners/international_partners }}

* * *

# همکاران آموزشی و درسی

{{ partners/curriculum_tutorial_partners }}

* * *

# همکاران و ابزارهای زیرساخت

{{ partners/infrastructure_partners_tools }}

* * *

# ساير شركا

{{ partners/additional_partners }}

{{ signup_button }}