---
title: شرکا
---

Hour of code رو کمیته‌ی بررسی Hour of Code اداره میکنه

[کمیته بررسی]({{ urls/review_committee }}) از 12 مربی کنونی و پیشین کلاسهای K-12 تشکیل شده که با کمک سیستم امتیازدهی که کمیته مشاوران ایجادش کرده فعالیت دانش‌آموزان رو ارزیابی کرده و نقطه نظراتش رو اعلام میکنه. این مربیان فعالیت‌های دانش آموز محور و برنامه های آموزشی معلم محور رو که توسط صدها نفر از شرکای همکار ارائه شده‌ن بررسی می‌کنن و ارزش آموزشی فعالیت‌ها، توانایی تعامل با دانش‌آموزان و درخواست‌های تجدیدنظر گروه‌های مختلف دانش آموزان رو ارزیابی می کنن.

کار و تعهد کمیته به موفقیت ساعت کدنویسی (Hour of Code) و ارائه‌ی مقدمه‌ای بر علوم کامپیوتر برای هر دانش‌آموز کمک کرده.

# شرکای اصلی و حاميان شرکتی

{{ partners/major_partners_corporate_supporters }}

* * *

# شرکای بین‌المللی

{{ partners/international_partners }}

* * *

# شرکای آموزشی و برنامه‌ریزان

{{ partners/curriculum_tutorial_partners }}

* * *

# همکاران و ابزارهای زیرساخت

{{ partners/infrastructure_partners_tools }}

* * *

# ساير شركا

{{ partners/additional_partners }}

{{ signup_button }}