{
  "abortedTestResult": "{className} > {methodName} ABORTADO",
  "addAComment": "Añade un comentario",
  "addACommentToReview": "Añade un comentario a la revisión",
  "allFilesCompile": "¡Todos los archivos compilados!",
  "authorLabel": "autor",
  "authorizerNearLimit": "Has ejecutado tu código demasiadas veces en la última hora. Has hecho {attemptsLeft} intentos antes de que tu cuenta sea bloqueada permanentemente y no podrás ejecutar el código Java. Por favor, espera 15 minutos antes de volver a intentarlo.",
  "authorizerNearLimitTemporary": "Has ejecutado tu código demasiadas veces en los últimos {lockoutPeriod}. Te quedan {attemptsLeft} intentos. Conviértete en un profesor verificado para acceder a una cuota mucho mayor para ti y tus alumnos.\nMás información sobre [cómo convertirse en profesor verificado](https://support.code.org/hc/en-us/articles/115001550131-How-to-Become-a-Verified-Teacher).\nMás información sobre [por qué es necesaria la verificación de profesores](https://support.code.org/hc/en-us/articles/6104078305549-Teacher-Verification-and-CSA).\n",
  "authorizerTokenUsed": "Estás intentando reutilizar un token que ya ha ejecutado tu código. Por favor, comprueba que estás en una red segura antes de volver a intentarlo. Si crees que este mensaje es un error, ponte en contacto con support@code.org.",
  "backpackErrorTitle": "Se ha producido un error",
  "backpackFileNameConflictWarning": "Al guardar se sobrescribirá un archivo existente en tu mochila.",
  "backpackLabel": "Mochila",
  "backpackListLoadError": "Se ha producido un error al cargar tu mochila. Inténtalo de nuevo.",
  "backpackListLoadErrorMessageCommitDialog": "Intenta cerrar y volver a abrir este diálogo.",
  "backpackSaveErrorMessage": "Por favor, inténtalo de nuevo",
  "cancel": "Cancelar",
  "classNotFound": "Error: falta una definición de clase en uno o varios archivos Java.",
  "classroomBlocked": "Tu sección ha ejecutado el código demasiadas veces y ha sido bloqueada. Pide a tu profesor que se ponga en contacto con support@code.org para desbloquear la sección.",
  "clearConsole": "Borrar Consola",
  "closeReview": "Revisión cerrada",
  "codeEditingDisabled": "La edición de código está desactivada mientras tu proyecto está en revisión",
  "codeReviewDisabledMessage": "La revisión de código está desactivada. Tu profesor debe colocarte en un grupo de revisión de código para habilitar esta función.",
  "codeReviewForStudent": "Revisión de Código para {student}",
  "codeReviewForYou": "Tu Revisión de Código",
  "codeReviewingPeer": "Revisando el Código {peerName}",
  "commentProfanityFound": "Tu comentario contiene lenguaje inapropiado, por lo que no se guardará. Por favor, actualiza tu comentario para eliminar las {wordCount, plural, one {palabra} other {palabras}} \"{words}\".",
  "commentUpdateError": "Se ha producido un error al procesar tu solicitud, inténtalo de nuevo.",
  "commit": "Confirmar",
  "commitAndSave": "Confirmar y guardar",
  "commitCode": "Código de confirmación",
  "commitNotes": "Notas de confirmación",
  "commitNotesPlaceholder": "Introduce aquí las notas sobre esta confirmación...",
  "compilationSuccess": "Compilación realizada con éxito.",
  "compileFailed": "Error de compilación.",
  "compiled": "¡Compilado!",
  "compilerError": "No hemos podido compilar el programa. Busca errores en tu programa y vuelve a intentarlo.",
  "compiling": "Compilando...",
  "compilingProgram": "'Compilando el programa...",
  "connecting": "Conectando...",
  "console": "Consola",
  "create": "Crear",
  "createNewFile": "Crear un nuevo archivo",
  "created": "Creado",
  "delete": "Borrar",
  "deleteFileConfirmation": "¿Estás seguro de que quieres borrar {filename}?",
  "disabledPeerReviewMessage": "Habilita la revisión por pares para que otros estudiantes de tu grupo puedan dejar comentarios en tu proyecto.",
  "displayThemeDarkMode": "modo oscuro",
  "displayThemeLightMode": "modo claro",
  "duplicateProjectFilenameError": "El archivo {filename} ya está en uso en este proyecto. Por favor, elige un nombre diferente",
  "duplicateSupportFilenameError": "El archivo {filename} ya está en uso en el código de soporte de este nivel. Por favor, elige un nombre diferente",
  "editingDisabledUnderReview": "La edición está desactivada mientras tu proyecto está en revisión.",
  "editor": "Editor",
  "emptyBackpackMessage": "Los archivos guardados en tu mochila aparecerán aquí.",
  "enablePeerReview": "Permite la revisión por pares",
  "errorJavabuilderConnectionGeneral": "Se ha producido un error de conexión con nuestro servidor. Inténtalo de nuevo.",
  "errorLoadingClassmates": "Se ha producido un error al cargar la lista de tus compañeros de clase. Por favor, inténtalo de nuevo.",
  "errorMediaImageLoadError": "Se produjo un error al cargar la imagen.",
  "errorNeighborhoodGetSquareFailed": "El cuadrado especificado no está en la cuadrícula.",
  "errorNeighborhoodInvalidColor": "No se reconoce el nombre de color proporcionado. Consulta la documentación para ver qué nombres de color se admiten.",
  "errorNeighborhoodInvalidDirection": "La dirección proporcionada no es una dirección reconocida. Las direcciones admitidas son \"norte\", \"sur\", \"este\" y \"oeste\".",
  "errorNeighborhoodInvalidGrid": "Se ha producido un error al cargar el nivel del barrio. Ponte en contacto con nosotros en support@code.org, y asegúrate de incluir la URL de esta página en tu mensaje.",
  "errorNeighborhoodInvalidLocation": "La ubicación especificada no está en la cuadrícula.",
  "errorNeighborhoodInvalidMove": "El pintor intentó salirse de la cuadrícula o chocar contra un obstáculo.",
  "errorNeighborhoodInvalidPaintLocation": "El pintor intentó salirse de la cuadrícula o pasar por encima de un obstáculo.",
  "errorNoJavaFiles": "Los archivos que has introducido no incluyen ningún archivo .java, o están todos vacíos.",
  "errorPeerReviewDisabled": "La Revisión por Pares ha sido desactivada en este proyecto.",
  "errorProjectNotEditedYet": "Este proyecto todavía no ha sido editado. El código tendrá que ser editado antes de que pueda ejecutarse.",
  "errorSoundInvalidAudioFileFormat": "El archivo de sonido proporcionado está en un formato no compatible. En este momento sólo se admite WAV.",
  "errorSoundMissingAudioData": "El archivo de sonido proporcionado no contenía datos de audio.",
  "errorTheaterDuplicatePlayCommand": "El método play() sólo puede ser llamado una vez por cada ejecución del programa.",
  "errorTheaterInvalidShape": "Una figura debe contener un número par de valores para representar las coordenadas (x,y), y debe incluir al menos 4 valores.",
  "errorTheaterVideoTooLarge": "Tu vídeo es demasiado grande. Por favor, disminuye el número de fotogramas del video e inténtalo de nuevo.",
  "errorTheaterVideoTooLong": "Tu vídeo ha superado el tiempo máximo de reproducción. Por favor, reduce la duración del vídeo e inténtalo de nuevo.",
  "exceptionMessage": "[EXCEPTION] {message}",
  "exceptionThrown": "[EXCEPTION] {exceptionName} fue lanzada",
  "failedTestResult": "{className} > {methodName} FALLADO",
  "feedbackBeginning": "Este es el comienzo de los comentarios para tu proyecto.",
  "feedbackBeginningPeer": "Este es el comienzo de los comentarios para el proyecto de {peerName}.",
  "fileDeleteConfirm": "¿Estás seguro de que quieres eliminar los siguientes archivos de tu mochila? Esta acción no se puede deshacer.",
  "fileDeleteError": "Se ha producido un error al eliminar uno o varios de tus archivos. Por favor, inténtalo de nuevo. Los archivos no pueden ser eliminados:",
  "fileImportError": "Uno o más nombres de archivos están reservados por Laboratorio Java y no pueden ser importados a este proyecto. Archivos que no se pueden importar:",
  "fileImportServerError": "Se ha producido un error al importar uno o varios de tus archivos. Por favor, inténtalo de nuevo. Los archivos no pueden ser importados:",
  "fileImportWarning": "Tienes uno o más nombres de archivo duplicados entre este proyecto y tus archivos de mochila seleccionados. Los nombres de archivo duplicados son:",
  "fileImportWarningConfirm": "¿Quieres sustituir estos archivos por los de tu mochila?",
  "fileLoadError": "Se produjo un error al cargar el archivo {filename}.",
  "fileNotFoundException": "Tu código generó una Excepción de Archivo No Encontrado (FileNotFoundException) mientras se ejecutaba el nombre del archivo: {causeMessage}",
  "generatingProgress": "{progressTime} segundos generados...",
  "genericError": "Error",
  "genericErrorMessage": "Por favor, inténtalo de nuevo",
  "genericSaveErrorTitle": "Error al guardar",
  "illegalMethodAccess": "Has intentado acceder a un método que está bloqueado por nuestra política de seguridad.\n{cause}",
  "import": "Importar",
  "inStartSourcesMode": "Estás editando fuentes de inicio.",
  "includeFiles": "Incluir archivos",
  "insertCode": "Insertar código",
  "internalCompilerException": "Oops. Hemos encontrado un error al compilar tu programa. Intenta ejecutarlo de nuevo. Si este error continúa, ponte en contacto con nosotros en support@code.org. Asegúrate de incluir la ID de la conexión {connectionId} en tu mensaje.",
  "internalException": "Oops. Nos encontramos con un error en nuestro lado. Intenta ejecutar tu programa de nuevo. Si este error continúa, ponte en contacto con nosotros en support@code.org. Asegúrate de incluir la ID de conexión {connectionId} en tu mensaje.",
  "internalRuntimeException": "Oops. Nos encontramos con un error al ejecutar tu programa. Intenta ejecutarlo de nuevo. Si este error continúa, ponte en contacto con nosotros en support@code.org. Asegúrate de incluir la ID de la conexión {connectionId} en tu mensaje.",
  "invalidJavaFilename": "Nombre de archivo no válido. Los nombres de archivos Java no pueden tener espacios.",
  "invalidJavaFilenameFormat": "Nombre de archivo inválido. El nombre de un archivo Java debe tener el formato 'NombreClase.java'.",
  "invalidMainMethod": "Se ha producido un error en tu método Main. Asegúrate de que tu método Main sea público, estático, tenga un tipo de retorno Void y tenga un solo argumento (String[] args).",
  "javaExtensionMissing": "Nombre de archivo no válido. Los nombres de archivo deben terminar en '.java'.",
  "javabuilderInvalidClassError": "{causeMessage} no es compatible con Java Lab.",
  "javabuilderJavaFilenameError": "El archivo Java: {causeMessage} tiene un nombre de archivo no válido. Los nombres de archivos Java no pueden contener espacios ni caracteres especiales.",
  "javabuilderMissingFilenameError": "En uno o más de tus archivos de proyecto faltan los nombres de los archivos.",
  "makeStarter": "Crear archivo de inicio",
  "makeSupport": "Crear archivo de soporte",
  "makeValidation": "Crear archivo de validación",
  "markComplete": "Marca Completa",
  "markIncomplete": "Marca Incompleta",
  "missingFilenameError": "El nombre del archivo no puede estar en blanco.",
  "moveLeft": "Mover a la izquierda",
  "moveRight": "Mover a la derecha",
  "newFile": "Archivo Nuevo",
  "noCodeReviewComments": "Los comentarios de tu profesor aparecerán aquí.",
  "noCodeReviewUntilStudentEditsCode": "No puedes dejar comentarios hasta que el propietario del proyecto haya modificado el código por defecto y haya pulsado el botón \"Ejecutar\"",
  "noFeedbackGiven": "No se han recibido comentarios.",
  "noMainMethod": "Error: tu programa no contiene un método principal.",
  "noOtherReviews": "Todavía no hay ningún otro proyecto listo para ser revisado.",
  "noTestsFound": "No se encontraron pruebas.",
  "noteWorthy": "Nota:",
  "onlyVisibleToYou": "los comentarios del profesor sólo son visibles para ti",
  "openedDate": "abierto {date}",
  "programCompleted": "Programa completado.",
  "programEndedUnexpectedly": "Tu programa se ha detenido inesperadamente. Es posible que no tengamos capacidad para ejecutar tu programa o que tengas problemas con la red. Comprueba tu conexión de red e inténtalo de nuevo.",
  "programStopped": "Programa detenido.",
  "refresh": "Actualizar",
  "rename": "Cambiar nombre",
  "renameFile": "Renombrar archivo",
  "replace": "Reemplazar",
  "returnToMyProject": "Volver a mi proyecto",
  "reviewClassmateProject": "Revisa el proyecto de un compañero de clase...",
  "running": "Ejecutando...",
  "runningProjectTests": "Ejecutando las pruebas de tu proyecto...",
  "runningValidation": "Ejecutando pruebas de nivel...",
  "runtimeError": "Tu código encontró una excepción mientras se ejecutaba.\n{cause}",
  "saveToBackpack": "Guardar en la mochila",
  "saving": "Guardando...",
  "sendingVideo": "Enviando vídeo. Longitud total: {totalTime} segundos.",
  "startReview": "Inicio Revisión",
  "startSourcesTemplateWarning": "ADVERTENCIA: Estás editando fuentes de inicio para un nivel con una plantilla. Las fuentes de inicio deben definirse en la plantilla.",
  "startingPainter": "Pintor principiante.",
  "submit": "Enviar",
  "successfulTestResult": "{className} > {methodName} SATISFACTORIO",
  "switchToDisplayTheme": "Cambiar a {displayTheme}",
  "teacherLabel": "profesor",
  "testsNotPassing": "Necesitas superar todas las pruebas para poder terminar el nivel.",
  "textSize": "Tamaño del texto",
  "timeout": "Tu proyecto se ha detenido.",
  "timeoutWarning": "Advertencia: tu proyecto dejará de funcionar en 15 segundos.",
  "togglePeerReviewError": "Error al activar/desactivar la revisión por pares, por favor, inténtalo de nuevo.",
  "twoMainMethods": "Error: Tu código sólo puede tener un método principal. Encontramos al menos dos clases con métodos \"main\".",
  "unauthorizedJavabuilderConnectionNotLoggedIn": "Debes estar conectado para ejecutar tu código en el Laboratorio Java. Inicia sesión y vuelve a intentarlo.",
  "unauthorizedJavabuilderConnectionStudent": "Para ejecutar tu código en el Laboratorio Java, tienes que estar asignado a una sección CSA y tu profesor tiene que estar \"verificado\". Pide ayuda a tu profesor e inténtalo de nuevo. Tu profesor puede encontrar más detalles en [este artículo.](https://support.code.org/hc/en-us/articles/115001550131)",
  "unauthorizedJavabuilderConnectionTeacher": "Para ejecutar tu código en el Laboratorio Java, necesitas convertirte en \"verificado\" o unirte a una sección de CSA de un profesor verificado. Consulta [este artículo](https://support.code.org/hc/en-us/articles/115001550131) para conocer los detalles de la verificación.",
  "unknownError": "Ups. Hemos encontrado un error. Intenta ejecutar tu programa de nuevo. Si el error persiste, ponte en contacto con nosotros en support@code.org. Asegúrate de incluir el ID de conexión {connectionId} en tu mensaje.\n{type}",
  "unsupportedMiniAppMessage": "Incompatibilidad de tipo de nivel: Los proyectos {miniAppType} no son compatibles con un nivel que no sea {miniAppType}.",
  "userBlocked": "Has ejecutado el código demasiadas veces y tu cuenta ha sido bloqueada. Ponte en contacto con support@code.org para desbloquear la cuenta.",
  "userBlockedTemporary": "Has alcanzado el límite del número de veces que puedes ejecutar código Java en 24 horas. Conviértete en un profesor verificado para acceder a una cuota mucho mayor para ti y tus alumnos.\nMás información sobre [cómo convertirse en profesor verificado](https://support.code.org/hc/en-us/articles/115001550131-How-to-Become-a-Verified-Teacher).\nMás información sobre [por qué es necesaria la verificación de profesores](https://support.code.org/hc/en-us/articles/6104078305549-Teacher-Verification-and-CSA).\nSi crees que este mensaje contiene un error, ponte en contacto con support@code.org.",
  "verificationDialogMessage": "El uso de Java está limitado para los nuevos usuarios. Los profesores verificados tienen acceso a una cuota mucho mayor para ellos y sus alumnos sin ningún control adicional. Puedes saber por qué es necesaria la verificación en [esta página del blog].({blogUrl})",
  "verificationHeaderMessage": "Por favor, confirme que es una persona",
  "verificationIncomplete": "La verificación no se ha completado. Por favor, ejecute su programa para intentarlo de nuevo.",
  "verificationRequiredMessage": "Verificación requerida: por favor, confirme que es una persona.",
  "verificationSuccessful": "¡Verificación correcta!",
  "waitingForServer": "Esperando una respuesta...",
  "youHaveProjectsToReview": "Tienes proyectos para revisar...",
  "yourPeer": "tu compañero"
}