{
  "abortedTestResult": "{className} > {methodName} ABANDONNÉ",
  "addAComment": "Ajoutez un commentaire",
  "addACommentToReview": "Ajouter un commentaire à l'avis",
  "allFilesCompile": "Compilation de tous les fichiers",
  "authorLabel": "auteur",
  "authorizerTokenUsed": "Vous essayez de réutiliser un jeton qui a déjà exécuté votre code. Vérifiez que vous êtes sur un réseau sécurisé avant de réessayer. Si vous pensez que ce message est une erreur, contactez support@code.org.",
  "backpackErrorTitle": "Une erreur s’est produite",
  "backpackFileNameConflictWarning": "Sauvegarder le fichier écrasera celui qui existe déjà dans votre sac à dos.",
  "backpackLabel": "Sac à dos",
  "backpackListLoadError": "Une erreur s’est produite lors du chargement de votre sac à dos. Veuillez réessayer.",
  "backpackListLoadErrorMessageCommitDialog": "Essayez de fermer et de rouvrir cette boîte de dialogue.",
  "backpackSaveErrorMessage": "Veuillez essayer à nouveau.",
  "cancel": "Annuler",
  "classNotFound": "Erreur : la définition de classe manque pour un ou plusieurs de vos fichiers Java.",
  "classroomBlocked": "Votre section a exécuté son code trop de fois et a été verrouillée. Demandez à votre professeur de contacter support@code.org pour déverrouiller votre section.",
  "clearConsole": "Vider la console",
  "closeReview": "Révision rapprochée",
  "codeEditingDisabled": "L'édition de code est désactivée pendant que votre projet est en cours de révision",
  "codeReviewDisabledMessage": "La révision du code est désactivée. Votre professeur doit vous placer dans un groupe de révision du code pour activer cette fonctionnalité.",
  "codeReviewForStudent": "Révision du code pour {student}",
  "codeReviewForYou": "Révision de votre code",
  "codeReviewingPeer": "Révision du code {peerName}",
  "commentUpdateError": "Une erreur est survenue lors du traitement de votre demande, veuillez réessayer à nouveau.",
  "commit": "Confirmer",
  "commitAndSave": "Confirmer et sauvegarder ",
  "commitCode": "Code de confirmation",
  "commitNotes": "Confirmer les notes",
  "commitNotesPlaceholder": "Entrez ici vos commentaires relatifs à cette confirmation...",
  "compilationSuccess": "Compilation effectuée avec succès.",
  "compileFailed": "Compilation échouée",
  "compiled": "Compilé !",
  "compilerError": "Nous n'avons pas pu compiler votre programme. Vérifiez votre programme puis réessayez.",
  "compiling": "Compilation en cours ...",
  "compilingProgram": "« Programme de compilation...",
  "connecting": "Connexion...",
  "console": "Console",
  "create": "Créer",
  "createNewFile": "Créer un nouveau fichier",
  "created": "Créé",
  "delete": "Supprimer",
  "deleteFileConfirmation": "Êtes-vous sûr de vouloir supprimer {filename} ?",
  "disabledPeerReviewMessage": "Activez l'évaluation par les pairs pour permettre aux autres élèves de votre groupe de laisser des commentaires sur votre projet.",
  "displayThemeDarkMode": "mode sombre",
  "displayThemeLightMode": "mode d'éclairage",
  "duplicateProjectFilenameError": "Le fichier {filename} est déjà en cours d'utilisation dans ce projet. Veuillez choisir un autre nom\n",
  "duplicateSupportFilenameError": "Le fichier {filename} est déjà en cours d'utilisation dans le code d'assistance de ce niveau. Veuillez choisir un autre nom",
  "editingDisabledUnderReview": "La modification est désactivée pendant que votre projet est en cours de révision.",
  "editor": "Éditeur",
  "emptyBackpackMessage": "Les fichiers enregistrés dans votre sac à dos apparaîtront ici.",
  "enablePeerReview": "Activer l'évaluation par les pairs",
  "errorJavabuilderConnectionGeneral": "Une erreur est survenue lors de la connexion à notre serveur. Veuillez réessayer.",
  "errorLoadingClassmates": "Une erreur est survenue lors du chargement de la liste de vos camarades de classe. Veuillez réessayer.",
  "errorMediaImageLoadError": "Une erreur s'est produite lors du chargement de l'image.",
  "errorNeighborhoodGetSquareFailed": "Le domaine spécifié n'est pas sur la grille.",
  "errorNeighborhoodInvalidColor": "Le nom de couleur que vous avez saisi n'est pas reconnu. Reportez-vous à la documentation pour savoir les noms de couleur qui sont pris en charge.",
  "errorNeighborhoodInvalidDirection": "La direction renseignée n'est pas reconnue. Les directions prises en compte sont : « Nord », « Sud », « Est » et « Ouest ».\n",
  "errorNeighborhoodInvalidGrid": "Une erreur est survenue lors du chargement du niveau de voisinage. Veuillez nous contacter à l'adresse support@code.org, et n'oubliez pas de mentionner l'URL de cette page dans votre courrier.",
  "errorNeighborhoodInvalidLocation": "L'emplacement spécifié n'est pas sur la grille.",
  "errorNeighborhoodInvalidMove": "Le peintre a essayé de sortir de la grille ou s'est heurté à un obstacle.",
  "errorNeighborhoodInvalidPaintLocation": "Le peintre a essayé de peindre en dehors de la grille ou par-dessus un obstacle.",
  "errorNoJavaFiles": "Les fichiers que vous avez fournis ne contiennent aucun fichier .java ou sont tous vides.",
  "errorPeerReviewDisabled": "L'évaluation par les pairs a été désactivée pour ce projet.",
  "errorProjectNotEditedYet": "Ce projet n'a pas encore été modifié. Veuillez modifier le code avant de l'exécuter.",
  "errorSoundInvalidAudioFileFormat": "Le format du fichier audio fourni n'est pas pris en charge. Seul le format WAV est pris en charge pour le moment.",
  "errorSoundMissingAudioData": "Le fichier audio fourni ne contient aucune données audio.",
  "errorTheaterDuplicatePlayCommand": "La fonction play() ne peut être utilisée qu'une seule fois par exécution du programme.",
  "errorTheaterInvalidShape": "Chaque figure doit contenir un nombre pair de valeurs représentant les coordonnées (x,y), et doit inclure au moins 4 valeurs.",
  "errorTheaterVideoTooLarge": "Votre vidéo est trop volumineuse. Réduisez le nombre d'images de votre vidéo et réessayez.",
  "errorTheaterVideoTooLong": "Votre vidéo a dépassé la durée de lecture maximale. Réduisez la durée de votre vidéo et réessayez.",
  "exceptionMessage": "[EXCEPTION] {message}",
  "exceptionThrown": "[EXCEPTION] {exceptionName} a été lancé",
  "failedTestResult": "{className} > {methodName} A ÉCHOUÉ",
  "feedbackBeginning": "Les commentaires sur votre projet vont commencer.",
  "feedbackBeginningPeer": "C'est le début des commentaires sur le projet {peerName}.",
  "fileDeleteConfirm": "Êtes-vous sûr de vouloir supprimer les fichiers suivants de votre sac à dos ? Cette action ne peut pas être annulée.",
  "fileDeleteError": "Une erreur s'est produite lors de la suppression d'un ou de plusieurs de vos fichiers. Veuillez réessayer. Fichiers impossibles à supprimer :",
  "fileImportError": "Un ou plusieurs noms de fichiers sont protégés par Java Lab et ne peuvent pas être importés dans ce projet. Impossible d'importer les fichiers :",
  "fileImportServerError": "Une erreur s'est produite lors de l'importation d'un ou de plusieurs de vos fichiers. Veuillez réessayer. Fichiers impossibles à importer :",
  "fileImportWarning": "Il y a un ou plusieurs noms de fichiers dupliqués dans ce projet ou dans les fichiers du sac à dos que vous avez sélectionnés. Les noms de fichiers dupliqués sont :",
  "fileImportWarningConfirm": "Voulez-vous remplacer ces fichiers par ceux qui sont dans votre sac à dos ?",
  "fileLoadError": "Une erreur s'est produite lors du chargement du fichier {filename}.",
  "fileNotFoundException": "Votre code a généré une exception FileNotFoundException lors de l'exécution du fichier : {causeMessage}.",
  "generatingProgress": "{progressTime} secondes générées...",
  "genericError": "Erreur",
  "genericErrorMessage": "Veuillez réessayer.",
  "genericSaveErrorTitle": "Erreur de sauvegarde",
  "illegalMethodAccess": "Vous avez essayé d'accéder à une fonction qui est bloquée en raison de notre politique de sécurité.\n{cause}",
  "import": "Importer",
  "inStartSourcesMode": "Vous modifiez les sources de départ.",
  "includeFiles": "Insérer des fichiers",
  "insertCode": "Insérer le code",
  "internalCompilerException": "Oups. Nous avons rencontré un problème lors de la compilation de votre programme. Essayez de le relancer. Si cette erreur persiste, contactez-nous à l'adresse support@code.org. N'oubliez pas de mentionner dans votre courrier l'identifiant de connexion {connectionId}.",
  "internalException": "Oups. Nous avons rencontré un problème de notre côté. Essayez à nouveau de lancer votre programme. Si cette erreur persiste, contactez-nous à l'adresse support@code.org. N'oubliez pas de mentionner dans votre courrier l'identifiant de connexion {connectionId}.\n",
  "internalRuntimeException": "Oups. Nous avons rencontré un problème lors de l'exécution de votre programme. Essayez de l'exécuter à nouveau. Si cette erreur persiste, contactez-nous à l'adresse support@code.org. N'oubliez pas de mentionner dans votre courrier l'identifiant de connexion {connectionId}.",
  "invalidJavaFilename": "Nom de fichier non valide. Les noms de fichiers Java ne peuvent pas contenir d'espaces.",
  "invalidJavaFilenameFormat": "Nom de fichier non valide. Un nom de fichier Java doit être au format « ClassName.java ».",
  "invalidMainMethod": "Une erreur est survenue au niveau de votre technique principale. Assurez-vous que votre technique principale est publique, statique, que le type de retour est void et qu'elle n'a qu'un seul argument (String[] args).",
  "javaExtensionMissing": "Nom de fichier non valide. Les noms de fichiers doivent se terminer par '.java'.",
  "javabuilderInvalidClassError": "{causeMessage} n'est pas pris en charge par Java Lab.",
  "javabuilderJavaFilenameError": "Le fichier Java : {causeMessage} porte un nom de fichier invalide. Les noms de fichiers Java ne doivent pas contenir d'espaces ou de caractères spéciaux.",
  "javabuilderMissingFilenameError": "Un ou plusieurs de vos fichiers de projet ne portent pas de nom de fichier.",
  "makeStarter": "Créer un fichier de démarrage",
  "makeSupport": "Créer un fichier de support",
  "makeValidation": "Créer un fichier de validation",
  "markComplete": "Marquer comme terminé",
  "markIncomplete": "Marquer comme inachevé",
  "missingFilenameError": "Vous devez saisir un nom pour le fichier.",
  "moveLeft": "Déplacer vers la gauche",
  "moveRight": "Déplacez-vous à droite",
  "newFile": "Nouveau fichier",
  "noCodeReviewComments": "Les commentaires faits par votre professeur apparaîtront ici.",
  "noCodeReviewUntilStudentEditsCode": "Vous ne pouvez pas commenter tant que le propriétaire du projet n'a pas modifié le code par défaut et cliqué sur le bouton « Exécuter ».",
  "noFeedbackGiven": "Aucun commentaire n'a été donné.",
  "noMainMethod": "Erreur : votre programme ne contient pas de fonction principale.",
  "noOtherReviews": "Aucun autre projet n'est encore prêt pour être évalué.",
  "noTestsFound": "Aucun test n'a été trouvé.",
  "noteWorthy": "Remarque :",
  "onlyVisibleToYou": "les commentaires des enseignants ne peuvent être lus que par vous",
  "openedDate": "ouvert {date}",
  "programCompleted": "Programme terminé.",
  "programEndedUnexpectedly": "Votre programme s'est arrêté de façon inattendue. Il se peut que nous ne soyons pas en mesure d'exécuter votre programme ou que vous rencontriez des problèmes de réseau. Vérifiez votre connexion réseau et réessayez.",
  "programStopped": "Le programme s'est arrêté.",
  "refresh": "Actualiser",
  "rename": "Renommer",
  "renameFile": "Renommer le fichier",
  "replace": "Remplacer",
  "returnToMyProject": "Revenir à mon projet",
  "reviewClassmateProject": "Évaluer le projet d'un camarade de classe...",
  "running": "En cours d'exécution...",
  "runningProjectTests": "Exécution des tests de votre projet...",
  "runningValidation": "Exécution de tests de niveau...",
  "runtimeError": "Une erreur s'est produite lors de l'exécution de votre code.{cause}",
  "saveToBackpack": "Sauvegarder dans le sac à dos",
  "saving": "Enregistrement en cours...",
  "sendingVideo": "Envoi de vidéos. Durée totale : {totalTime} seconde.",
  "startReview": "Commencer la révision",
  "startSourcesTemplateWarning": "AVERTISSEMENT : Vous modifiez les sources de départ d'un niveau à l'aide d'un modèle. Les sources de départ doivent être définies dans le modèle.",
  "startingPainter": "Commencer la peinture.",
  "submit": "Envoyer",
  "successfulTestResult": "{className} > {methodName} RÉUSSI",
  "switchToDisplayTheme": "Passer à {displayTheme}",
  "teacherLabel": "Professeur",
  "testsNotPassing": "Vous devez réussir tous les tests avant de pouvoir terminer le niveau.",
  "textSize": "Taille du texte",
  "timeout": "Votre projet a été interrompu.",
  "timeoutWarning": "Attention : votre projet sera interrompu dans 15 secondes.",
  "togglePeerReviewError": "Erreur d'activation/de désactivation de l'évaluation par les pairs, veuillez réessayer.",
  "twoMainMethods": "Erreur : Votre code ne peut avoir qu'une seule méthode principale. Nous avons trouvé au moins deux classes avec des méthodes principales.",
  "unauthorizedJavabuilderConnectionNotLoggedIn": "Vous devez être connecté pour exécuter votre code dans Java Lab. Connectez-vous et réessayez.",
  "unauthorizedJavabuilderConnectionStudent": "Pour exécuter votre code dans Java Lab, vous devez être affecté à une section CSA et votre professeur doit être « vérifié ». Demandez de l'aide à votre professeur et réessayez. Votre professeur peut trouver plus de détails dans [cet article.] (https://support.code.org/hc/en-us/articles/115001550131)",
  "unauthorizedJavabuilderConnectionTeacher": "Pour exécuter votre code dans Java Lab, vous devez être « vérifié » ou rejoindre une section CSA appartenant à un professeur certifié. Consultez [cet article] (https://support.code.org/hc/en-us/articles/115001550131) pour plus de détails sur la procédure à suivre pour être vérifié.",
  "unknownError": "Oups. Une erreur s'est produite de notre côté. Essayez à nouveau d'exécuter votre programme. Si cette erreur persiste, veuillez nous contacter à l'adresse support@code.org. N'oubliez pas de mentionner dans votre message l'ID de connexion {connectionId}.\n{type}",
  "userBlocked": "Vous avez exécuté votre code trop de fois et votre compte a été verrouillé. Contactez support@code.org pour déverrouiller votre compte.",
  "userBlockedTemporary": "Vous avez atteint la limite du nombre de fois que vous pouvez exécuter du code Java en 24 heures. Devenez un professeur vérifié pour accéder à un quota beaucoup plus élevé pour vous et vos élèves.\nEn savoir plus sur [comment devenir un professeur certifié] (https://support.code.org/hc/en-us/articles/115001550131-How-to-Become-a-Verified-Teacher).\nDécouvrez [pourquoi la vérification par l'enseignant est nécessaire] (https://support.code.org/hc/en-us/articles/6104078305549-Teacher-Verification-and-CSA).\nSi vous pensez que ce message est une erreur, contactez support@code.org.",
  "waitingForServer": "En attente d'une réponse...",
  "youHaveProjectsToReview": "Vous avez des projets à revoir...",
  "yourPeer": "vos pairs"
}