{
  "addAComment": "Opmerking toevoegen",
  "allFilesCompile": "Alle bestanden compileren!",
  "authorLabel": "auteur",
  "backpackErrorTitle": "Er vond een fout plaats.",
  "backpackFileNameConflictWarning": "Opslaan zal een bestaand bestand in uw 'backpack' overschrijven.",
  "backpackLabel": "Backpack",
  "backpackListLoadError": "Er vond een fout plaats tijdens het laden van uw 'backpack'. Probeer het nog een keer.",
  "backpackListLoadErrorMessageCommitDialog": "Probeer dit dialoogvenster te sluiten en weer te openen.",
  "backpackSaveErrorMessage": "Probeer het nog een keer.",
  "cancel": "Annuleren",
  "classNotFound": "Fout: bij een of meerdere van uw Java-bestanden ontbreekt een klassedefinitie.",
  "clearConsole": "Console wissen",
  "commentUpdateError": "Er is een fout opgetreden tijdens het verwerken van uw verzoek. Probeer het nog een keer.",
  "commit": "Bevestigen",
  "commitAndSave": "Bevestigen en opslaan",
  "commitCode": "Code bevestigen",
  "commitNotes": "Notities bevestigen",
  "commitNotesPlaceholder": "Voer hier notities over deze bevestiging in...",
  "compilationSuccess": "Het compileren is gelukt.",
  "compileFailed": "Het compileren is mislukt.",
  "compilerError": "Het is niet gelukt uw programma te compileren. Kijk of er bugs in uw programma zitten en probeer het nog een keer.",
  "compiling": "Bezig met compileren...",
  "console": "Console",
  "create": "Maak",
  "delete": "Verwijderen",
  "deleteFileConfirmation": "Weet u zeker dat u {filename} wilt verwijderen?",
  "disabledPeerReviewMessage": "Laat collegae meekijken om andere studenten in staat te stellen opmerkingen bij uw project achter te laten. ",
  "duplicateProjectFilenameError": "De bestandsnaam {filename} wordt reeds in dit project gebruikt. Kies een andere naam.",
  "duplicateSupportFilenameError": "De bestandsnaam {filename} wordt reeds gebruikt in de ondersteuningscode van dit niveau. Kies een andere naam.",
  "editor": "Editor",
  "emptyBackpackMessage": "De in uw backpack opgeslagen bestanden zullen hier verschijnen.",
  "enablePeerReview": "Collegiale toetsing inschakelen",
  "errorJavabuilderConnectionGeneral": "Er vond een fout plaats toen er contact werd gemaakt met onze server. Probeer het nog een keer.",
  "errorLoadingClassmates": "Tijdens het laden van de lijst met klasgenoten vond er een fout plaats. Probeer het nog een keer.",
  "errorMediaImageLoadError": "Het laden van de afbeelding verliep niet goed.",
  "errorNeighborhoodGetSquareFailed": "Het opgegeven vierkant staat niet op het raster.",
  "errorNeighborhoodInvalidColor": "De opgegeven kleurnaam wordt niet herkent. Raadpleeg de documentatie om te zien wlke kleurnamen mogelijk zijn.",
  "errorNeighborhoodInvalidDirection": "De opgegeven richting wordt niet herkent. De ondersteunde richtingen zijn \"noord\", \"zuid\", \"oost\" en \"west\".",
  "errorNeighborhoodInvalidGrid": "Er vond een fout plaats tijdens het laden van het buurtniveau. Neem contact met ons op via support@code.org, en vergeet niet de URL van deze pagina te vermelden in uw bericht.",
  "errorNeighborhoodInvalidLocation": "De opgegeven locatie staat niet op het raster.",
  "errorNeighborhoodInvalidMove": "De schilder probeerde van het raster te verdwijnen of raakte een obstakel.",
  "errorNeighborhoodInvalidPaintLocation": "De schilder probeerde buiten het raster of over een obstakel te verven.",
  "errorPeerReviewDisabled": "Voor dit project werd de collegiale toetsing uitgeschakeld.",
  "errorProjectNotEditedYet": "De project is nog niet bewerkt. De programmering moet worden bewerkt voordat het kan worden uitgevoerd.",
  "errorSoundInvalidAudioFileFormat": "Het gebruikte geluidsbestand is in een format dat niet wordt ondersteunt. Op dit moment wordt alleen WAV ondersteunt.",
  "errorSoundMissingAudioData": "Het gebruikte geluidsbestand bevat geen audiogegevens.",
  "errorTheaterDuplicatePlayCommand": "De afspeelmethode() kan slechts één keer per uitvoering van het programma worden opgeroepen.",
  "errorTheaterInvalidShape": "Een voerm moet een even aantal waarden bevatten voor de (x,y) coördinaten, en ten minste 4 waarden bevatten.",
  "feedbackBeginning": "Dit is het begin van de feedback voor jouw project.",
  "feedbackBeginningPeer": "Dit is het begin van de feedback voor het project van {peerName}.",
  "fileImportError": "Een of meerdere bestandsnamen zijn gereserveerd door Java Lab en kunnen niet in dit project worden geïmporteerd. Bestanden die niet konden worden geïmporteerd:",
  "fileImportWarning": "U hebt één of meerdere dubbele bestandsnamen in dit project en de door uw geselecteerde backpack-bestanden. De dubbele bestandsnamen zijn:",
  "fileImportWarningConfirm": "Wilt u deze bestanden vervangen met de bestanden uit uw backpack?",
  "fileLoadError": "Er vond een fout plaats tijdens het laden van het bestand {filename}.",
  "fileNotFoundException": "Uw programma gaf een FileNotFoundException tijdens het uitvoeren van bestandsnaam: {causeMessage}",
  "genericErrorMessage": "Probeer het nog een keer.",
  "genericSaveErrorTitle": "Fout opslaan",
  "illegalMethodAccess": "U hebt geprobeerd een methode te gebruiken die door ons beveiliginsbeleid is geblokkeerd.\n{cause}",
  "import": "Importeren",
  "includeFiles": "Inclusief bestanden",
  "internalCompilerException": "Oeps! We hebben een fout gemaakt tijdens het compileren van uw programma. Probeer het weer uit te voeren. Als deze fout zich blijft voordoen, neem dan contact met ons op via support@code.org. Vergeet niet de verbindings-ID {connectionId} in uw bericht te vermelden.",
  "internalException": "Oeps! We hebben een fout gemaakt. Probeer het programma opnieuw uit te voeren. Als deze fout zich blijft voordoen, neem dan contact met ons op via support@code.org. Vergeet niet de verbindings-ID {connectionId} in uw bericht te vermelden.",
  "internalRuntimeException": "Oeps. We hebben een fout gemaakt tijdens het uitvoeren van uw programma. Probeer het nog een keer uit te voeren. Als deze fout zich blijft voordoen, neem dan contact met ons op via support@code.org. Vergeet niet de vebindings-ID {connectionId} in uw bericht te vermelden.",
  "invalidJavaFilename": "Ongeldige bestandsnaam. Java-bestandsnamen kunnen geen spaties bevatten.",
  "javaExtensionMissing": "Ongeldige bestandsnaam. Bestandsnamen moeten eindigen in '.java'.",
  "javabuilderJavaFilenameError": "Java-bestand: {causeMessage} heeft een ongeldige bestandsnaam. Java-bestandsnamen mogen geen spaties of speciale tekens bevatten.",
  "javabuilderMissingFilenameError": "Een of meer van uw projectbestanden hebben geen bestandsnamen.",
  "markComplete": "Markeer als voltooid",
  "markIncomplete": "Markeer als onvoltooid",
  "missingFilenameError": "De bestandsnaam mag niet leeg zijn.",
  "newFile": "Nieuw bestand",
  "noCodeReviewComments": "Hier verschijnen de opmerkingen van je leraar.",
  "noCodeReviewUntilStudentEditsCode": "U kunt pas opmerkingen achterlaten als de eigenaar van het project de standaard code heeft aangepast en op de knop \"Uitvoeren\" heeft geklikt.",
  "noMainMethod": "Fout: uw programma bevat geen hoofdmethode.",
  "noOtherReviews": "Er zijn nog geen andere project klaar om te wordne geëvalueerd.",
  "onlyVisibleToYou": "Alleen jij kunt de opmerkingen van de leraar lezen.",
  "programCompleted": "Programma voltooid.",
  "refresh": "Vernieuwen",
  "rename": "Hernoemen",
  "replace": "Vervangen",
  "returnToMyProject": "Ga terug naar mijn project",
  "reviewClassmateProject": "Bekijk het project van een klasgenoot...",
  "running": "Wordt uitgevoerd...",
  "runtimeError": "Je code heeft een uitzondering gemaakt tijdens het uitvoeren.\n{cause}",
  "saveToBackpack": "Opslaan in de backpack",
  "saving": "Bezig met opslaan...",
  "startingPainter": "Painter wordt gestart.",
  "submit": "Insturen",
  "teacherLabel": "leraar",
  "timeout": "Uw project is gestopt.",
  "timeoutWarning": "Waarschuwing; uw project zal over 15 seconden stoppen!",
  "togglePeerReviewError": "Fout bij het in- of uitschakelen van de collegiale toetsing. Probeer het nog een keer.",
  "twoMainMethods": "Fout: uw code mag slechts één hoofdmethode bevatten. We hebben ten miste twee klassen met hoofdmethoden aangetroffen.",
  "unknownError": "Oeps! Wij hebben een fout gemaakt. Probeeer uw programma nog een keer uit te voeren. Als de fout zich blijft voordoen, neem dan contact met ons op via support@code.org. Vergeet niet de verbinidngs-ID {connectionId} te vermelden in uw bericht.\n{type}",
  "yourPeer": "je collega"
}