{
  "abortedTestResult": "{className}{methodName} FAALEAOGA",
  "addAComment": "fai se faamatalaga",
  "allFilesCompile": "Ua tuufaatasia uma faila",
  "authorLabel": "tusitala",
  "backpackErrorTitle": "Na iai se faaletonu",
  "backpackFileNameConflictWarning": "O le teuina o faila, e suia atoa se faila o loo i totonu o lau ato",
  "backpackLabel": "ato",
  "backpackListLoadError": "O loo iai se faaletonu i le faaalu ae o lau ato. Toe taumafai",
  "backpackListLoadErrorMessageCommitDialog": "Taumafai e tapuni ma toe tatala lenei talanoaga",
  "backpackSaveErrorMessage": "Toe taumafai faamolemole",
  "cancel": "Taofi",
  "classNotFound": "Faaletonu: o se tasi pe sili o au faila Java e le o iai se faamatalaga o le vasega",
  "clearConsole": "Faakilia le Console",
  "commentUpdateError": "Na iai le faaletonu i le faagaioiga o lau talosaga, faamolemole toe taumafai. ",
  "commit": "Faamau",
  "commitAndSave": "Faamau & Teu",
  "commitCode": "Faamau le Faailo",
  "commitNotes": "Faamau Faamatalaga",
  "commitNotesPlaceholder": "Tuu ifo faamatalaga e faatatau i le faamau iinei",
  "compilationSuccess": "Manuia le tuufaatasiga",
  "compileFailed": "Le manuia le Tuufaatasiga",
  "compiled": "Na tuufaatasi",
  "compilerError": "Matou te lei mafai ona tuufaatasi lau polokalame. Vaai ni faaletonu o lau polokalame ma toe taumafai.",
  "compiling": "O loo tuufaatasi",
  "compilingProgram": "Tuufaatasi le polokalame",
  "console": "Console",
  "create": "Fai",
  "deleteFileConfirmation": "O e mautinoa e te manao e aveese {filename}?",
  "disabledPeerReviewMessage": "Faataga se paga e toe iloilo e mafai ai e isi tamaiti o lau vaega e tuu ifo se faamatalaga i luga o lau poloketi. ",
  "displayThemeDarkMode": "faapogisa",
  "displayThemeLightMode": "malamalama",
  "duplicateProjectFilenameError": "Igoa o le faila {filename}o loo faaaogaina i lenei poloketi. Faamolemole toe fai seisi igoa",
  "duplicateSupportFilenameError": "Igoa o le faila {filename}o loo faaaogaina i le faailo lagolago o le laasaga lenei. Faamolemole toe fai seisi igoa",
  "editor": "Faatonu",
  "emptyBackpackMessage": "O faila ua teuina i lau ato e aliali iinei",
  "enablePeerReview": "Tatala le Iloilo a Paga",
  "errorJavabuilderConnectionGeneral": "Ua iai se faaletonu i le tau fesootai ma le matou masini o fesootaiga. Toe taumafai. ",
  "errorLoadingClassmates": "Na iai le faaletonu i le faaalu ae o le lisi o tamaiti o lau vasega. Faamolemole toe taumafai. ",
  "errorMediaImageLoadError": "Na iai le faaletonu i le faaalu ae o le ata",
  "errorNeighborhoodGetSquareFailed": "O le tafafa faatonuina e le o i le pusa",
  "errorNeighborhoodInvalidColor": "O le lanu ua uma e le o talia. Toe vaai pepa ma faila e iloa ai poo a lanu e talia. ",
  "errorNeighborhoodInvalidDirection": "O le faasino ala ua sauni e le o talia. O faasino ala e talia o le \"matu\", \"saute\", \"sasae\", ma \"sisifo\". ",
  "errorNeighborhoodInvalidGrid": "Na iai le faaletonu i le faaalu ae o le laasaga o tuaoi ma le nuu. Faamolemole faafesootaimai matou i le support@code.org ma e tatau ona tusia ai foi ma le URL o lenei itulau i lau imeli. ",
  "errorNeighborhoodInvalidLocation": "O le nofoaga na faatonu e le o i luga o le pusa. ",
  "errorNeighborhoodInvalidMove": "O le tagata vali sa taumafai e alu ese ma le pusa pe alu i totonu o le poloka faigata.",
  "errorNeighborhoodInvalidPaintLocation": "O le tagata vali na vali i fafo atu ma le pusa pe ova atu o se poloka faigata",
  "errorNoJavaFiles": "O faila na e saunia e le o taulia ai faila o le java poo ua leai se mea o i totonu o faila.",
  "errorPeerReviewDisabled": "O le Iloiloga a Paga ua le faaaogaina i lenei poloketi. ",
  "errorProjectNotEditedYet": "O lenei poloketi e le o iai ni suiga. E manaomia ona sui le faailo ae lei faaalu le poloketi. ",
  "errorSoundInvalidAudioFileFormat": "O le faila musika na aumai e le lagolagoina lenei ituaiga. Na o le WAV e talia i lenei taimi",
  "errorSoundMissingAudioData": "O le faila musika na aumai e le iai se leo",
  "errorTheaterDuplicatePlayCommand": "O le metotia amata () na o le tasi lava le taimi i faasalaga a le polokalame e mafai ai ona valaau ai. ",
  "errorTheaterInvalidShape": "O le foliga e manaomia ona iai numera sogia o numera taua e faailoa ai (x,y) coordinate ma e tatau ona iai ni numera taua se 4",
  "errorTheaterVideoTooLarge": "E lapoa tele lau video. Faamolemole toe faaitiiti le numera o frames i lau video ma toe taumafai.",
  "errorTheaterVideoTooLong": "Ua ausia e lau video taimi faatapulaaina e mafai ai ona faaalu. Faamolemole faaitiiti le umi o lau video ma toe taumafai.",
  "exceptionThrown": "[EXCEPTION]{exceptionName} na togi",
  "failedTestResult": "{className}{methodName} LE MANUIA",
  "feedbackBeginning": "O le amataga lenei o au tali mo lau poloketi",
  "feedbackBeginningPeer": "O le amataga lenei o au tali mo le poloketi a {peerName}",
  "fileImportError": "E tasi pe sili atu igoa o faila o loo faataoto e le Java Lab ma e le mafai ona sii mai i totonu o lenei poloketi. O faila nei e le mafai ona sii mai:",
  "fileImportWarning": "E tasi pe sili atu igoa o faila tutusa ua faaluaina i le va o lenei poloketi ma faila teu ua e filifilia. O faila tutusa nei ua faaluaina:",
  "fileImportWarningConfirm": "E te manao e sui faila nei mai faila o loo e teu?",
  "fileLoadError": "Na iai le faaletonu i le faaalu ae o le faila {filename}.",
  "fileNotFoundException": "O lau faailo na togi le FileNotFoundException a o faaalu le igoa mo le faila:{causeMessage}",
  "generatingProgress": "{progressTime} sekone e fai ai",
  "genericErrorMessage": "Toe taumafai faamolemole",
  "genericSaveErrorTitle": "Teu le faaletonu",
  "illegalMethodAccess": "Sa e taumafai e faaaoga se metotia o loo polokaina i aiaiga a le matou puipuiga {cause}.",
  "import": "Aumai i totonu",
  "includeFiles": "Faitaulia Faila",
  "internalCompilerException": "Oi. Ua iai se faaletonu i le matou itu a o tuufaatasi lau polokalame. Toe taumafai e faaalu. Afai e aliali pea le faaleonu, faafesootai mai matou i le support@code.org. Ia mautinoa e tuu i totonu le ID o fesootaiga {connectionId} i lau tusi.",
  "internalException": "Oi. O loo iai se faaletonu i le matou itu. Toe taumafai e faaalu lau polokalame. Afai e faaauau pea lenei faaletonu, faafesootai mai matou i le support@code.org. Ia mautinoa e tuu iai ma lau ID o fesootaiga {connectionId} i lau tusi. ",
  "internalRuntimeException": "Oi. O loo iai se faaletonu i le matou itu a o alu lau polokalame. Toe taumafai e faaalu. Afai e faaauau pea lenei faaletonu, faafesootai mai matou i le support@code.org. Ia mautinoa e tuu iai ma lau ID o fesootaiga {connectionId} i lau tusi. ",
  "invalidJavaFilename": "E le o sao le igoa o le faila. O igoa o faila a le Java e le tatau ona iai ni va.",
  "invalidJavaFilenameFormat": "E le o sao le igoa o le faila. O igoa o faila a le Java tatau ona faatulaga 'ClassName.java'.",
  "javaExtensionMissing": "E le o sao le igoa o le faila. O igoa o faila e tatau ona faaiu i le '.java'.",
  "javabuilderInvalidClassError": "{causeMessage} e le o lagolagoina e le Java Lab.",
  "javabuilderJavaFilenameError": "O le faila Java: {causeMessage} o le igoa o le faila e le taulia. O igoa o faila a le Java le tatau ona iai ni poo ni mataitusi faapitoa.",
  "javabuilderMissingFilenameError": "E tasi pe sili atu foi faila a au poloketi e le o faaigoa.",
  "makeStarter": "Fai se faila amata",
  "makeSupport": "Fai se faila lagolago",
  "makeValidation": "Fai se faila faamaonia",
  "markComplete": "Faailoa ua Maea",
  "markIncomplete": "Faailoa e le Maea",
  "missingFilenameError": "O igoa o faila e le tatau ona tuufua",
  "newFile": "Faila Fua",
  "noCodeReviewComments": "O faamatalaga mai au faiaoga e aliali iinei",
  "noCodeReviewUntilStudentEditsCode": "E le mafai ona e alu ese mai comments sei vagana ua suia e le ana le poloketi le default code ma oomi le ki \"Run\".",
  "noMainMethod": "Faaletonu: o lau polokalame e le iai se metotia autu",
  "noOtherReviews": "E le o iai nisi poloketi o sauni mo se iloiloga.",
  "onlyVisibleToYou": "na o oe lava e iloa atu faamatalaga a faiaoga ",
  "programCompleted": "Ua uma na e faia le polokalame",
  "refresh": "Toe faafou",
  "rename": "Toe faaigoa",
  "replace": "Toe suitulaga",
  "returnToMyProject": "Toe foi i la'u poloketi",
  "reviewClassmateProject": "Iloilo se poloketi a se tamaitiiti aoga",
  "running": "Faaalu",
  "runningProjectTests": "Faaalu suega mo lau poloketi",
  "runningValidation": "Faaalu suega o laasaga",
  "runtimeError": "O lau faailo na maua le exception a o faaalu.\n{cause}",
  "saveToBackpack": "Teu i le Atofaafafa ",
  "saving": "o loo teu",
  "sendingVideo": "Lafo le video. Aofaiga o le umi:{totalTime} sekone.",
  "startingPainter": "Amata le valiata",
  "successfulTestResult": "{className}{methodName} MANUIA",
  "switchToDisplayTheme": "Sui i le {displayTheme}",
  "teacherLabel": "faiaoga",
  "timeout": "O lau poloketi na taofi. ",
  "timeoutWarning": "Lapataiga: o lau poloketi e taofi i le isi 15 sekone.",
  "togglePeerReviewError": "Faaletonu le tatalaina/faaleaogaina o le iloiloga a paga, faamolemole toe taumafai. ",
  "twoMainMethods": "Faaletonu: O lau faailo e nao le tasi lava metotia autu e mafai ona faaaoga. Ua matou maua ni vasega se lua o loo iai ni metotia autu. ",
  "unknownError": "Oi. Ua iai se faaletonu i le matou itu. Toe taumafai e toe faaalu lau polokalame. Afai e faaauau pea lenei faaletonu, faafesootai mai matou i le support@code.org. Tautuana e tuu iai foi ma le ID o le fesootaiga {connectionId} i lau feau tusitusia. {type}",
  "yourPeer": "o lau paga "
}