{
  "clicked": "",
  "clickedSprite": "",
  "subject": "",
  "subjectSprite": "",
  "object": "",
  "objectSprite": "",
  "errorLoadingAnimation": "Parece que estamos com problemas para carregar sua animação \"{animationName}\". Verifique se você tem uma boa conexão com a Internet e tente recarregar a página. Se esse problema persistir, é possível que essa animação seja interrompida. Nesse caso, talvez seja necessário continuar removendo a animação.",
  "reinfFeedbackMsg": "Você terminou! Clique em \"Continuar\" para passar para o próximo nível.",
  "shareGame": "Compartilhe seu jogo:",
  "spritelabFeedbackCreateFishWithBehavior": "Você precisa fazer pelo menos um sprite de peixe e dar um comportamento a ele.",
  "spritelabFeedbackMoveFishLeftRight": "Seu sprite de peixe precisa se mover para a esquerda ou para a direita. Tente mudar seu comportamento.",
  "spritelabFeedbackChangeBackgroundColor": "Você precisa alterar o plano de fundo para algo diferente de branco.",
  "spritelabFeedbackCreateTwoSprites": "Você precisa criar exatamente dois sprites.",
  "spritelabFeedbackTwoSpritesWithCostumes": "Seus dois sprites precisam de roupas diferentes.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Você precisa criar dois sprites com roupas diferentes, cada um com um comportamento.",
  "spritelabFeedbackClickSprite": "Certifique-se de clicar no seu sprite depois de pressionar `Executar`.",
  "spritelabFeedbackUseSpinningBehavior": "Seu sprite precisa começar a girar. Tente mudar seu comportamento.",
  "spritelabFeedbackPinkAlienBehavior": "Seu sprite alienígena rosa não iniciou um comportamento.",
  "spritelabFeedbackCreateThreeAliens": "Você precisa criar um alien azul, um alien rosa e um alien amarelo.",
  "spritelabFeedbackAliensNotInLine": "Seus três sprites alienígenas precisam ser organizados em uma linha horizontal (dentro de 50 pixels).",
  "spritelabFeedbackYellowAlienBehavior": "O alien amarelo não iniciou seu comportamento.",
  "spritelabFeedbackNoAlienColor": "Pelo menos um de seus alienígenas não mudou de cor.",
  "spritelabFeedbackNeedAlienStopBehavior": "Seus sprites alienígenas precisam parar todos os seus comportamentos.",
  "spritelabFeedbackBlueAlienBehavior": "Seu alien azul precisa começar um novo comportamento.",
  "spritelabFeedbackUseCostume": "Você precisa usar pelo menos uma roupa.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Você precisa criar três sprites com roupas diferentes.",
  "spritelabFeedbackMoveUpNotDown": "Seu sprite precisa se mover para cima (norte) ao invés de para baixo (sul).",
  "spritelabFeedbackRobotFasterThanRover": "O robô alcançou o lado direito da tela antes da sonda.",
  "spritelabFeedbackDifferentStarRotation": "Os dois sprites com roupas de estrela precisam girar a mesma quantidade de vezes.",
  "spritelabFeedbackAstronautMoveToCorner": "O sprite astronauta precisa se mover para um dos quatro cantos."
}
