{
  "addAComment": "Προσθήκη σχολίου",
  "addACommentToReview": "Προσθήκη σχολίου στην κριτική",
  "authorizerNearLimit": "Έχετε τρέξει τον κώδικά σας πάρα πολλές φορές στο τελευταίο {lockoutPeriod}. Έχετε {attemptsLeft} απόπειρες πριν ο λογαριασμός σας κλειδωθεί μόνιμα και δεν θα μπορείτε να εκτελέσετε κώδικα Java. Παρακαλώ περιμένετε 15 λεπτά πριν προσπαθήσετε ξανά.",
  "authorizerNearLimitTemporary": "Έχετε τρέξει τον κώδικά σας πάρα πολλές φορές στο τελευταίο {lockoutPeriod}. Έχετε {attemptsLeft} προσπάθειες αριστερά. Γίνετε πιστοποιημένη δασκάλα για να αποκτήσετε πρόσβαση σε ένα πολύ υψηλότερο ποσοστό για εσάς και τους μαθητές σας.\nΜάθετε περισσότερα σχετικά με το [πώς να γίνετε επαληθευμένος δάσκαλος] (https://support.code.org/hc/en-us/articles/115001550131-How-to-Become-a-Verified-Teacher).\nΜάθετε [γιατί απαιτείται επαλήθευση των εκπαιδευτικών] (https://support.code.org/hc/en-us/articles/6104078305549-Teacher-Verification-and-CSA).\n",
  "authorizerTokenUsed": "Προσπαθείτε να χρησιμοποιήσετε ξανά ένα διακριτικό που έχει ήδη εκτελέσει τον κώδικά σας. Ελέγξτε ότι βρίσκεστε σε ασφαλές δίκτυο πριν προσπαθήσετε ξανά. Εάν πιστεύετε ότι αυτό το μήνυμα είναι λάθος, επικοινωνήστε με το support@code.org.",
  "authorLabel": "συγγραφέας",
  "allFilesCompile": "Μεταγλώττιση όλων των αρχείων!",
  "backpackFileNameConflictWarning": "Η αποθήκευση θα αντικαταστήσει ένα υπάρχον αρχείο στο σακίδιό σας",
  "backpackLabel": "Σακίδιο πλάτης",
  "backpackListLoadError": "Παρουσιάστηκε σφάλμα κατά τη φόρτωση του σακιδίου σας. Προσπάθησε ξανά.",
  "backpackListLoadErrorMessageCommitDialog": "Δοκιμάστε να κλείσετε και να ανοίξετε ξανά αυτό το παράθυρο διαλόγου.",
  "backpackErrorTitle": "Παρουσιάστηκε σφάλμα",
  "backpackSaveErrorMessage": "Παρακαλώ προσπαθήστε ξανά",
  "cancel": "Άκυρο",
  "clearConsole": "Εκκαθάριση κονσόλας",
  "classroomBlocked": "Το τμήμα σας έχει τρέξει τον κώδικά τους πάρα πολλές φορές και έχει κλειδωθεί. Ζητήστε από τον δάσκαλό σας να επικοινωνήσει με το support@code.org για να ξεκλειδώσετε την ενότητα σας.",
  "classNotFound": "Σφάλμα: σε ένα ή περισσότερα από τα αρχεία Java λείπει ένας ορισμός κλάσης.",
  "closeReview": "Κλείσιμο αξιολόγησης",
  "codeEditingDisabled": "Η επεξεργασία κώδικα είναι απενεργοποιημένη ενώ το εγχείρημά σας είναι σε αξιολόγηση",
  "codeReviewForStudent": "Αναθεώρηση κώδικα για {student}",
  "codeReviewDisabledMessage": "Η αναθεώρηση κώδικα είναι απενεργοποιημένη. Ο δάσκαλός σας πρέπει να σας τοποθετήσει σε μια ομάδα ανασκόπησης κώδικα για να ενεργοποιήσει αυτή τη δυνατότητα.",
  "codeReviewForYou": "Η αναθεώρηση του κώδικά σας",
  "codeReviewingPeer": "Επανεξέταση κώδικα {peerName}",
  "commentProfanityFound": "Το σχόλιό σας περιέχει ακατάλληλη γλώσσα, επομένως δεν θα αποθηκευτεί. Παρακαλώ ενημερώστε το σχόλιό σας για να καταργήσετε το {wordCount, plural, one {Λέξη} other {Λόγια}} «{words}».",
  "commentUpdateError": "Παρουσιάστηκε σφάλμα κατά την επεξεργασία του αιτήματός σας, δοκιμάστε ξανά.",
  "commit": "Δεσμεύομαι",
  "commitAndSave": "Δέσμευση & Αποθήκευση",
  "commitCode": "Δέσμευση κώδικα",
  "commitNotes": "Υποβολή σημειώσεων",
  "commitNotesPlaceholder": "Εισάγετε σημειώσεις σχετικά με αυτό commit εδώ...",
  "compilationSuccess": "Επιτυχής συλλογή.",
  "compiled": "Συγκεντρώθηκαν!",
  "compileFailed": "Η μεταγλώττιση απέτυχε.",
  "compilerError": "Δεν μπορέσαμε να συντάξουμε το πρόγραμμά σου. Αναζητήστε σφάλματα στο πρόγραμμά σας και προσπαθήστε ξανά.",
  "compiling": "Μεταγλώττιση...",
  "compilingProgram": "Πρόγραμμα μεταγλώττισης...",
  "connecting": "Σύνδεση...",
  "console": "Κονσόλα",
  "create": "Δημιουργία",
  "created": "δημιουργήθηκε",
  "createNewFile": "Δημιουργία νέου αρχείου",
  "delete": "Διαγραφή",
  "deleteFileConfirmation": "Είστε βέβαιοι ότι θέλετε να διαγράψετε {filename}?",
  "duplicateProjectFilenameError": "Το όνομα αρχείου {filename} χρησιμοποιείται ήδη σε αυτό το έργο. Παρακαλώ επιλέξτε διαφορετικό όνομα",
  "duplicateSupportFilenameError": "Το όνομα αρχείου {filename} χρησιμοποιείται ήδη στον κώδικα υποστήριξης αυτού του επιπέδου. Παρακαλώ επιλέξτε διαφορετικό όνομα",
  "disabledPeerReviewMessage": "Ενεργοποιήστε την αξιολόγηση από ομότιμους για να επιτρέψετε σε άλλους μαθητές της ομάδας σας να αφήσουν σχόλια στο έργο σας.",
  "displayThemeDarkMode": "σκοτεινή λειτουργία",
  "displayThemeLightMode": "λειτουργία φωτισμού",
  "editor": "Επεξεργαστής",
  "editingDisabledUnderReview": "Η επεξεργασία είναι απενεργοποιημένη ενώ το έργο σας βρίσκεται υπό αναθεώρηση.",
  "emptyBackpackMessage": "Τα αρχεία που αποθηκεύονται στο σακίδιό σας θα εμφανιστούν εδώ.",
  "enablePeerReview": "Ενεργοποίηση αξιολόγησης από ομότιμους",
  "errorJavabuilderConnectionGeneral": "Χτυπήσαμε ένα σφάλμα κατά τη σύνδεση με το διακομιστή μας. Προσπάθησε ξανά.",
  "errorLoadingClassmates": "Παρουσιάστηκε σφάλμα κατά τη φόρτωση της λίστας των συμμαθητών σας. Παρακαλώ προσπαθήστε ξανά.",
  "errorMediaImageLoadError": "Παρουσιάστηκε σφάλμα κατά τη φόρτωση της εικόνας.",
  "errorNeighborhoodInvalidGrid": "Παρουσιάστηκε σφάλμα κατά τη φόρτωση του επιπέδου γειτονιάς. Παρακαλούμε επικοινωνήστε μαζί μας στο support@code.org και φροντίστε να συμπεριλάβετε τη διεύθυνση URL αυτής της σελίδας στο μήνυμά σας.",
  "errorNeighborhoodInvalidDirection": "Η κατεύθυνση που παρέχεται δεν είναι αναγνωρισμένη. Οι υποστηριζόμενες κατευθύνσεις είναι «βόρεια», «νότια», «ανατολικά» και «δυτικά».",
  "errorNeighborhoodGetSquareFailed": "Το καθορισμένο τετράγωνο δεν βρίσκεται στο πλέγμα.",
  "errorNeighborhoodInvalidColor": "Το παρεχόμενο όνομα χρώματος δεν αναγνωρίζεται. Ανατρέξτε στην τεκμηρίωση για να δείτε ποια ονόματα χρωμάτων είναι supprted.",
  "errorNeighborhoodInvalidLocation": "Η καθορισμένη τοποθεσία δεν βρίσκεται στο πλέγμα.",
  "errorNeighborhoodInvalidMove": "Ο ζωγράφος προσπάθησε να φύγει από το δίκτυο ή να μπει σε ένα εμπόδιο.",
  "errorNeighborhoodInvalidPaintLocation": "Ζωγράφος προσπάθησε να ζωγραφίσει από το δίκτυο ή πάνω από ένα εμπόδιο.",
  "errorNoJavaFiles": "Τα αρχεία που δώσατε δεν περιλαμβάνουν αρχεία.java, ή είναι όλα κενά.",
  "errorPeerReviewDisabled": "Η αξιολόγηση από ομότιμους έχει απενεργοποιηθεί σε αυτό το έργο.",
  "errorProjectNotEditedYet": "Αυτό το έργο δεν έχει επεξεργαστεί ακόμα. Ο κώδικας θα πρέπει να επεξεργαστεί για να μπορέσει να εκτελεστεί.",
  "errorSoundInvalidAudioFileFormat": "Το αρχείο ήχου που παρέχεται είναι σε μη υποστηριζόμενη μορφή. Προς το παρόν υποστηρίζεται μόνο WAV.",
  "errorSoundMissingAudioData": "Το παρεχόμενο αρχείο ήχου δεν είχε δεδομένα ήχου.",
  "errorTheaterDuplicatePlayCommand": "Η μέθοδος αναπαραγωγής () μπορεί να κληθεί μόνο μία φορά ανά εκτέλεση του προγράμματος.",
  "errorTheaterInvalidShape": "Ένα σχήμα πρέπει να περιέχει έναν άρτιο αριθμό τιμών για να αναπαραστήσει τις συντεταγμένες (x, y) και πρέπει να περιλαμβάνει τουλάχιστον 4 τιμές.",
  "errorTheaterVideoTooLarge": "Το βίντεό σας είναι πολύ μεγάλο. Μειώστε τον αριθμό των καρέ στο βίντεό σας και προσπαθήστε ξανά.",
  "errorTheaterVideoTooLong": "Το βίντεό σας ξεπέρασε το μέγιστο χρόνο αναπαραγωγής. Μειώστε τη διάρκεια του βίντεό σας και προσπαθήστε ξανά.",
  "exceptionMessage": "[EXCEPTION] {message}",
  "exceptionThrown": "[EXCEPTION] {exceptionName} ρίχτηκε",
  "feedbackBeginning": "Αυτή είναι η αρχή της ανατροφοδότησης για το έργο σας.",
  "feedbackBeginningPeer": "Αυτή είναι η αρχή της ανατροφοδότησης για το έργο του {peerName}.",
  "illegalMethodAccess": "Προσπαθήσατε να αποκτήσετε πρόσβαση σε μια μέθοδο που έχει αποκλειστεί από την πολιτική ασφαλείας μας.\n{cause}",
  "fileDeleteConfirm": "Είστε βέβαιοι ότι θέλετε να διαγράψετε τα ακόλουθα αρχεία από το σακίδιο σας; Αυτή η ενέργεια δεν μπορεί να αναιρεθεί.",
  "fileDeleteError": "Παρουσιάστηκε ένα σφάλμα κατά τη διαγραφή ενός ή περισσότερων από τα αρχεία σας. Παρακαλώ προσπαθήστε ξανά. Τα αρχεία δεν μπορούν να διαγραφούν:",
  "fileImportError": "Ένα ή περισσότερα ονόματα αρχείων δεσμεύονται από το Java Lab και δεν μπορούν να εισαχθούν σε αυτό το έργο. Τα αρχεία δεν μπορούν να εισαχθούν:",
  "fileImportServerError": "Παρουσιάστηκε σφάλμα κατά την εισαγωγή ενός ή περισσότερων από τα αρχεία σας. Παρακαλώ προσπαθήστε ξανά. Τα αρχεία δεν μπορούν να εισαχθούν:",
  "fileImportWarning": "Έχετε ένα ή περισσότερα διπλότυπα ονόματα αρχείων μεταξύ αυτού του έργου και των επιλεγμένων αρχείων σακιδίου. Τα διπλότυπα ονόματα αρχείων είναι:",
  "fileImportWarningConfirm": "Θέλετε να αντικαταστήσετε αυτά τα αρχεία με τα αρχεία από το σακίδιο σας;",
  "fileLoadError": "Παρουσιάστηκε σφάλμα κατά τη φόρτωση του αρχείου {filename}.",
  "genericError": "Σφάλμα",
  "genericSaveErrorTitle": "Σφάλμα αποθήκευσης",
  "genericErrorMessage": "Παρακαλώ προσπαθήστε ξανά",
  "import": "Εισαγωγή",
  "includeFiles": "Συμπερίληψη αρχείων",
  "insertCode": "Εισαγωγή κωδικού",
  "inStartSourcesMode": "Επεξεργάζεστε πηγές έναρξης.",
  "internalCompilerException": "Ουπς. Χτυπήσαμε ένα σφάλμα από την πλευρά μας κατά τη σύνταξη του προγράμματός σας. Δοκίμασε να το ξανακάνεις. Εάν αυτό το σφάλμα συνεχίζεται, επικοινωνήστε μαζί μας στο support@code.org. Βεβαιωθείτε ότι έχετε συμπεριλάβει το αναγνωριστικό σύνδεσης {connectionId} στο μήνυμά σας.",
  "internalException": "Ουπς. Χτυπήσαμε ένα λάθος από την πλευρά μας. Δοκιμάστε να εκτελέσετε ξανά το πρόγραμμά σας. Εάν αυτό το σφάλμα συνεχίζεται, επικοινωνήστε μαζί μας στο support@code.org. Βεβαιωθείτε ότι έχετε συμπεριλάβει το αναγνωριστικό σύνδεσης {connectionId} στο μήνυμά σας.",
  "internalRuntimeException": "Ουπς. Χτυπήσαμε ένα σφάλμα από την πλευρά μας κατά την εκτέλεση του προγράμματος σας. Δοκίμασε να το ξανακάνεις. Εάν αυτό το σφάλμα συνεχίζεται, επικοινωνήστε μαζί μας στο support@code.org. Βεβαιωθείτε ότι έχετε συμπεριλάβει το αναγνωριστικό σύνδεσης {connectionId} στο μήνυμά σας.",
  "invalidJavaFilename": "Μη έγκυρο όνομα αρχείου. Τα ονόματα αρχείων Java δεν μπορούν να έχουν κενά διαστήματα.",
  "invalidJavaFilenameFormat": "Μη έγκυρο όνομα αρχείου. Ένα όνομα αρχείου Java πρέπει να έχει τη μορφή 'ClassName.java'.",
  "invalidMainMethod": "Παρουσιάστηκε σφάλμα στην κύρια μέθοδό σας. Βεβαιωθείτε ότι η κύρια μέθοδος σας είναι δημόσια, στατική, έχει κενό τύπο επιστροφής και έχει μόνο ένα όρισμα (String[] args).",
  "generatingProgress": "Δημιουργήθηκαν {progressTime} δευτερόλεπτα...",
  "javaExtensionMissing": "Μη έγκυρο όνομα αρχείου. Τα ονόματα αρχείων πρέπει να τελειώνουν σε '.java'.",
  "javabuilderInvalidClassError": "{causeMessage} δεν υποστηρίζεται από το Java Lab.",
  "javabuilderJavaFilenameError": "Αρχείο Java: Το {causeMessage} έχει μη έγκυρο όνομα αρχείου. Τα ονόματα αρχείων Java δεν μπορούν να περιέχουν κενά ή ειδικούς χαρακτήρες.",
  "javabuilderMissingFilenameError": "Ένα ή περισσότερα από τα αρχεία του έργου σας λείπουν ονόματα αρχείων.",
  "makeStarter": "Κάντε το αρχείο εκκίνησης",
  "makeSupport": "Δημιουργήστε αρχείο υποστήριξης",
  "makeValidation": "Δημιουργήστε αρχείο επικύρωσης",
  "markComplete": "Σήμανση ως Ολοκληρωμένη",
  "markIncomplete": "Σήμανση μη ολοκληρωμένου",
  "missingFilenameError": "Το όνομα αρχείου δεν μπορεί να είναι κενό.",
  "moveLeft": "Μετακίνηση αριστερά",
  "moveRight": "Μετακίνηση δεξιά",
  "newFile": "Νέο αρχείο",
  "noCodeReviewComments": "Σχόλια από τον δάσκαλό σας θα εμφανιστούν εδώ.",
  "noCodeReviewUntilStudentEditsCode": "Δεν μπορείτε να αφήσετε σχόλια μέχρι ο κάτοχος του έργου να τροποποιήσει τον προεπιλεγμένο κώδικα και να κάνει κλικ στο κουμπί «Εκτέλεση»",
  "noFeedbackGiven": "Δεν δόθηκε καμία ανατροφοδότηση.",
  "noMainMethod": "Σφάλμα: το πρόγραμμά σας δεν περιέχει μια κύρια μέθοδο.",
  "noOtherReviews": "Κανένα άλλο έργο δεν είναι ακόμη έτοιμο για αναθεώρηση.",
  "noteWorthy": "Σημείωση:",
  "noTestsFound": "Δεν βρέθηκαν δοκιμές.",
  "onlyVisibleToYou": "Τα σχόλια των εκπαιδευτικών είναι ορατά μόνο σε εσάς",
  "openedDate": "ανοίχτηκε {date}",
  "programCompleted": "Το πρόγραμμα ολοκληρώθηκε.",
  "programEndedUnexpectedly": "Το πρόγραμμά σας σταμάτησε απροσδόκητα. Μπορεί να μην έχουμε τη δυνατότητα να εκτελέσουμε το πρόγραμμά σας ή μπορεί να αντιμετωπίζετε προβλήματα δικτύου. Ελέγξτε τη σύνδεση δικτύου σας και προσπαθήστε ξανά.",
  "programStopped": "Το πρόγραμμα σταμάτησε.",
  "refresh": "Ανανέωση",
  "rename": "Μετονομασία",
  "renameFile": "Μετονομασία αρχείου",
  "replace": "Αντικαταστήστε",
  "reviewClassmateProject": "Επανεξέταση του έργου ενός συμμαθητή...",
  "returnToMyProject": "Επιστροφή στο έργο μου",
  "running": "Τρέξιμο...",
  "runningProjectTests": "Τρέχοντας τις δοκιμές του έργου σας...",
  "runningValidation": "Δοκιμές επιπέδου εκτέλεσης...",
  "runtimeError": "Ο κώδικάς σας χτύπησε μια εξαίρεση ενώ έτρεχε.\n{cause}",
  "saveToBackpack": "Αποθήκευση σε Σακίδιο",
  "saving": "Αποθήκευση...",
  "sendingVideo": "Στέλνω βίντεο. Συνολικό μήκος: {totalTime} δευτερόλεπτα.",
  "startingPainter": "Αρχικός ζωγράφος.",
  "startReview": "Έναρξη Αξιολόγησης",
  "startSourcesTemplateWarning": "ΠΡΟΕΙΔΟΠΟΙΗΣΗ: Επεξεργάζεστε πηγές εκκίνησης για ένα επίπεδο με ένα πρότυπο. Οι πηγές εκκίνησης θα πρέπει να ορίζονται στο πρότυπο.",
  "submit": "Υποβολή",
  "successfulTestResult": "{className} > {methodName} Πέτυχες",
  "switchToDisplayTheme": "Μετάβαση σε {displayTheme}",
  "testsNotPassing": "Πρέπει να περάσετε όλες τις δοκιμές για να μπορέσετε να ολοκληρώσετε το επίπεδο.",
  "textSize": "Μέγεθος κειμένου",
  "timeoutWarning": "Προειδοποίηση: το έργο σας θα σταματήσει να εκτελείται σε 15 δευτερόλεπτα.",
  "timeout": "Το πρότζεκτ σου σταμάτησε.",
  "twoMainMethods": "Σφάλμα: Ο κωδικός σας μπορεί να έχει μόνο μία κύρια μέθοδο. Βρήκαμε τουλάχιστον δύο κατηγορίες με κύριες μεθόδους.",
  "teacherLabel": "δάσκαλος",
  "togglePeerReviewError": "Σφάλμα ενεργοποίησης/απενεργοποίησης αξιολόγησης από ομότιμους κριτές, δοκιμάστε ξανά.",
  "unauthorizedJavabuilderConnectionNotLoggedIn": "Πρέπει να είσαι συνδεδεμένος για να εκτελέσετε τον κώδικά σας στο Εργαστήρι Java. Συνδεθείτε και δοκιμάστε ξανά.",
  "unauthorizedJavabuilderConnectionTeacher": "Για να εκτελέσετε τον κώδικά σας στο εργαστήρι Java, πρέπει να γίνετε \"Εξακριβωμένος\" ή να ενώσετε τις δυνάμεις σας με ένα τμήμα προηγμένου επιπέδου μαθημάτων πληροφορικής που ανήκσει σε μια πιστοποιηημένη δασκάλα. Παρακαλώ να δείτε [αυτό το άρθρο] (https://support.code.org/hc/en-us/articles/115001550131) για λεπτομέρειες αναφορικά στο πώς μπορείτε να γίνετε πιστοποιημένη.",
  "unauthorizedJavabuilderConnectionStudent": "Για να εκτελέσετε τον κώδικά σας στο Εργαστήρι Java, θα πρέπει να σας έχει ανατεθεί ένα τμήμα του προηγμένου επιπέδου μαθημάτων πληροφορικής και η δασκάλα σας πρέπει να είναι \"πιστοποιημένη\". Ζητήστε βοήθεια από τη δασκάλα σας και δοκιμάστε ξανά. Η δασκάλα σας μπορεί να βρει περισσότερες λεπτομέρειες σε [αυτό το άρθρο] (https://support.code.org/hc/en-us/articles/115001550131)",
  "unknownError": "Ουπς. Χτυπήσαμε ένα λάθος από την πλευρά μας. Δοκιμάστε να εκτελέσετε ξανά το πρόγραμμά σας. Εάν αυτό το σφάλμα συνεχίζεται, επικοινωνήστε μαζί μας στο support@code.org. Βεβαιωθείτε ότι έχετε συμπεριλάβει το αναγνωριστικό σύνδεσης {connectionId} στο μήνυμά σας.\n{type}",
  "unsupportedMiniAppMessage": "Αναντιστοιχία τύπων επιπέδου: {miniAppType} έργα δεν υποστηρίζονται σε μη-{miniAppType} επίπεδο.",
  "userBlocked": "Έχετε εκτελέσει τον κωδικό σας πάρα πολλές φορές και ο λογαριασμός σας έχει κλειδωθεί. Επικοινωνήστε με το support@code.org για να ξεκλειδώσετε το λογαριασμό σας.",
  "userBlockedTemporary": "Έχετε φτάσει στο όριο του αριθμού των φορών που μπορείτε να εκτελέσετε κώδικα Java σε 24 ώρες. Γίνετε πιστοποιημένη δασκάλα για να αποκτήσετε πρόσβαση σε ένα πολύ υψηλότερο ποσοστό για εσάς και τους μαθητές σας.\nΜάθετε περισσότερα σχετικά με το [πώς να γίνετε επαληθευμένος δάσκαλος] (https://support.code.org/hc/en-us/articles/115001550131-How-to-Become-a-Verified-Teacher).\nΜάθετε [γιατί απαιτείται επαλήθευση των εκπαιδευτικών] (https://support.code.org/hc/en-us/articles/6104078305549-Teacher-Verification-and-CSA).\nΕάν πιστεύετε ότι αυτό το μήνυμα είναι λάθος, επικοινωνήστε με το support@code.org.",
  "waitingForServer": "Αναμονή για μια απάντηση...",
  "youHaveProjectsToReview": "Έχετε εργασίες προς επανεξέταση...",
  "yourPeer": "συνομηλίκους σας"
}
