{
  "clicked": "πατημένο",
  "clickedSprite": "πατημένος χαρακτήρας",
  "subject": "θέμα",
  "subjectSprite": "θέμα χαρακτήρας",
  "object": "αντικείμενο",
  "objectSprite": "αντικείμενο χαρακτήρας",
  "errorLoadingAnimation": "Φαίνεται να αντιμετωπίζουμε κάποιο πρόβλημα στη φόρτωση της κίνησης \"{animationName}\". Επιβεβαιώστε ότι είστε συνδεδεμένοι στο διαδίκτυο και επιχειρήστε να ανανεώσετε τη σελίδα. Αν το πρόβλημα επιμείνει, τότε είναι πιθανόν η κίνηση αυτή να είναι χαλασμένη. Σε αυτή την περίπτωση, ίσως χρειαστεί να συνεχίσετε αφαιρώντας αυτήν την κίνηση.",
  "reinfFeedbackMsg": "Τελειώσατε! Πατήστε \"Συνέχεια\" για να προχωρήσετε στο επόμενο επίπεδο.",
  "shareGame": "Μοιράσου το παιχνίδι σου:",
  "spritelabFeedbackCreateFishWithBehavior": "Πρέπει να φτιάξετε τουλάχιστον έναν χαρακτήρα-ψάρι και να του δώσετε μία συμπεριφορά.",
  "spritelabFeedbackMoveFishLeftRight": "Ο χαρακτήρας-ψάρι πρέπει να μπορεί να κινείται αριστερά ή δεξιά. Προσπαθήστε να αλλάξετε τη συμπεριφορά του.",
  "spritelabFeedbackChangeBackgroundColor": "Πρέπει να αλλάξεις το χρώμα στο φόντο σε κάτι άλλο εκτός από άσπρο.",
  "spritelabFeedbackCreateTwoSprites": "Πρέπει να δημιουργήσετε ακριβώς δύο χαρακτήρες.",
  "spritelabFeedbackTwoSpritesWithCostumes": "Οι δύο χαρακτήρες σας χρειάζονται διαφορετικά κουστούμια.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Πρέπει να δημιουργήσετε δύο χαρακτήρες με διαφορετικά κουστούμια, όπου ο καθένας θα έχει μία συμπεριφορά.",
  "spritelabFeedbackClickSprite": "Μη ξεχάσετε να πατήσετε τον χαρακτήρα σας με το ποντίκι μετά που θα πατήσετε `Τρέξε`",
  "spritelabFeedbackUseSpinningBehavior": "Ο χαρακτήρας σας πρέπει να αρχίσει να περιστρέφεται. Προσπαθήστε να αλλάξετε τη συμπεριφορά του.",
  "spritelabFeedbackPinkAlienBehavior": "Ο ροζ εξωγήινος χαρακτήρας σας δεν εκκίνησε καμία συμπεριφορά.",
  "spritelabFeedbackCreateThreeAliens": "Πρέπει να δημιουργήσετε έναν μπλε εξωγήινο, έναν ροζ εξωγήινο και έναν κίτρινο εξωγήινο.",
  "spritelabFeedbackAliensNotInLine": "Οι τρεις εξωγήινοι χαρακτήρες σας πρέπει να βρίσκονται σε μία οριζόντια γραμμή (εντός 50 εικονοστοιχείων).",
  "spritelabFeedbackYellowAlienBehavior": "Ο κίτρινος εξωγήινος δεν εκκίνησε την συμπεριφορά του.",
  "spritelabFeedbackNoAlienColor": "Τουλάχιστον ένας από τους εξωγήινούς σας δεν άλλαξε χρώμα.",
  "spritelabFeedbackNeedAlienStopBehavior": "Οι εξωγήινοι χαρακτήρες σας πρέπει να σταματήσουν όλες τις συμπεριφορές τους.",
  "spritelabFeedbackBlueAlienBehavior": "Ο μπλε εξωγήινός σας πρέπει να εκκινήσει μια καινούρια συμπεριφορά.",
  "spritelabFeedbackUseCostume": "Πρέπει να χρησιμοποιήσετε τουλάχιστον ένα κουστούμι.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Πρέπει να δημιουργήσετε τρεις χαρακτήρες με διαφορετικά κουστούμια.",
  "spritelabFeedbackMoveUpNotDown": "Ο χαρακτήρας σας πρέπει να κινείται προς τα πάνω (βόρεια) αντί για προς τα κάτω (νότια).",
  "spritelabFeedbackRobotFasterThanRover": "Το ρομπότ έφτασε στη δεξιά πλευρά της οθόνης πριν από το όχημα.",
  "spritelabFeedbackDifferentStarRotation": "Οι χαρακτήρες και με τα δύο αστρο-κουστούμια πρέπει να περιστρέφονται κατά το ίδιο ποσό.",
  "spritelabFeedbackAstronautMoveToCorner": "Ο χαρακτήρας-αστροναύτης πρέπει να μετακινηθεί σε μία από τις τέσσερις γωνίες."
}
