{
    "fishvtrash-training-init1": "Úrgangur, sem fleygt er í vatn, hefur áhrif á lífið í vatninu. Í þessu verkefni munt þú forrita eða þjálfa GG (gervigreind) til að aðgreina fisk og úrgang. Hreinsum til í hafinu! Smelltu einhverstaðar á skjáinn til að halda áfram.",
    "fishvtrash-training-init2": "Kynnumst GG",
    "fishvtrash-training-init3": "GG veit ekki hvort hlutur er fiskur eða úrgangur, en hún getur unnið úr myndum og greint mynstur.",
    "fishvtrash-training-init4": "Til að forrita GG notar þú hnappana til að merkja mynd sem \"Fisk\" eða \"Ekki fisk\". Þjálfunin sem þú leggur inn kennir GG að þekkja mynstur án hjálpar. Byrjum á þessu!",
    "fishvtrash-training-pause1": "Það fara um 8 miljarðar kílógramma af plasti í hafið á hverju ári.",
    "fishvtrash-training-pause2": "Þú ert að forrita eða þjálfa GG með hverjum smelli. Haltu áfram.",
    "fishvtrash-training-pause3": "80% af mengun í hafinu kemur í formi úrgangs frá landi og hún kostar um 1.600 miljarða króna á ári.",
    "fishvtrash-training-pause4": "GG lærir af því sem þú velur. Ef þú velur \"rangt\" mun GG endurtaka þau mistök. Haltu áfram að þjálfa.",
    "fishvtrash-training-pause5": "Fín vinna! Því meiri gögn sem þú lætur GG fá, því meira lærir hún. Haltu áfram að þjálfa GG  eða farðu í næsta verkefni.",
    "fishvtrash-predicting-init1": "Nú skulum við athuga hvort GG veit hvernig \"fiskur\" lítur út.",
    "fishvtrash-predicting-init2": "GG mun greina hluti sem valdir eru af handahófi og merkja þá út frá þjálfun þinni.",
    "fishvtrash-predicting-init3": "Byrjum á þessu!",
    "fishvtrash-pond-init1": "Með því að nota þjálfunina, sem þú veittir, hefur GG merkt hér nokkra hluti sem \"fisk\". Hvernig stóð GG sig?",
    "fishvtrash-pond-recall": "Smelltu hér til að skipta á milli hluta sem eru greindir sem \"fiskur\" og \"ekki fiskur\".",
    "fishvtrash-pond-init2": "Þú getur þjálfað GG frekar...",
    "fishvtrash-pond-init3": "... eða farið í næsta.",
    "creaturesvtrashdemo-predicting-init1": "Til þessa höfum við þjálfað GG í að greina hluti sem \"fisk\" eða \"ekki fisk\".",
    "creaturesvtrashdemo-predicting-init2": "Hvað ef þessi þjálfun væri notuð til að ákveða hvað ætti heima í vatninu?",
    "creaturesvtrashdemo-predicting-init3": "Hvað mundi koma fyrir aðrar sjávarlífverur? Hefur þessi þjálfunaraðferð aðrar afleiðingar en við höfðum ætlað?",
    "creaturesvtrashdemo-predicting-init4": "Athugum málið.",
    "creaturesvtrashdemo-predicting-pause1": "Tókstu eftir að GG greindi nokkrar sjávarlífverur sem \"ekki fisk\"?",
    "creaturesvtrashdemo-predicting-pause2": "Þó að þessar sjávarlífverur séu ekki fiskar, eiga þær samt heima í hafinu.",
    "creaturesvtrashdemo-predicting-pause3": "GG lærir bara það sem við kennum henni.",
    "creaturesvtrashdemo-predicting-pause4": "Við skulum þjálfa GG betur.",
    "creaturesvtrash-training-init1": "Nú skulum við hjálpa GG að læra hvaða hlutir eiga heima í vatninu.",
    "creaturesvtrash-training-init2": "Í hafinu getur plastúrgangur skaðað fiska, sjófugla og sjávarspendýr. Verndun sjófugla og sjávarlífvera er ein af mörgum ástæðum fyrir því að halda höfunum hreinum.",
    "creaturesvtrash-training-init3": "Því meiri gögn sem þú notar til að þjálfa, því meira lærir GG. Haltu áfram að þjálfa.",
    "creaturesvtrash-training-init4": "Plastmengun í hafinu hefur haft slæm áhrif á a.m.k. 267 tegundir um allan heim, þar á meðal 86% af öllum tegundum sjávarskjaldbaka.",
    "creaturesvtrash-training-init5": "Haltu áfram að kenna GG hvað á heima í vatninu.",
    "creaturesvtrash-training-init6": "Fín vinna! Því meiri gögn sem þú lætur GG fá, því betri árangri nær hún. Haltu áfram að þjálfa GG  eða farðu í næsta verkefni.",
    "creaturesvtrash-predicting-init1": "Heldur þú að GG muni nú standa sig betur við að greina hvað á heima í vatninu? Fylgjumst með.",
    "creaturesvtrash-pond-init1": "Út frá þjálfun þinni eru hér nokkrir hlutir sem GG hefur greint sem \"eiga heima í vatni\". Hvernig stóð GG sig?",
    "fishshort-words-init1": "Gervigreind og vélarnám má nota til að kenna tölvu ný mynstur.",
    "fishshort-words-init2": "Við skulum kenna GG nýtt orð með því að sýna henni dæmi um fisk af því tagi.",
    "fishshort-words-training-pause1": "Heldur þú að GG hafi fengið nægar upplýsingar? Þú getur smellt á Áfram til að komast að því.",
    "fishshort-words-training-pause2": "Fín vinna! Þjálfaðu GG frekar eða farðu Áfram.",
    "fishshort-predicting-init1": "Með þjálfunargögnum þínum hefur þú forritað GG til að þekkja fiskinn “{word}”.",
    "fishshort-predicting-init2": "Sjáum hvernig GG gengur að greina fiskinn “{word}”.",
    "fishshort-pond-init1": "Eftir þjálfun þína tókst GG að greina {n, plural,one {þennan fisk} other {þessa fiska}} sem  “{word}”.  Hvernig tókst þetta hjá GG?  Þú getur valið Þjálfa meira ef þú vilt bæta árangurinn.",
    "fishshort-pond-init2": "Smelltu á upplýsingahnappinn til að sjá hvað GG hefur lært.",
    "fishlong-words-init1": "Nú skulum við athuga hvort GG getur lært óljósara orð.",
    "fishlong-words-init2": "Við skulum kenna GG orð sem byggist á þinni hugmynd. Nú átt þú að velja fiska sem passa við orðið þitt.",
    "fishlong-training-pause1": "Er sanngjarnt að nota gervigreind til að dæma fisk eftir útlitinu? Þó að GG gæti virst sanngjörn og hlutlaus, þá byggir greining hennar á þjálfun sem við leggjum til. Hvaða hlutdrægni gæti þá laumast inn?",
    "fishlong-training-pause2": "Því meira af þjálfunargögnum, því betur mun GG læra orðið þitt. Haltu áfram að þjálfa.",
    "fishlong-training-pause3": "Hvert val þitt getur hjálpað GG að læra. Haltu áfram að þjálfa.",
    "fishlong-training-pause4": "Heldurðu að GG hafi fengið næg gögn með þjálfun? GG nær betri árangri með miklum gögnum. Farðu áfram þegar þú heldur að GG sé tilbúin.",
    "fishlong-training-many": "Vá. Rosa mikið af fiski!",
    "fishlong-predicting-init1": "Með þjálfunargögnum þínum hefur þú forritað GG til að þekkja fiskinn “{word}”.",
    "fishlong-predicting-init2": "Sjáum nú hvernig GG gengur að greina fiskinn “{word}”.",
    "fishlong-pond-init1": "Út frá þjálfun þinni greindi GG {n, plural,one {þennan fisk} other {þessa fiska}} sem “{word}”.  Hvernig stóð GG sig?",
    "fishlong-pond-init2": "Þú getur nota Þjálfa meira ef þú vilt bæta árangurinn.",
    "fishlong-pond-init3": "Eða þú getur kennt GG nýtt orð með því að velja Nýtt orð.",
    "didYouKnow": "Vissurðu?",
    "continue": "Áfram",
    "areYouSure": "Ertu viss?",
    "eraseWarning": "Ef gögnum GG er eytt þurrkar það út alla þjálfun varanlega. Viltu gera það?",
    "erase": "Eyða",
    "cancel": "Hætta við",
    "yes": "Já",
    "no": "Nei",
    "notWord": "Ekki {word}",
    "run": "Keyra",
    "mostImportantParts": "Þetta voru mikilvægustu fiskhlutarnir:",
    "clickIndividualFish": "Smelltu á fisk til að sjá upplýsingar um hann.",
    "mostImportantPartsDescription": "Þessir hlutar voru mikilvægastir í að ákvarða hvort þessi fiskur væri “*{word}*” eða “**{notWord}**”.",
    "newWord": "Nýtt Orð",
    "finish": "Ljúka",
    "trainMore": "Þjálfa meira",
    "wordQuestionShort": "Hvers konar fisk vilt þú þjálfa GG í að greina?",
    "wordQuestionLong": "Veldu nýtt orð til að kenna GG.",
    "isThisFish": "Er þessi fiskur {word}?",
    "isThisAFish": "Er þetta fiskur?",
    "doesThisBelongInWater": "Á þetta heima í vatni?",
    "fish": "Fiskur",
    "waterCreature": "Sjávarlífvera",
    "blue": "Blár",
    "green": "Grænn",
    "red": "Rauður",
    "circular": "Kringlóttur",
    "rectangular": "Ferhyrndur",
    "triangular": "Þríhyrndur",
    "angry": "Reiður",
    "awesome": "Frábært",
    "delicious": "Ljúffengur",
    "endangered": "Á válista",
    "fast": "Hraður",
    "fierce": "Grimmur",
    "fun": "Skemmtilegur",
    "glitchy": "Óstöðugur",
    "happy": "Glaður",
    "hungry": "Svangur",
    "playful": "Glettinn",
    "scary": "Ógnvekjandi",
    "silly": "Kjánalegur",
    "spooky": "Draugalegur",
    "wild": "Villtur",
    "dorsalFins": "bakuggi",
    "pectoralFinsFront": "eyruggar",
    "tails": "sporður",
    "bodies": "bolur",
    "scales": "hreistur",
    "eyes": "augu",
    "mouths": "kjaftur",
    "colors": "litir"
}
