{
  "clicked": "",
  "clickedSprite": "",
  "subject": "",
  "subjectSprite": "",
  "object": "objeto",
  "objectSprite": "",
  "errorLoadingAnimation": "Parece que tenemos problemas al cargar tu animación \"{animationName}\". Asegúrate de que tienes una buena conexión a Internet y vuelve a cargar la página. Si persiste el problema, es posible que la animación esté rota. En ese caso, deberías eliminar la animación para continuar.",
  "reinfFeedbackMsg": "¡Has finalizado! Haz clic en \"Continuar\" para pasar al siguiente nivel.",
  "shareGame": "Comparte tu juego:",
  "spritelabFeedbackCreateFishWithBehavior": "Debes crear al menos un sprite de pez y asignarle un comportamiento.",
  "spritelabFeedbackMoveFishLeftRight": "Tu sprite de pez debe moverse a la izquierda o a la derecha. Prueba cambiar su comportamiento.",
  "spritelabFeedbackChangeBackgroundColor": "Debes cambiar el fondo a algo que no sea blanco.",
  "spritelabFeedbackCreateTwoSprites": "Debes crear exactamente dos sprites.",
  "spritelabFeedbackTwoSpritesWithCostumes": "Tus dos sprites necesitan disfraces diferentes.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Debes crear dos sprites con disfraces diferentes para que cada uno tenga un comportamiento.",
  "spritelabFeedbackClickSprite": "Asegúrate de hacer clic en tu sprite luego de presionar `Ejecutar`.",
  "spritelabFeedbackUseSpinningBehavior": "Tu sprite debe comenzar a girar. Prueba cambiar su comportamiento.",
  "spritelabFeedbackPinkAlienBehavior": "Tu sprite de alienígena rosa no inició un comportamiento.",
  "spritelabFeedbackCreateThreeAliens": "Debes crear un alienígena azul, uno rosa y uno amarillo.",
  "spritelabFeedbackAliensNotInLine": "Debes ordenar tus tres sprites de alienígenas en una fila horizontal (dentro de 50 pixeles).",
  "spritelabFeedbackYellowAlienBehavior": "El alienígena amarillo no inició su comportamiento.",
  "spritelabFeedbackNoAlienColor": "Al menos uno de tus alienígenas no cambió el color.",
  "spritelabFeedbackNeedAlienStopBehavior": "Tus sprites de alienígenas deben detener todos sus comportamientos.",
  "spritelabFeedbackBlueAlienBehavior": "Tu alienígena azul debe iniciar un nuevo comportamiento.",
  "spritelabFeedbackUseCostume": "Debes usar al menos un disfraz.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Debes crear tres sprites con disfraces diferentes.",
  "spritelabFeedbackMoveUpNotDown": "Tu sprite debe moverse hacia arriba (norte) y no hacia abajo (sur).",
  "spritelabFeedbackRobotFasterThanRover": "El robot llegó al lado derecho de la pantalla antes que el explorador.",
  "spritelabFeedbackDifferentStarRotation": "Los sprites con disfraces de estrella deben girar en la misma medida.",
  "spritelabFeedbackAstronautMoveToCorner": "El sprite de astronauta debe moverse a una de las cuatro esquinas."
}
