{
  "key": "playing-notes",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-creativity",
  "parent_reference_guide_key": "circuit-playground-parent",
  "display_name": "Playing Notes",
  "content": "In Western music, we represent the \"notes\" in music with letters from A through G. Those notes correspond to specific tone frequencies - in fact, the same frequencies that we've been using with the buzzer. You could recreate your favorite songs using just the appropriate frequencies, but the Maker Toolkit includes a [`buzzer.note()`(#f78183)](/docs/applab/buzzer.note/) command that looks up the appropriate values for you.\n\n## Frequencies to Notes\n\n<div style=\"float: right; margin: 20px;\" markdown=\"1\">\n\n|Frequency   |  Note It Maps To |\n|---|---|\n| 261 | C4 |\n| 277 | C#4 |\n| 293 | D4 |\n| 311 | D#4 |\n| 329 | E4 |\n| 349 | F4 |\n| 369 | F#4 |\n| 392 | G4 |\n| 415 | G#4 |\n| 440 | A4 |\n| 466 | A#4 |\n| 493 | B4 |\n| 523 | C5 |\n\n</div>\n\nThe chart to the right shows one set of notes starting with C4, also known as \"middle\" C, and each of the notes' corresponding frequency.\n\n## Notes\n\n[`buzzer.note()`(#f78183)](/docs/applab/buzzer.note/) simplifies this. Instead of passing it a frequency to play, like [`buzzer.frequency`(#f78183)](/docs/applab/buzzer.frequency/), you just give it the note that you want to be played. This can include sharp notes as well, so long as you include the \"#\" after the note.\n\n## Octaves\n\nThe buzzer can play each note on one of eight octaves. When passing any note into the [`buzzer.note()`(#f78183)](/docs/applab/buzzer.note/) method, you'll include the octave you want that note to be at too. \"C4\", for example, if you want to play the middle C note, \"C1\" if you want the lowest possible C note, and \"C8\" if you want the highest possible C note. If you don't specify this, then the notes will automatically play at the 4th octave.\n\nFor the best possible sound, you should stay in octave 4. Anything lower than the 4th or higher than 6th octaves tend to sound distorted on the buzzer. ",
  "position": 6
}