{
  "key": "style-sheets",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-creativity",
  "parent_reference_guide_key": "css",
  "display_name": "Style Sheets",
  "content": "Web Developers intentionally separate content and style to make their code easier to maintain. HTML is the language used to structure the content of a web page, and CSS, which stands for **Cascading Style Sheets**, is a language that adds style to a web page. \n\n<img src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/CS-Discoveries---Semester-1.png\" style=\"float: right; height: 300px;\">\n\n## Separating out content, structure, and style.\n\nAs programmers develop web pages, it's important for them to tell the difference between the content, structure, and style of the page. Developers use HTML to organize the different types of content on page, indicating how it should be structured.  This lets them communicate what role each piece of content plays in the page, such as heading, list, tables, or other types of content.   If you don't use CSS (Cascading Style Sheets) to style that content, then the web browser will apply default styles based on the way the HTML has structured it.  As you learn CSS style rules, you'll have more control over the style applied to different types of content on the page.\n\n## Adding a style sheet\n\n<img alt=\"Web Lab Stylesheet\" src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/weblab_stylesheet.png\" class=\"center\" style=\"max-width: 600px;\">\n\n[diagram_nums]\n\n1. To add CSS style rules to an HTML page, you need to create a style sheet document.\n2. This is the style sheet.\n3. Link to your style sheet.  The link goes inside the [`Head`(#fff176)](/docs/weblab/head/) tag and looks like this:\n\t`<link rel=\"stylesheet\" href=\"style.css\">`\n    \n[/diagram_nums]\n\n## CSS rule-sets\n\nCSS rule-sets consist of two main parts: the selector and the rules. \n\n### Selectors\n\nThe selectors can be any part of the web page you want to style. One way you can identify parts of the web page is using the names of the element type. Selecting an element type will make all elements of that type have the given styling. The selector name for HTML element types is the name of the tag with the brackets removed. In the below example the selector is h1 and it will style all the h1 elements with the rules inside the curly braces (`{ }`).\n\n### Rules\n\nThe rules describe how the elements identified by the selector should change. Each rule consists of a property name and a value, separated by a colon (`:`).  The property name describes what the rule is about, such as color or size, and the value how the property should change.  For example, the rule-set below will make all the h1 headers on the page have blue text that is underlined.\n\n```\nh1{\n  color:blue;\n  text-decoration: underline;\n}\n```\n\nThe punctuation in the rule-set is very important, because that's the way the computer knows where each rule starts and stops.\n\n## FAQ\n\n1) **What is CSS?**\n   - CSS is a language that controls the way content on a website appears. It uses **rule sets** to change the look of a page. Each **rule set** has a **selector**, which specifies which elements on the page will be affected, and the **rules**, which explain how to display the elements. Each rule consists of a **property** and a **value** for that property.\n   - Here’s an example of a rule-set that makes the text in an h2 tag blue and cursive:\n```\nh2 {\n   color: blue;\n   font-family: cursive;\n}\n```\n   - In this example, **h2** is the **selector**, **color** and **font-family** are **properties**, and **blue** and **cursive** are the **values** for those properties.\n2) **What is a style sheet?**\n   - A style sheet is a document that controls how a web page will appear. External style sheets are separate files that are linked to the HTML page.\n3) **What should I name my style sheet?**\n   - You can name your style sheet anything, but it's better to choose a relevant name, such as \"style.css\" or \"aboutmestyles.css\" so that it's clear what the file is. Your file should always end in the \".css\" extension.\n4) **Why do I need all the punctuation?**\n   - The punctuation, such as the curly braces `{}`, the colon `:`, and the semicolon `;`, help the computer to understand the rules in the style sheet. The curly braces hold all the rules for a particular selector. Each rule should end in a semicolon, and the properties and values are always separated by a colon.\n5) **How does the code work?**\n   - Here is the code that is making the `h1` heading red:\n```\nh1 {\n  color: red;\n}\n```\n   - `h1` is the **selector**. It specifies which elements will have to follow the rules inside the curly braces.\n   - `color: red`; is the **rule** that makes the text inside the h1 tags red.\n      - `color` is the **property**. It explains what the rule is about, in this case, the text color.\n      - `red` is the **value**. It explains how the rule should be applied, in this case making the text red.\n6) **How do I make a new rule set?**\n   - To make a new rule set, you'll need a selector and a list of rules. The selector is the name of the tag you want the rules to be applied to. The rules are a list of property and value pairs. You'll also need to pay careful attention to the punctuation in the rule set. Look at the code below for an example of how the code should look. You'll need to change the specifics for your page.\n```\np {\n  color: blue;\n}\n```\n   - `p` is the **selector**. It specifies which elements will have to follow the rules inside the curly braces.\n   - `color: blue`; is the **rule** that makes the text inside the p tags blue.\n      - `color` is the **property**. It explains what the rule is about, in this case, the text color.\n      - `blue` is the **value**. It explains how the rule should be applied, in this case making the text blue.\n7) **What rules can be added to a class rule set?**\n   - A class rule set can have the same rules as any other type of selector. If a rule does not apply to the content of the class (for example, using font-size on an element with no text), then the computer will ignore that rule, but wil still, use the rules that work.\n8) **Why does the selector have a period in front of it?**\n   - In CSS, a period in front of a selector means that the selector is the name of a class [*(see the page on CSS Classes)*](https://levelbuilder-studio.code.org/courses/csd-2022/guides/classes). If there is no period, it means that the selector is the name of an HTML tag.\n\n\n**W3 Schools Links**\n\n* [CSS Syntax](https://www.w3schools.com/css/css_syntax.asp)",
  "position": 1
}