{
  "key": "tableDataStorage",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-creativity",
  "parent_reference_guide_key": "app-lab",
  "display_name": "App Lab Table Data Storage",
  "content": "### Overview\nApp Lab's table data storage enables persistent data storage\n for an app. Whereas [setKeyValue()](/docs/applab/setKeyValue/) and [getKeyValue()](/docs/applab/getKeyValue/) can be used to store multiple independent key/value pairs, table data storage allows you to store similar data together in a table format.\n\nAs a simple example, let's say you are building an app that collects information about a person's name, age, and favorite food so you can figure out if food preferences are correlated with age.\n\nIf you were storing this data on a piece of paper, or with a spreadsheet app, you might format the data like this:\n\n| Name  | Age | Food\n|-----------------|------|-----------|\n| Abby  | 17 | Ravioli |\n| Kamara  | 15 | Sushi |\n| Rachel  | 16 | Salad |\n&nbsp\n\nThe table has a row of column names, and then each row that is added to the table fills in one or more of the columns. App Lab's table data storage let you store similarly formatted data, and provides simple functions to [read](/docs/applab/readRecords/), [create](/docs/applab/createRecord/), [delete](/docs/applab/deleteRecord/), and [update](/docs/applab/updateRecord/) records (rows) in a table, right from your app.\n\n### Definitions\n_Table:_ A collection of records with shared column names\n_Record:_ A \"row\" of the table\n_Persistent data storage:_ Data that is stored \"in the cloud\" separately from the code running in your app. The data can be accessed across multiple app refreshes or users of the app.\n\n### Viewing Data\n View your app's table data by clicking the 'Data' tab in App Lab and clicking the table name you want to view.\n\n### Reading and creating table records from your app\nTo create, read, update, and delete table records from your app, use the following App Lab Data functions:\n\n- To create a row in a table: [createRecord](/docs/applab/createRecord/)\n- To read one or multiple rows in a table: [readRecords](/docs/applab/readRecords/)\n- To update an existing row in a table: [updateRecord](/docs/applab/updateRecord/)\n- To delete an existing row from a table: [deleteRecord](/docs/applab/deleteRecord/)\n\n### Bulk importing table data from a file\nIf you have existing data in a spreadsheet that you want your app to be able to access, you can use the Import feature to quickly fill a table with records from the spreadsheet. To import data:\n\n_Step 1._ **Format the spreadsheet**\nIn a spreadsheet editor of your choice, make sure the data is formatted with column names in the first row, and your table data below that. Your spreadsheet data should be formatted like this, but with values of your choosing (like our favorite food example):\n\n| column 1  | column 2 | ... column N\n|-----------------|------|-----------|\n| row1 col1 data   | row1 col2 data | row1 colN data |\n| row2 col1 data   | row2 col2 data | row2 colN data |\n| row3 col1 data   | row3 col2 data | row3 colN data |\n\n&nbsp\n\n_Step 2._ **Save the spreadsheet as a csv file**\nA comma separated file, or csv file, is a simple file format that most spreadsheet editors should support saving your file as. Save the file as a csv, and download it to your computer.\n\n_Step 3._ **Import the file to App Lab table data storage**\nTo import the file into a table in App Lab:\n\n1. Click the 'View data' button in App Lab while viewing your code in \"Code mode.\"\n2. Click an existing table name or add a new table to your app.\n3. Click the Import button and select the csv file from Step 2.\n4. Click 'Overwrite & Import' to have the spreadsheet data overwrite the current table data.\n**Note:** Existing data _will_ be overwritten, so make sure you didn't intend to keep the current data!\n\n_Step 4._ **Review the imported data**\nIf your data is imported successfully, then review the table to make sure everything looks right. You can make quick tweaks to rows\nby clicking the \"Edit\" button for that row and editing the values inline.\n\nIf the data failed to import properly, make sure that your original csv file was formatted properly with column names and valid rows.\n\nNow that you have data in your table, you can use the App Lab Data functions linked above to read, update, delete, or create new rows in\nyour table.",
  "position": 9
}