{
  "key": "using-data-with-numerical-features",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-creativity",
  "parent_reference_guide_key": "ai-lab",
  "display_name": "Using Data with Numerical Features",
  "content": "## Looking at Numerical Data\n\n<img style=\"margin-right: 10px; margin-left: 10px; border: 2px solid black\" src=\"https://curriculum.code.org/media/uploads/NumFeature_1.png\" width=\"75%\" />\n<p>\nWhen you click on a column with numerical data, you can view more information in the panel on the right-side of AI Lab\n</p>\n\n[diagram_nums]\n\n1. This is the name of the column that you selected\n2. This is a description of the column you selected. It can tell you more information about the data in this column. If the data came from a survey, this will usually contain the question that was asked on the survey\n3. A **Scatter Plot** shows how this column is related to the label you are trying to predict.\n4. A **Range** chart shows the minimum and maximum values in this column, and the range between them. This can be helpful in identifying if there is a mistake in your data, such as a value accidentally being too large or too small.\n5. Press the \"Add feature\" button to use this column as one of the inputs in your machine learning model\n\n\n[/diagram_nums]\n\n## Reading Scatter Plots\n\nIn the Scatter Plot, look to see if the feature you picked has a strong relationship with your label. You can see if the points follow a pattern that will let you make a \"When the feature is... that means the label is...\" statement. For example:\n- When the temperature is _lower_, the number of bats in the sky is _higher_\n- When the cost of tickets is _higher_, the attendance to the games is _lower_\n\nThese types of patterns make it easier for AI Bot to make predictions.\n\n\n<div style=\"height: 250px\">\n<img style=\"float:left; margin-right: 10px; margin-left: 10px; border: solid 2px black\" src=\"https://curriculum.code.org/media/uploads/image_PxfTjEs.png\" width=\"50%\" />\n<p>\nThis chart shows a strong relationship between the feature on the bottom of the graph and the label on the side of the graph. \n- When there are a low number of antelopes, there are also a low number of lions\n- When there are a high number of antelopes, there are also a high number of lions.\n<p>\nThis means if AI Bot knows how many antelopes are in the wild, it has a strong change of predicting how many lions are also in the wild.\n</p>\n</div>\n\n<div style=\"height: 250px\">\n<img style=\"float:right; margin-right: 10px; margin-left: 10px; border: solid 2px black\" src=\"https://curriculum.code.org/media/uploads/image_LtrzSMX.png\" width=\"50%\" />\n<p>\nThis chart does <strong>not</strong> show a strong relationship between the feature and the label. When looking at what day of the month it is, there is a wide range in the number of lions you could see on that particular day. A better graph would have all of the points clustered closer together for a particular day of the month.\n<p>\nThis means if AI Bot knows what day of the month it is, that doesn't help narrow down how many lions may have been in the wild on that day.\n</p>\n</div>\n\n## Video\n\n(Opens YouTube in new tab)\n\n[![Numerical Data in AI Lab](https://curriculum.code.org/media/uploads/Capture_AfMf5K0.PNG)](https://www.youtube.com/watch?v=Po4i_EtpDWI)",
  "position": 2
}