---
title: الانتهاء من أنشطة "ساعة من البرمجة" باستخدام التقنية المساعدة
---

# الانتهاء من أنشطة "ساعة من البرمجة" باستخدام التقنية المساعدة

يمكن لأي شخص تجربة أنشطة "ساعة من البرمجة" أثناء الأسبوع العالمي للبرمجة وعلوم الحاسوب.

## استخدام قارئ الشاشة

إذا كنت تستخدم قارئ شاشة، فإن [البرنامج التعليمي لتعلم لغة "Quorum" للمبتدئين](https://quorumlanguage.com/hourofcode/astro1.html) أو [البرنامج التعليمي لتعلم لغة "Quorum" للطلاب الذين لديهم خلفية بسيطة في علوم الحاسوب](https://quorumlanguage.com/hourofcode/part1.html) هي برامج رائعة لبدء أنشطة "ساعة من البرمجة". بدأ لغة "Quorum" كلغة مترجمة تم تصميمها في الأصل لتكون قابلة للوصول من خلال برامج قراءة الشاشة. لقد أصبحت لغة برمجة الأغراض العامة مصمَّمة لأي مستخدم. وإذا كنت تريد برامج تعليمية إضافية غير أنشطة "ساعة من البرمجة"، فإن فريق "Quorum" لديه أدوات ومناهج إضافية.

[![برنامج تعليمي للمبتدئين](https://code.org/images/fill-480x360/tutorials/hoc2017/quorum_astronomy.jpg)](https://quorumlanguage.com/hourofcode/astro1.html) [![برنامج تعليمي للطلاب الذين لديهم خلفية بسيطة في علوم الحاسوب](https://code.org/images/fill-480x360/quorum.jpg)](https://quorumlanguage.com/hourofcode/part1.html)

## دورات Code.org بدون صوت

يمكن استخدام[البرامج التعليمية على موقع Code.org](https://studio.code.org/courses) مع أو بدون صوت. جميع مقاطع الفيديو تحتوي على تعليقات توضيحية.

## البرمجة الثنائية

البرمجة الثنائية هي أداة يستخدمها علماء الحاسوب لحل المشاكل كثنائي أو كفريق. حاول العمل على تحديات "ساعة من البرمجة" مع صديق أو زميل في الفصل الدراسي. لا تنس [مشاهدة هذا الفيديو](https://www.youtube.com/watch?v=vgkahOzFH2Q) لمعرفة أفضل التقنيات للبرمجة الثنائية.