---
title: الشركاء
---

يُدار "ساعة البرمجة" بواسطة لجنة مراجعة ساعة البرمجة.

تتشكل [لجنة المراجعة]({{ urls/review_committee }}) من 12 معلمًا حاليين وسابقين على مستوى الصفوف من الحضانة إلى الصف الثاني عشر، وتقوم بتقييم والتوصية بالأنشطة باستخدام قواعد تضعها لجنة استشارية. يراجع هؤلاء المعلمون الأنشطة التي يقودها الطلاب وخطط الدروس التي يقودها المعلمون والتي يقدمها المئات من شركاء الأنشطة، وتقييم القيمة التعليمية للأنشطة، والقدرة على إشراك المتعلمين، والقدرة المحتملة للأنشطة لجذب مجموعات متنوعة من الطلاب.</p> 

لقد ساهم عمل اللجنة وتفانيها في نجاح حملة "ساعة البرمجة" ورؤيتها في توفير مدخل إلى علوم الحاسوب لكل طالب.

# الشركاء الرئيسيون و الشركات الداعمة

{{ partners/major_partners_corporate_supporters }}

* * *

# الشركاء الدوليون

{{ partners/international_partners }}

* * *

# شركاء المناهج والبرامج التعليمية

{{ partners/curriculum_tutorial_partners }}

* * *

# شركاء وأدوات البنية التحتية

{{ partners/infrastructure_partners_tools }}

* * *

# شركاء إضافيون

{{ partners/additional_partners }}

{{ signup_button }}