{
  "key": "analog-sensors",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-design-with-purpose",
  "parent_reference_guide_key": "circuit-playground-parent",
  "display_name": "Circuit Playground Sensors",
  "content": "## Light, Sound, and Temperature\n\nThe Circuit Playground has three basic analog sensors, each of which takes an analog input and converts it into a value that is usable by the computer.\n\n<img src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/cp_sensors.png\" alt=\"analog sensors\" class=\"center\" style=\"width: 500px;\">\n\n1. The [`lightSensor`(#f78183)](/docs/applab/lightSensor/) measures how bright or dark it is. When it's very dark, [`lightSensor.value`(#f78183)](/docs/applab/lightSensor.value/) is 0, and when it's very bright, the value is 1023. \n2. The [`tempSensor`(#f78183)](/docs/applab/tempSensor/) checks the temperature and shows it in Fahrenheit ([`tempSensor`(#f78183)](/docs/applab/tempSensor/)) or Celsius ([`tempSensor.C`(#f78183)](/docs/applab/tempSensor.C/)). \n3. The [`soundSensor`(#f78183)](/docs/applab/soundSensor/) measures how loud noises are but can't record sounds like a microphone. It also gives a value from 0 to 1023.\n\n## Reading Sensor Data\n\nTo read the data from the sound and light sensors, you can use the \"value\" property (like [`soundSensor.value`(#f78183)](/docs/applab/soundSensor.value/)). If the range of 0-1023 isn't what you need, you can change the range using the setScale() method. For example, [`soundSensor.setScale(-50, 50)`(#f78183)](/docs/applab/soundSensor.setScale/) makes the sound sensor show values between -50 and 50. The temperature sensor already shows temperature in a way that's easy to understand.\n\n## Sensor Sensitivity\n\nThe sensors on your boards aren't perfect and might give slightly different readings on different boards. If you need your program to work well with different boards, you can write code that lets you adjust the sensors. If your app runs code when a sensor reading goes above a certain value, make that value a variable that can be changed by the user. This way, the user can change the variable to make the app work best with their board.",
  "position": 5
}