{
  "key": "microbit-circuits-buttons",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-design-with-purpose",
  "parent_reference_guide_key": "microbit-parent",
  "display_name": "External Buttons on a micro:bit",
  "content": "<img src=\"https://images.code.org/766895a5debf8fcb1e2552ff47f94c18-Micro_bit Circuits and LEDs.png\" style=\"width: 350px; float: right; margin: 10px\" />\n\nOn the bottom edge of the micro:bit there are 5 gold strips called pins. These pins allow you to create circuits, or connect external things like LEDs or buttons.\n\n- The **Input/Output Pins** on the micro:bit are “0”, “1”, and “2.” These allow you to connect LEDs or buttons. \n- The **\"3V\" pin** is the 3 volt power pin that you can use to power external LEDs and other electronics.\n- The **GND pin** is the ground pin. It’s used to complete electrical circuits when you connect headphones, LEDs, or external switches to the micro:bit.\n\n<div style=\"clear: both;\" ></div>\n\n<img src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/button_alligator.png\" alt=\"Button Up and Down\" style=\"width:250px; float: right; margin: 0 20px;\">\n\nTo create a button or a switch, you just need a circuit that can be easily connected and disconnected. A button circuit can be created by connecting one wire to a data pin and another wire to a ground pin. \n\nTo \"close\" the circuit (which is like pressing a button) you connect the two wires, either by touching them to each other or connecting them to a piece of hardware (like a button or switch) that can be used to open and close the circuit. \n\nAn \"open\" button is equivalent to the button \"up\" event, while a \"closed\" circuit is like the button \"down\" event.\n\n## Creating Button Circuits\n\nTo create a button circuit you'll need a data pin, two wires, and a ground pin.\n\n1. Connect a wire to your numbered data pin.\n2. Connect a different wire to a ground pin.\n3. Use one of the following blocks of in your code:\n    - [`pinMode()`(#4dd0e1)](/docs/ide/applab/expressions/pinMode) tells your micro:bit that you want to use one of the external pads for either input or output. \"Pin\" is the generic term for the pads on the micro:bit, and pins can look different on other devices.\n    - [`digitalWrite()`(#4dd0e1)](/docs/ide/applab/expressions/digitalWrite) tells your micro:bit to start or stop sending electricity to the device on that pin. 1 means \"on\", and 0 means \"off\"\n    - [`createButton()`(#4dd0e1)](/docs/ide/applab/expressions/createButton) block lets you assign an external button to a variable\n    - [`onBoardEvent()`(#f78183)](/docs/ide/applab/expressions/onBoardEvent) block uses the same variable name to respond to input \n",
  "position": 6
}