{
  "key": "text-properties",
  "course_version_key": "2024",
  "course_offering_key": "focus-on-design-with-purpose",
  "parent_reference_guide_key": "css",
  "display_name": "Text Properties",
  "content": "There are many CSS properties available that allow you to style the text on your page. Here's a review of some of the more common ones\n\n| Property  | What it Changes | Example |\n| ------------- | ------------- | ------------- |\n| **color**  | The color of your text | `color: maroon;` |\n| **text-align** | The alignment of your text | `text-align: center;` |\n| **text-decoration** | Additional style | `text-decoration: underline;` |\n| **font-family** | Which font to use | `font-family: fantasy;` |\n| **font-size** | The size of your text | `font-size: 20px;` |\n\n## Styled Text Example\n\nIf we put this all together, you might get some text like this:\n\n```\np {\n  color: maroon;\n  text-align: center;\n  text-decoration: underline;\n  font-family: fantasy;\n  font-size: 20px;\n}\n```\n\n<img src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/Screenshot-2017-05-03-09.38.04.png\" style=\"max-width: 300px; margin: 10px auto;\" class=\"center\">\n\n## Specifying Fonts\n\nYou might notice when using CSS like `font-family: fantasy;` that your text looks different on different computers. This is because we're only telling the browser what _kind_ of font to use, not which _specific_ font.\n\n## FAQ\n\n1) **What colors can I use in CSS?**\n   - CSS includes most common color names (red, blue, green, etc.), and many uncommon ones. You can see a full list of CSS color names at [W3Schools - HTML Color Names](http://www.w3schools.com/colors/colors_names.asp). You can still use colors that are not included in the named list, but you will need to use their RGB values. You can read more about using colors in CSS at [W3Schools - CSS Legal Color Values](http://www.w3schools.com/cssref/css_colors_legal.asp).\n2) **I used different RGB values, but mine works too.**\n   - Because RGB creates millions of different colors, some are so similar that people have a hard time telling them apart. That means that there are multiple RGB values that are close enough to work for our dark red color.\n3) **What are the possible values for font-family?**\n   - You can choose between \"serif\", \"sans-serif\", \"cursive\", \"fantasy\", and \"monospace\". You can also try more specific fonts as described in [W3Schools - CSS Web Safe Font Combinations](http://www.w3schools.com/cssref/css_websafe_fonts.asp).\n4) **What are the possible values for text decoration?**\n   - You can choose between \"underline\", \"overline\", and \"line-through\". You can read more about the text-decoration property at [W3Schools - CSS text-decoration Property](http://www.w3schools.com/cssref/pr_text_text-decoration.asp).\n5) **Why doesn’t `text-align: left` do anything?**\n   - Most properties have default values. The default values are the styles that an element will have automatically before you add your style sheet. The default value for text-align is left, so it doesn't change from how it already looked.\n6) **What are the possible values for text align?**\n   - You can choose between \"left\", \"right\", and \"center\". You can read more about the text-align property at [W3Schools - CSS text-align Property](http://www.w3schools.com/cssref/pr_text_text-align.asp).\n7) **Why doesn’t `letter-spacing: 0px;` do anything?**\n   - Most properties have default values. The default values are the styles that an element will have automatically before you add your style sheet. The default value for letter-spacing is 0, so it doesn't change from how it already looked.\n8) **What are the possible values for letter spacing?**\n   - You can choose between negative and positive numbers. Negative numbers space the letters closer to each other while positive numbers space the letters out further.\n9) **What does `px` mean / What is a pixel?**\n   - Pixel, which is abbreviated `px`, is how elements are measured in CSS. It’s the size of a single point of light on the screen.\n1) **Why doesn’t `text-shadow: 0px 0px;` do anything?**\n   - Most properties have default values. The default values are the styles that an element will have automatically before you add your style sheet. The default value for text-shadow is 0px 0px, so it doesn't change from how it already looked.\n1) **What are the possible values for text-shadow?**\n   - You can choose between negative and positive numbers. Negative numbers move the shadow either left or up while positive numbers move the shadow to the right or down.\n\n\n\n\n**W3 Schools Links**\n\n* [CSS Text Properties](https://www.w3schools.com/css/css_text.asp)",
  "position": 3
}