{
  "key": "console.log",
  "name": "console.log(message)",
  "category": "Variables",
  "category_key": "variables",
  "content": "console.log() is used as a debugging tool to help you understand what your code is doing.  By displaying a message containing either descriptive text that tells you what is happening or the value of particular variables, you can follow along as your code executes. The user of your app will not see the console.log() messages.",
  "examples": [
    {
      "name": "Example: It's Alive",
      "code": "```\n// Let's you know your code is running.\nconsole.log(\"It's Alive!\");\n```"
    },
    {
      "name": "Example: Random Thought",
      "description": "I'm thinking of a number between 1 and 10.",
      "code": "```\n// I'm thinking of a number between 1 and 10.\nvar myRandomNumber = randomNumber(1,10);\nconsole.log(\"My random number is: \" + myRandomNumber);\n```"
    },
    {
      "name": "Example: Checkbox Value",
      "description": "Display the true/false state of a checkbox.",
      "code": "```\n// Display the true/false state of a checkbox.\ncheckbox(\"myCheckbox\", false);\ntextLabel(\"myLabel\", \"Click on or off\", \"myCheckbox\");\nonEvent(\"myCheckbox\", \"click\", function(event) {\n  console.log(\"Checkbox is: \" + getChecked(\"myCheckbox\"));\n});\n```"
    }
  ],
  "palette_params": [
    {
      "name": "message",
      "type": "string",
      "required": true,
      "description": "The message string and/or variable values to display in the console."
    }
  ],
  "parameters": [
    "message"
  ],
  "return_value": "No return value. Outputs to the console only.",
  "short_description": "Displays a string and/or variable values in the debug console in App Lab.",
  "syntax": "console.log(message)",
  "tips": "- You can use the string concatentation operator + to make long strings containing both words (enclosed in \" \"), variables (the current value will be displayed), and function return values.\n- Remember that the + operator works differently for numbers than strings.  For instance console.log(5 + 3) will display \"8\" because the integers 5 and 3 will be added together then automatically converted to a string, but console.log(\"5\" + \"3\") will simply concatenate the two strings to display \"53\".\n- Code that has a lot of console.log() messages is considered \"chatty\" because it talks to you a lot. Chatty code is good when you first write a new block of code because it helps you know what is happening, so don't hesitate to use console.log() a lot.  But chatty code can be irritating after a while, so once your code is working the way you want, it is a good idea to go back through and clean up by removing console.log() messages that are no longer helpful."
}