{
  "key": "declareAssign_x_promptNum",
  "name": "Prompt the user for a numerical value and store it",
  "category": "Variables",
  "category_key": "variables",
  "content": "[name]\n\n## Prompt the user for a numerical value and store it\n\n[/name]\n\n[category]\n\nCategory: Variables\n\n[/category]\n\n[description]\n\n[short_description]\n\nDeclares a variable and prompts the user for its initial numeric value.\n\n[/short_description]\n\nMany apps process numerical data. To be able to process data your apps need to keep track of the data in memory. Variables are simply names you use to refer to stored data in your apps. You can name your variables whatever you want so long as the name is not already used by the system. Variable names can not have spaces or special characters. In practice, it is helpful to name your variables in a way that describes the value they store. For instance, if the variable you create is to store a person's name you might name that variable personName.\n\nTo process data in our apps we need to assign values to memory locations we have previously named using var to declare a variable. The promptNum() function causes a pop-up window to display with the given message and the app waits for the user to type a number in and click OK. The variable getting the value always goes on the left hand side of the assignment operator =.\n\n[/description]\n\n### Examples\n____________________________________________________\n\n[example]\n\n```\n// Compliment the user's age.\nvar age = prompt(\"What's your age?\");\nconsole.log(\"You don't look a day over \" + (age-5));\n```\n\n[/example]\n\n____________________________________________________\n\n[example]\n\n**Example: Change Counter** Count the amount of change a user has.\n\n```\n// Count the amount of change a user has.\nvar quarters = promptNum(\"How many quarters do you have?\");\nvar dimes = promptNum(\"How many dimes do you have?\");\nvar nickels = promptNum(\"How many nickels do you have?\");\nvar pennies = promptNum(\"How many pennies do you have?\");\nvar total = quarters*25 + dimes*10 + nickels*5 + pennies*1;\nwrite(\"You have \" + total + \" cents.\");\n```\n\n[/example]\n\n____________________________________________________\n\n[syntax]\n\n### Syntax\n\n```\nvar x = promptNum(\"Enter a value\")\n```\n\n[/syntax]\n\n[parameters]\n\n### Parameters\n\n| Name  | Type | Required? | Description |\n|-----------------|------|-----------|-------------|\n| x | variable name | Yes | The name you will use in the program to reference the variable. Must begin with a letter, contain no spaces, and may contain letters, digits, - and _. |\n| \"Enter a value\" | string | Yes | The string the user will see in the pop-up window when asked to enter a value. |\n\n[/parameters]\n\n[returns]\n\n### Returns\nNo return value. Variable created in memory and numeric value assigned.\n\n[/returns]\n\n[tips]\n\n### Tips\n- The pop-up window only allows the user to enter a number. Use [prompt()](/docs/applab/declareAssign_x_prompt) if the user is allowed to enter non-numeric data.\n- The block of code where you declare the variable defines the variable's scope. Scope refers to which blocks of code can access that variable by name. For instance, if you declare a variable inside a function, that variable name can only be accessed inside that function. Variables declared at the top of your program are global and can be accessed anywhere in your program.\n- Excessive use of promptNum() can get annoying, use this sparingly.\n\n[/tips]\n\n[bug]\n\nFound a bug in the documentation? Let us know at documentation@code.org\n\n[/bug]",
  "return_value": "promptNum returns a number (and forces the user to enter a number)",
  "short_description": "\nPrompt the user for a numerical value and store it\nCategory: Variables",
  "syntax": "var x = promptNum(\"Enter a value\");"
}