{
  "key": "declareAssign_x",
  "name": "Declare and assign a value to a variable",
  "category": "Variables",
  "category_key": "variables",
  "content": "Many apps process data. To be able to process data your apps need to keep track of the data in memory. Variables are simply names you use to refer to stored data in your apps. You can name your variables whatever you want so long as the name is not already used by the system. Variable names can not have spaces or special characters. In practice, it is helpful to name your variables in a way that describes the value they store. For instance, if the variable you create is to store a person's name you might name that variable personName.\n\nTo process data in our apps we need to assign values to memory locations we have previously named using var to declare a variable. Programmers read the statement \"area = length * width;\" as \"area gets length times width\". The variable getting the value always goes on the left hand side of the assignment operator =. The right hand side of the assignment operator can be a number or a string, or the number or string returned by a function, or the numeric or string result of the evaluation of an expression.",
  "examples": [
    {
      "name": "Printing Variables",
      "description": "",
      "code": "```\n// Pioneering computer scientist and first African American to earn a Ph.D. in computer science.\nvar name = \"Marsha Rhea Williams\";\nvar birthYear = 1948;\nconsole.log(name + \" was born in the year \" + birthYear);\n```"
    },
    {
      "name": "Example: Unbeatable Coin Flip",
      "description": "Generate a random 1 or 2, and always win because of carefully worded messages.",
      "code": "```\n// Generate a random 1 or 2, and always win because of carefully worded messages.\nvar myRandomNumber = randomNumber(1,2);\nif(myRandomNumber == 1){\n  console.log(\"Heads, I win!\");\n}\nelse {\n  console.log(\"Tails, you lose!\");\n}\n```"
    }
  ],
  "palette_params": [
    {
      "name": "x",
      "type": "variable name",
      "required": true,
      "description": "The name you will use in the program to reference the variable. Must begin with a letter, contain no spaces, and may contain letters, digits, - and _."
    },
    {
      "name": "___",
      "type": "any type",
      "required": true,
      "description": "The right hand side of the assignment operator can be a number or a string, or the number or string returned by a function, or the numeric or string result of the evaluation of an expression."
    }
  ],
  "return_value": "No return value. Variable created in memory and value assigned.",
  "short_description": "Declares and assigns an initial value to a variable.\n",
  "syntax": "var x = __;",
  "tips": "- You don't strictly need to provide a variable with an initial value when you create it, but it is a good practice, because if you accidentally use a variable that has never been assigned a value you can get unpredictable results in your code.\n- Variables can store numbers, strings, arrays or objects.\n- The block of code where you declare the variable defines the variable's scope. Scope refers to which blocks of code can access that variable by name. For instance, if you declare a variable inside a function, that variable name can only be accessed inside that function. Variables decalred at the top of your program are global and can be accessed anywhere in your program.\n- = is the assignment operator. == is the boolean check for equivalency operator.\n"
}