{
  "key": "return",
  "name": "return",
  "category": "Functions",
  "category_key": "functions",
  "content": "When you **define** a function you give a name to a set of actions you want the computer to perform. When you **call** a function you are telling the computer to run (or execute) that set of actions. When that function is finished running, execution of the program returns to the point in the code where the function was called. When you use **return** you are able to specify a single value that will be \"returned\" to whatever code called the function in the first place. This is how your functions can generate output that other parts of your program can use.",
  "examples": [
    {
      "name": "Example: Return Roll",
      "code": "```\n// Call functions to generate two die rolls and sum the result. Display the value on the console.\nconsole.log(rollDie() + rollDie());\n\nfunction rollDie() { \n// Define a function that uses randomNumber(1,6) to randomly generate a die roll, 1 to 6, and return the value.\n  var roll = randomNumber(1,6);\n  return roll;\n}\n```"
    },
    {
      "name": "Example: Return Area of Circle",
      "description": "Calculate and return the area of a circle of a specified radius.",
      "code": "```\n// Calculate and return the area of a circle of a specified radius.\nvar area = computeCircleArea(10);\nconsole.log(area);\n\nfunction computeCircleArea(radius) {\n    return Math.PI * Math.pow(radius, 2);\n}\n```"
    }
  ],
  "palette_params": [
    {
      "name": "__",
      "type": "Any",
      "required": true,
      "description": "The return value can be a number, boolean or a string, or a variable containing a number, boolean or string, or the number, boolean or string returned by a function, or the numeric, boolean or string result of the evaluation of an expression."
    }
  ],
  "return_value": "The return value can be a number, boolean or a string.\n",
  "short_description": "Returns a value from a function.",
  "syntax": "return __;",
  "tips": "- If the function returns a value, you must assign the returned value to a variable or use the value as a parameter in another function call.\n- The purpose of a function is to help you organize your code and to avoid writing the same code twice.\n- You can call a function within another function.\n- A function that does not explicitly return a value returns the JavaScript value undefined."
}