---
title: குறியீட்டு நேரத்திற்கு சிறப்புத் தேவை மாணவர்களை ஆதரித்தல்
---

# குறைபாடுள்ள மாணவர்களுக்கு மணிநேர குறியீட்டை ஆதரித்தல்

கணினி அறிவியல் கல்வி வாரத்தில் யார் வேண்டுமானாலும் ஒரு மணிநேர குறியீட்டை முயற்சி செய்யலாம். பெரும்பாலும், மன இறுக்கம், ADHA அல்லது பிற கற்றல் வேறுபாடுகள் உள்ள மாணவர்கள் அவர்கள் நிரலாக்கத்தை விரும்புகிறார்கள். உங்கள் வகுப்பறையில் உள்ள அனைத்து மாணவர்களையும் முயற்சித்துப் பார்க்க ஊக்குவிக்கவும்! உங்கள் வகுப்பறைக்கு அனுபவத்தை அமைப்பதில், பங்கேற்பை முடிப்பதை விட வெகுமதி. ஒரு மணி நேரத்திற்குள் எத்தனை புதிர்கள் அல்லது சவால்களை அவர்கள் முடித்தாலும் அனைவருக்கும் நீங்கள்[ சான்றிதழை ]({{ supporting-special-needs-students/certificate }}) வழங்கலாம். [ ஜோடி நிரலாக்க ](https://www.youtube.com/watch?v=vgkahOzFH2Q) ஒத்துழைப்பைக் கற்பிப்பதற்கான மற்றொரு சிறந்த வழியாகும், மேலும் சிக்கல்களைத் தீர்க்க மாணவர்கள் ஒன்றிணைந்து செயல்பட வேண்டும்.

## பிரிக்கப்படாத மற்றும் ஆன்லைன் பயிற்சிகளுடன் பல்வேறு தேவைகளைப் பொருத்துங்கள்

உங்கள் வகுப்பில் உள்ள அனைவருக்கும் சரியான செயல்பாட்டைக் கண்டுபிடிப்பதில், கணினிகள் தேவையில்லாத ஆன்லைன் மற்றும் “பிரிக்கப்படாத” விருப்பங்களைக் கவனியுங்கள். அவிழ்க்கப்படாத நடவடிக்கைகள் கணினி அறிவியல் கருத்தாக்கங்களுடன் கைகளைப் பெற அனுமதிக்கின்றன. [ பெரிய நிகழ்வு ](https://studio.code.org/s/course1/lessons/15/levels/1) ஆசிரியர்களின் மாணவர்களின் செயல்களைக் கட்டுப்படுத்துகிறது, இது ஒரு சிறந்த வாய்ப்பை அனுமதிக்கிறது ஒவ்வொரு மாணவரின் திறன்களுக்கும் உள்ளடக்கத்தை மாற்றியமைக்க.

பிற மாணவர்களுக்கு, கணினியில் கிடைக்கும் இடவசதிகள், பிரிக்கப்படாத தேர்வை விட சிறப்பாக பங்கேற்க அனுமதிக்கலாம். எடுத்துக்காட்டாக, காது கேளாத அல்லது கேட்க முடியாத மாணவர்கள் ஆன்லைன் டுடோரியல்களில் முழுமையாக பங்கேற்கலாம்.

அணுகக்கூடிய கணினி ஆய்வகம் அல்லது மடிக்கணினிகள் உள்ளதா என்பதையும் பொறுத்து மிகவும் உள்ளடக்கிய தேர்வு.

எடுத்துக்காட்டாக, உங்கள் மாணவர்கள் இயக்கம் அல்லது திறனைக் குறைத்துள்ளார்களா? உங்கள் பள்ளியில் உங்கள் மாணவர்கள் அனைவருக்கும் தொழில்நுட்ப அணுகல் இருந்தால், உங்கள் மாணவர்கள் அல்லது தொழில்நுட்ப ஆசிரியரிடம் உங்கள் மாணவர்கள் பொதுவாக கிடைக்கக்கூடிய கணினிகளுடன் என்ன வசதிகளைப் பயன்படுத்துகிறார்கள் என்று கேளுங்கள்.

## உணர்ச்சி குறைபாடுகள்

### பார்வையற்ற அல்லது குறைந்த பார்வை கொண்ட மாணவர்கள்

ஸ்கிரீன் ரீடரைப் பயன்படுத்தும் மாணவர்களுக்கு, [ தொடக்கக்காரர்களுக்கான கோரம் பயிற்சி ](https://quorumlanguage.com/hourofcode/astro1.html) அல்லது [ வசதியான மாணவர்களுக்கான கோரம் பயிற்சி ](https://quorumlanguage.com/hourofcode/part1.html) தொடங்குவதற்கு ஒரு சிறந்த இடம். திரை வாசகர் பயனர்களுக்கு அணுகக்கூடிய வகையில் வடிவமைக்கப்பட்ட ஒரு மொழியாக கோரம் தொடங்கியது. இறுதியில், இது எந்தவொரு பயனருக்கும் வடிவமைக்கப்பட்ட பொது நோக்க நிரலாக்க மொழியாக மாறியது. உங்கள் முழு வகுப்பறையுடனும் இந்த மணிநேர குறியீடு பயிற்சிகளைப் பயன்படுத்தலாம். மேலும், நீங்கள் ஒரு மணி நேர குறியீட்டைத் தாண்டிச் செல்ல விரும்பினால், கோரம் குழுவில் கூடுதல் கருவிகள் மற்றும் பாடத்திட்டங்கள் உள்ளன.

உங்கள் மாணவர் தொழில்நுட்ப வகுப்புகளில் பிற இடவசதிகளைப் பயன்படுத்தினால், மணிநேர குறியீட்டிற்கும் உதவ நீங்கள் அவற்றைப் பயன்படுத்தலாம். பெரிய மானிட்டர்கள், மென்பொருள் திரை உருப்பெருக்கம், அவற்றின் இயக்க முறைமையில் அதிக மாறுபட்ட அமைப்புகள், குரல் கட்டுப்பாடு மற்றும் பலவற்றை இதில் சேர்க்கலாம்.

### காது கேளாத அல்லது கேட்க முடியாத மாணவர்கள்

[ Code.org tutorials ](https://studio.code.org/) அனைத்தும் ஒலியுடன் அல்லது இல்லாமல் பயன்படுத்த வடிவமைக்கப்பட்டுள்ளன. எல்லா வீடியோக்களுக்கும் தலைப்புகள் உள்ளன சில மாணவர்கள் அதிக அளவு ஹெட்ஃபோன்களிலிருந்து பயனடையலாம்.

## மேலும் அறிக

கணினி அறிவியல் கல்வி மற்றும் சிறப்புத் தேவை மாணவர்களைப் பற்றி மேலும் அறிய, இந்த[ ஆன்லைன் புத்தகம் ]({{ supporting-special-needs-students/book }}) ஐப் பரிந்துரைக்கிறோம்.