---
title: ಅವರ್ ಆಫ್ ಕೋಡ್‌ಗೆ ವಿಶೇಷ ಅಗತ್ಯ ಹೊಂದಿರುವ ವಿದ್ಯಾರ್ಥಿಗಳಿಗೆ ಬೆಂಬಲ ನೀಡುವುದು
---

# ಅಂಗವಿಕಲ ವಿದ್ಯಾರ್ಥಿಗಳಿಗೆ ಅವರ್ ಆಫ್ ಕೋಡ್ ಕುರಿತು ಸಹಾಯ ಮಾಡುವುದು

ಕಂಪ್ಯೂಟರ್ ಸೈನ್ಸ್ ಎಜುಕೇಶನ್ ವೀಕ್‌ನಲ್ಲಿ ಅವರ್ ಆಫ್ ಕೋಡ್ ಅನ್ನು ಯಾರು ಬೇಕಾದರೂ ಪ್ರಯತ್ನಿಸಬಹುದು. ಆಗಾಗ್ಗೆ, ಆಟಿಸಂ, ಎಡಿಎಚ್‌ಡಿ ಅಥವಾ ಇತರ ಕಲಿಕೆ ತೊಂದರೆಗಳನ್ನು ಹೊಂದಿರುವ ವಿದ್ಯಾರ್ಥಿಗಳು ಪ್ರೋಗ್ರಾಮಿಂಗ್‌ ಬಗ್ಗೆ ಆಸಕ್ತಿಯನ್ನು ಪ್ರದರ್ಶಿಸುತ್ತಾರೆ. ನಿಮ್ಮ ತರಗತಿಯ ಎಲ್ಲ ವಿದ್ಯಾರ್ಥಿಗಳೂ ಇದನ್ನು ಪ್ರಯತ್ನಿಸುವಂತೆ ಪ್ರೋತ್ಸಾಹಿಸಿ! ನಿಮ್ಮ ತರಗತಿಗೆ ಅನುಭವವನ್ನು ಸೆಟಪ್ ಮಾಡುವಲ್ಲಿ, ಪೂರ್ಣಗೊಳಿಸುವುದಕ್ಕಿಂತ ಭಾಗವಹಿಸುವಿಕೆಗೆ ಪ್ರೋತ್ಸಾಹ ನೀಡಿ. ಒಂದು ಗಂಟೆಯಲ್ಲಿ ಅವರು ಎಷ್ಟೇ ಪಝಲ್‌ಗಳು ಅಥವಾ ಸವಾಲುಗಳನ್ನು ಪೂರ್ಣಗೊಳಸಿದ್ದರೂ ಎಲ್ಲರಿಗೂ [ಪ್ರಮಾಣಪತ್ರವನ್ನು]({{ supporting-special-needs-students/certificate }}) ನೀವು ನೀಡಬಹುದು. [ಜೋಡಿ ಪ್ರೋಗ್ರಾಮಿಂಗ್‌](https://www.youtube.com/watch?v=vgkahOzFH2Q) ಎಂಬುದು ಸಹಭಾಗಿತ್ವವನ್ನು ಬೋಧಿಸಲು ಮತ್ತು ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸಲು ವಿದ್ಯಾರ್ಥಿಗಳು ಒಟ್ಟಾಗಿ ಕೆಲಸ ಮಾಡುವುದನ್ನು ತಿಳಿಸಲು ಉತ್ತಮ ವಿಧಾನವಾಗಿದೆ.

## ಅನ್‌ಪ್ಲಗ್ ಮಾಡಿದ ಮತ್ತು ಆನ್‌ಲೈನ್ ಟ್ಯುಟೋರಿಯಲ್‌ಗಳೊಂದಿಗೆ ವಿವಿಧ ಅಗತ್ಯಗಳಿಗೆ ಹೊಂದಿಸಿ

ನಿಮ್ಮ ತರಗತಿಯಲ್ಲಿನ ಎಲ್ಲರಿಗೂ ಸರಿಯಾದ ಚಟುವಟಿಕೆಯನ್ನು ಹುಡುಕುವುದಕ್ಕೆ, ಕಂಪ್ಯೂಟರ್‌ಗಳ ಅಗತ್ಯ ಇಲ್ಲದ ಆನ್‌ಲೈನ್ ಮತ್ತು "ಅನ್‌ಪ್ಲಗ್ಡ್" ಆಯ್ಕೆಗಳೆರಡನ್ನೂ ಪರಿಗಣಿಸಿ. ಕಂಪ್ಯೂಟರ್ ಸೈನ್ಸ್ ಕಾನ್ಸೆಪ್ಟ್‌ಗಳ ಪರಿಚಯ ಮಾಡಿಸಲು ವಿದ್ಯಾರ್ಥಿಗಳಿಗೆ ಅನ್‌ಪ್ಲಗ್ಡ್ ಚಟುವಟಿಕೆಗಳು ಅನುವು ಮಾಡುತ್ತವೆ. [ದೊಡ್ಡ ಕಾರ್ಯಕ್ರಮವು](https://studio.code.org/s/course1/lessons/15/levels/1) ವಿದ್ಯಾರ್ಥಿಗಳ ಕ್ರಮಗಳ ಮೇಲೆ ಶಿಕ್ಷಕರಿಗೆ ನಿಯಂತ್ರಣ ಒದಗಿಸುತ್ತದೆ, ಪ್ರತಿ ವಿದ್ಯಾರ್ಥಿಯ ಸಾಮರ್ಥ್ಯಗಳಿಗೆ ಕಂಟೆಂಟ್ ಅನ್ನು ಹೊಂದಿಸುವ ಉತ್ತಮ ಅವಕಾಶವನ್ನು ಒದಗಿಸುತ್ತದೆ.

ಇತರ ವಿದ್ಯಾರ್ಥಿಗಳಿಗೆ, ಕಂಪ್ಯೂಟರ್‌ನಲ್ಲಿ ಸೌಲಭ್ಯವು ಅನ್‌ಪ್ಲಗ್ಡ್ ಆಯ್ಕೆಗಿಂತ ಉತ್ತಮವಾಗಿ ಭಾಗವಹಿಸಲು ಅನುವು ಮಾಡಬಹುದು. ಉದಾಹರಣೆಗೆ, ದೃಷ್ಟಿ ದೋಷ ಅಥವಾ ಅಂಧ ವಿದ್ಯಾರ್ಥಿಗಳು ಸಂಪೂರ್ಣವಾಗಿ ಆನ್‌ಲೈನ್ ಟ್ಯುಟೋರಿಯಲ್‌ಗಳಲ್ಲಿ ಭಾಗವಹಿಸಬಹುದು.

ಕಂಪ್ಯೂಟರ್ ಲ್ಯಾಬ್ ಅಥವಾ ಲ್ಯಾಪ್‌ಟಾಪ್‌ಗಳನ್ನು ನೀವು ಹೊಂದಿದ್ದೀರೋ ಇಲ್ಲವೋ ಎಂಬುದನ್ನೂ ಹೆಚ್ಚು ಸಮಗ್ರತೆಯ ಆಯ್ಕೆಯು ಅವಲಂಬಿಸಿರುತ್ತದೆ.

ಉದಾಹರಣೆಗೆ, ನಿಮ್ಮ ವಿದ್ಯಾರ್ಥಿಗಳ ಚಲನೆ ಸಾಮರ್ಥ್ಯ ಕಡಿಮೆ ಇದೆಯೇ ಅಥವಾ ಕೈ ಚಲನೆಯಲ್ಲಿ ಸಮಸ್ಯೆ ಇದೆಯೇ? ನಿಮ್ಮ ಶಾಲೆಯಲ್ಲಿ ನಿಮ್ಮ ಎಲ್ಲ ವಿದ್ಯಾರ್ಥಿಗಳಿಗೂ ತಂತ್ರಜ್ಞಾನದ ಪ್ರವೇಶಾವಕಾಶ ಇದ್ದರೆ, ಕಂಪ್ಯೂಟರ್‌ಗಳ ಲಭ್ಯತೆ ಕುರಿತಂತೆ ಯಾವುದೇ ಅನುಕೂಲವನ್ನು ಹೊಂದಿದ್ದೀರಿ ಎಂದು ನಿಮ್ಮ ವಿದ್ಯಾರ್ಥಿಗಳು ಅಥವಾ ಟೆಕ್ ಟೀಚರ್ ಅನ್ನು ಕೇಳಿ.

## ಸಂವೇದನಾ ವೈಕಲ್ಯ

### ಅಂಧರು ಅಥವಾ ದೃಷ್ಟಿ ದೋಷ ಇರುವ ವಿದ್ಯಾರ್ಥಿಗಳು

ವಿದ್ಯಾರ್ಥಿಗಳು ಸ್ಕ್ರೀನ್ ರೀಡರ್ ಅನ್ನು ಬಳಸುತ್ತಿದ್ದರೆ, [ಆರಂಭಿಕರಿಗಾಗಿ ಕೋರಮ್ ಟ್ಯುಟೋರಿಯಲ್](https://quorumlanguage.com/hourofcode/astro1.html) ಅಥವಾ [ಕಂಫರ್ಟಬಲ್ ವಿದ್ಯಾರ್ಥಿಗಳಿಗೆ ಕೋರಮ್ ಟ್ಯುಟೋರಿಯಲ್‌](https://quorumlanguage.com/hourofcode/part1.html) ಅವರ್ ಆಫ್ ಕೋಡ್ ಆರಂಭಿಸಲು ಉತ್ತಮ ಸ್ಥಳವಾಗಿದೆ. ಸ್ಕ್ರೀನ್ ರೀಡರ್‌ಗಳ ಮೂಲಕ ಪ್ರವೇಶ ಪಡೆಯುವುದಕ್ಕೆ ವಿನ್ಯಾಸ ಮಾಡಿರುವ ವ್ಯಾಖ್ಯಾನ ಭಾಷೆಯಾಗಿ ಕೋರಮ್ ಆರಂಭಿಸಲಾಗಿದೆ. ನಿಧಾನವಾಗಿ, ಯಾವುದೇ ಬಳಕೆದಾರರಿಗೆ ಸಾಮಾನ್ಯ ಉದ್ದೇಶದ ಪ್ರೋಗ್ರಾಮಿಂಗ್ ಲ್ಯಾಂಗ್ವೇಜ್ ಇದಾಯಿತು. ನಿಮ್ಮ ಇಡೀ ತರಗತಿಯೊಂದಿಗೆ ಈ ಅವರ್ ಆಫ್ ಕೋಡ್ ಟ್ಯುಟೋರಿಯಲ್‌ಗಳನ್ನು ಬಳಸಬಹುದು. ಹಾಗೂ, ಅವರ್ ಆಫ್ ಕೋಡ್ ಆಚೆಗೂ ನೀವು ಹೋಗಲು ಬಯಸಿದರೆ, ಹೆಚ್ಚುವರಿ ಪರಿಕರಗಳು ಮತ್ತು ಪಠ್ಯಕ್ರಮವನ್ನು ಕೋರಮ್ ಹೊಂದಿದೆ.

ತಂತ್ರಜ್ಞಾನ ತರಗತಿಗಳಲ್ಲಿ ಇತರ ಅನುಕೂಲವನ್ನು ನಿಮ್ಮ ವಿದ್ಯಾರ್ಥಿ ಬಳಸಿದರೆ, ಅವರಿಗೆ ಅವರ್ ಆಫ್ ಕೋಡ್‌ನಲ್ಲಿ ಸಹಾಯ ಮಾಡಲೂ ಆಯ್ಕೆ ಮಾಡಿಕೊಳ್ಳಬಹುದು. ದೊಡ್ಡ ಮಾನಿಟರ್‌ಗಳು, ಸಾಫ್ಟ್‌ವೇರ್ ಸ್ಕ್ರೀನ್ ಮ್ಯಾಗ್ನಿಫಿಕೇಶನ್‌, ಅವರ ಆಪರೇಟಿಂಗ್‌ ಸಿಸ್ಟಮ್‌ನಲ್ಲಿ ಅಧಿಕ ಕಾಂಟ್ರಾಸ್ಟ್ ಸೆಟ್ಟಿಂಗ್‌ಗಳು, ಧ್ವನಿ ನಿಯಂತ್ರಣ ಮತ್ತು ಇನ್ನಷ್ಟನ್ನು ಇದು ಒಳಗೊಂಡಿರಬಹುದು.

### ಕಿವುಡರು ಅಥವಾ ಶ್ರವಣ ದೋಷ ಇರುವ ವಿದ್ಯಾರ್ಥಿಗಳು

ಧ್ವನಿ ಸಹಿತ ಅಥವಾ ಧ್ವನಿ ರಹಿತವಾಗಿ ಬಳಸಲು ಎಲ್ಲ [Code.org ಟ್ಯುಟೋರಿಯಲ್‌ಗಳನ್ನು](https://studio.code.org/) ವಿನ್ಯಾಸ ಮಾಡಲಾಗಿದೆ. ಎಲ್ಲ ವೀಡಿಯೋಗಳು ಕ್ಯಾಪ್ಷನ್‌ಗಳನ್ನು ಹೊಂದಿರುತ್ತವೆ. ಕೆಲವು ವಿದ್ಯಾರ್ಥಿಗಳಿಗೆ ಹೆಡ್‌ಫೋನ್‌ಗಳ ವಾಲ್ಯೂಮ್ ಅನ್ನು ಹೆಚ್ಚು ಇಟ್ಟರೂ ಸಹಾಯವಾಗುತ್ತದೆ.

## ಇನ್ನಷ್ಟು ತಿಳಿಯಿರಿ

ಕಂಪ್ಯೂಟರ್ ಸೈನ್ಸ್ ಶಿಕ್ಷಣ ಮತ್ತು ವಿಶೇಷ ಅಗತ್ಯಗಳ ವಿದ್ಯಾರ್ಥಿಗಳ ಬಗ್ಗೆ ಇನ್ನಷ್ಟು ತಿಳಿಯಲು, ನಾವು ಈ [ಆನ್‌ಲೈನ್‌ ಪುಸ್ತಕವನ್ನು]({{ supporting-special-needs-students/book }}) ಶಿಫಾರಸು ಮಾಡುತ್ತೇವೆ.