---
title: හවුල්කරුවන්
---

Hour of Code වැඩසටහන මෙහෙයවනු ලබන්නේ Hour of Code සමාලෝචන කමිටුව මගිනි.

[සමාලෝචන කමිටුව]({{ urls/review_committee }}) K-12 ශ්‍රේණියේ වත්මන් සහ හිටපු අධ්‍යාපනඥයින් 12 දෙනෙකුගෙන් සමන්විත වන අතර එය උපදේශක කමිටුවක් විසින් පිහිටුවන ලද රුබ්‍රික් එකක් භාවිතයෙන් ක්‍රියාකාරකම් තක්සේරු කර නිර්දේශ කරයි. මෙම අධ්‍යාපනඥයින් ශිෂ්‍යයන් විසින් මෙහෙයවන ක්‍රියාකාරකම් සහ ක්‍රියාකාරකම් හවුල්කරුවන් සියගණනක් විසින් ඉදිරිපත් කරන ලද ගුරුවරුන් විසින් මෙහෙයවන පාඩම් සැලසුම් සමාලෝචනය කරයි, ක්‍රියාකාරකම්වල අධ්‍යාපනික වටිනාකම, ඉගෙන ගන්නන් සම්බන්ධ කර ගැනීමේ හැකියාව සහ විවිධ ශිෂ්‍ය කණ්ඩායම් වෙත ඇති විය හැකි ආයාචනය ඇගයීමට ලක් කරයි.

කමිටුවේ කාර්යය සහ කැපවීම Hour of Code හි සාර්ථකත්වයට සහ සෑම සිසුවෙකුටම පරිගණක විද්‍යාව පිළිබඳ හැඳින්වීමක් පිරිනැමීමේ එහි දැක්මට දායක වී ඇත.

# ප්‍රධාන හවුල්කරුවන් සහ ආයතනික ආධාරකරුවන්

{{ partners/major_partners_corporate_supporters }}

* * *

# ජාත්‍යන්තර හවුල්කරුවන්

{{ partners/international_partners }}

* * *

# විෂයමාලා සහ නිබන්ධන හවුල්කරුවන්

{{ partners/curriculum_tutorial_partners }}

* * *

# යටිතල පහසුකම් හවුල්කරුවන් සහ මෙවලම්

{{ partners/infrastructure_partners_tools }}

* * *

# අතිරේක හවුල්කරුවන්

{{ partners/additional_partners }}

{{ signup_button }}