{
  "backgroundOrTextEffect": "Musisz dodać tło lub efekt tekstowy.",
  "deletedSprite": "Wygląda na to, że usunąłeś duszka. Możesz dodać go z powrotem z przybornika **Duszki**.",
  "effectWithEvent": "Spróbuj użyć nowego efektu pierwszego planu lub tła pod blokiem zdarzenia „kiedy linia pokazuje”.",
  "foregroundEffectWithEvent": "Musisz dodać efekt pierwszego planu za pomocą zdarzenia.",
  "makeBackground": "Musisz dodać efekt tła.",
  "makeForeground": "Musisz dodać efekt tła.",
  "noTextEffects": "Musisz dodać efekt tekstowy do swojego projektu.",
  "oneTextEffect": "Świetna robota! Dodałeś jeden efekt tekstowy. Spróbuj dodać kolejny.",
  "removedSprite": "Wygląda na to, że usunąłeś duszka. Możesz dodać go z powrotem z przybornika **Duszki**.",
  "setSize": "Użyj bloku „ustaw rozmiar”, aby zmienić rozmiar swojego duszka. Użyj liczby innej niż 100.",
  "spriteEvent": "Spróbuj dodać lub usunąć duszka pod blokiem zdarzenia `kiedy linia pokazuje`.",
  "successAddedSprite": "Świetna robota przy dodawaniu nowego duszka ze zdarzeniem! Kliknij „Graj dalej”, aby spróbować usunąć duszka za pomocą zdarzenia.",
  "successBackgroundEvent": "Świetna robota zmieniająca Twoje tło dzięki wydarzeniu! Kliknij „Kontynuuj odtwarzanie”, aby spróbować zmienić efekt pierwszego planu.",
  "successEffectWithEvent": "Gratulacje, dodałeś efekt do swojego kodu! Możesz kliknąć „Kontynuuj grę”, aby dodać jeszcze więcej efektów.",
  "successForegroundEvent": "Świetna robota zmieniająca Twój pierwszy plan dzięki wydarzeniu! Kliknij „Kontynuuj odtwarzanie”, aby spróbować zmienić efekt tła.",
  "successLevel1": "Gratulacje! Ukończyłeś poziom 1.",
  "successLevel2": "Gratulacje! Ukończyłeś poziom 2.",
  "successLevel3": "Gratulacje! Ukończyłeś poziom 3.",
  "successLevel4": "Gratulacje! Ukończyłeś poziom 4.",
  "successLevel5": "Gratulacje! Ukończyłeś poziom 5.",
  "successLevel6": "Gratulacje! Ukończyłeś poziom 6.",
  "successLevel7": "Gratulacje! Ukończyłeś poziom 7.",
  "successLevel8": "Gratulacje! Ukończyłeś poziom 8.",
  "successLevel9": "Gratulacje! Ukończyłeś poziom 9.",
  "successLevel10": "Gratulacje! Ukończyłeś poziom 10.",
  "successRemovedSprite": "Świetna robota przy dodawaniu nowego duszka ze zdarzeniem! Kliknij „Graj dalej”, aby spróbować dodać duszka za pomocą zdarzenia.",
  "successTextEvent": "Świetna robota zmieniająca Twój efekt tekstowy za pomocą zdarzenia! Kliknij „Kontynuuj grę”, aby spróbować zmienić efekt pierwszego planu lub tła.",
  "textEffectWithEvent": "Ustaw nowy efekt tekstowy w bloku zdarzenia `gdy linia pokazuje`."
}
