{
  "errorLoadingAnimation": "Wygląda na to, że mamy problem z załadowaniem Twojej animacji \"{animationName}\". Upewnij się, że Twoje połączenie z internetem jest poprawne i spróbuj przeładować stronę. Jeżeli problem nadal występuje, możliwym jest, że animacja jest uszkodzona. W tym przypadku, aby kontynuować musisz usunąć animację.",
  "reinfFeedbackMsg": "Zakończyłeś! Kliknij \"Kontynuuj\", aby przejść na kolejny poziom.",
  "shareGame": "Podziel się swoją grą:",
  "spritelabFeedbackCreateFishWithBehavior": "Musisz utworzyć przynajmniej jednego rybiego duszka i nadać mu reguły zachowania.",
  "spritelabFeedbackMoveFishLeftRight": "Twój rybi duszek musi poruszać się w lewo lub prawo. Spróbuj zmienić jego reguły zachowania.",
  "spritelabFeedbackChangeBackgroundColor": "Musisz zmienić tło na inne niż białe.",
  "spritelabFeedbackCreateTwoSprites": "Musisz utworzyć dokładnie dwa duszki.",
  "spritelabFeedbackTwoSpritesWithCostumes": "Każdy z dwóch duszków musi mieć inny kostium.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Musisz utworzyć dwa duszki, które posiadają reguły zachowania oraz różne kostiumy.",
  "spritelabFeedbackClickSprite": "Upewnij się, że kliknąłeś w Twojego duszka po naciśnięciu klawisza 'Start'.",
  "spritelabFeedbackUseSpinningBehavior": "Twój duszek musi zacząć się obracać. Spróbuj zmienić jego reguły zachowania.",
  "spritelabFeedbackPinkAlienBehavior": "Twój różowy obcy nie zaczął żadnego zachowania.",
  "spritelabFeedbackCreateThreeAliens": "Musisz utworzyć niebieskiego, różowego i żółtego obcego.",
  "spritelabFeedbackAliensNotInLine": "Twoi trzej obcy muszą być ustawieni w poziomej linii (w ciągu 50 pikseli).",
  "spritelabFeedbackYellowAlienBehavior": "Żółty obcy nie zaczął żadnego zachowania.",
  "spritelabFeedbackNoAlienColor": "Co najmniej jeden z Twoich obcych nie zmienił koloru.",
  "spritelabFeedbackNeedAlienStopBehavior": "Twoje duszki obcych muszą zatrzymać wszystkie swoje zachowania.",
  "spritelabFeedbackBlueAlienBehavior": "Twój niebieski obcy musi zacząć nowe zachowanie.",
  "spritelabFeedbackUseCostume": "Musisz użyć co najmniej jednego kostiumu.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Musisz utworzyć trzy duszki z różnymi kostiumami.",
  "spritelabFeedbackMoveUpNotDown": "Twój duszek musi poruszać się w górę (północ) zamiast w dół (południe).",
  "spritelabFeedbackRobotFasterThanRover": "Robot dotarł do prawej strony ekranu przed wędrowcem.",
  "spritelabFeedbackDifferentStarRotation": "Obydwa duszki w gwiezdnych kostiumach muszą obrócić się tyle samo.",
  "spritelabFeedbackAstronautMoveToCorner": "Duszek astronauta musi przenieść się do jednego z czterech rogów."
}
