---
title: أنشر الكلمة
layout: wide
nav: promote_nav
---

{{ signup_button }}

# اجعل جماعتك تشارك في ساعة البرمجة

## انشر الكلمة

أخبر أصدقاءك عن **#HourOfCode**!

{{ promote/share_buttons }}

## اطلب من مدرستك كلها أن تشارك في حدث "ساعة من الكود البرمجي"

[ارسل هذا الإيميل]({{ promote/sample_emails }}) إلى مديرك وتحد كل الفصول في مدرستك لتسجيل الدخول.

## 3.أطلب من مشغلك/صاحب العمل الخاص بك أن يشارك في هدا الحدث

[أرسل هذا الإيميل]({{ promote/sample_emails }}) إلى المسير أو المدير العام للشركة.

## 4. روج لساعة البرمجة في جماعتك

[جند مجموعة محلية]({{ promote/sample_emails }})- فتيات وفتيان نادي الكشافة، كنيسة، جامعة، مجموعة قدماء المقاومين، اتحاد العمال، أو حتى بعض الأصدقاء. لست بحاجة لأن تكون في المدرسة لتعلم مهارات جديدة. استخدم هذه [ملصقات، ولافتات، ومقاطع فيديو والمزيد](%= resolve_url('/promote/resources')%)لحدثك الخاص.

## 5. أطلب من مسؤول محلي لدعم حدث "ساعة من الكود البرمجي"

[أرسل هذه الإيميل]({{ promote/sample_emails }}) إلى ممثليك المحليين، مجلس المدينة، مجلس المؤسسة وقم بدعوتهم لزيارة مؤسستك من أجل ساعة البرمجة. يمكن أن تساعد في دعم لعلوم الكمبيوتر في منطقتك بعد ساعة واحدة.

{{ signup_button }}