---
title: مثال افتتاحي داعم لأسبوع تدريس علوم الكمبيوتر وساعة البرمجة
layout: wide
nav: promote_nav
---

{{ signup_button }}

# اكتب مقالا افتتاحيا لدعم أسبوع تدريس علوم الكمبيوتر

### فيما يلي مثال مقال داعم لأسبوع تدريس علوم الكمبيوتر - وأهدافه- التي يمكن استعمالها من طرف مشرعين جهويين أو محليين، تجار كبار، وأكثر.

### قم بزيارة [advocacy.code.org]({{ urls/advocacy }}) لإيجاد معلومات خاصة في الجهة حول علوم الكمبيوتر.

* * *

#### عنوان: الحوسبة... حيث توجد الوظائف

#### بواسطة [NAME] و[CONSIDER CO-AUTHORING WITH EDUCATOR, SUPERINTENDENT OR BUSINESS LEADER]

الحواسب في كل مكان. إنها في جيوبنا. إنها في جدراننا. إنها في سياراتنا. إنها جزء مهم في بنيتنا التحتية، من شبكة الكهرباء إلى إشارات المرور إلى الاشتغال الداخلي لأسواقنا المالية. وكل هذه الحواسيب لديها شيء مشترك واحد. تتعلق بالبرنامج لتطلب منها ما ستقوم به.

لكن ما الذي سيكتبه بالضبط هذا البرنامج؟

بالنظر إلى سرعة تحول عالمنا بواسطة التكنولوجيا، يمكن أن تتوقع أن يكون عدد الطلاب الذين يدرسون علوم الكمبيوتر في K-12 اليوم هو الأعلى على الإطلاق. ستكون مخطئا. في الحقيقة، قليل من الطلاب يدرسون علوم الكمبيوتر، وقليل من المدارس تدرسها قبل عقد من الزمن.

في وقت لم يكن فيه الطلب على المبرمجين كبيرا، لدينا عدد قليل من الإعلامياتيين. حتى في هذه الفترة من معدل بطالة كبير، آلاف الوظائف. العديد منها هنافي **[INSERT STATE/CITY]**، تبقى شاغرة بسبب عدم امتلاك الأفراد المهارات المطلوبة.

لماذا هذا؟ وكيف سنعالجه؟

المشكل يبدأ في مؤسساتنا الإعدادية والثانوية. تسعة من عشرة مدارس لا تتوفر على أقسام لتدريس البرمجة على الحاسوب. في **[SCHOOL DISTRICT]** خلال السنة الماضية، فقط **[NUMBER]** من الطلاب اجتازوا امتحان علوم الكمبيوتر في المستوى الإعدادي المتقدم، فقط **[%]** من الذلاب من نجحوا فيه في ولايتنا. ببساطة لا نبذل جهدا أكبر لإعداد أو تشجيع طلابنا لمتابعة هذه المهن الحيوية العالية الأجر.

كل الاختراعات الرئيسية تم اختراعها تقريبا في هذا البلد، لكننا معرضون لخطر فقدان الريادة إن لم شيئا الآن.

نحتاج إلى القيام ببعض التغييرات.

**[OPTIONAL FOR STATES WHERE THIS APPLIES]**

تغيير إيجابي يجب أن يحصل وهو إتاحة الفرصة لدروس صارمة في علوم الكمبيوتر لتلبية الرياضيات والعلوم في التخرج من المدارس الثانوية. في **[INSERT STATE]**، دورات علوم الكمبيوتر اختيارية. نظرا للمتطلبات الأكاديمية، فالطلاب لن يستطيعوا تحمل دراسة دروس اختيارية في علوم الكمبيوتر. والقيام بهذا التغيير سيكون له تأثير كبير. في الولايات التي يتم فيها احتساب دروس علوم الكمبيوتر كمعيار للنجاح، تكون فيها الدروس أكبر بخمسين بالمئة ونسب المشاركة للأقليات تمثيليا مرتفعة أكثر من الولايات التي تكون فيها علوم الكمبيوتر اختيارية.

يجب علينا أيضا أن نعمل مع الطلاب في سن مبكرة لإثارة اهتمامهم بعلوم الكمبيوتر والبرمجة. يجب على أطفالنا ألا يعرفوا فقط كيفية استعمال ولعب ألعاب الفيديو - يجب عليهم معرفة كيفية إنشائها. يمكن للأطفال تعلم أساسيات البرمجة باكرا في المستوى الثاني.

نحتاج لتوظيف مدرسي علوم الكمبيوتر أكثر لتشجيع التطوير المهني في مجالهم. اليوم، هناك العديد من موارد على الأنترنت التي يمكن أن تساعد المدرسين على الولوج إلى أحدث التكنولوجيات لطلابهم ومواكبتها.

حسب إحصائيات مكتب دراسات، في 2020 سيكون هنا 9.2 مليون منصب عمل في مجال العلوم والتكنولوجيا والهندسة والرياضيات. نصف هذه الوظائف -4.6 ملوين- سيكون حول تكنولوجيا المعلوميات. وعلوم الكمبيوتر أصبحت معرفة ضرورية أساسية للقرن 21. من سيتولى هذه المناصب إن لم يكن لأولادنا فرصة اكتساب المهارات المطلوبة؟

هذه الأسبوع، {{ campaign_date/full }}، هو أسبوع تدريس علوم الكمبيوتر. في المدراس في **[STATE]**، سيشارك طلابنا في ساعة البرمجة وطنية، لإزالة الغموض حول موضوع علوم الكمبيوتر آملين فتح شهيتهم للذهاب أبعد والتعلم أكثر. سأنضم إلهم، وأدعوك للانضمام ايضا. يجب أن يتعلم كل واحد كيف يبرمج. زر https://hourofcode.com/{{ country }} للمزيد من التفاصيل والبدء. وادعم مجهوداتنا لحمل علوم الكمبيوتر إلى مدارس أكثر في **[STATE]**.

{{ signup_button }}