---
title: مواد صحفية
layout: wide
nav: promote_nav
---

{{ signup_button }}

# كيف تجذب وسائل الإعلام إلى حدثك لساعة البرمجة

### قم بالتحسيس لحدثك لساعة البرمجة وقم بدعوة صحافة محلية لمعرفة لماذا علوم الكمبيوتر مهمة لمدرستك.

*لجميع استفسارات الصحافة ووسائل الإعلام، يرجى الاتصال ب <press@code.org>*

* * *

## نصائح رئيسية

- اتصل بوسائل الإعلام أسبوعين قبل الحدث الخاص بك عبر البريد الإلكتروني. ثم تابع بالبريد الإلكتروني والهاتف إذا كنت لا تتلقى استجابة أولية.
- أطلب من أحد موظفي مدرسة أو المتطوعين التقاط الصور و مشاركتها عبر الإنترنت أو إرسالها إلى الصحافة.
- اكتب حول حدث "ساعة البرمجة" على الصفحة الرئيسية لموقع الويب الخاص بك، وفي صحيفة المدرسة. قم بنشر تفاصيل الحدث، وصور من الأنشطة الطلابية.
- تقاسم على فايسبوك، تويتر، كل التغييرات على تنظيمك، إعلان أحداثك، وقم بنشر الصور خلال {{ campaign_date/year }}. استعمل الهاشتاك **#HourOfCode** ليمكن Code.org من مشاهدتها وروج لأحداثك.

## دليل خطوة بخطوة

### 1-خطط الحدث الذي ستنظمه

- نظم اجتماع لاطلاق الحدث.
- أرسل [رسالة]({{ promote/sample_emails }}) إلى الآباء والأمهات. واطلب منهم نشر الحدث.
- قم بإرسال [رسالة]({{ promote/sample_emails }}) لدعوة رئيس البلدية، عضو البرلمان، الحاكم، أو الاشخاص ذوي النفوذ التجاري للحضور والتحدث إلى الطلاب.
- قم بتنظيم أنشطة للفرق (مثل الانشطة الغير موصولة)، أو عرض اهم الأنشطة التي أنشأها الطلاب.
- اعرض [ فيديو ساعة البرمجة]({{ urls/home }}) ل Code.org أو أحد [هذه الفيديوهات]({{ promote/videos }}) إلهام الطلاب. <br />

### 2. قم بتحديد مراسلين صحفيين يغطون مجال التعليم أو الأحداث المحلية

كالصحف المحلية، محطة التلفاز او الراديو، أو المدونات. <br />

### 3-الاتصال بوسائل الإعلام المحلية

أفضل وسيلة للتواصل تكون عن طريق البريد الإلكتروني. ينبغي أن يكون الاتصال قصيرا ومعبرا: لماذا يجب أن يهتم الآخرون بهذا الحدث؟ ضَمِّن معلومات الاتصال (رقم المحمول) لكل من سيكون حاضرا في الحدث. **[شاهد مثال تقديم للإعلام]({{ promote/press-kit-emails }})**.

ابحث على الإنترنت للعثور على معلومات للاتصال بالمراسلين. إن لم تستطع العثور عليه، اتصل بالجريدة لطلبه، أو أرسل بريدا الكترونيا إلى العنوان العام للمؤسسة واطلب منهم توجيه البريد إلى المراسل الصحيح. <br />

### 4-إعداد الأسئلة الميدانية حول الحدث. وإليك بعض الأمثلة:

#### لماذا تنظم مؤسستك ساعة البرمجة؟

كلنا نعلم اليوم أهمية تعلم التلاميذ كيفية التنقل في علم مشبع بالتكنولوجيا، لكن العديد من المدرسين تنقصهم التجربة في علوم الكمبيوتر ولايعرفون من أين سيبدؤون. هذا الحدث هو فرصة لنا جميعا لمعرفة حول ماذا تدور علوم الكمبيوتر.

نأمل أن يثير هذا اهتمام المتعلمين لمواصلة التعلم. تظهر الأبحاث أن الأطفال يمكنهم استيعاب مفاهيم البرمجة قبل تعلم القراءة والكتابة. في الواقع، أدمغتهم مستعدة أكثر لاستقبال لغات البرمجة في سن مبكرة كالغات الأجنبية. <br /> <br />

#### لماذا هذا مهم؟

التكنولوجيا تحول كل الصناعات في الكوكب. في 2015، 7 ملايين منصب مفتوح في الولايات المتحدة -بما فيها الفن والتصميم - التي تعترف بقيمة مهارات البرمجة. لكن 60 بالمئة من مدارس الولايات المتحدة لا تدرس علوم الكمبيوتر. حان الوقت لكي نلحق بالقرن 21. بغض النظر عما سيمارسه الطلبة عندما يكبرون، سواء الطب أو التجارة أو السياسة، فابتكار التكنولوجيا سيمنحهم الثقة والقدرة على التنافسية. <br />

<a id="sample-emails"></a>

## مثال لبريد الكتروني لدعوة صحافة محلية إلى حدثك

**عنوان الخبر** المدرسة المحلية تشارك في مهمة تعريف الطلاب بعلوم الكمبيوتر

الحواسيب في كل مكان، وتحول كل صناعات العالم، لكن أقل من نصف كل المدارس هي التي تدرس علوم الكمبيوتر. الفتيات والمجموعات الأقل تمثيلا في فصول علوم الكمبيوتر، وفي تكنولوجيا الصناعات. الخبر السار، أننا في طريقنا لنغير ذلك.

مع ساعة البرمجة، كانت علوم الكمبيوتر في الصفحة الرئيسية للمواقع Google، MSN، Yahoo!, وDisney. أكثر من 100 شريك انضموا جميعا لدعم هذه الحركة. كل متاجر أبل في العالم استضافت ساعة البرمجة. حتى الرئيس الأمريكي أوباما كتب سطره الول من الكود كجزء من الحملة.

ولهذا السبب كل [X number] طالب في [SCHOOL NAME] منضم إلى أكبر حدث تعلمي في التاريخ: ساعة البرمجة، خلال أسبوع تدريس علوم الكمبيوتر (3-9 دجنبر).

أكتب إليكم لأدعوكم لحضور اجتماع انطلاقة الحدث ولمشاهدة الأطفال يبدؤون النشاط في [DATE].

ساعة من البرمجة، حدث تم تنظيمه من قبل مؤسسة Code.org غيرالربحية ومايزيد ع، 100 مؤسسة أخرى، هي حركة عالمية تؤمن بأن المتعلمين مستعدون لتعلم المهارات اللازمة للنجاح في القرن 21. نرجو أن تنضم إلينا.

اتصل: [YOUR NAME]، [TITLE]، الهاتف المحمول، بتاريخ: [DATE and TIME of your event]، ومكان: [ADDRESS and DIRECTIONS]

أتطلع لأان نكون على اتصال. <br />

## تفاصيل إضافية واقتباس يمكن أن تستخدمه في المواد

يقول ( Hadi Partovi) مؤسس ورئيس إدارة ( Code.org): "ساعة البرمجة مصممة لتذليل الصعوبات وإظهار كون علوم الكمبيوتر ليست علما صعبا - الجميع يمكنه تعلم الأساسيات". "أكثر من 100 مليون طالب حول العالم جربوا ساعة البرمجة. طلب تدريس فعال للمعلوميات للقرن 21 يتجاوز كل الحدود ولا يعترف بالحدود <br /> <br />

#### ما هو (Code.org)؟

(Code.org) منظمة غير ربحية هدفها توسيع المشاركة في علوم الكمبيوتر وزيادة النساء والفئات من الطلاب الممثلين تمثيلا أقل. رؤيتها هي أن كل طالب في كل مدرسة له الفرصة في تعلم الرمجة المعلوماتية. بعد إطلاقها 2013، (Code.org) نظمت حملة ساعى البرمجة - التي عرفت أكثر من 100 مليون طالب بعلوم الكمبيوتر إلى اليوم - وأبرمت شراكات مع 70 مدرسة عمومية فيجميع أنحاء البلاد لنشر برامج علوم الكمبيوتر. Code.org مدعومة بالتبرعات الخيرية من الشركات، والمؤسسات والأفراد الكرماء، بما فيها (Microsoft)، (Facebook)، (Infosys Foundation USA)، (Amazon)، وآخرون. لمزيد من المعلومات المرجو زيارة: [code.org]({{ urls/codeorg }}).

  
جِد المزيد من الموارد وأمثلة إيميلات [هنا]({{ promote/sample_emails }}).

{{ signup_button }}