---
title: دليل الاستخدام
layout: wide
nav: how_to_nav
---

{{ signup_button }}

# كيف تدرس " ساعة من البرمجة" لفصول وأندية "ما بعد المدرسة"

### انضم للحراك وقدم لمجموعة من طلابك ساعتهم الأولى من علوم الحاسب بهذه الخطوات. "ساعة من البرمجة" سهلة العمل - حتى للمبتدئين! اذا اردت مساعدة إضافية، يمكنك ان تجد [متطوعا محليا](%= codeorg_url('/volunteer/local') %) ليساعدك في القيام بساعة برمجة بعد المدرسة أو في لنادي.

* * *

## ١. شاهد هذا الفيديو كيف-تفعل <iframe width="500" height="255" src="//www.youtube.com/embed/SrnvvWDm73k" frameborder="0" allowfullscreen mark="crwd-mark"></iframe> 

## 2. اختر برنامجاً تعليمياً

نوفر متعة متنوعة، [دورات طويلة]({{ urls/learn }}) للمشاركين من كل الأعمار، مصممة من طرف شركاء مختلفين. [جربها]({{ urls/learn }})

**كل دروس "ساعة من البرمجة"** تتطلب اقل وقت ممكن من الاعداد من المنظمين, وهي ذاتية الاسترشاد - بحيث تسمح للطلاب بالتعلم حسب مستوى مهارة كل فرد.

[![](/images/fit-700/tutorials.png)]({{ urls/learn }})

**هل أنت بحاجة إلى خطة دراسية لنشاط "ساعة من البرمجة" بعد المدرسة ؟** تفقد هذا! [النموذج](/files/AfterschoolEducatorLessonPlanOutline.docx)!

## ٣. عزّز ساعة البرمجة لديك

روج لحدثك لساعة البرمجة [مع هذه الأدوات]({{ urls/promote }}) وشجع الآخرين على استضافتها.

## ٤. حدد احتياجاتك من التقنية - أجهزة الحاسب الآلي اختيارية

أفضل تجربة ل"ساعة من البرمجة" تتضمن أجهزة كمبيوتر متصلة بالإنترنت. لكن **لا** تحتاج إلى جهاز كمبيوتر لكل طفل، ويمكنك حتى تعليم "ساعة من البرمجة" دون كمبيوتر على الإطلاق.

تأكد من اختبار البرامج التعليمية على كمبيوترات الطلاب أو أجهزتهم للتأكد من أنها تعمل بشكل صحيح على المتصفحات بالصوت والفيديو. **هل سرعة النت ضعيفة ؟** قم أنت بعرض مقاطع الفيديو أمام كل طلاب الفصل، بحيث لا يحتاج كل طالب تحميل المقاطع بنفسه. أو جرب البرامج التعليمية الغير متصلة / بدون انترنت.

**وفر سماعات لطلاب الفصل**، أو أطلب من الطلاب إحضار سماعاتهم، إذا اخترت برنامجا تعليميا يعمل بشكل أفضل مع الصوت.

**ليس لديك ما يكفي من الاجهزة؟**إستخدم[البرمجة المزدوجة](https://www.youtube.com/watch?v=vgkahOzFH2Q). عندما يتعاون الطلبة، يقل الاعتماد على المعلم. أيضا سيلاحظون أن علم الحاسوب اجتماعي و تعاوني.

## 5) ابدأ تدريب "ساعة من البرمجة" بمشاهدة فيديو ملهم للطلاب

أطلق "ساعة من البزمجة" بإلهام المشاركين و مناقشة كيف يأثر علم الحاسوب في كل جزء من حياتنا.

**اعرض احد الفيديوهات المُلهِمة:**

- الفيديو الرسمي ل Code.org، من تقديم بيل غاتس, مارك زوكربيرج ونجم إن بي أي كريس بوش (توجد نسح <a href="https://www.youtube.com/watch?v=qYZF6oIZtfc"1 دقيقة واحدة</a>, [5 دقائق](https://www.youtube.com/watch?v=nKIu9yen5nc), [9 دقائق](https://www.youtube.com/watch?v=dU1xS07N-FA)).
- [الفيديو العالمي لساعة من البرمجة ](https://www.youtube.com/watch?v=KsOIlDT145A)
- [الرئيس اوباما يدعو جميع الطلاب لتعلم علم الحاسوب](https://www.youtube.com/watch?v=6XvmhE1J9PY).
- للعثور على المزيد من أشرطة الفيديوهات الملهمة من [ هنا](https://www.youtube.com/playlist?list=PLzdnOPI1iJNfpD8i4Sx7U0y2MccnrNZuP).

**ليست مشكلة اذا كنت جديد على علم الحاسوب. هذا بعض الافكار اللتي ستعرفم على نشاط "ساعة برمجة":**

- اشرح كيف أن التكنولوجيا تؤثر على حياتنا بطرق متعددة، مع أمثلة بحيث أن كلا من الأولاد والبنات يهتمون ب (النقاش حول كيف أن التطبيقات التكنولوجية تستخدم في إنقاذ الأرواح، ومساعدة الناس، وربط الناس ببعضهم البعض وإلى أخره).
- بمشاركة الفصل، اسرد الاشياء التي نستخدم فيها البرمجة في حياتنا اليومية.
- هذه بعض التوجيهات لجعل الفتيات يهتمن بعلوم الكمبيوتر[هنا]({{ urls/girls }}).

**بحاجة إلى المزيد من التوجيه؟** حمل هذا [ النموذج من الخطة الدراسية](/files/AfterschoolEducatorLessonPlanOutline.docx).

## ٦- برمج!

**توجيه المشاركين الى النشاط** -اكتب رابط الدرس في لوح المعلومات. اعثر على الرابط المدرج في [معلومات حول دورتك المختارة]({{ urls/learn }}) تحت عدد المشاركين.

**عندما يأتي شخص عبر الصعوبات لا بأس بأن يجاوب:** --"أنا لا أعرف. دعونا نتخيل هذا معا. " -"التكنولوجيا لا تعمل دائماً بالطريقة التي نريد". -"تعلم البرمجة مثل تعلم لغة جديدة; لا يمكن ان تجيدها على الفور. "

**ماذ تفعل إن أنهى أحد عمله باكرا؟** - شجع المشاركين لإجراء نشاط ساعة برمجة آ على [خر hourofcode.com/learn]({{ urls/learn }}) - أو اطلب ممن أنهوا باكرا ليساعدوا المتعثرين.

## ٧- احتفل

- [اطبع الشهادات](%= codeorg_url('/certificates')%) لطلابك.
- [اطبع "أجريت ساعة البرمجة"]({{ promote/resources_stickers }}) ملصقات لطلابك.
- [اطلب قمصان خاصة](http://blog.code.org/post/132608499493/hour-of-code-shirts-and-more) لمدرستك.
- شارك صور وفيديوهات حدث ساعة برمجة الذي قمت به على وسائل التواصل الاجتماعي. استخدم #HourOfCode و @codeorg حتى نسلط الضوء على نجاحك ايضا!

## موارد أخرى لمعلمي ساعة برمجة

- تفقد [ أفضل الممارسات](http://www.slideshare.net/TeachCode/hour-of-code-best-practices-for-successful-educators-51273466) من منظمين اخرين لنشاط "ساعة من البرمجة".
- شاهد تسجيلنا لمحاضرة [ دليل المعلم لنشاط"ساعة من البرمجة"](https://youtu.be/EJeMeSW2-Mw).
- قم بزيارة [ منتدى ساعة من البرمجة](http://forum.code.org/c/plc/hour-of-code) للحصول على نصيحة، فكرة و دعم من منظمين اخرين.
- استعرض [ساعة برمجة سؤال وجواب](https://support.code.org/hc/en-us/categories/200147083-Hour-of-Code).

## ماذا بعد ساعة برمجة؟

نشاط"ساعة من البرمجة" هو مجرد خطوه اولية في الرحلة لمعرفه كيفيه عمل التكنولوجيا وكيفيه انشاء التطبيقات البرمجيات. ساعد الطلاب في متابعة مسيرتهم و تشجيعهم [لتعلم المزيد على الانترنت](%= codeorg_url('/learn/beyond') %)!

{{ signup_button }}