---
title: دليل الآباء
layout: wide
nav: how_to_nav
---

{{ signup_button }}

# كيف تنجز ساعة برمجة مع طفلك

### أكمل ساعة برمجة بالمنزل، أو تطوع لنقلها الي فصل طفلك في المدرسة!

* * *

## 1) شاهد هذا الفيديو "كيف تفعل ذلك" <iframe width="500" height="255" src="//www.youtube.com/embed/SrnvvWDm73k" frameborder="0" allowfullscreen mark="crwd-mark"></iframe> 

## 2) اختر دورة

نحن نوفر متعة متنوعة، دزرات طولية لكل الأعمار، مصممة منطرف عدة شركاء. [جربها]({{ urls/learn }})

**كل دورات ساعة البرمجة ذاتية التوجيه- مما يسمح لطفلك ان يكملها على وتيرته و مستوى مهاراته**

[![](/images/fit-700/tutorials.png)]({{ urls/learn }})

## ٣) خطط لاحتياجاتك التقنية

افضل تجربة لساعة برمجة ستكون مع أجهزة كمبيوتر متصلة بالانترنت. لكنك **لا** تحتاج إلى كمبيوتر. هنالك العديد من الأنشطة "الغير متصلة" ويمكن أن تنجز دون اي تكنولوجيا على الاطلاق. دورات تجريبية على حاسوبك أو جهازك. تأكد أنها تعمل جيدا على متصفحات البحث بالصوت والصورة.

**تريد أن تتعلم إلى جانب طفلك؟** جرب [البرمجة الثنائية.](http://www.ncwit.org/resources/pair-programming-box-power-collaborative-learning)علوم الكمبيوتر هي اجتماعي تشاركي.

## 4) ابدأ ساعة البرمجة بفيديو ملهم

أطلق ساعة البرمجة بإلهام طفلك ومناقشة كيف أن علم الكمبيوتر يؤثر في كل جزء من حياتنا.

**اعرض احد الفيديوهات المُلهِمة:**

- الفيديو الرسمي لإطلاق Code.org، من تقديم بيل غايتس Bill Gates, مارك زاكربيرج Mark Zuckerberg و نجم إن بي أي NBA كريس بوش (توجد نسخ[الدقيقة الواحدة](https://www.youtube.com/watch?v=qYZF6oIZtfc), [الخمس دقائق](https://www.youtube.com/watch?v=nKIu9yen5nc), and [ التسع دقائق](https://www.youtube.com/watch?v=dU1xS07N-FA)).
- [الفيديو العالمي لساعة البرمجة](https://www.youtube.com/watch?v=KsOIlDT145A).
- [الرئيس اوباما يدعو جميع الطلاب لتعلم علم الحاسوب](https://www.youtube.com/watch?v=6XvmhE1J9PY).
- اطلع على المزيد من [الموارد الملهمة]({{ urls/inspire }}) و[الفيديوهات](https://www.youtube.com/playlist?list=PLzdnOPI1iJNfpD8i4Sx7U0y2MccnrNZuP).

لا بأس ان تكون انت وطفلك حديثي العهد بعلم الكمبيوتر. هنا بعض الأفكار كي تقدم نشاط ساعة برمجة:

- اشرح طرق تأثير التكنولوجيا على حياتنا، مع ذكر أمثلة تهم الفتيات والفتيان (تكلم عن انقاذ الحياة، مساعدة الناس، التواصل بينهم، الخ.).
- بمشاركة الفصل، اسرد الاشياء التي نستخدم فيها البرمجة في حياتنا اليومية.
- هذه بعض التوجيهات لجعل الفتيات يهتمن بعلوم الكمبيوتر[هنا]({{ urls/girls }}).

هل تريد المزيد من الأفكار؟ انظر إلى [نموذج خطة الدرس](/files/AfterschoolEducatorLessonPlanOutline.docx) لتحصل على أفضل الممارسات من خبراء التعليم.

## ٥) برمج!

<img src="/images/fit-700/tutorial-short-link.png" />

عندما تختار الدرس التعليمي الذي تود القيام به، يمكنك حفظ إشارة مرجعية لرابط الدرس.

**عندما يواجه طفلك بعض الصعوبات**

لا بأس أن تجيبه:

- "لا أعرف، دعنا نكتشف سوياً."
- "لا تعمل التقنية كما نحب دائما."
- "تعلم البرمجة مثل تعلم لغة جديدة، لن تتحدث بطلاقة مباشرة."

## ٦) احتفل

[اطبع الشهادات](%= codeorg_url('/certificates') %) لطفلك (ولنفسك!).

شارك صور وفيديوهات حدث ساعة برمجة الذي قمت به على وسائل التواصل الاجتماعي. استخدم #HourOfCode و @codeorg حتى نسلط الضوء على نجاحك ايضا!

راجع [الأسئلة المتكررة في ساعة البرمجة](https://support.code.org/hc/en-us/categories/200147083-Hour-of-Code).

## ماذا بعد ساعة برمجة؟

ساعة البرمجة هي مجرد خطوة أولى في رحلة تعلم المزيد عن كيفية عمل التكنولوجيا وكيف تنشئ تطبيقات برمجية. لتواصل هذه الرحلة:

- شجع طفلك ليواصل [التعلم عبر الانترنت](%= codeorg_url('/learn/beyond') %).
- ساعد في [تعزيز](%= resolve_url('/promote') %) تعليم علوم الكمبيوتر في منطقة مدرسة ابنك.

{{ signup_button }}