{
  "errorLoadingAnimation": "Parece que temos un problema ao cargar a túa animación «{animationName}». Asegúrate de que tes unha boa conexión a internet e trata de volver a cargar a páxina. Se continua o problema, é posible que esta animación estea rota. Neste caso, pode ser que teñas que eliminar a animación para continuar.",
  "reinfFeedbackMsg": "Remataches! Fai clic en «Continuar» para pasar ao seguinte nivel.",
  "shareGame": "Comparta o seu xogo:",
  "spritelabFeedbackCreateFishWithBehavior": "Debes crear alomenos un sprite de peixe e darlle un comportamento.",
  "spritelabFeedbackMoveFishLeftRight": "O teu sprite de peixe debe moverse á esquerda ou dereita. Tenta cambiando o seu comportamento.",
  "spritelabFeedbackChangeBackgroundColor": "Precisas cambiar a un fondo que sexa distinto de branco.",
  "spritelabFeedbackCreateTwoSprites": "Debes crear exactamente dous sprites.",
  "spritelabFeedbackTwoSpritesWithCostumes": "Os teus dos sprites precisan disfraces diferentes.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Debes crear dous sprites con diferentes disfraces cada un cun comportamento.",
  "spritelabFeedbackClickSprite": "Asegúrate de facer clic no teu sprite despois de presionar «Executar».",
  "spritelabFeedbackUseSpinningBehavior": "O teu sprite ten que comezar a xirar. Tenta cambiando o seu comportamento.",
  "spritelabFeedbackPinkAlienBehavior": "O teu sprite de extraterrestre rosa non iniciou un comportamento.",
  "spritelabFeedbackCreateThreeAliens": "Debes crear un extraterrestre azul, un extraterrestre rosa e un extraterrestre amarelo.",
  "spritelabFeedbackAliensNotInLine": "Os teus tres sprites de extraterrestres deben colocarse nunha línea horizontal (de 50 píxeles).",
  "spritelabFeedbackYellowAlienBehavior": "O extraterrestre amarelo non iniciou o seu comportamento.",
  "spritelabFeedbackNoAlienColor": "Alomenos un dos teus extraterrestres non cambiou de cor.",
  "spritelabFeedbackNeedAlienStopBehavior": "Os teus sprites de extraterrestres deben parar todos os seus comportamentos.",
  "spritelabFeedbackBlueAlienBehavior": "O teu extraextraterrestre azul debe comezar un novo comportamento.",
  "spritelabFeedbackUseCostume": "Debes crear alomenos un disfraz.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Debes crear tres sprites con diferentes disfraces.",
  "spritelabFeedbackMoveUpNotDown": "O teu sprite debe moverse para arriba (norte) no lugar de abaixo (sur).",
  "spritelabFeedbackRobotFasterThanRover": "O robot acadou a parte dereita da pantalla antes que o explorador.",
  "spritelabFeedbackDifferentStarRotation": "Os sprites con disfraces de estrela deben xirar na mesma medida.",
  "spritelabFeedbackAstronautMoveToCorner": "O sprite de astronauta debe moverse cara un dos catro recantos."
}
