{
  "key": "callMyFunction",
  "name": "Call a function",
  "category": "Functions",
  "category_key": "functions",
  "content": "When you **define** a function you give a name to a set of actions you want the computer to perform. When you **call** a function you are telling the computer to run (or execute) that set of actions.\n\nA function definition can be provided anywhere in your code - in some ways the function definition lives independently of the code around it. It actually doesn't matter where you put a function definition. And you can call it from anywhere, either before or after the function definition. We will follow the convention of always putting function definitions at the bottom of our program, and the code for calling functions at the top of our program.",
  "examples": [
    {
      "name": "Example: Long Line",
      "code": "```\n// Call function to draw a long line.\nlongLine();\n\nfunction longLine(){ // Define a function to draw a long line.\n  penDown();\n  moveForward();\n  moveForward();\n  moveForward(); \n}\n```"
    },
    {
      "name": "Example: Big Box",
      "description": "Call functions to draw a big box.",
      "code": "```\n// Call functions to draw a big box.\nlongLine();\nturnLeft();\nlongLine();\nturnLeft();\nlongLine();\nturnLeft();\nlongLine();\nturnLeft();\n\nfunction longLine(){ // Define a function to draw a long line.\n  penDown();\n  moveForward();\n  moveForward();\n  moveForward(); \n}\n```"
    },
    {
      "name": "Example: Big Box (Improved)",
      "description": "Call functions to draw a big box. This is improved because it abstracts the box as two \"left angles\" and creates a new function that reduces repeated statements.",
      "code": "```\n// Call functions to draw a big box.\nleftAngle();\nleftAngle();\n\nfunction leftAngle(){ // Define a function to draw a left angle with long lines.\n  longLine();\n  turnLeft();\n  longLine();\n  turnLeft();\n}\n\nfunction longLine(){ // Define a function to draw a long line.\n  penDown();\n  moveForward();\n  moveForward();\n  moveForward(); \n}\n```"
    },
    {
      "name": "Example: Roll Two Die",
      "description": "Call functions that use randomNumber(1,6) to simulate rolling two die and summing the results.",
      "code": "```\n// Call functions to generate two die rolls and sum the result. Display the value on the console.\nconsole.log(rollDie() + rollDie());\n\nfunction rollDie() { \n// Define a function that uses randomNumber(1,6) to randomly generate a die roll, 1 to 6, and return the value.\n  var roll = randomNumber(1,6);\n  return roll;\n}\n```"
    }
  ],
  "return_value": "If the function returns a value, you must assign the returned value to a variable or use the value as a parameter in another function call.",
  "short_description": "Calls a user defined function that takes no parameters, and optionally generates a return value.",
  "syntax": "myFunction();",
  "tips": "- The purpose of a function is to help you organize your code and to avoid writing the same code twice.\n- You can call a function within another function.\n- A function that does not explicitly return a value returns the JavaScript value undefined."
}