{
  "key": "createSprite",
  "name": "var sprite = createSprite()",
  "category": "Sprites",
  "category_key": "sprites",
  "content": "Creates a new sprite and assigns it to the variable specified.\r\n\r\nSprites are used to make complex and interesting animations and games. A sprite is able to store images or animations with a set of properties such as position and visibility. Sprites also have properties to report interactions with other sprites or the mouse.",
  "examples": [
    {
      "name": "",
      "description": "",
      "code": "```\nvar sprite = createSprite();\r\ndrawSprites();\n```",
      "app": "",
      "image": null,
      "app_display_type": "codeFromCodeField",
      "embed_app_with_code_height": 310
    },
    {
      "name": "Red Stripe",
      "description": "A later sprite overwrites and earlier sprite.",
      "code": "```\n// A later sprite overwrites an earlier sprite.\r\nvar sprite1 = createSprite(200,200,100,100);\r\nvar sprite2 = createSprite(200,200,50,100);\r\nsprite2.shapeColor=\"red\";\r\ndrawSprites();\n```",
      "app": "",
      "image": null,
      "app_display_type": "codeFromCodeField",
      "embed_app_with_code_height": 310
    },
    {
      "name": "Make Some Stickers",
      "description": "Using 26 different images for stickers, use randomNumber to pick twenty different stickers randomly, and use randomNumber again to pick random places for each sticker.",
      "code": "```\n// Use 10 different images for stickers, and randomNumber to place the stickers\r\nvar count = 0;\r\n\r\nfunction draw() {\r\n  background(\"white\");\r\n  count = count + 1;\r\n  if (count < 20) {\r\n    var sprite = createSprite(200, 200);\r\n    sprite.setAnimation(\"sticker\" + randomNumber(1,10));\r\n    sprite.x = randomNumber(40, 360);\r\n    sprite.y = randomNumber(40, 360);\r\n    \r\n  }\r\n  drawSprites();\r\n}\r\n\n```",
      "app": "https://studio.code.org/projects/gamelab/BIJQLGDNofmVTjkVlt1zjz8qonkbfNM9RYHjSqf3jNg",
      "image": null,
      "app_display_type": "codeFromCodeField",
      "embed_app_with_code_height": 310
    }
  ],
  "palette_params": [
    {
      "name": "x",
      "type": "Number",
      "required": false,
      "description": "The x-location in pixels of the center of the sprite from left to right on the display. Default x value is 0. Should be a number from 0 to 400, but negative numbers will center the sprite to the left of the display and numbers greater than 400 will center the sprite to the right of the display (possibly unseen)."
    },
    {
      "name": "width",
      "type": "Number",
      "required": false,
      "description": "The horizontal width in pixels of the default sprite shape, a rectangle. Default width is 100. Should be a positive number."
    },
    {
      "name": "y",
      "type": "Number",
      "required": false,
      "description": "The y-location in pixels of the center of the sprite from top to bottom on the display. Default y value is 0. Should be a number from 0 to 400, but negative numbers will center the sprite above the display and numbers greater than 400 will start the sprite below the display (possibly unseen)."
    },
    {
      "name": "height",
      "type": "Number",
      "required": false,
      "description": "The vertical height in pixels of the default sprite shape, a rectangle. Default height is 100. Should be a positive number."
    }
  ],
  "parameters": [
    "x",
    "y"
  ],
  "return_value": "Returns the sprite and assigns it to the variable specified.",
  "short_description": "Creates a new sprite and assigns it to the variable specified.",
  "syntax": "var sprite = createSprite(x, y)",
  "tips": "- Sprites that are created later are displayed in front of sprites created earlier, unless the `depth` property is changed.\r\n- Change the image displayed for the sprite from the default rectangle using the `setAnimation` command. All images must be first loaded and given a label using the Animation tab above the display window in Game Lab.\r\n- Sprites all have the same properties and you use the dot notation (combining the name of the sprite, followed by a dot, with the label of the property) to both access and update the property for that sprite.\r\n- If you attempt to set a sprite property to an incorrect value the property reverts to its default value."
}