{
  "key": "functionParams_n",
  "name": "Define a function with parameters",
  "category": "Functions",
  "category_key": "functions",
  "content": "Some functions take parameter values as input to be able to abstract multiple different actions.\n\nWhen you **define** a function you give a name to a set of actions you want the computer to perform. When you **call** a function you are telling the computer to run (or execute) that set of actions. \n\nA function definition can be provided *anywhere* in your code - in some ways the function definition lives independently of the code around it. It actually doesn't matter where you put a function definition. And you can call it from anywhere, either before or after the function definition.  We will follow the convention of always putting function definitions at the bottom of our program, and the code for calling functions at the top of our program.\n\n**Optional**: A function can return a value by using the [`return`(#68D995)](/docs/gamelab/return/) command.",
  "examples": [
    {
      "name": "Example: Drawing a Square",
      "description": "Draw a square of any size.",
      "code": "```\nsquare(75);\n\nfunction square(sideLength){\n\tmoveForward(sideLength);\n\tturnLeft();\n\tmoveForward(sideLength);\n\tturnLeft();\n\tmoveForward(sideLength);\n\tturnLeft();\n\tmoveForward(sideLength);\n\tturnLeft();\n}\n```"
    },
    {
      "name": "Example: Drawing a Rectangle",
      "description": "Draw a rectangle with a function with *two parameters*, the length and width of the rectangle.",
      "code": "```\nrectangle(75, 45);\n\nfunction rectangle(width, height){\n\tmoveForward(width);\n\tturnLeft();\n\tmoveForward(height);\n\tturnLeft();\n\tmoveForward(width);\n\tturnLeft();\n\tmoveForward(height);\n\tturnLeft();\n}\n```"
    },
    {
      "name": "Example: Area of Circle",
      "description": "Calculate and return the area of a circle of a specified radius.",
      "code": "```\n// Calculate and return the area of a circle of a specified radius.\nvar area = computeCircleArea(10);\nconsole.log(area);\n\nfunction computeCircleArea(radius) {\n    return Math.PI * Math.pow(radius, 2);\n}\n```"
    }
  ],
  "short_description": "Gives a name to a set of parameter driven actions you want the computer to perform, and optionally return a value.",
  "syntax": "function myFunction(param1, param2, ..., paramN) {\n    // function body, including optional \"return\" command.\n}",
  "tips": "- The purpose of a function is to help you organize your code and to avoid writing the same code twice. You can you define a function once, and then call the function a number of times.\n- The order of the parameters when calling a function must match the order of parameters in the function definition.\n- A common error is defining a function but forgetting to call the function. A function does not automatically get executed.\n- A function that does not explicitly return a value returns the JavaScript value undefined."
}