{
  "key": "setColliderEach",
  "name": "group.setColliderEach()",
  "category": "Groups",
  "category_key": "groups",
  "content": "Sets the collider for every sprite in the group.\r\n\r\nA collider is an invisible circle or rectangle that can have any size or position relative to the sprite and which will be used to detect collisions and overlapping with other sprites, or the mouse cursor.\r\n\r\nIf the sprite is checked for collision, bounce, overlapping or mouse events a rectangle collider is automatically created from the width and height parameter passed at the creation of the sprite or the from the image dimension in case of animated sprites.\r\n\r\nOften the image default rectangle collider is not appropriate for collision detection so you can set a smaller circular or rectangular collider and offset from the sprite's center.",
  "examples": [
    {
      "name": "",
      "description": "",
      "code": "```\nvar group = createGroup();\r\nfor (var i = 0; i < 10; i++) {\r\n  var sprite = createSprite(randomNumber(0, 400), randomNumber(0, 400),randomNumber(10, 20),randomNumber(10, 20));\r\n  sprite.debug = true;\r\n  group.add(sprite);\r\n}\r\ngroup.setAnimationEach(\"carrot_1\");\r\ngroup.setColliderEach(\"rectangle\", 0, 0, 20, 80, -45);\r\nfunction draw() {\r\n  background(\"white\");\r\n  drawSprites();\r\n}\n```",
      "app": "",
      "image": null,
      "app_display_type": "codeFromCodeField",
      "embed_app_with_code_height": 310
    }
  ],
  "palette_params": [
    {
      "name": "type",
      "type": "String",
      "required": true,
      "description": "The shape of the collider, \"rectangle\" or \"circle\"."
    },
    {
      "name": "xOffset",
      "type": "Numebr",
      "required": false,
      "description": "The offset in the x-direction from the center of the sprite to the center of the collider. The default is 0."
    },
    {
      "name": "yOffset",
      "type": "Number",
      "required": false,
      "description": "The offset in the y-direction from the center of the sprite to the center of the collider. The default is 0."
    },
    {
      "name": "width/radius",
      "type": "Number",
      "required": false,
      "description": "The width of a rectangle collider or the radius of a circle collider. The default is determined by the size of the sprite."
    },
    {
      "name": "height",
      "type": "Number",
      "required": false,
      "description": "The height of a rectangle collider or the radius of a circle collider. The default is determined by the size of the sprite."
    },
    {
      "name": "rotationOffset",
      "type": "Number",
      "required": false,
      "description": "The clockwise rotation in degrees of the collider with respect to the sprite. The default is 0."
    }
  ],
  "parameters": [
    "type"
  ],
  "return_value": "No return value. Determines sprite collisions and sprite-mouse interactions.",
  "short_description": "Sets the collider for every sprite in the group.",
  "syntax": "setColliderEach(type)",
  "tips": "- When your games have complex interactions between sprites or the mouse set `sprite.debug` to true so the sprite is shown with the outline of the collider, the depth, and center.\r\n- If `setColliderEach()` is called for a sprite before it is scaled, the collider is not scaled. But if a sprite is first scaled and then the collider set, the scale is also applied to the collider.\r\n- Groups of sprites all have the same functions and you use the dot notation (combining the name of the group, followed by a dot, with the function name) to call the function for that group of sprites.\r\n- Any changes to the properties of a sprite will not be seen until after `drawSprites()` is called."
}