{
  "key": "whileBlock",
  "name": "While loop",
  "category": "Control",
  "category_key": "control",
  "content": "Apps sometimes need to repeatedly execute some code while something is true. The while loop uses a boolean condition to repeatedly run a block of code. It will check the expression, and if it is true it runs the block of code contained within the curly braces. This process of checking the condition and running the block of code is repeated as long as the boolean condition remains true. Once the boolean expression becomes false it will stop.\n\nA *while* block requires you to define an expression that evaluates to true or false. Just as in arithmetic there are some operators you can use to write expressions that evaluate to a number, programming languages also have a comparison operators (< <= == > >= !=) and boolean operators (&& || !) that let you write expressions that evaluate to true or false.",
  "examples": [
    {
      "name": "Example: Keep Rolling",
      "description": "",
      "code": "```\n// Keep rolling a die while you do not roll a 6. (event-controlled loop)\nvar die=randomNumber(1,6);\nwhile (die !=6) {\n  write(die);\n  die=randomNumber(1,6);\n}\nwrite(die);\n```",
      "image": "https://images.code.org/2dc79e2e4405810d08cc7c6600a14738-image-1450268132597.jpg"
    },
    {
      "name": "Example: Roll 5 Times",
      "code": "```\n// Roll a die 5 times. (counter-controlled loop)\nvar count=1;\nwhile (count<=5) {\n  write(randomNumber(1,6));\n  count=count+1;\n}\n```"
    },
    {
      "name": "Example: Prompt and Loop",
      "description": "Prompt the user for exam scores and find the average.",
      "code": "```\n// Prompt the user for exam scores and find the average.\nvar examGrade = promptNum(\"Enter an exam score from 0 to 100:\");\nvar sum=0;\nvar count=0;\nwhile (examGrade>=0 && examGrade<=100) {\n  sum=sum+examGrade;\n  count=count+1;\n  examGrade = promptNum(\"Enter an exam score from 0 to 100:\");\n}\nif (count>0) {\n  write(\"Average=\"+(sum/count));\n}\nelse {\n  write(\"No valid exam scores entered\");\n}\n```"
    }
  ],
  "palette_params": [
    {
      "name": "condition",
      "type": "boolean expression",
      "required": true,
      "description": "An expression that evaluates to true or false. Comparison operators include < <= == > >= !=. Boolean operators include &&"
    },
    {
      "name": "statement",
      "type": "App Lab statement(s)",
      "required": true,
      "description": "Any valid App Lab statements."
    }
  ],
  "return_value": "No return value.",
  "short_description": "Executes a block of statements while the specified condition is true.",
  "syntax": "while (condition) {\n    statement\n}",
  "tips": "- Unlike an event handler, an while statement does not constantly monitor your program checking the condition to see if it's true or false. A while statement is an instruction just like any other that gets executed line by line in order from top to bottom.\n- Ensure the while loop condition eventually evaluates to false to prevent an infinite loop.\n- If the condition in the while loop is false initially, the loop is never entered and execution continues with the statement following the loop.\n- If the problem phrases the iteration as an *until* (roll a die until you roll a 6), the while condition usually uses a negation, !(die==6).\n- It is sometimes helpful to use the debugging tools (setting breakpoints, inspecting variable values, and stepping) to help correct a loop error."
}