{
  "key": "physical-input",
  "course_version_key": "2024",
  "course_offering_key": "csp",
  "parent_reference_guide_key": "maker-toolkit",
  "display_name": "Physical Input",
  "content": "The Circuit Playground can be used for more than just _outputting_ information (like you've done with LED), it can also be used as an _input_ device. The simplest forms of input available on the board are the **buttons** and the **switch**.\n\n## Identifying the Inputs\n<img alt=\"buttons\" src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/cp_buttonswitch.png\" style=\"float: right; margin-left: 10px; width: 400px;\">\n\n[diagram_nums]\n\n1. The **Reset Button** isn't actually available for you to use in your program. Clicking this button causes the board to reset itself, so avoid clicking it while running a program. It is useful, however, if your board isn't functioning the way you expect.\n\n2.  The left and right buttons are available in code as `buttonL` and `buttonR` respectively. These buttons are identical to each other aside from location on the board. \n Note that the left and right assume that you are looking at the board with the USB port at the top. \n\n3. The **Toggle Switch** is available in code as [`toggleSwitch`(#f78183)](/docs/applab/toggleSwitch/). \n\n[/diagram_nums]\n\n## Events and Event Types\n\n### Left and Right Buttons:\n\n| Event Type  |  Description |  \n|---|---|\n| `down` | Triggers when the button is pressed down.|\n| `up` | Triggers when the button pops back up after being pressed.| \n\n### Toggle Switch:\n\n|  Event Type  | Description  |   \n|---|---|\n| [`open`(#fff176)](/docs/applab/open/)  |  When the toggleSwitch is flipped to open (or `true`) |\n| `close`  |  When the toggleSwitch is flipped to closed (or `false`) |\n| `change`  | When the toggleSwitch is flipped at all  |\n\n## State\n\nThe buttons and switch are similar in that they are both _binary_ inputs - they can only be in one of two **states**. \n\nThe buttons are normally off, or `false`, and change to on, or `true`, when you push them down. You can check whether a button is being pressed using the boolean [`buttonL.isPressed`(#f78183)](/docs/applab/isPressed/)[`buttonL.isPressed`(#f78183)](/docs/applab/isPressed/). \n\nThe switch, however, stays in whichever position you last put it in. When the switch is on the left it’s open, or `true`, and on the right it’s closed, or `false`. \n\nThe switch has  little plus and minus signs printed on either side of it to help you remember. You can check which state the switch is in with the [`toggleSwitch.isOpen`(#f78183)](/docs/applab/toggleSwitch.isOpen/) boolean.\n",
  "position": 5
}