{
  "key": "style-sheets",
  "course_version_key": "2024",
  "course_offering_key": "csp",
  "parent_reference_guide_key": "css",
  "display_name": "Style Sheets",
  "content": "Web Developers intentionally separate content and style to make their code easier to maintain. HTML is the language used to structure the content of a web page, and CSS, which stands for **Cascading Style Sheets**, is a language that adds style to a web page. \n\n<img src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/CS-Discoveries---Semester-1.png\" style=\"float: right; height: 300px;\">\n\n## Separating out content, structure, and style.\n\nAs programmers develop web pages, it's important for them to tell the difference between the content, structure, and style of the page. Developers use HTML to organize the different types of content on page, indicating how it should be structured.  This lets them communicate what role each piece of content plays in the page, such as heading, list, tables, or other types of content.   If you don't use CSS (Cascading Style Sheets) to style that content, then the web browser will apply default styles based on the way the HTML has structured it.  As you learn CSS style rules, you'll have more control over the style applied to different types of content on the page.\n\n## Adding a style sheet\n\n<img alt=\"Web Lab Stylesheet\" src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/weblab_stylesheet.png\" class=\"center\" style=\"max-width: 600px;\">\n\n[diagram_nums]\n\n1. To add CSS style rules to an HTML page, you need to create a style sheet document.\n2. This is the style sheet.\n3. Link to your style sheet.  The link goes inside the [`<head></head>`(#fff176)](/docs/weblab/head/) tag and looks like this:\n\t`<link rel=\"stylesheet\" href=\"style.css\">`\n    \n[/diagram_nums]\n\n## CSS rule-sets\n\nCSS rule-sets consist of two main parts: the selector and the rules. \n\n### Selectors\n\nThe selectors can be any part of the web page you want to style. One way you can identify parts of the web page is using the names of the element type. Selecting an element type will make all elements of that type have the given styling. The selector name for HTML element types is the name of the tag with the brackets removed. In the below example the selector is h1 and it will style all the h1 elements with the rules inside the curly braces (`{ }`).\n\n### Rules\n\nThe rules describe how the elements identified by the selector should change. Each rule consists of a property name and a value, separated by a colon (`:`).  The property name describes what the rule is about, such as color or size, and the value how the property should change.  For example, the rule-set below will make all the h1 headers on the page have blue text that is underlined.\n\n```\nh1{\n  color:blue;\n  text-decoration: underline;\n}\n```\n\nThe punctuation in the rule-set is very important, because that's the way the computer knows where each rule starts and stops.\n\n**W3 Schools Links**\n\n* [CSS Syntax](https://www.w3schools.com/css/css_syntax.asp)",
  "position": 1
}