{
  "addAComment": "Adaugă un comentariu",
  "authorLabel": "autor",
  "allFilesCompile": "Toate Fișierele Sunt Compilate!",
  "backpackFileNameConflictWarning": "Salvarea va suprascrie un fișier existent în ghiozdanul dvs.",
  "backpackLabel": "Ghiozdan",
  "backpackListLoadError": "S-a produs o eroare la încărcarea ghiozdanului tău. Încearcă din nou.",
  "backpackListLoadErrorMessageCommitDialog": "Încearcă să închizi și să redeschizi acest dialog",
  "backpackErrorTitle": "S-a produs o eroare",
  "backpackSaveErrorMessage": "Te rugăm să încerci din nou",
  "cancel": "Revocare",
  "clearConsole": "Curăță Consola",
  "classNotFound": "Eroare: uneia sau mai multor fișiere Java le lipsește o definiție de clasă.",
  "commentUpdateError": "S-a produs o eroare în timpul procesării cererii tale, te rugăm încearcă din nou.",
  "commit": "Confirmă",
  "commitAndSave": "Confirmă & Salvează",
  "commitCode": "Cod de Confirmare",
  "commitNotes": "Note de Confirmare",
  "commitNotesPlaceholder": "Introdu note despre această confirmare aici",
  "compilationSuccess": "Compilarea a reușit",
  "compileFailed": "Compilarea a Eșuat",
  "compilerError": "Nu am putut compila programul tău. Se pare că programul tău are erori și încearcă din nou",
  "compiling": "Se compilează...",
  "console": "Consolă",
  "delete": "Șterge",
  "deleteFileConfirmation": "Ești sigur că vrei să ștergi {filename}?",
  "duplicateProjectFilenameError": "Denumirea fișierului {filename} este deja folosită în acest proiect. Te rugăm să alegi o denumire diferită",
  "duplicateSupportFilenameError": "Denumirea fișierului {filename} este deja folosită în codul de suport al acestui nivel. Te rugăm să alegi o denumire diferită",
  "disabledPeerReviewMessage": "Activează evaluarea inter pares pentru a permite altor studenți din grupul tău să lase comentarii despre proiectul tău.",
  "editor": "Editor",
  "emptyBackpackMessage": "Fișierele salvate în ghiozdanul tău vor apărea aici.",
  "enablePeerReview": "Activează Evaluarea Inter Pares",
  "errorJavabuilderConnectionGeneral": "Am întâlnit o eroare la încărcarea imaginii.",
  "errorJavabuilderConnectionNotAuthorized": "Nu ești autorizat să accesezi Javalab. Trebuie să te autorizezi sau să intri într-o secțiune?",
  "errorLoadingClassmates": "S-a produs o eroare la încărcarea listei colegilor tăi de clasă. Te rugăm să încerci din nou.",
  "errorMediaImageLoadError": "S-a produs o eroare la încărcarea imaginii.",
  "errorNeighborhoodInvalidGrid": "S-a produs o eroare la încărcarea nivelului vecin. Te rugăm să ne contactezi la support@code.org și asigură-te să incluzi URL-ul acestei pagini în mesajul tău.",
  "errorNeighborhoodInvalidDirection": "Direcția furnizată nu este recunoscută. Direcțiile acceptate sunt „nord”, „sud”, „est” și „vest”.",
  "errorNeighborhoodGetSquareFailed": "Piața specificată nu se află în grilă.",
  "errorNeighborhoodInvalidColor": "Numele culorii furnizate nu este recunoscut. Consultă documentația pentru a vedea numele culorilor acceptate.",
  "errorNeighborhoodInvalidLocation": "Locația specificată nu există în grilă.",
  "errorNeighborhoodInvalidMove": "Pictorul a încercat să iasă din grilă sau să intre într-un obstacol.",
  "errorNeighborhoodInvalidPaintLocation": "Pictorul a încercat să picteze în afara grilei sau peste un obstacol.",
  "errorPeerReviewDisabled": "Evaluarea Inter Pares a fost dezactivată pentru acest proiect.",
  "errorPlaygroundInvalidMessage": "Nu poți face nicio schimbare a panoului după ce ai utilizat funcția sfârșit().",
  "errorPlaygroundRunning": "Metoda funcției de pornire() nu poate fi utilizată înainte de a utiliza funcția de sfârșit()",
  "errorPlaygroundNotRunning": "Metoda de sfârșit() nu poate fi utilizată înainte de utilizarea funcției de pornire().",
  "errorProjectNotEditedYet": "Acest proiect nu a fost editat încă. Codul va trebui să fie editat înainte de a putea fi rulat.",
  "errorSoundInvalidAudioFileFormat": "Fișierul de sunet furnizat nu are un format acceptat. Doar WAV este acceptat în acest moment.",
  "errorSoundMissingAudioData": "Fișierul de sunet furnizat nu a conținut date audio.",
  "errorTheaterDuplicatePlayCommand": "Metoda de redare() poate fi utilizată o singură dată per executarea programului.",
  "errorTheaterInvalidShape": "O formă trebuie să conțină un număr par de valori pentru a reprezenta coordonatele (x,y) și trebuie să includă cel puțin 4 valori.",
  "feedbackBeginning": "Acesta este începutul recenziilor pentru proiectul tău.",
  "feedbackBeginningPeer": "Acesta este începutul recenziilor pentru proiectul tău {peerName}.",
  "illegalMethodAccess": "Ai încercat să accesezi o metodă care este blocată de politica noastră de securitate. {cause}",
  "fileImportError": "Unul sau mai multe denumiri de fișiere sunt rezervate de JavaLab și nu pot fi importate în prezentul proiect. Fișierele care nu pot fi importate:",
  "fileImportWarning": "Ai unul sau mai multe denumiri de fișiere duplicate între acest proiect și fișierele salvate în ghiozdanul tău. Denumirile fișierelor duplicate sunt:",
  "fileImportWarningConfirm": "Dorești să înlocuiești aceste fișiere cu fișiere din ghiozdanul tău?",
  "fileLoadError": "S-a produs o eroare la încărcarea fișierului {filename}.",
  "fileNotFoundException": "Codul tău a generat o ExcepțieFișierNegăsit în timpul căutării denumirii fișierului: {causeMessage}",
  "genericSaveErrorTitle": "Salvează eroarea",
  "genericErrorMessage": "Te rugăm să încerci din nou",
  "import": "Importă",
  "includeFiles": "Include Fișierele",
  "internalCompilerException": "Hopa! Am întâmpinat o eroare la compilarea programului tău. Încearcă să îl rulezi din nou. Dacă această eroare continuă, contactează-ne la support@code.org. Asigură-te că incluzi ID-ul de conexiune {connectionId} în mesajul tău.",
  "internalException": "Hopa! Am întâmpinat o eroare. Încearcă să îl rulezi din nou. Dacă această eroare continuă, contactează-ne la support@code.org. Asigură-te că incluzi ID-ul de conexiune {connectionId} în mesajul tău.",
  "internalRuntimeException": "Hopa! Am întâmpinat o eroare la rularea programului tău. Încearcă să îl rulezi din nou. Dacă această eroare continuă, contactează-ne la support@code.org. Asigură-te că incluzi ID-ul de conexiune {connectionId} în mesajul tău.",
  "invalidJavaFilename": "Denumire fișier nevalabilă. Denumirile fișierelor Java nu pot avea spații.",
  "javaExtensionMissing": "Denumire fișier nevalabilă. Denumirile fișierului trebuie să se termine în '.java'.",
  "javabuilderJavaFilenameError": "Fișier Java: {causeMessage} are o denumire fișier nevalabilă. Denumirile fișierelor Java nu pot conține spații sau caractere speciale.",
  "javabuilderMissingFilenameError": "Unuia sau mai multora fișiere ale proiectului tău le lipsesc denumirile fișierelor.",
  "markComplete": "Marcare Completă",
  "markIncomplete": "Marcare Incompletă",
  "missingFilenameError": "Denumirea fișierului nu poate fi necompletată.",
  "newFile": "Fișier Nou",
  "noMainMethod": "Eroare: programul tău nu conține o metodă principală.",
  "noCodeReviewComments": "Comentariile profesorului tău vor apărea aici.",
  "noCodeReviewUntilStudentEditsCode": "Nu poți lăsa comentarii până când titularul proiectului nu a modificat codul implicit și a apăsat butonul „Rulează”",
  "noOtherReviews": "Nu există alte proiecte gata a fi revizuite încă.",
  "onlyVisibleToYou": "comentariile profesorului sunt vizibile doar ție",
  "programCompleted": "Program completat.",
  "refresh": "Reîmprospătează",
  "rename": "Redenumește",
  "replace": "Înlocuiește",
  "reviewClassmateProject": "Revizuiește un proiect al unui coleg de clasă...",
  "returnToMyProject": "Revino la proiectul meu",
  "running": "Se rulează...",
  "runtimeError": "Codul tău a întâlnit o excepție în timpul rulării. {cause}",
  "saveToBackpack": "Salvează în Ghiozdan",
  "startingPainter": "Pornește pictorul.",
  "timeoutWarning": "Avertisment: proiectul tău se va opri în 15 secunde.",
  "timeout": "Proiectul tău s-a oprit.",
  "twoMainMethods": "Eroare: Codul tău poate avea doar o metodă principală. Am găsit cel puțin două clase cu metode principale.",
  "saving": "Salvare...",
  "teacherLabel": "profesor",
  "togglePeerReviewError": "Eroare la activarea/dezactivarea evaluării intra pares, te rugăm să încerci din nou.",
  "unknownError": "Hopa! Am întâmpinat o eroare. Încearcă să rulezi programul tău din nou. Dacă această eroare continuă, contactează-ne la support@code.org. Asigură-te că incluzi ID-ul de conexiune {connectionId} în mesajul tău.{type}",
  "yourPeer": "colegul tău"
}
