{
  "key": "chocolate_ratings",
  "name": "Chocolate Ratings",
  "content": "Description: Chocolate is one of the most popular candies in the world. Each year, residents of the United States collectively eat more than 2.8 billions pounds. However, not all chocolate bars are created equal! This dataset contains expert ratings of over 1,700 individual chocolate bars, along with information on their regional origin, percentage of cocoa, the variety of chocolate bean used and where the beans were grown.\r\n\r\n[Source](https://www.kaggle.com/datasets/rtatman/chocolate-bar-ratings?resource=download)\r\n\r\nColumns:\r\n\r\n* Flavors of Cacao Rating System:\r\n5= Elite (Transcending beyond the ordinary limits)\r\n4= Premium (Superior flavor development, character and style)\r\n3= Satisfactory(3.0) to praiseworthy(3.75) (well made with special qualities)\r\n2= Disappointing (Passable but contains at least one significant flaw)\r\n1= Unpleasant (mostly unpalatable)\r\nEach chocolate is evaluated from a combination of both objective qualities and subjective interpretation. A rating here only represents an experience with one bar from one batch. Batch numbers, vintages and review dates are included in the database when known.\r\n\r\n\r\n* Flavor is the most important component of the Flavors of Cacao ratings. Diversity, balance, intensity and purity of flavors are all considered. It is possible for a straight forward single note chocolate to rate as high as a complex flavor profile that changes throughout. Genetics, terroir, post harvest techniques, processing and storage can all be discussed when considering the flavor component.\r\n\r\n* Texture has a great impact on the overall experience and it is also possible for texture related issues to impact flavor. It is a good way to evaluate the makers vision, attention to detail and level of proficiency.\r\n\r\n* Aftermelt is the experience after the chocolate has melted. Higher quality chocolate will linger and be long lasting and enjoyable. Since the aftermelt is the last impression you get from the chocolate, it receives equal importance in the overall rating.\r\n\r\n* Overall Opinion is really where the ratings reflect a subjective opinion. Ideally it is my evaluation of whether or not the components above worked together and an opinion on the flavor development, character and style. It is also here where each chocolate can usually be summarized by the most prominent impressions that you would remember about each chocolate.\r\n\r\n"
}