{
  "key": "international-exhibition-of-modern-art-1913",
  "name": "International Exhibition of Modern Art 1913",
  "content": "Description: Data on the works of art included in the International Exhibition of Modern Art 1913\n\nThe Armory Show, also known as the International Exhibition of Modern Art, was a show organized by the Association of American Painters and Sculptors in 1913. It was the first large exhibition of modern art in America...                                                            \n\nThe three-city exhibition started in New York City's 69th Regiment Armory, on Lexington Avenue between 25th and 26th Streets, from February 17 until March 15, 1913. The exhibition went on to the Art Institute of Chicago and then to The Copley Society of Art in Boston, where, due to a lack of space, all the work by American artists was removed.\n\nThe show became an important event in the history of American art, introducing astonished Americans, who were accustomed to realistic art, to the experimental styles of the European avant garde, including Fauvism, Cubism, and Futurism. The show served as a catalyst for American artists, who became more independent and created their own \"artistic language.\" [Source](https://en.wikipedia.org/wiki/Armory_Show) accessed January 12, 2020\n\nData Source: [Dr. Nancy Ross and Her Students](http://arthistoryteachingresources.org/2015/02/digital-art-history-for-beginners-the-spreadsheet/) via [Bootstrap](https://docs.google.com/spreadsheets/d/108ZnfCy3V2WkpSmjYpane6gmogM3EtBLL1sD-9h0Acc/edit#gid=650985565) \n\nColumns:\n\n* Title (string): title of the work of art\n* Artist (string): name of the artist\n* Sex (string): sex of the artist\n* Medium (string): the medium the work of art was done in\n* Location (string): the names of the cities where the work of art was exhibited\n* Number of Locations (numerical): the number locations where the work of art was exhibited\n* Sale Price in Dollars (numerical): the price the work of art sold for, in dollars\n* Included because (string): the reason the work of art was included in the exhibition"
}