{
  "key": "nba-playoffs-23-24",
  "name": "NBA Player Playoff Stats 2023-24",
  "content": "Description: This dataset contains detailed statistics for NBA players during the 2023-2024 playoffs. It includes a wide range of metrics that cover various aspects of player performance, including scoring, rebounding, assists, turnovers, shooting efficiency, and more.\r\n\r\n[Source](https://www.kaggle.com/datasets/mohamedsaqibshouqi/2023-2024-nba-player-stats-playoffs?resource=download)\r\n\r\nColumns:\r\n\r\n* RANK (string): Rank of the player.\r\n* NAME (string): The name of the NBA player.\r\n* TEAM (string): The team the player belongs to.\r\n* POS (string): The position the player plays.\r\n* AGE (number): Age of the player\r\n* GP (number): Games played\r\n* MPG (number): Minutes played per game\r\n* USG% (number): Usage Rate - An estimate of the percentage of team plays used by a player while he was on the floor.\r\n* TO% (number): Turnover Percentage - A metric that estimates the number of turnovers a player commits per 100 possessions.\r\n* FTA (number): Total free throws attempted\r\n* FT% (number): Free throw percentage\r\n* 2PA (number): Total 2-point field goals attempted\r\n* 2PA% (number): 2-pt field goal percentage\r\n* 3PA (number): Total 3-point field goals attempted\r\n* 3P% (number): 3-pt field goal percentage\r\n* eFG% (number): Effective Field Goal Percentage - A shooting efficiency metric that takes into account the increased value of 3-point shots.\r\n* TS% (number): True Shooting Percentage - A measure of shooting efficiency that includes field goals, 3-point field goals, and free throws.\r\n* PPG (number): Points Per Game - The average number of points scored by the player per game.\r\n* RPG (number): Rebounds Per Game - The average number of rebounds grabbed by the player per game.\r\n* APG (number): Assists Per Game - The average number of assists made by the player per game.\r\n* SPG (number): Steals Per Game): The average number of steals made by the player per game.\r\n* BPG (number): Blocks Per Game - The average number of blocks made by the player per game.\r\n* TPG (number): Turnovers Per Game - The average number of turnovers committed by the player per game.\r\n* P+R (number): Points + Rebounds Per Game - The combined total of points and rebounds per game.\r\n* P+A (number): Points + Assists Per Game - The combined total of points and assists per game.\r\n* P+R+A (number): Points + Rebounds + Assists Per Game - The combined total of points, rebounds, and assists per game.\r\n* VI (number): Versatility Index - A metric that measures a player’s ability to produce in points, assists, and rebounds.\r\n* ORtg (number): Offensive Rating): The number of points produced by a player per 100 offensive possessions.\r\n* DRtg (number): Defensive Rating - The number of points allowed by a player per 100 defensive possessions.\r\n\r\n\r\n"
}