{
  "category_key": "control_structures",
  "content": "For Loops are critical tools in programming that allow you to repeat blocks of code for a specified duration. You can have a block of code repeat X number of times or repeat until a specified condition is met. The `for` loop syntax has **3 key components:**\n- `initialExpression:` this part of the loop syntax initializes and/or declares the variable that will be used to determine how many times the loop is executed. the `initialExpression` part of the syntax is only executed once.\n- `testExpression:` this is the condition you are operating with (similar to an if statement condition). if the condition in the `testExpression` evaluates to true, the body of the `for` loop will execute. \n- `updateExpression:` this part of the expression updates the variable initialized in the `initialExpression`. The `testExpression` is then evaluated again to see if the condition is still true with this updated value of the variable.",
  "examples": "[{\"name\":\"Using a for loop to perform a set number of actions\",\"code\":\"```\\nfor(int i = 0; i \\u003c 5; i++)\\n{\\n     System.out.println(i);\\n}\\n```\\n//the output indicates how the value of i changes with each iteration of the loop \\n\\n//when i is equal to 5, it no longer satisfies the condition anymore and therefore  the body of the loop is not executed\\n\\n**output:**\\n\\n0\\n\\n1\\n\\n2\\n\\n3\\n\\n4\\n\"},{\"name\":\"Using a for loop to iterate through an array\",\"description\":\"\",\"code\":\"a `for loop` can be used to iterate through the elements of a pre-defined array \\n```\\nint [] numbers = {1, 2, 3, 4};\\nfor(int i =0; i \\u003c numbers.length(); i++)\\n{\\n     System.out.println(numbers[i]);\\n}\\n```\\n**output:**\\n\\n1\\n\\n2\\n\\n3\\n\\n4\\n\"}]",
  "external_documentation": "",
  "fields": "[]",
  "key": "ForLoops",
  "name": "For Loops",
  "syntax": "for (initialExpression; testExpression; updateExpression) {\n\n    // body of code\n}\n\n*the image below is a flowchart of how `for loop` logic operates*\n\n![](https://images.code.org/5093d32dba305b86d2c5bb460700f628-Screen Shot 2022-05-16 at 2.02.18 PM.png)",
  "tips": "",
  "methods": [

  ]
}