{
  "category_key": "control_structures",
  "content": "If/Else Statements are critical to creating conditional programs and are some of the most valuable tools in initial Java programming. Based on a logical condition that you specify, a certain body of code will be executed upon. If that logical condition proves to be false, the else component will be triggered and that body of code may be executed upon. To make it more clear, let's begin with the different types of conditions Java common supports:\n\n###Logical Conditions:\n- Less than: ``a < b``\n- Less than or equal to: Less than: ``a <= b``\n- Greater than: ``a > b``\n- Greater than or equal to: ``a >= b``\n- Equal to: `` a == b``\n- Not Equal To: ``a != b``\n\n###*If Statements*\n- The ``if`` conditional statement allows you to specify a block of code and then content to be executed on. If the statement evaluates to true, the body of the statement will be executed upon. Otherwise, the body of code will be skipped.\n\n###*Else Statements*\n- the `else` conditional statement allows you to specify content to be executed upon if the previous `if` statement evaluates to false.\n\n###*Else if Statements*\n- the `else if` is used to specify a new condition to test, and will be triggered if the first condition is false.",
  "examples": "[{\"name\":\"Using if, else, and else if statements\",\"code\":\"**this first example show a simple use case for an if statement**\\n```\\nif (17 \\u003e 12)  //this condition evaluates to true, so the following code executes\\n{\\n     System.out.println(\\\"The condition evaluated to true.\\\");\\n}\\n```\\n**the example below shows the use of an if statement and else block**\\n```\\nif(17 \\u003c 12) //this condition evaluates to false, so the following code does not executes\\n{\\n     System.out.println(\\\"The condition evaluated to true.\\\");\\n}\\nelse //instead, we will enter this block (because the previous statement evaluated to false\\n{\\n     System.out.println(\\\"In the else block\\\");\\n}\\n```\\n**the example below shows the use of an if, else, and else if**\\n```\\nif(17 \\u003c 12) //evaluates to false\\n{\\n     System.out.println(\\\"Less Than.\\\");\\n}\\nelse if (17 == 12) //evaluates to false\\n{\\n          System.out.println(\\\"Equal To.\\\");\\n}\\nelse //enters this block of code \\n{\\n         System.out.println(\\\"Greater Than.\\\"); //this is printed \\n}\\n```\\n\\n\"}]",
  "external_documentation": "",
  "fields": "[]",
  "key": "IfStatements",
  "name": "If/Else Statements",
  "syntax": "",
  "tips": "Note: You can embed if statements inside of each other. \n**For Example:**\n```\nif(17 >= 17)\n{\n      if(17 == 17)\n      {    \n             System.out.println(\"EQUAL\");\n      }\n}\n\n```",
  "methods": [

  ]
}