{
  "errorLoadingAnimation": "Níl ag éirí linn do bheochan \"{animationName}\" a lódáil. Deimhnigh go bhfuil tú ceangailte leis an Idirlíon agus ansin athlódáil an leathanach. Má mhaireann an fhadhb, d'fhéadfadh sé go bhfuil an bheochan briste. Sa chás sin, ba chóir duit an bheochan a bhaint.",
  "reinfFeedbackMsg": "Tá tú críochnaithe! Cliceáil \"Ar aghaidh\" chun dul go dtí an chéad leibhéal eile.",
  "shareGame": "Comhroinn do chluiche:",
  "spritelabFeedbackAliensNotInLine": "Ní mór do na trí eachtrán a bheith leagtha amach i líne chothrománach (laistigh de 50 picteilín).",
  "spritelabFeedbackAstronautMoveToCorner": "Ní mór don spásaire dul go dtí ceann de na ceithre chúinne.",
  "spritelabFeedbackBlueAlienBehavior": "Ní mór don eachtrán gorm iompar nua a thosú.",
  "spritelabFeedbackChangeBackgroundColor": "Caithfidh tú an cúlra a athrú go dtí rud éigin seachas bán.",
  "spritelabFeedbackClickSprite": "Ná déan dearmad cliceáil ar an sprid tar éis duit `Rith` a bhrú.",
  "spritelabFeedbackCreateFishWithBehavior": "Caithfidh tú iasc amháin ar a laghad a chruthú agus iompar a thabhairt dó.",
  "spritelabFeedbackCreateThreeAliens": "Ní mór duit eachtrán gorm, eachtrán bándearg, agus eachtrán buí a chruthú.",
  "spritelabFeedbackCreateTwoSprites": "Caithfidh tú dhá sprid a chruthú (agus sin an méid).",
  "spritelabFeedbackDifferentStarRotation": "Ní mór do na sprideanna leis na cultacha réalta an méid céanna casadh a dhéanamh.",
  "spritelabFeedbackMoveFishLeftRight": "Ní mór don iasc dul ar chlé nó ar dheis. Bain triail as a iompar a athrú.",
  "spritelabFeedbackMoveUpNotDown": "Ní mór don sprid dul suas (ó thuaidh) in áit dul síos (ó dheas).",
  "spritelabFeedbackNeedAlienStopBehavior": "Ní mór do na heachtráin a n-iompar a stopadh.",
  "spritelabFeedbackNoAlienColor": "Níor athraigh ceann de na heachtráin a dhath.",
  "spritelabFeedbackPinkAlienBehavior": "Níor thosaigh an t-eachtrán bándearg iompar ar bith.",
  "spritelabFeedbackRobotFasterThanRover": "Bhain an róbat an taobh deas den scáileán amach roimh an bhfánaí.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Ní mór duit trí eachtrán le trí chulaith éagsúla a chruthú.",
  "spritelabFeedbackTwoSpritesWithCostumes": "Caithfidh tú cultacha difriúla a thabhairt don dá sprid.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Caithfidh tú dhá sprid le dhá chulaith dhifriúla a chruthú, agus iompar éigin a thabhairt dóibh.",
  "spritelabFeedbackUseCostume": "Caithfidh tú úsáid a bhaint as culaith amháin ar a laghad.",
  "spritelabFeedbackUseSpinningBehavior": "Ní mór don sprid a bheith ag casadh. Bain triail as iompar difriúil.",
  "spritelabFeedbackYellowAlienBehavior": "Níor thosaigh an t-eachtrán buí a iompar."
}