{
  "errorLoadingAnimation": "Het lijkt erop dat we een probleem hebben met het laden van je animatie \"{animationName}\". Zorg ervoor dat je een goede internetconnectie hebt en probeer de site opnieuw te laden. Als dit probleem aanhoudt, kan het zo zijn dat je animatie niet werkt. In dat geval, moet je de animatie verwijderen.",
  "reinfFeedbackMsg": "Je bent klaar! Klik op \"Doorgaan\" om verder te gaan naar het volgende level.",
  "shareGame": "Deel je spel met anderen:",
  "spritelabFeedbackCreateFishWithBehavior": "Je moet tenminste één vis ontwerp maken en het een gedrag geven.",
  "spritelabFeedbackMoveFishLeftRight": "Je vis ontwerp moet naar links of rechts bewegen. Probeer zijn gedrag aan te passen.",
  "spritelabFeedbackChangeBackgroundColor": "Je moet de achtergrond veranderen naar iets anders dan wit.",
  "spritelabFeedbackCreateTwoSprites": "Je moet precies twee ontwerpen maken.",
  "spritelabFeedbackTwoSpritesWithCostumes": "Je twee ontwerpen hebben verschillende kleding nodig.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Je moet twee ontwerpen maken met verschillende kleding die een gedrag hebben.",
  "spritelabFeedbackClickSprite": "Zorg ervoor dat je op je ontwerp klikt nadat je op 'Run' hebt gedrukt.",
  "spritelabFeedbackUseSpinningBehavior": "Je ontwerp moet beginnen met tollen. Probeer zijn gedrag aan te passen.",
  "spritelabFeedbackPinkAlienBehavior": "Je roze alien ontwerp heeft geen gedrag gestart.",
  "spritelabFeedbackCreateThreeAliens": "Je moet een blauwe alien, een roze alien en een gele alien maken.",
  "spritelabFeedbackAliensNotInLine": "Je drie alien ontwerpen moeten gerangschikt zijn in een horizontale lijn (binnen 50 pixels).",
  "spritelabFeedbackYellowAlienBehavior": "De gele alien heeft geen gedrag gestart.",
  "spritelabFeedbackNoAlienColor": "Tenminste één van je aliens veranderde niet van kleur.",
  "spritelabFeedbackNeedAlienStopBehavior": "Je alien ontwerpen moeten stoppen met hun gedrag.",
  "spritelabFeedbackBlueAlienBehavior": "Je blauwe alien moet een nieuw gedrag starten.",
  "spritelabFeedbackUseCostume": "Je moet tenminste één kledingstuk gebruiken.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Je moet drie ontwerpen met verschillende kleding maken.",
  "spritelabFeedbackMoveUpNotDown": "Je ontwerp moet naar boven bewegen (Noord) in plaats van naar beneden (Zuid).",
  "spritelabFeedbackRobotFasterThanRover": "De robot bereikte de rechterkant van het scherm voor de rover.",
  "spritelabFeedbackDifferentStarRotation": "Ontwerpen met beide ster kledingstukken moeten evenveel draaien.",
  "spritelabFeedbackAstronautMoveToCorner": "Het astronaut ontwerp moet naar één van de vier hoeken bewegen."
}