{
  "errorLoadingAnimation": "Parece que estamos a ter problemas em carregar a tua animação \"{animationName}\". Certifica-te que tens uma boa ligação à internet e tenta recarregar a página. Se o problema persistir, é possível que esta animação esteja avariada. Nesse caso, terás que continuar removendo a animação.",
  "reinfFeedbackMsg": "Terminaste! Clica em 'Continuar' para avançar para o próximo nível.",
  "shareGame": "Partilha o teu jogo:",
  "spritelabFeedbackCreateFishWithBehavior": "Precisas de criar pelo menos um sprite dum peixe e dar-lhe um comportamento.",
  "spritelabFeedbackMoveFishLeftRight": "O teu sprite dum peixe precisa de ser movido para a esquerda ou para a direita. Tenta mudar o seu comportamento.",
  "spritelabFeedbackChangeBackgroundColor": "Necessitas de mudar o fundo para algo que não seja branco.",
  "spritelabFeedbackCreateTwoSprites": "Precisas de criar exatamente dois sprites.",
  "spritelabFeedbackTwoSpritesWithCostumes": "Os teus dois sprites precisam de vestuários diferentes.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Precisas de criar dois sprites com vestuários diferentes e que cada um tem um comportamento. ",
  "spritelabFeedbackClickSprite": "Certifica-te que clicas no teu sprite depois de pressionares 'Correr'",
  "spritelabFeedbackUseSpinningBehavior": "O teu sprite precisa de começar a girar. Tenta mudar o seu comportamento.",
  "spritelabFeedbackPinkAlienBehavior": "O teu alienígena cor-de-rosa não começou um comportamento.",
  "spritelabFeedbackCreateThreeAliens": "Precisas de criar um alienígena azul, um alienígena cor-de-rosa e um alienígena amarelo. ",
  "spritelabFeedbackAliensNotInLine": "Os teus três sprites alienígenas precisam de ser organizados numa linha horizontal (dentro de 50 píxeis). ",
  "spritelabFeedbackYellowAlienBehavior": "O alienígena amarelo não começou com seu comportamento.",
  "spritelabFeedbackNoAlienColor": "Pelo menos um dos teus alienígenas não mudou de cor.",
  "spritelabFeedbackNeedAlienStopBehavior": "Os teus alienígenas precisam de parar todos os seus comportamentos.",
  "spritelabFeedbackBlueAlienBehavior": "O teu alienígena azul precisa de começar um novo comportamento. ",
  "spritelabFeedbackUseCostume": "Precisas de usar pelo menos um vestuário.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Precisas de criar três sprites com diferentes vestuários.",
  "spritelabFeedbackMoveUpNotDown": "Os teus sprites precisam de se mover para cima (norte) em vez de para baixo (sul). ",
  "spritelabFeedbackRobotFasterThanRover": "O robot chegou ao lado direito do ecrã antes do veículo.",
  "spritelabFeedbackDifferentStarRotation": "Sprites com vestuário de fada precisam de rodar o mesmo. ",
  "spritelabFeedbackAstronautMoveToCorner": "O sprite do astronauta precisa de se mover para um dos quatro cantos."
}