{
  "addAComment": "Aggiungi un commento",
  "authorLabel": "autore",
  "allFilesCompile": "Tutti i File Compilati!",
  "backpackFileNameConflictWarning": "Il salvataggio sovrascriverà un file esistente nel tuo zaino",
  "backpackLabel": "Zaino",
  "backpackListLoadError": "Si è verificato un errore caricando il tuo zaino. Riprova.",
  "backpackListLoadErrorMessageCommitDialog": "Prova a chiudere e riaprire questa finestra.",
  "backpackErrorTitle": "Si è verificato un errore",
  "backpackSaveErrorMessage": "Sei pregato di riprovare",
  "cancel": "Annulla",
  "clearConsole": "Cancella Console",
  "classNotFound": "Errore: uno o più dei tuoi file Java mancano della definizione di una classe.",
  "commentUpdateError": "Si è verificato un errore elaborando la tua richiesta, sei pregato di riprovare.",
  "commit": "Commit",
  "commitAndSave": "Commit e Salva",
  "commitCode": "Commit Codice",
  "commitNotes": "Commit Note",
  "commitNotesPlaceholder": "Inserisci le note su questo commit qui...",
  "compilationSuccess": "Compilazione riuscita.",
  "compileFailed": "Compilazione Fallita.",
  "compilerError": "Impossibile compilare il tuo programma. Cerca dei bug nel tuo programma e riprova.",
  "compiling": "Compilando...",
  "console": "Console",
  "delete": "Elimina",
  "deleteFileConfirmation": "Sei sicuro di voler eliminare {filename}?",
  "duplicateProjectFilenameError": "Il nome del file {filename} è già in uso in questo progetto. Sei pregato di scegliere un nome differente",
  "duplicateSupportFilenameError": "Il nome del file {filename} è già in uso nel codice di supporto di questo livello. Sei pregato di scegliere un nome differente",
  "disabledPeerReviewMessage": "Consenti la revisione in pari per consentire ad altri studenti nel tuo gruppo di lasciare commenti sul tuo progetto.",
  "editor": "Editor",
  "emptyBackpackMessage": "I file salvati al tuo zaino compariranno qui.",
  "enablePeerReview": "Consenti la Revisione in Pari",
  "errorJavabuilderConnectionGeneral": "Abbiamo riscontrato un errore connettendoci al nostro server. Riprova.",
  "errorJavabuilderConnectionNotAuthorized": "Non sei autorizzato ad accedere a Javalab. Devi accedere o unirti a una sezione?",
  "errorLoadingClassmates": "Si è verificato un errore caricando l'elenco dei tuoi compagni di classe. Sei pregato di riprovare.",
  "errorMediaImageLoadError": "Si è verificato un errore caricando l'immagine.",
  "errorNeighborhoodInvalidGrid": "Si è verificato un errore caricando il livello del quartiere. Sei pregato di contattarci a support@code.org e di assicurarti di includere l'URL a questa pagina nel tuo messaggio.",
  "errorNeighborhoodInvalidDirection": "La direzione fornita non è riconosciuta. Le direzioni supportate sono \"nord\", \"sud\", \"est\" e \"ovest\".",
  "errorNeighborhoodGetSquareFailed": "La piazza specificata non è sulla griglia.",
  "errorNeighborhoodInvalidColor": "Il nome del colore fornito non è riconosciuto. Fai riferimento alla documentazione per vedere quali nomi dei colori sono supportati.",
  "errorNeighborhoodInvalidLocation": "La posizione specificata non è sulla griglia.",
  "errorNeighborhoodInvalidMove": "Il verniciatore ha provato a spostarsi dalla griglia o in un ostacolo.",
  "errorNeighborhoodInvalidPaintLocation": "Il verniciatore ha provato a dipingere fuori dalla griglia o su un ostacolo.",
  "errorPeerReviewDisabled": "La Revisione in Pari è stata disabilitata su questo progetto.",
  "errorPlaygroundInvalidMessage": "Non puoi effettuare alcuna modifica alla scheda dopo aver chiamato end().",
  "errorPlaygroundRunning": "Il metodo start() può esser chiamato solo una volta per esecuzione del programma.",
  "errorPlaygroundNotRunning": "Il metodo end() non può esser richiamato prima di start().",
  "errorProjectNotEditedYet": "Questo progetto non è ancora stato modificato. Il codice dovrà esser modificato prima di poter esser eseguito.",
  "errorSoundInvalidAudioFileFormat": "Il file sonoro fornito è in un formato non supportato. Solo WAV è supportato al momento.",
  "errorSoundMissingAudioData": "Il file sonoro fornito non aveva alcun dato sonoro.",
  "errorTheaterDuplicatePlayCommand": "Il metodo play() è chiamabile solo una volta per esecuzione del programma.",
  "errorTheaterInvalidShape": "Una forma deve contenere un numero pari di valori per rappresentare le coordinate (x,y) e deve includere almeno 4 valori.",
  "feedbackBeginning": "Questo è l'inizio del feedback per il tuo progetto.",
  "feedbackBeginningPeer": "Questo è l'inizio del feedback per il progetto di {peerName}.",
  "illegalMethodAccess": "Hai provato ad accedere a un metodo bloccato dalla nostra politica sulla sicurezza.\n{cause}",
  "fileImportError": "Uno o più nomi del file sono riservati da Java Lab e non sono importabili in questo progetto. I file non importabili:",
  "fileImportWarning": "Hai uno o più nomi di file duplicati tra questo progetto e i file del tuo zaino selezionato. I nomi del file duplicato sono:",
  "fileImportWarningConfirm": "Desideri sostituire questi file con i file dal tuo zaino?",
  "fileLoadError": "Si è verificato un errore caricando il file {filename}.",
  "fileNotFoundException": "Il tuo codice ha generato una FileNotFoundException durante l'esecuzione per il nome del file: {causeMessage}",
  "genericSaveErrorTitle": "Errore di salvataggio",
  "genericErrorMessage": "Sei pregato di riprovare",
  "import": "Importa",
  "includeFiles": "Includi File",
  "internalCompilerException": "Ops. Abbiamo riscontrato un errore dal nostro lato. Prova a rieseguirlo. Se questo errore persiste, contattaci a support@code.org. Assicurati di includere l'ID della connessione {connectionId} nel tuo messaggio.",
  "internalException": "Ops. Abbiamo riscontrato un errore dal nostro lato. Prova a rieseguirlo. Se questo errore persiste, contattaci a support@code.org. Assicurati di includere l'ID della connessione {connectionId} nel tuo messaggio.",
  "internalRuntimeException": "Ops. Abbiamo riscontrato un errore dal nostro lato eseguendo il tuo programma. Prova a rieseguirlo. Se questo errore persiste, contattaci a support@code.org. Assicurati di includere l'ID della connessione {connectionId} nel tuo messaggio.",
  "invalidJavaFilename": "Nome del file non valido. I nomi dei file Java non possono contenere spazi.",
  "invalidJavaFilenameFormat": "Nome del file non valido. Il nome di un file Java dev'essere nel formato 'ClassName.java'.",
  "generatingProgress": "{progressTime} secondi generati...",
  "javaExtensionMissing": "Nome del file non valido. I nomi dei file devono terminare per '.java'.",
  "javabuilderInvalidClassError": "{causeMessage} non è supportato da Java Lab.",
  "javabuilderJavaFilenameError": "File Java: {causeMessage} ha un nome del file non valido. I nomi di file Java non possono contenere spazi o caratteri speciali.",
  "javabuilderMissingFilenameError": "Uno o più file del tuo progetto mancano dei nomi del file.",
  "markComplete": "Segna come completato",
  "markIncomplete": "Segna come incompleto",
  "missingFilenameError": "Il nome del file non può essere vuoto.",
  "newFile": "Nuovo File",
  "noMainMethod": "Errore: il tuo programma non contiene un metodo principale.",
  "noCodeReviewComments": "I commenti dal tuo insegnante compariranno qui.",
  "noCodeReviewUntilStudentEditsCode": "Non puoi lasciare commenti finché il proprietario del progetto non ha modificato il codice predefinito e cliccato il pulsante \"Esegui\"",
  "noOtherReviews": "Nessun altro progetto è ancora pronto per la revisione.",
  "onlyVisibleToYou": "visibile solo a te",
  "programCompleted": "Programma completato.",
  "refresh": "Aggiorna",
  "rename": "Rinomina",
  "replace": "Sostituisci",
  "reviewClassmateProject": "Revisiona il progetto di un compagno...",
  "returnToMyProject": "Torna al mio progetto",
  "running": "Eseguendo...",
  "runtimeError": "Il tuo codice ha riscontrato un'eccezione durante la sua esecuzione.\n{cause}",
  "saveToBackpack": "Salva allo Zaino",
  "sendingVideo": "Invio video. Lunghezza totale: {totalTime} secondi.",
  "startingPainter": "Avviando il verniciatore.",
  "timeoutWarning": "警告: あなたのプロジェクトはあと15秒で実行が停止します。",
  "timeout": "あなたのプロジェクトは停止しました。",
  "twoMainMethods": "Errore: Il tuo codice può avere solo un metodo principale. Abbiamo trovato almeno due classi con metodi principali.",
  "saving": "Salvataggio in corso...",
  "teacherLabel": "insegnante",
  "togglePeerReviewError": "Errore abilitando/disabilitando la revisione in pari, sei pregato di riprovare.",
  "unknownError": "Ops. Abbiamo riscontrato un errore dal nostro lato. Prova a rieseguire il tuo programma. Se l'errore persiste, contattaci a support@code.org. Assicurati di includere l'ID della connessione {connectionId} nel tuo messaggio.\n{type}",
  "yourPeer": "il tuo collega"
}
