{
  "errorLoadingAnimation": "Sembra ci siano dei problemi a caricare l'animazione \"{animationName}\". Assicurati di avere una buona connessione ad Internet e prova a ricaricare la pagina. Se il problema persiste, è possibile che questa animazione sia guasta. In questo caso, dovresti rimuovere l'animazione.",
  "reinfFeedbackMsg": "Hai finito! Clicca su \"Continua\" per passare all'esercizio successivo.",
  "shareGame": "Condividi il tuo gioco:",
  "spritelabFeedbackCreateFishWithBehavior": "Devi creare almeno un personaggio pesce e attribuirgli un comportamento.",
  "spritelabFeedbackMoveFishLeftRight": "Il tuo pesce deve muoversi a sinistra e a destra. Prova a cambiare il suo comportamento.",
  "spritelabFeedbackChangeBackgroundColor": "Devi impostare uno sfondo diverso da quello bianco.",
  "spritelabFeedbackCreateTwoSprites": "Devi creare esattamente due personaggi.",
  "spritelabFeedbackTwoSpritesWithCostumes": "I tuoi due personaggi devono avere due costumi diversi.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Devi creare due personaggi con costumi diversi ed entrambi dotati di un comportamento.",
  "spritelabFeedbackClickSprite": "Clicca sul tuo personaggio dopo aver premuto il pulsante \"Esegui\".",
  "spritelabFeedbackUseSpinningBehavior": "Il tuo personaggio deve iniziare a girare (_spining_). Prova a cambiare il suo comportamento.",
  "spritelabFeedbackPinkAlienBehavior": "Il tuo alieno rosa non ha iniziato alcun comportamento.",
  "spritelabFeedbackCreateThreeAliens": "Devi creare un alieno blu, uno rosa ed uno giallo.",
  "spritelabFeedbackAliensNotInLine": "I tuoi tre personaggi alieni devono essere posizionati lungo una linea orizzontale (entro 50 pixel).",
  "spritelabFeedbackYellowAlienBehavior": "L'alieno giallo non ha iniziato il suo comportamento.",
  "spritelabFeedbackNoAlienColor": "Almeno uno dei tuoi alieni non ha cambiato colore.",
  "spritelabFeedbackNeedAlienStopBehavior": "Tutti i tuoi personaggi alieni devono interrompe i loro comportamenti.",
  "spritelabFeedbackBlueAlienBehavior": "Il tuo alieno blu deve iniziare un nuovo comportamento.",
  "spritelabFeedbackUseCostume": "Devi usare almeno un costume.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Devi creare tre personaggi con costumi diversi.",
  "spritelabFeedbackMoveUpNotDown": "Il tuo personaggio deve muoversi verso l'alto (nord) invece che verso il basso (sud).",
  "spritelabFeedbackRobotFasterThanRover": "Il robot ha raggiunto la parte destra dello schermo prima del rover.",
  "spritelabFeedbackDifferentStarRotation": "Entrambi i personaggi con costumi a stella devono ruotare della stessa quantità.",
  "spritelabFeedbackAstronautMoveToCorner": "Il personaggio astronauta deve muoversi verso uno dei quattro angoli."
}
