{
  "key": "html-tags",
  "course_version_key": "2022",
  "course_offering_key": "csd",
  "parent_reference_guide_key": "html",
  "display_name": "HTML Tags",
  "content": "## What is HTML?\n\nIn order to display a web page a computer needs to know a lot more than just what words or images should be on the screen. It needs to know where to place the content, what size to make it, what fonts and colors to use, and lots of other information that turns ordinary text and images into a full web page.\n\nTo solve this problem computer scientists have created languages that communicate this extra information. **HTML**, short for **H**yper**t**ext **M**arkup **L**anguage, is one language that helps solve this problem. Using a system of tags HTML lets a programmer indicate the purpose of different parts of a web page. This lets the computer know how it should display these different elements.\n\n## HTML Tags\n\nHTML indicates the purpose of different parts of a web page by surrounding them with pairs of opening and closing tags, like in the example below.\n\n<img alt=\"HTML element\" src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/html_element.png\" class=\"center\" style=\"max-width: 400px; margin: 20px auto;\">\n\n| HTML Tag | Tag Name | What it does |\n| -------- |----------------| ------------------ |\n| `<p>` | Opening Paragraph Tag | Start of a paragraph. Paragraphs are just blocks of text in your web page. |\n| `</p>` | Closing Paragraph Tag | Marks the end of a paragraph. An end tag is always just the opening tag with a ` / ` at the beginning. |\n\n<br>\n\n## Default Tags\n\nAll HTML pages include a common set of tags. They're so common, in fact, that all Web Lab projects will start with them added already.\n\n| HTML Tag | What it does |\n| -------- | ------------------ |\n|<img src=\"https://cdo-curriculum.s3.amazonaws.com/media/uploads/Screenshot-2017-04-26-at-2.19.39-PM.png\">|This starter code is included in each Web Lab project. The different tags are explained below.|\n|`<!DOCTYPE html>`| Tells the computer that this is a document written in HTML |\n|`<html>`| Indicates the beginning of your code written in HTML |\n|`<head>`| Contains information (sometimes called \"metadata\") about your web page |\n|`<body>`| Contains all the main contents of your web page |\n\n<br>\n\n\n## More HTML Tags\n\n| HTML Tag | Tag Name | What it does |\n| -------- |----------------| ------------------ |\n| `<br>` | Line break. | This moves your text down to the next line, similar to hitting \"Enter\" on your keyboard. |\n| `<hr>` | Horizontal rule. | Inserts a horizontal rule or line in an HTML page to divide or separate document sections. |\n_Note: The tags listed in the above table do **not** require a closing tag as they are both \"empty\" elements that do not necessarily give format to the text itself._\n<br>\n## FAQ\n\n1) **What is an HTML element?**\n   - An HTML element is a piece of a website that is marked by a start tag and sometimes closed with an end tag. The element also includes the content inside the tags. For example:\n```\n<img src=\"https://images.code.org/fb4df62aa4d879f7021c567be2e28eea-image-1481135855001.png\" style=\"width:500px\">\n```\n2) **What does `head` do?**\n   - The `<head>` `</head>` tags contain information, called metadata, about your web page. Metadata is not displayed on your web page and content you want on your actual page should not go here.\n3) **What does `body` do?**\n   - Between the `<body>` `</body>` tags is where you want to be the content of your web page. It should contain the body of the web page, including all text, media, links, etc. that you want people to see on your page.\n\n\n<br>\n<br>\n\n## W3 Schools\n\nThere are lots of great resources to learn about HTML tags online, but one of the most commonly used is [w3schools.com](http://w3schools.com). This website includes lots of useful information about how tags work as well as links to new tags you might want to read about. In Map Levels in this unit you'll always find a link to the tags on W3 Schools and you should explore other tags if you're interested in learning more.\n\n**W3 Schools Links**\n\n* [&lt;p&gt;](https://www.w3schools.com/html/html_paragraphs.asp)\n* [&lt;!DOCTYPE&gt;](https://www.w3schools.com/tags/tag_doctype.asp)\n* [&lt;html&gt;](https://www.w3schools.com/tags/tag_html.asp)\n* [&lt;head&gt;](https://www.w3schools.com/tags/tag_head.asp)\n* [&lt;body&gt;](https://www.w3schools.com/tags/tag_body.asp)\n",
  "position": 2
}