{
  "addAComment": "Ajoutez un commentaire",
  "authorLabel": "auteur",
  "allFilesCompile": "Compilation de tous les fichiers",
  "backpackFileNameConflictWarning": "La sauvegarde remplacera un fichier existant dans votre sac à dos.",
  "backpackLabel": "Sac à dos",
  "backpackListLoadError": "Une erreur s’est produite lors du chargement de votre sac à dos. Veuillez réessayer.",
  "backpackListLoadErrorMessageCommitDialog": "Essayez de fermer et de rouvrir cette boîte de dialogue.",
  "backpackErrorTitle": "Une erreur s’est produite",
  "backpackSaveErrorMessage": "Veuillez essayer à nouveau.",
  "cancel": "Annuler",
  "clearConsole": "Vider la console",
  "classNotFound": "Erreur : il manque une définition de classe dans un ou plusieurs de vos fichiers Java.",
  "commentUpdateError": "Une erreur s'est produite lors du traitement de votre demande, veuillez réessayer à nouveau.",
  "commit": "Confirmer",
  "commitAndSave": "Confirmer et sauvegarder ",
  "commitCode": "Code de confirmation",
  "commitNotes": "Confirmer les notes",
  "commitNotesPlaceholder": "Entrez ici vos commentaires relatifs à cette confirmation...",
  "compilationSuccess": "Compilation effectuée avec succès.",
  "compileFailed": "Compilation échouée",
  "compilerError": "Nous n'avons pas pu compiler votre programme. Cherchez des erreurs dans votre programme et réessayez.",
  "compiling": "En cours de compilation...",
  "console": "Console",
  "delete": "Supprimer",
  "deleteFileConfirmation": "Êtes-vous sûr de vouloir supprimer {filename} ?",
  "duplicateProjectFilenameError": "Ce nom de fichier {nom du fichier} est déjà utilisé dans ce projet. Veuillez choisir un autre nom\n",
  "duplicateSupportFilenameError": "Ce nom de fichier {nom du fichier} est déjà utilisé dans le code d'assistance de ce niveau. Veuillez choisir un autre nom\n",
  "disabledPeerReviewMessage": "Activez l'évaluation par les pairs pour permettre aux autres élèves de votre groupe de laisser des commentaires sur votre projet.",
  "editor": "Éditeur",
  "emptyBackpackMessage": "Les fichiers enregistrés dans votre sac à dos apparaîtront ici.",
  "enablePeerReview": "Activer l'évaluation par les pairs",
  "errorJavabuilderConnectionGeneral": "Nous avons rencontré une erreur de connexion à notre serveur. Veuillez réessayer.",
  "errorJavabuilderConnectionNotAuthorized": "Vous n'êtes pas autorisé à accéder à Javalab. Avez-vous besoin de vous connecter ou de rejoindre une section ?",
  "errorLoadingClassmates": "Une erreur s'est produite lors du chargement de la liste de vos camarades de classe. Veuillez réessayer.",
  "errorMediaImageLoadError": "Une erreur s'est produite lors du chargement de l'image.",
  "errorNeighborhoodInvalidGrid": "Une erreur s'est produite lors du chargement du niveau de voisinage. Veuillez nous contacter à l'adresse support@code.org, et veillez à mentionner l'URL de cette page dans votre courrier.",
  "errorNeighborhoodInvalidDirection": "La direction qu vous avez renseignée n'est pas reconnue. Les directions prises en compte sont : \"Nord\", \"Sud\", \"Est\" et \"Ouest\".\n",
  "errorNeighborhoodGetSquareFailed": "Le carré spécifié n'est pas sur la grille.",
  "errorNeighborhoodInvalidColor": "Le nom de couleur que vous avez saisi n'est pas reconnu. Reportez-vous à la documentation pour savoir les noms de couleur qui sont pris en charge.",
  "errorNeighborhoodInvalidLocation": "L'emplacement spécifié n'est pas sur la grille.",
  "errorNeighborhoodInvalidMove": "Le peintre est sorti de la grille ou rencontre un obstacle.",
  "errorNeighborhoodInvalidPaintLocation": "Le peintre essaie de peindre en dehors de la grille ou rencontre un obstacle.",
  "errorPeerReviewDisabled": "L'évaluation par les pairs a été désactivée pour ce projet.",
  "errorPlaygroundInvalidMessage": "Vous ne pouvez pas apporter de modifications au tableau après avoir utilisé la fonction end().",
  "errorPlaygroundRunning": "La méthode start() ne peut être utilisée qu'une seule fois par exécution du programme.",
  "errorPlaygroundNotRunning": "La méthode end() ne peut pas être utilisée avant la méthode start().",
  "errorProjectNotEditedYet": "Ce projet n'a pas encore été modifié. Vous devrez modifier le code avant de pouvoir l'exécuter.",
  "errorSoundInvalidAudioFileFormat": "Le format du fichier audio fourni n'est pas pris en charge. Seul le format WAV est pris en charge pour le moment.",
  "errorSoundMissingAudioData": "Le fichier audio fourni ne contient pas de données audio.",
  "errorTheaterDuplicatePlayCommand": "La méthode play() ne peut être utilisée qu'une seule fois par exécution du programme.",
  "errorTheaterInvalidShape": "La configuration doit contenir des valeurs en nombre pair pour représenter les coordonnées (x,y), et doit comprendre au moins 4 valeurs.",
  "feedbackBeginning": "Les commentaires sur votre projet vont commencer.",
  "feedbackBeginningPeer": "Les commentaires sur le projet de {nomdupair} ont commencé.",
  "illegalMethodAccess": "Vous avez essayé d'accéder à une méthode qui est bloquée en raison de notre politique de sécurité.\n{cause}",
  "fileImportError": "Un ou plusieurs noms de fichiers sont protégés par Java Lab et ne peuvent pas être importés dans ce projet. Il est impossible d'importer les fichiers :",
  "fileImportWarning": "Il y a un ou plusieurs noms de fichiers dupliqués dans ce projet ou dans les fichiers du sac à dos que vous avez sélectionnés. Les noms de fichiers dupliqués sont :",
  "fileImportWarningConfirm": "Voulez-vous remplacer ces fichiers par ceux qui sont dans votre sac à dos ?",
  "fileLoadError": "Une erreur s'est produite lors du chargement du fichier {nom du fichier}.",
  "fileNotFoundException": "Votre code a généré une exception FileNotFoundException lors de l'exécution du nom de fichier : {causeMessage}.\n",
  "genericSaveErrorTitle": "Erreur de sauvegarde",
  "genericErrorMessage": "Veuillez essayer à nouveau.",
  "import": "Importer",
  "includeFiles": "Insérer des fichiers",
  "internalCompilerException": "Oups. Nous avons rencontré un problème lors de la compilation de votre programme. Essayez de le relancer. Si cette erreur persiste, contactez-nous à l'adresse support@code.org. Veillez à mentionner dans votre courrier l'identifiant de connexion {connectionId}.",
  "internalException": "Oups. Nous avons rencontré un problème de notre côté. Essayez à nouveau de lancer votre programme. Si cette erreur persiste, contactez-nous à l'adresse support@code.org. Veillez à mentionner dans votre courrier l'identifiant de connexion {connectionId}.\n",
  "internalRuntimeException": "Oups. Nous avons rencontré un problème lors de l'exécution de votre programme. Essayez de l'exécuter à nouveau. Si cette erreur persiste, contactez-nous à l'adresse support@code.org. Veillez à mentionner dans votre courrier l'identifiant de connexion {connectionId}.",
  "invalidJavaFilename": "Nom de fichier non valide. Les noms de fichiers Java ne peuvent pas contenir d'espaces.",
  "generatingResults": "Générer des résultats...",
  "javaExtensionMissing": "Nom de fichier non valide. Les noms de fichiers doivent se terminer par '.java'.",
  "javabuilderJavaFilenameError": "Le fichier Java : {causeMessage} porte un nom de fichier invalide. Les noms de fichiers Java ne peuvent pas contenir d'espaces ou de caractères spéciaux.",
  "javabuilderMissingFilenameError": "Il manque des noms de fichiers à certains de vos fichiers de projet.",
  "markComplete": "Marquer comme terminé",
  "markIncomplete": "Marquer comme inachevé",
  "missingFilenameError": "Vous devez saisir un nom pour le fichier.",
  "newFile": "Nouveau fichier",
  "noMainMethod": "Erreur : votre programme ne contient pas de méthode principale.",
  "noCodeReviewComments": "Les commentaires faits par votre professeur apparaîtront ici.",
  "noCodeReviewUntilStudentEditsCode": "Vous ne pouvez pas commenter tant que le propriétaire du projet n'a pas modifié le code par défaut et cliqué sur le bouton \"Exécuter\".",
  "noOtherReviews": "Aucun autre projet n'est encore prêt pour être évalué.",
  "onlyVisibleToYou": "vous êtes le seul à voir les commentaires faits par les enseignants",
  "programCompleted": "Programme terminé.",
  "refresh": "Actualiser",
  "replace": "Remplacer",
  "reviewClassmateProject": "Évaluer le projet d'un camarade de classe...",
  "returnToMyProject": "Revenir à mon projet",
  "running": "En cours d'exécution...",
  "runtimeError": "Une erreur s'est produite lors de l'exécution de votre code.{cause}",
  "saveToBackpack": "Sauvegarder dans le sac à dos",
  "startingPainter": "Commencer la peinture.",
  "twoMainMethods": "Erreur : Votre code ne peut avoir qu'une seule méthode principale. Nous avons trouvé au moins deux classes avec des méthodes principales.",
  "saving": "Enregistrement en cours...",
  "teacherLabel": "Professeur",
  "togglePeerReviewError": "Erreur d'activation/désactivation de l'évaluation par les pairs, veuillez réessayer.",
  "unknownError": "Oups. Une erreur s'est produite de notre côté. Essayez à nouveau d'exécuter votre programme. Si cette erreur persiste, contactez-nous à l'adresse support@code.org. Veillez à mentionner dans votre message l'ID de connexion {connectionId}.\n{type}",
  "yourPeer": "vos pairs"
}
