{
  "clicked": "cliqué",
  "clickedSprite": "lutin cliqué",
  "subject": "sujet",
  "subjectSprite": "lutin sujet",
  "object": "objet",
  "objectSprite": "lutin objet",
  "errorLoadingAnimation": "Il semble que nous ayons des difficultés à charger votre animation \"{animationName}\". Assurez-vous d'avoir une bonne connexion Internet et essayez de recharger la page. Si ce problème persiste, il est possible que cette animation soit interrompue. Dans ce cas, vous devrez peut-être continuer en supprimant l'animation.",
  "reinfFeedbackMsg": "Vous avez fini! Cliquez sur \"Continuer\" pour passer au niveau suivant.",
  "shareGame": "Partage ton jeu :",
  "spritelabFeedbackCreateFishWithBehavior": "Vous devez créer au moins un sprite poisson et lui donner un comportement.",
  "spritelabFeedbackMoveFishLeftRight": "Votre sprite poisson doit bouger à gauche ou à droite. Essayez de changer son comportement.",
  "spritelabFeedbackChangeBackgroundColor": "Vous devez modifier l'arrière-plan en un élément autre que le blanc.",
  "spritelabFeedbackCreateTwoSprites": "Vous devez créer exactement deux sprites.",
  "spritelabFeedbackTwoSpritesWithCostumes": "Vos deux sprites ont besoin de costumes différents.",
  "spritelabFeedbackTwoSpritesWithCostumesAndBehaviors": "Vous devez créer deux sprites avec des costumes différents qui ont chacun un comportement.",
  "spritelabFeedbackClickSprite": "Assurez-vous de cliquer sur votre sprite après avoir appuyé sur \"courir\"",
  "spritelabFeedbackUseSpinningBehavior": "Ton lutin a besoin de commencer à tourner. Essaie de changer son comportement.",
  "spritelabFeedbackPinkAlienBehavior": "Ton lutin extraterrestre n'a pas commencé un comportement.",
  "spritelabFeedbackCreateThreeAliens": "Tu dois créer un extraterrestre bleu, un rose et un jaune.",
  "spritelabFeedbackAliensNotInLine": "Tes 3 lutins extraterrestres doivent être alignés sur une ligne horizontale (sur 50 pixels).",
  "spritelabFeedbackYellowAlienBehavior": "L'extraterrestre jaune n'as pas commencé son comportement.",
  "spritelabFeedbackNoAlienColor": "Au moins un de tes extraterrestres n'a pas changé de couleur.",
  "spritelabFeedbackNeedAlienStopBehavior": "Tes lutins extraterrestres doivent arrêter leurs comportements.",
  "spritelabFeedbackBlueAlienBehavior": "Ton extraterrestre bleu doit commencer un nouveau comportement.",
  "spritelabFeedbackUseCostume": "Tu dois utiliser au moins un costume.",
  "spritelabFeedbackThreeSpritesWithCostumes": "Tu dois créer 3 lutins avec des costumes différents.",
  "spritelabFeedbackMoveUpNotDown": "Ton lutin doit monter (nord) au lieu de descendre (sud).",
  "spritelabFeedbackRobotFasterThanRover": "Le robot a atteint le côté droit de l'écran avant l'engin.",
  "spritelabFeedbackDifferentStarRotation": "Les lutins avec les 2 costumes d'étoiles doivent tourner autant l'un que l'autre.",
  "spritelabFeedbackAstronautMoveToCorner": "Le lutin astronaute doit bouger vers l'un des quatres coins."
}
