{
    "fishvtrash-training-init1": "La basura arrojada al agua afecta la vida marina. En esta actividad, programarás o entrenarás a IA (inteligencia artificial) para identificar peces o basura. ¡Limpiemos el océano! Haz clic en cualquier lugar de la pantalla para continuar.",
    "fishvtrash-training-init2": "Conozcamos a A.I. (siglas de Inteligencia Artificial en Inglés).",
    "fishvtrash-training-init3": "A.I. no sabe si un objeto es un pez o basura, pero puede procesar imágenes e identificar patrones.",
    "fishvtrash-training-init4": "Para programar a A.I., usa los botones para etiquetar una imagen como \"Pez\" o \"No pez\". El entrenamiento que brindes le enseñará a A.I. a reconocer patrones por sí misma. ¡Empecemos!",
    "fishvtrash-training-pause1": "Más de siete mil millones de libras de plástico ingresan al océano cada año.",
    "fishvtrash-training-pause2": "Estás programando o entrenando a IA con cada clic. Sigue adelante.",
    "fishvtrash-training-pause3": "El 80% de la contaminación del océano proviene de los desechos terrestres y se estima que cuesta 13 mil millones de dólares por año.",
    "fishvtrash-training-pause4": "IA aprende de tus elecciones. Si tomas decisiones \"incorrectas\", IA repetirá tus errores. Sigue entrenando.",
    "fishvtrash-training-pause5": "¡Buen trabajo! Cuantos más datos proporciones a IA, más aprenderá. Sigue entrenando a IA o continúa cuando estés listo.",
    "fishvtrash-predicting-init1": "Ahora veamos si IA sabe cómo se ve un \"pez\".",
    "fishvtrash-predicting-init2": "IA analizará un conjunto aleatorio de objetos y los etiquetará según su entrenamiento.",
    "fishvtrash-predicting-init3": "¡Adelante!",
    "fishvtrash-pond-init1": "Según tu entrenamiento, aquí hay algunos objetos que IA identificó como \"pez\". ¿Cómo lo hizo?",
    "fishvtrash-pond-recall": "Haz clic aquí para cambiar entre los objetos identificados como \"pez\" y \"no pez\".",
    "fishvtrash-pond-init2": "Puedes seguir entrenando a IA...",
    "fishvtrash-pond-init3": "...o Continuar.",
    "creaturesvtrashdemo-predicting-init1": "Hasta ahora, entrenamos a IA para identificar objetos como \"pez\" o \"no pez\".",
    "creaturesvtrashdemo-predicting-init2": "¿Qué pasa si estos datos de entrenamiento se usaron para decidir qué pertenecía al agua?",
    "creaturesvtrashdemo-predicting-init3": "¿Qué pasaría con otras criaturas marinas? ¿Nuestro enfoque de entrenamiento tiene consecuencias no deseadas?",
    "creaturesvtrashdemo-predicting-init4": "Veamos.",
    "creaturesvtrashdemo-predicting-pause1": "¿Notaste que IA identificó algunas criaturas marinas como \"no peces\"?",
    "creaturesvtrashdemo-predicting-pause2": "Si bien estas criaturas marinas no son peces, sí pertenecen al agua.",
    "creaturesvtrashdemo-predicting-pause3": "IA solo aprende lo que le enseñamos.",
    "creaturesvtrashdemo-predicting-pause4": "Volvamos a entrenar a IA.",
    "creaturesvtrash-training-init1": "Enseñemos a IA para que aprenda qué objetos deberían estar en el agua.",
    "creaturesvtrash-training-init2": "En el océano, los desechos plásticos pueden dañar peces, aves marinas y mamíferos marinos. La protección de las aves marinas y la vida marina es una de las muchas razones para mantener limpios los océanos.",
    "creaturesvtrash-training-init3": "Cuantos más datos de entrenamiento proporciones, más aprende IA. Sigue entrenando.",
    "creaturesvtrash-training-init4": "La contaminación del mar con plásticos ha afectado al menos a 267 especies en todo el mundo, incluido el 86% de las especies de tortugas marinas.",
    "creaturesvtrash-training-init5": "Sigue entrenando para enseñar a IA lo que pertenece al agua.",
    "creaturesvtrash-training-init6": "¡Buen trabajo! Cuantos más datos proporciones a IA, mejor lo hará. Sigue entrenando a IA o continúa cuando estés listo.",
    "creaturesvtrash-predicting-init1": "¿Crees que IA ahora hará un mejor trabajo al identificar lo que debería estar en el agua? Veamos.",
    "creaturesvtrash-pond-init1": "Según tu entrenamiento, aquí hay algunos objetos que IA identificó como \"pertenece al agua\". ¿Cómo lo hizo?",
    "fishshort-words-init1": "La inteligencia artificial y el aprendizaje automático se pueden utilizar para enseñar nuevos patrones a una computadora.",
    "fishshort-words-init2": "Enseñemos a IA una nueva palabra mostrándole ejemplos de ese tipo de pez.",
    "fishshort-words-training-pause1": "¿Crees que IA tiene suficientes datos de entrenamiento? Puedes hacer clic en Continuar para averiguarlo.",
    "fishshort-words-training-pause2": "¡Buen trabajo! Sigue entrenando a IA o continúa cuando estés listo.",
    "fishshort-predicting-init1": "Con tus datos de entrenamiento, has programado a IA para reconocer el pez “{word}”.",
    "fishshort-predicting-init2": "Veamos cómo IA identifica un pez “{word}”.",
    "fishshort-pond-init1": "Según tu entrenamiento, IA identificó {n, plural,one{este} other {estos}} peces como “{word}”. ¿Cómo lo hizo? Puedes entrenar más si quieres mejorar los resultados.",
    "fishshort-pond-init2": "Haz clic en el botón de información para ver qué aprendió IA.",
    "fishlong-words-init1": "Ahora veamos si IA puede aprender una palabra menos obvia.",
    "fishlong-words-init2": "Enseñemos a IA una palabra que dependa de tu opinión. Depende de ti elegir peces que coincidan con tu palabra.",
    "fishlong-training-pause1": "¿Está bien usar la inteligencia artificial para juzgar a un pez por su apariencia? Si bien la IA puede parecer justa y neutral, su análisis proviene del entrenamiento que le brindamos. ¿Qué sesgo involuntario podría causar esto?",
    "fishlong-training-pause2": "Más datos de entrenamiento ayudarán a IA a aprender tu palabra. Sigue entrenando.",
    "fishlong-training-pause3": "Cada elección que hagas puede ayudar a IA a aprender. Sigue entrenando.",
    "fishlong-training-pause4": "¿Crees que IA tiene suficientes datos de entrenamiento? IA funcionará mejor con muchos datos. Continúa cuando creas que IA está lista.",
    "fishlong-training-many": "Guau. ¡Esos son muchos peces!",
    "fishlong-predicting-init1": "Con tus datos de entrenamiento, has programado a IA para reconocer el pez “{word}”.",
    "fishlong-predicting-init2": "Veamos cómo IA identifica un pez “{word}”.",
    "fishlong-pond-init1": "Según tu entrenamiento, IA identificó {n, plural,one {este} other {estos}} peces como “{word}”. ¿Cómo lo hizo?",
    "fishlong-pond-init2": "Puedes entrenar más si quieres mejorar los resultados.",
    "fishlong-pond-init3": "O puedes enseñar a IA una nueva palabra eligiendo Nueva palabra.",
    "didYouKnow": "¿Lo sabías?",
    "continue": "Continuar",
    "areYouSure": "¿Está seguro?",
    "eraseWarning": "Si borras los datos de A.I., se eliminará para siempre el entrenamiento. ¿Es eso lo que quieres hacer?",
    "erase": "Borrar",
    "cancel": "Cancelar",
    "yes": "Sí",
    "no": "No",
    "notWord": "No {word}",
    "run": "Ejecutar",
    "mostImportantParts": "Estas fueron las partes más importantes del pez:",
    "clickIndividualFish": "Haz clic en el pez para ver su información.",
    "mostImportantPartsDescription": "Estas fueron las partes de pez más importantes por determinar si este pez fue \"*{word}*\" o \"**{notWord}**\".",
    "newWord": "Nueva palabra",
    "finish": "Terminar",
    "trainMore": "Entrenar más",
    "wordQuestionShort": "¿Qué tipo de pez quieres que detecte A.I.?",
    "wordQuestionLong": "Elige una nueva palabra para enseñar a A.I.",
    "isThisFish": "¿Este pez es {word}?",
    "isThisAFish": "¿Este es un pez?",
    "doesThisBelongInWater": "¿Esto pertenece al agua?",
    "fish": "Pez",
    "waterCreature": "Criatura del agua",
    "blue": "Azul",
    "green": "Verde",
    "red": "Rojo",
    "circular": "Circular",
    "rectangular": "Rectangular",
    "triangular": "Triangular",
    "angry": "Enojado",
    "awesome": "Increíble",
    "delicious": "Delicioso",
    "endangered": "En peligro de extinción",
    "fast": "Rápido",
    "fierce": "Feroz",
    "fun": "Divertido",
    "glitchy": "Débil",
    "happy": "Alegre",
    "hungry": "Hambriento",
    "playful": "Juguetón",
    "scary": "Miedoso",
    "silly": "Tonto",
    "spooky": "Escalofriante",
    "wild": "Salvaje",
    "dorsalFins": "aleta dorsal",
    "pectoralFinsFront": "aletas pectorales",
    "tails": "cola",
    "bodies": "cuerpo",
    "scales": "escamas",
    "eyes": "ojos",
    "mouths": "boca",
    "colors": "colores"
}
