{
  "addAComment": "Añade un comentario",
  "authorLabel": "autor",
  "allFilesCompile": "¡Todos los archivos se compilaron!",
  "backpackFileNameConflictWarning": "Al guardar se sobrescribirá un archivo existente en la mochila.",
  "backpackLabel": "Mochila",
  "backpackListLoadError": "Se ha producido un error al cargar tu mochila. Inténtalo de nuevo.",
  "backpackListLoadErrorMessageCommitDialog": "Intenta cerrar y volver a abrir este diálogo.",
  "backpackErrorTitle": "Ocurrió un error",
  "backpackSaveErrorMessage": "Vuelve a intentarlo",
  "cancel": "Cancelar",
  "clearConsole": "Borrar Consola",
  "classNotFound": "Error: uno o más de tus archivos Java no tienen una definición de clase.",
  "commentUpdateError": "Hubo un error al procesar tu solicitud. Vuelve a intentarlo.",
  "commit": "Enviar",
  "commitAndSave": "Enviar y guardar",
  "commitCode": "Código de confirmación",
  "commitNotes": "Notas de envío",
  "commitNotesPlaceholder": "Ingresa aquí las notas sobre este envío...",
  "compilationSuccess": "Compilación realizada con éxito.",
  "compileFailed": "Error en la compilación.",
  "compilerError": "No hemos podido compilar el programa. Busca errores en tu programa y vuelve a intentarlo.",
  "compiling": "Compilando...",
  "console": "Consola",
  "delete": "Borrar",
  "deleteFileConfirmation": "¿Estás seguro de que quieres borrar {filename}?",
  "duplicateProjectFilenameError": "El archivo {filename} ya está en uso en este proyecto. Por favor, elija un nombre diferente",
  "duplicateSupportFilenameError": "El archivo {filename} ya está en uso en el código de soporte de este nivel. Por favor, elija un nombre diferente",
  "disabledPeerReviewMessage": "Habilita la revisión por pares para que otros estudiantes de tu grupo puedan dejar comentarios en tu proyecto.",
  "editor": "Editor",
  "emptyBackpackMessage": "Los archivos guardados en tu mochila aparecerán aquí.",
  "enablePeerReview": "Habilita la revisión por pares",
  "errorJavabuilderConnectionGeneral": "Se ha producido un error de conexión con nuestro servidor. Inténtalo de nuevo.",
  "errorJavabuilderConnectionNotAuthorized": "No estás autorizado para acceder a Javalab. ¿Necesitas iniciar sesión o unirte a una sección?",
  "errorLoadingClassmates": "Se ha producido un error al cargar la lista de tus compañeros de clase. Por favor, inténtalo de nuevo.",
  "errorMediaImageLoadError": "Hubo un error al cargar la imagen.",
  "errorNeighborhoodInvalidGrid": "Se produjo un error al cargar el nivel de vecindario. Ponte en contacto con nosotros a support@code.org y asegúrate de incluir la URL de esta página en tu mensaje.",
  "errorNeighborhoodInvalidDirection": "No podemos reconocer la dirección provista. Las opciones admitidas son \"norte\", \"sur\", \"este\" y \"oeste\".",
  "errorNeighborhoodGetSquareFailed": "El cuadrado especificado no está en la cuadrícula.",
  "errorNeighborhoodInvalidColor": "No podemos reconocer el nombre del color. Consulta la documentación para ver los nombres de colores compatibles.",
  "errorNeighborhoodInvalidLocation": "La ubicación especificada no está en la cuadrícula.",
  "errorNeighborhoodInvalidMove": "El pintor intentó salirse de la cuadrícula o chocar contra un obstáculo.",
  "errorNeighborhoodInvalidPaintLocation": "El pintor intentó salirse de la cuadrícula o pasar por encima de un obstáculo.",
  "errorPeerReviewDisabled": "La Revisión por Pares ha sido desactivada en este proyecto.",
  "errorPlaygroundInvalidMessage": "No se puede hacer ningún cambio en el tablero después de llamar a end().",
  "errorPlaygroundRunning": "El método start() sólo puede ser llamado una vez por cada ejecución del programa.",
  "errorPlaygroundNotRunning": "El método end() no puede ser llamado antes de llamar a start().",
  "errorProjectNotEditedYet": "Este proyecto todavía no ha sido editado. El código tendrá que ser editado antes de que pueda ejecutarse.",
  "errorSoundInvalidAudioFileFormat": "El archivo de sonido no tiene un formato compatible. Sólo se permite el formato WAV en este momento.",
  "errorSoundMissingAudioData": "El archivo de sonido no tiene datos de audio.",
  "errorTheaterDuplicatePlayCommand": "El método play() sólo se puede llamar una vez por cada ejecución del programa.",
  "errorTheaterInvalidShape": "Una forma debe contener un número par de valores para representar las coordenadas (x, y) e incluir al menos 4 valores.",
  "feedbackBeginning": "Este es el comienzo de los comentarios para tu proyecto.",
  "feedbackBeginningPeer": "Este es el comienzo de la evaluación para tu proyecto {peerName}",
  "illegalMethodAccess": "Has intentado acceder a un método que está bloqueado por nuestra política de seguridad.\n{cause}",
  "fileImportError": "Uno o más nombres de archivos están reservados por Java Lab y no pueden ser importados a este proyecto. Archivos que no se pueden importar:",
  "fileImportWarning": "Tienes uno o más nombres de archivo duplicados entre este proyecto y tus archivos de mochila seleccionados. Los nombres de archivo duplicados son:",
  "fileImportWarningConfirm": "¿Quieres sustituir estos archivos por los de tu mochila?",
  "fileLoadError": "Se produjo un error al cargar el archivo {filename}.",
  "fileNotFoundException": "Tu código generó una Excepción de Archivo No Encontrado (FileNotFoundException) mientras se ejecutaba el nombre del archivo: {causeMessage}",
  "genericSaveErrorTitle": "Guardar error",
  "genericErrorMessage": "Vuelve a intentarlo",
  "import": "Importar",
  "includeFiles": "Incluir archivos",
  "internalCompilerException": "Oops. Hemos encontrado un error al compilar tu programa. Intenta ejecutarlo de nuevo. Si este error continúa, ponte en contacto con nosotros en support@code.org. Asegúrate de incluir la ID de la conexión {connectionId} en tu mensaje.",
  "internalException": "Oops. Nos encontramos con un error en nuestro lado. Intenta ejecutar tu programa de nuevo. Si este error continúa, ponte en contacto con nosotros en support@code.org. Asegúrate de incluir la ID de conexión {connectionId} en tu mensaje.",
  "internalRuntimeException": "Oops. Nos encontramos con un error al ejecutar tu programa. Intenta ejecutarlo de nuevo. Si este error continúa, ponte en contacto con nosotros en support@code.org. Asegúrate de incluir la ID de la conexión {connectionId} en tu mensaje.",
  "invalidJavaFilename": "Nombre de archivo no válido. Los nombres de archivos Java no pueden tener espacios.",
  "invalidJavaFilenameFormat": "Nombre de archivo inválido. El nombre de un archivo Java debe tener el formato 'NombreClase.java'.",
  "generatingResults": "Generando resultados...",
  "javaExtensionMissing": "Nombre de archivo no válido. Los nombres de archivo deben terminar en '.java'.",
  "javabuilderInvalidClassError": "Java Lab no es compatible con {causeMessage}",
  "javabuilderJavaFilenameError": "El archivo Java: {causeMessage} tiene un nombre de archivo no válido. Los nombres de archivos Java no pueden contener espacios ni caracteres especiales.",
  "javabuilderMissingFilenameError": "En uno o más de tus archivos de proyecto faltan los nombres de los archivos.",
  "markComplete": "Marca Completa",
  "markIncomplete": "Marca Incompleta",
  "missingFilenameError": "El nombre del archivo no puede estar en blanco.",
  "newFile": "Archivo Nuevo",
  "noMainMethod": "Error: Tu programa no contiene un método principal.",
  "noCodeReviewComments": "Los comentarios de tu docente aparecen aquí.",
  "noCodeReviewUntilStudentEditsCode": "No puedes dejar comentarios hasta que el propietario del proyecto haya modificado el código por defecto y haya pulsado el botón \"Ejecutar\"",
  "noOtherReviews": "Todavía no hay ningún otro proyecto listo para ser revisado.",
  "onlyVisibleToYou": "los comentarios de los profesores sólo son visibles para ti",
  "programCompleted": "Programa completado.",
  "refresh": "Actualizar",
  "replace": "Reemplazar",
  "reviewClassmateProject": "Revisa el proyecto de un compañero...",
  "returnToMyProject": "Volver a mi proyecto",
  "running": "Ejecutando...",
  "runtimeError": "Tu código encontró una excepción mientras se ejecutaba.\n{cause}",
  "saveToBackpack": "Guardar en Mochila",
  "startingPainter": "Pintor principiante.",
  "timeoutWarning": "Advertencia: tu proyecto dejará de funcionar en 15 segundos.",
  "timeout": "Tu proyecto se ha detenido.",
  "twoMainMethods": "Error: Tu código sólo puede tener un método principal. Encontramos al menos dos clases con métodos \"main\".",
  "saving": "Guardando...",
  "teacherLabel": "Profesor",
  "togglePeerReviewError": "Ocurrió un error al habilitar/deshabilitar la revisión por pares. Vuelve a intentarlo.",
  "unknownError": "Ups. Hemos encontrado un error. Intenta ejecutar tu programa de nuevo. Si este error continúa, ponte en contacto con nosotros a support@code.org. Asegúrate de incluir el ID de conexión {connectionId} en tu mensaje.{type}",
  "yourPeer": "tu compañero"
}
